{
  "n_pages": 4,
  "title_page": {
    "title": "Chartered Institute Of Transport Of Sri Lanka (Incorporation) (Amendment) Act",
    "num": "18",
    "year": "2023",
    "date_certified": "2023-09-19",
    "date_published": "2023-09-22",
    "price": 12.0,
    "price_postage": 150.0
  },
  "body_pages": {
    "preamble": [
      "1",
      "[Certified On 19Th Of September, 2023]",
      "L.D.O. (Inc.) 4/2019",
      "A N   A Ct   To   Amend   The  C Hartered  I Nstitute   Of  T Ransport   Of S Ri  L Anka  (I Ncorporation ) A Ct , N O . 8  Of  2000",
      "Be It  Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :"
    ],
    "pre_section_list": [
      {
        "class_name": "ActL1Section",
        "num": "1",
        "text": "This Act may be cited as the Chartered Institute of Transport of Sri Lanka (Incorporation) (Amendment) Act, No. 18 of  2023.",
        "pre_block_list": [
          "Short title"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "2",
        "text": "The long title to the Chartered Institute of Transport of Sri Lanka (Incorporation) Act, No. 8 of 2000, (hereinafter referred to as the principal enactment) is hereby amended by the substitution, for the words Chartered Institute of Transport of Sri Lanka. of the words Chartered Institute of Logistics and Transport of Sri Lanka",
        "pre_block_list": [
          "",
          "Amendment of long title to the Act, No. 8 of 2000"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "3",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "In the principal enactment and in any other written law there shall be substituted for the words Chartered Institute of  Transport of Sri Lanka wherever such words appear in the principal enactment and such other written law of the words Chartered Institute of Logistics and Transport of Sri Lanka.",
            "pre_block_list": [
              "General amendment to the principal enactment and other written law"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "Every reference to the Chartered Institute of  Transport of Sri Lanka in any notice, notification, contract, communication or other document shall be read and construed as a reference   to the   Chartered Institute of Logistics and Transport of Sri Lanka.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "4",
        "text": "For the avoidance of doubts it is hereby declared that the Chartered Institute of Logistics and Transport of Sri Lanka shall for all purposes be deemed to be the successor to the Chartered Institute of Transport of Sri Lanka.",
        "pre_block_list": [
          "Avoidance of doubts",
          "Sinhala text to prevail in case of inconsistency"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "5",
        "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
        "pre_block_list": [
          "3",
          "English Acts of the Parliament can be purchased at the P RAKASHANA  P IYASA , D EPARTMENT   OF G OVERNMENT  P RINTING , N O . 118, D R . D ANISTER  D E  S ILVA  M AWATHA , C OLOMBO  8."
        ],
        "child_level_list": []
      }
    ],
    "part_list": []
  }
}