{
  "n_pages": 4,
  "title_page": {
    "title": "Ports  And  Airports  Development Levy (Amendment) Act",
    "num": "10",
    "year": "2012",
    "date_certified": "2012-03-30",
    "date_published": "2012-03-30",
    "price": 2.5,
    "price_postage": 5.0
  },
  "body_pages": {
    "preamble": [
      "Ports And Airports Development Levy (Amendment) Act, No. 10 Of 2012 1",
      "[Certified On 30Th March, 2012]",
      "L.D.O.7/2012.",
      "A N  A Ct   To   Amend   The  P Orts   And  A Irports  D Evelopment  L Evy A Ct , N O . 18  Of  2011",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :-"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Ports and Airports Development Levy (Amendment)  Act, No. 10 2012 and shall be deemed to have come into operation on January 1, 2012 unless different dates of operation  are specified in the relevant sections.",
            "pre_block_list": [
              "Short title and date of operation."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "Section 4 of the Ports and Airports Development Levy Act, No. 18 of 2011 is hereby amended by the repeal of subsection (2) thereof and substitution therefor of the following subsection :-",
            "pre_block_list": [
              "Amendment to section 4 of Act, No. 18 of 2011."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Notwithstanding the provisions of sections 2 and 3, the Director -  General  of Customs shall defer the collection of the levy on the importation of any article",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "i",
                    "text": "for the use of any specified project identified by the Minister in charge of the subject of Finance, having regard to the interests of the national economy on which the tax is borne by the government, with effect from July 1, 2009 until such time the article is re-exported after the completion of such project, subject to the furnishing of a corporate guarantee which covers the amount of the tax due on the article so imported; or",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "being plant, machinery  or equipment by any undertaking qualified for a tax exemption under section 16 D  or 17 A   of the Inland",
                        "pre_block_list": [
                          "2PL0066656,615 (03/2012)",
                          "Ports and Airports Development Levy (Amendment) Act, No. 10 of 2012 2",
                          "Revenue  Act, No. 10 of 2006, as the case may be, during the project  implementation period, for the use by such undertaking for the purposes specified  in the agreement entered into with the Board of Investment of Sri Lanka established under Board of Investment Law, No. 4 of 1978 on which  tax is exempted subject to the  fulfillment  of the conditions specified  in the agreement entered into, and to the furnishing of a bank guarantee which covers the amount of the tax due on the article so imported",
                          ""
                        ],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "In the event of an inconsistency between the Sinhala and Tamil texts of this Act, the  Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail  in case of any inconsistency.",
              "Ports and Airports Development Levy (Amendment) Act, No. 10 of 2012 3",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , D EPARTMENT   OF G OVERNMENT  I NFORMATION , N O . 163, K IRULAPONA  M AWATHA , P OLHENGODA , C OLOMBO  05 before 15th December each year in respect of the year following ."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}