{
  "n_pages": 5,
  "title_page": {
    "title": "Stamp  Duty  (Special  Provisions) (Amendment)  Act",
    "num": "10",
    "year": "2008",
    "date_certified": "2008-02-29",
    "date_published": "2008-02-29",
    "price": 4.0,
    "price_postage": 5.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 29Th February, 2008]",
      "L. D. O. 68/2007",
      "A N  A Ct   To   Amend   The  S Tamp  D Uty  (S Pecial  P Rovisions ) A Ct , N O . 12  Of  2006",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of  Sri Lanka As Follows:"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "This Act may be cited as the Stamp Duty (Special Provisions) (Amendment) Act, No. 10 of  2008.",
                "pre_block_list": [
                  "Short title and the date of operation."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The provisions of this Act, shall be deemed for all purposes to have come into operation from January 1, 2008.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "Section 6 of the Stamp Duty (Special Provisions) Act, No. 12 of  2006 (hereinafter referred to as the principal enactment) is hereby amended as follows:",
            "pre_block_list": [
              "Amendment of section 6 of Act, No. 12 of 2006."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "in paragraph ( d ) of that section, by the substitution for the words credit card holder; and, of the words credit card holder;;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the insertion, immediately after paragraph ( d ), of the following new paragraphs:",
                "pre_block_list": [
                  "( dd ) in the case of a warrant to act as Notary Public, by the person applying for the office of  Notary;",
                  "( ddd ) in the case of a licence, by the person applying for the same; and."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "Section 8 of the principal enactment is hereby repealed and the following section substituted  therefor:",
            "pre_block_list": [
              "Replacement of section 8 of the principal enactment. Manner of payment of stamp duty.",
              "8. (1) Otherwise than, when stamp duty is compounded in terms of section 7, the stamp duty payable on any specified   instrument shall be paid by means of affixing adhesive stamps to the required value, prior to, or at the time of, the",
              "2PL 0028156,400 (02/2008)",
              "execution of the instrument. The value of the stamp duty so paid shall be specified on the face of the instrument so executed:",
              "Provided that, share transfers executed in Sri Lanka shall be stamped within one month from the execution of the same."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Stamp duty payable on any specified instrument relating to a mortgage or lease of any immovable property may be paid, prior to, or at the time of, the execution of the specified instrument, to a prescribed bank. Where however, the stamp duty cannot be so paid due to reasons beyond the control of the person by whom the stamp duty is payable, the stamp duty shall be paid to the prescribed bank within seven days from the date of such execution. The bank shall thereupon issue a certificate in the prescribed form certifying that the stamp duty  has been duly paid and such certificate shall be affixed to the instrument so executed.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Any person executing a specified instrument shall at the time of the execution of such specified instrument which is not stamped with an impressed stamp, cancel the stamps thereon by writing or marking in ink on or across each stamp, his name or initials, thereby preventing the stamp from being used again. Further, where such specified instrument bears an adhesive stamp of the value of fifty rupees or more, such stamp shall be cancelled by the person executing a specified instrument by perforating the same by either cutting or pricking the stamp with a suitable instrument.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Any specified instrument bearing an adhesive stamp which  has not been cancelled in the manner set out in subsection (3) shall be deemed to be unstamped to the extent of the value of such stamp",
                "pre_block_list": [
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "In the event of any inconsistency  between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency.",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS   B UREAU , D EPARTMENT   OF G OVERNMENT   I NFORMATION ,  N O . 163,  K IRULAPONA  M AWATHA , P OLHENGODA , C OLOMBO  05  before  15th December each year in respect of the year following."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}