{
  "n_pages": 4,
  "title_page": {
    "title": "Conferring The Honour Of Senior Instructing Attorneys-At-Law  Act",
    "num": "26",
    "year": "2023",
    "date_certified": "2023-11-01",
    "date_published": "2023-11-03",
    "price": 12.0,
    "price_postage": 150.0
  },
  "body_pages": {
    "preamble": [
      "Ws 6",
      "Pl 13965",
      "Conferring The Honour Of Senior Instructing Attorneys-At-Law Act, No. 26 Of 2023 1",
      "[Certified On 01St Of November, 2023]",
      "L.D.-O. 13/2023",
      "A N  A Ct   To   Provide   For   The  C Onferment   Of   The  H Onour   Of  S Enior I Nstructing  A Ttorneys - At -L Aw   With   A   View   To   Recognizing",
      "And   Appreciating   The   Service   Rendered   By  A Ttorneys - At -L Aw",
      "Practicing   As  I Nstructing  A Ttorneys   Who   Have   Demonstrated",
      "Eminence   And   High   Standards   In   The   Legal   Profession ;  And   To",
      "Provide   For   Matters   Connected   Therewith   Or   Incidental",
      "Thereto .",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows: -"
    ],
    "pre_section_list": [
      {
        "class_name": "ActL1Section",
        "num": "1",
        "text": "This Act may be cited as the Conferring the Honour of Senior Instructing Attorneys-at-Law Act, No. 26 of 2023.",
        "pre_block_list": [
          "Short  title"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "2",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "His Exellency the President may, after obtaining observations from the Chief Justice and the Minister assigned the subject of Justice, and having regard to the guidelines made by the Minister assigned the subject of Justice under section 3, confer the honour of Senior Instructing Attorney- at-Law on any Attorney-at-Law of the Supreme Court of the Democratic Socialist Republic of Sri Lanka who-",
            "pre_block_list": [
              "Conferring the honour of Senior Instructing Attorneys-at- Law"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "has been in active practice as an Instructing Attorney for a period not less than twenty years as at the date of conferring such honour;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "has reached eminence in the legal profession and has maintained high standards of conduct and professional rectitude;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "has not been found guilty of any criminal offence under any written law;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "has not been found guilty of any professional misconduct under the Supreme Court (Conduct of and Etiquette for Attorneys-at-Law) Rules 1988 and",
                "pre_block_list": [
                  "the provisions of the Judicature Act, No. 2 of 1978; and"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "has been a person of good character and repute.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "His Excellency the President shall, upon conferring the honour of Senior Instructing Attorney-at-Law to any Instructing Attorney, hand over a certificate to that effect to such Instructing Attorney.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "An Attorney-at-Law to whom a certificate has been handed over under subsection (2), may use the post-nominal title SIA.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "3",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "The Minister assigned the subject of Justice shall, from time to time, make guidelines relating to the conferment of the honour of Senior Instructing Attorneys-at-Law for the purposes of this Act.",
            "pre_block_list": [
              "Minister to make guidelines"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "The guidelines made by the Minister under subsection (1) shall be published in the  Gazette  and shall come into operation on the date of such publication or on such later date as may be specified therein.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "4",
        "text": "In this Act, unless the context otherwise requires-",
        "pre_block_list": [
          "Interpretation",
          "Instructing Attorney means an Attorney-at-Law whose main practice is to instruct a Counsel to appear in court on the instructions of such Attorney-at-Law."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "5",
        "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
        "pre_block_list": [
          "Sinhala text to prevail in case of inconsistency",
          "Conferring the Honour of Senior Instructing Attorneys-at-Law Act, No. 26 of 2023 3",
          "DEPARTMENT   OF   GOVERNMENT   PRINTING",
          "English Acts of the Parliament can be purchased at the P RAKASHANA  P IYASA , D EPARTMENT   OF G OVERNMENT  P RINTING , N O . 118, D R . D ANISTER  D E  S ILVA  M AWATHA , C OLOMBO  8."
        ],
        "child_level_list": []
      }
    ],
    "part_list": []
  }
}