{
  "n_pages": 7,
  "title_page": {
    "title": "Social Security Board (Amendment) Act",
    "num": "33",
    "year": "1999",
    "date_certified": "1999-10-07",
    "date_published": "1999-10-08",
    "price": 5.75,
    "price_postage": 3.5
  },
  "body_pages": {
    "preamble": [
      "[Certified On 07 Th October, 1999]",
      "L.D.O.54/98.",
      "A N  A Ct    To   Amend   The  S Ocial  S Ecurity  B Oard A Ct , N O . 17  Of  1996",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :-"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Social Security Board (Amendment) Act, No.33 of 1999.",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "Wherever in the Social Security Board Act, No. 17 of 1996 (hereinafter referred to as the principal enactment) or in any other written law or in any notice, communication, form or other document issued, made, required, or authorised by or under the principal enactment or such other written law, the expression  Social Security Board occurs, there shall be substitued the expression the Sri Lanka Social Security Board",
            "pre_block_list": [
              "General amendment of Act, No. 17 of 1996 and other written law."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "Section 3 of the Principal enactment is hereby amended by the repeal of subsection (2) of that section and the substitution of the following subsection therefor :-",
            "pre_block_list": [
              "Amendment of section 3 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Minister shall appoint one of the Directors as the Chairman of the Board, and may appoint another Director to be a working Director of the Board.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "Section 4 of the principal enactment is hereby repealed and the following section substituted therefor :-",
            "pre_block_list": [
              "Replacement of section 4 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Subject to the other provisions of this Act, the functions of the Board shall be to establish a Pension and Social Security Benefit Scheme (hereinafter referred to as the Scheme) for self employed persons other than those in the fisheries and agriculture sectors, and to administer and manage such scheme with the following objectives in view:- (a)  to provide social security to self employed persons during their old  age and  on  disability ;",
                "pre_block_list": [
                  "H - 022545"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "to provide relief to the dependants of self employed persons, upon death ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "to encourage self employed persons to continue in their respective occupations and to develop their capabilities and skills;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "to encourage youth to be self employed and to develop their capabilities and skills;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "to educate self employed persons on the benefits of thrift and resource management; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "to improve the living standards of self employed persons generally",
                    "pre_block_list": [
                      ""
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "Section 5 of the principal enactment is hereby amended by the insertion immediately after paragraph  (f)  of that section of the following new paragraph :-",
            "pre_block_list": [
              "Amendment of section 5 of the principal enactment.",
              "  (ff)  collaborate with state institutions or non- governmental organizations discharging functions similar to the functions of the Board ;",
              "Insertion of new section 6 A    in the principal enactment"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "The following new section is hereby inserted immedialtey after section 6 and shall have effect as section 6 A  of the principal enactment.",
            "pre_block_list": [
              "6 A . (1) The Minister shall appoint a Technical Advisory Committee (hereinafter refferred to as the Committee) consisting of not more than nine persons, from among persons who, in the opinion of the Minister have had experience, or shown capacity, in the fields of social security, social welfare, insurance, actuarial evaluation, administration, finance or management.",
              "Technical Advisory Committee."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Chairman of the Board shall be the Chairman of the Committee.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The functions of the Committee shall be -",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "to advise the Board on such matters relating to the administration and management of the scheme as may, from time to time, be referred to it by the Board;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "to advise the Board on any matter the Committee  deems  necessary  or conducive to the attainment of the objectives towards the attainment of which the scheme is being administered and managed; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "to advise the Board with regard to the making of rules by the Board.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The members of the Committee may be paid such remuneration as may be determined by the Board, subject to the approval of the Minister, from the Fund of the Board",
                "pre_block_list": [
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "Section 9 of the principal enactment is hereby amended as follows:-",
            "pre_block_list": [
              "Amendment of section 9 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "in subsection (1) of the section, by the substitution, for the words a contributor shall be entitled, of the words a contributor shall, subject to the provisions of subsection (1A), be entitled; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the insertion immediately after subsection (1) of that section of the following subsection:-",
                "pre_block_list": [
                  " (1 A ) A contributor who is certified, by a Medical Practitioner registered under the Medical Ordinance, to be mentally retarded and who has commenced to contribute to the Fund before reaching the age of thirty five years shall be entitled to a pension on reaching the age of forty years.",
                  "Amendment of section 13 of the principal enactment."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "Section 13 of the principal enactment is hereby amended by the substitution for the words be paid to his surviving spouse, of the words be paid to such person or persons as may have been nominated by him  in the prescribed form and deposited with the Board, and in lieu of such nomination, be paid to his surviving spouse.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "Section 21 of the principal enactment is hereby amended as follows:-",
            "pre_block_list": [
              "Amendment of section 21 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the insertion immediately after paragraph  (c)  of subsection (2), of that section, of the following new paragraph:-",
                "pre_block_list": [
                  "  (cc)  all such sums of money as may be transferred to the Board by any, Government Department, or Public Corporation ;; and"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the insertion immediately after subsection (3) of that section, of the following new subsections:-",
                "pre_block_list": [
                  " (4) The initial  capital of the Board shall be one hundred million rupees which may be increased from time to time, by such amounts as may be authorised by an Appropriation Act or by resolution of Parliament. The amount of such capital shall be paid out of the Consolidated Fund in such instalments as the Minister in charge of the subject of Finance may, in consultation with the Minister determine, and such sums shall be credited to the Fund.",
                  "(5) From and after the inclusion of the Board under section 8 of the Inland Revenue Act, No. 28 of 1979, the profits and income of the Board shall be exempt from income tax."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "10",
            "text": "The following section is hereby inserted immediately after section 28, and shall have effect as section 28 A  of the principal enactment:-",
            "pre_block_list": [
              "Insertion of new section 28 A  in the Principal enactment.",
              "28 A . (1) The Minister may give the Board general directions as to the exercise of the powers and discharge of the functions, of the Board, and it shall be the duty of the Board to give effect to every such direction.",
              "Power of Minister to give directions"
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Minister may direct the Board, in writing, to furnish him with such information with respect to the discharge of the functions of the Board as may be specified in such writing and it shall be the duty of the Board to give effect to every such direction.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "11",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency.",
              "Annual subscription of  English Bills and Acts of  the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , No. 32,T RANSWORKS  H OUSE , L OTUS  R OAD , C OLOMBO  01 before 15th December each year in respect of the year following."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}