{
  "n_pages": 13,
  "title_page": {
    "title": "Act",
    "num": "29",
    "year": "2017",
    "date_certified": "2017-11-18",
    "date_published": "2017-11-24",
    "price": 16.0,
    "price_postage": 10.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 18Th Of November, 2017]",
      "L. D.O. 7/2015.",
      "A N  A Ct   To   Amend   The   P Revention   Of  C Rimes",
      "O Rdinance  (C Hapter  22)",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:"
    ],
    "pre_section_list": [
      {
        "class_name": "ActL1Section",
        "num": "1",
        "text": "This Act may be cited as the  Prevention of Crimes (Amendment)  Act, No. 29 of 2017.",
        "pre_block_list": [
          "Short title."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "2",
        "text": "Section 2 of the  Prevention of Crimes Ordinance (Chapter 22) (hereinafter referred to as the principal enactment) is hereby amended in sub-paragraph (i) of paragraph ( b ) of subsection (3) thereof, by the substitution for the words and figures, by section 302 of the Criminal Procedure Code, of the words and figures, by section 277 of the Code of Criminal Procedure  Act, No. 15 of 1979.",
        "pre_block_list": [
          "Amendment of section 2 of Chapter 22."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "3",
        "text": "Section 3 of the principal enactment is hereby amended in subsection (1) thereof, by the substitution for the words and figures under section 325(1) of the Criminal Procedure Code, the Magistrate shall, notwithstanding anything in section 190 of the Criminal Procedure Code, of the words and figures, under section 306 of the Code of Criminal Procedure Act, No.15 of 1979, the Magistrate shall, notwithstanding anything in section 185 of that Act,.",
        "pre_block_list": [
          "Amendment of section 3 of the principal enactment."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "4",
        "text": "Section 5 of the principal enactment is hereby amended as follows:",
        "pre_block_list": [
          "Amendment of section 5 of the principal enactment."
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "in subsection (1) thereof, by the substitution for the words be subject to the supervision by the police, of the words be subject to such supervision by the police as prescribed by rules made under section 17,; and",
            "pre_block_list": [
              "2PL 053612,962  (08/2017)",
              "Prevention of Crimes (Amendment) Act, No. 29 of 2017 2"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "by the insertion, immediately after subsection (1) of that section,  of the following new subsection:",
            "pre_block_list": [
              "(1A) Where a person referred to in subsection (1) is imposed a suspended sentence on being convicted of a crime, the Court may direct that such person be subject to such supervision by the police, as prescribed by rules made under section 17, from the date of imposing the suspended sentence, until the expiry of the operational period of such sentence",
              ""
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "5",
        "text": "Section 17 of the principal enactment is hereby amended by the repeal of subsection (2) thereof and the substitution therefor of the following:",
        "pre_block_list": [
          "Amendment of section 17 of the principal enactment."
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "All rules so made shall",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "be published in the  Gazette  and within a period of six months of such publication, be brought before the Parliament for approval; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "come into force on the date on which they are approved by the Parliament or on such later date as may be specified in such rules",
                "pre_block_list": [
                  ""
                ],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "6",
        "text": "Section 18 of the principal enactment is hereby amended as follows:",
        "pre_block_list": [
          "Amendment of section 18 of the principal enactment."
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "by the repeal of the definition of the word crime thereof and the substitution therefor, of the following definition:",
            "pre_block_list": [
              " crime means an offence punishable under such sections listed under each Act, as specified in the Schedule hereto;; and"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "by the repeal of the definition of the word Registrar thereof and the substitution therefor, of the following definition:",
            "pre_block_list": [
              "Registrar means  the Registrar of Finger Prints and includes the Additional Registrar of Finger Prints, the Deputy Registrar of Finger Prints and the Assistant Registrar of Finger Prints",
              ""
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "7",
        "text": "The Schedule to the principal enactment is hereby repealed and the following Schedule is substituted therefor:",
        "pre_block_list": [
          "Replacement of the Schedule to the principal enactment.",
          " SCHEDULE [section 18]",
          "B RIBERY  A CT  (C HAPTER  26)"
        ],
        "child_level_list": [
          {
            "class_name": "ActL3Paragraph",
            "num": "i",
            "text": "14 Bribery of judicial officers and members of Parliament.",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL4SubParagraph",
                "num": "ii",
                "text": "15 Acceptance of gratification by Members of Parliament for interviewing public servants.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL4SubParagraph",
                "num": "iii",
                "text": "16 Bribery of police officers, peace officers and other public servants.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL4SubParagraph",
                "num": "iv",
                "text": "17 Bribery for giving assistance or using influence in regard to contracts.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL4SubParagraph",
                "num": "v",
                "text": "18 Bribery for procuring withdrawals of tenders.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL4SubParagraph",
                "num": "vi",
                "text": "19 Bribery in respect of Government business.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL4SubParagraph",
                "num": "vii",
                "text": "20 Bribery in connection with payment of claims, appointments, employments, grants, leases and other benefits.",
                "pre_block_list": [
                  "Prevention of Crimes (Amendment) Act, No. 29 of 2017 4"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL4SubParagraph",
                "num": "viii",
                "text": "21 Bribery of public servants by persons having dealings with the Government.",
                "pre_block_list": [
                  "(ix) 22 Bribery of Member of local authority or of scheduled institution or of governing body of scheduled institution, and bribery of officer or employee of local authority or of scheduled institution.",
                  "(x) 23 Use of threats or fraud to influence vote of members of local authority or of scheduled institution or of governing body of scheduled institution.",
                  "(xi) 23A To own or to have owned property deemed under this section to be property acquired by bribery or property to which property acquired by bribery has or had been converted.",
                  "(xii) 24 Acceptor of gratification to be guilty notwithstanding that purpose not carried out & c.",
                  "(xiii) 25 Attempt to commit, and abetment of an offence under Part II.",
                  "(xiv) 70 Corruption.",
                  "C OMMISSION   TO  I NVESTIGATE  A LLEGATIONS   OF  B RIBERY   OR C ORRUPTION  A CT , N O . 19  OF  1994",
                  "(i) 21 Making a false allegation.",
                  "(ii) 22 Breach of provisions regarding secrecy.",
                  "(iii) 23 Miscellaneous offences.",
                  "C OMPUTER  C RIME  A CT , N O . 24  OF  2007",
                  "(i) 3 Securing unauthorized access to a computer.",
                  "(ii) 4 Doing any act to secure unauthorized access in order to commit an offence.",
                  "(iii) 5 Causing a computer to perform a function without lawful authority.",
                  "(iv) 6 Offences committed against national security & c.",
                  "(v) 7 Dealing with data & c., unlawfully obtained.",
                  "(vi) 8 Illegal interception of data.",
                  "(vii) 9 Using of illegal devices an offence.",
                  "(viii) 10 Unauthorized disclosure of information enabling access to a service.",
                  "(ix) 11 Attempt to commit an offence.",
                  "(x) 12 Abetment of an offence.",
                  "(xi) 13 Conspiring to commit an offence.",
                  "C ONVENTION  A GAINST  I LLICIT  T RAFFICKING   IN  N ARCOTICS  D RUGS   AND P SYCHOTROPIC  S UBSTANCES  A CT , N O . 1  OF  2008",
                  "(i) 2 Offences under the Act.",
                  "C ONVENTION  A GAINST  T ORTURE   AND   OTHER  C RUEL , I NHUMAN   OR  D EGRADING T REATMENT   OR  P UNISHMENT  A CT , N O . 22  OF  1994",
                  "(i) 2 Offence of Torture.",
                  "C ONVENTION   ON   THE  S UPPRESSION   OF  T ERRORIST  F INANCING A CT , N O . 25  OF  2005",
                  "(i) 3 Offences under the Act.",
                  "Prevention of Crimes (Amendment) Act, No. 29 of 2017 6",
                  "F IREARMS  O RDINANCE  (C HAPTER  182)",
                  "(i) 22 Failure to obtain a Licence to possess a gun.",
                  "(ii) 44 Offences under Chapter 182 other than any offence in respect of which no specific punishment is provided.",
                  "I MMIGRANTS   AND  E MIGRANTS  A CT  (C HAPTER  351)",
                  "(i) 45(1)( a ) to ( n ) Immigration and emigration offences.",
                  "(ii) 45(2) Preparation, attempt or abetment to commit offences specified in section 45(1)( a ) to ( n ).",
                  "(iii) 45A(1)( a ) to ( c ) Offences of bringing persons into Sri Lanka in contravention of the Act.",
                  "(iv) 45A(2)( a ) and ( b ) Attempt, abetmemnt or preparation to commit the offences specified in section 45A(1)( a ) to ( c ).",
                  "(v) 45C(1)( a ) Offence of organizing.",
                  "(vi) 45C(1)( b ) Attempting, aiding and abetting for, or doing any act preparatory to the offence of organizing.",
                  "I NTELLECTUAL  P ROPERTY  A CT , N O . 36  OF  2003",
                  "(i) 177 Falsification of entries in any register.",
                  "(ii) 178(1) and (2) Infringement of rights protected under Part II.",
                  "(iii) 179 Infringement of Industrial Designs.",
                  "(iv) 181 Infringement of Patents.",
                  "(v) 184 Infringement of Marks.",
                  "O FFENCES  A GAINST  P UBLIC  P ROPERTY  A CT , N O . 12  OF  1982",
                  "(i) 2 Mischief to public property.",
                  "(ii) 3 Theft of public property.",
                  "(iii) 4 Robbery of public property.",
                  "(iv) 5 Dishonest misappropriation, criminal breach of trust, cheating, forgery and falsification of accounts.",
                  "(v) 10 Attempt to commit an offence under the Act.",
                  "O FFENSIVE  W EAPONS  A CT , N O . 18  OF  1966",
                  "(i) 2 Prohibition of the importation & c., of offensive weapons.",
                  "(ii) 3 Damage & c., to property by use of offensive weapons.",
                  "(iii) 4 Attempt to cause death or injury and causing of injury with offensive weapons.",
                  "(iv) 5 Attempt to commit offences other than offences under section 4 of the Act.",
                  "P AYMENT  D EVICES  F RAUDS  A CT , N O . 30  OF  2006",
                  "(i) 3 Acts amounting to payment devices fraud.",
                  "(ii) 4 Attempt to commit an offence under the Act.",
                  "(iii) 5 Abetment of an offence under the Act.",
                  "(iv) 6 Conspiracy to commit an offence under the Act.",
                  "Prevention of Crimes (Amendment) Act, No. 29 of 2017 8",
                  "P ENAL  C ODE  (C HAPTER  19)",
                  "Abetting and conspiracy to commit any offence of the Penal Code specified in this Schedule.",
                  "(i) 101, 102, 113A and 113B",
                  "Offences against the State.",
                  "(ii) 114 to 123, (both inclusive)",
                  "Joining an unlawful assembly armed with any deadly weapon.",
                  "(iii) 141",
                  "Rioting armed with deadly weapons.",
                  "(iv) 145",
                  "Giving or fabricating false evidence and offences against public justice.",
                  "(v) 190 to 224 (both inclusive)",
                  "Offences relating to coin and Government stamps.",
                  "(vi) 226 to 256 (both inclusive)",
                  "Obscene Publication, exhibition &c. relating to children.",
                  "(vii) 286A",
                  "Causing or procuring children to beg.",
                  "(viii) 288",
                  "Hiring or employing children to act as procurers for sexual intercourse.",
                  "(ix) 288A",
                  "Hiring or employing children to traffic in restricted articles.",
                  "(x) 288B",
                  "Murder, Culpable homicide and attempt thereto.",
                  "(xi) 296, 297, 300 and 301",
                  "Causing miscarriage or injuries to unborn children, exposure of infants and the concealment of births.",
                  "(xii) 303 to 309 (both inclusive)",
                  "Cruelty to children.",
                  "(xiii) 308A",
                  "Voluntarily causing hurt by dangerous weapon, & c.",
                  "(xiv) 315 to 324 (both inclusive)",
                  "Wrongful confinement, & c.",
                  "(xv) 334 to 339 (both inclusive)",
                  "Using criminal force to deter a public servant from discharge of his duty.",
                  "(xvi) 344",
                  "(xvii) 345",
                  "Sexual harassment.",
                  "(xviii) 354",
                  "Kidnapping.",
                  "(xix) 355 to 359 (both inclusive)",
                  "Aggravated  form  of  offence  of kidnapping and abduction.",
                  "(xx) 358A",
                  "Debt bondage serfdom, forced or compulsary  labour,  slavery  and recruitment of children for use in armed conflict.",
                  "(xxi) 360",
                  "Kidnapping or abducting a child under ten years.",
                  "(xxii) 360A",
                  "Procuration.",
                  "(xxiii) 360B",
                  "Sexual exploitation of children.",
                  "(xxiv) 360C",
                  "Trafficking.",
                  "(xxv) 360D",
                  "Offences relating to adoption.",
                  "(xxvi) 360E",
                  "Offences relating to soliciting a child.",
                  "(xxvii) 364",
                  "Rape.",
                  "(xxviii) 364A",
                  "Incest.",
                  "(xxix) 365",
                  "Unnatural offence.",
                  "(xxx) 365A",
                  "Acts of gross indecency between persons.",
                  "(xxxi) 365B",
                  "Grave sexual abuse.",
                  "(xxxii) 367 to 371 (both inclusive)",
                  "Theft, theft of cattle, & c.",
                  "(xxxiii) 373 to  378 (both inclusive)",
                  "Extortion, & c.",
                  "(xxxiv) 380 to  385 (both inclusive)",
                  "Robbery, & c.",
                  "(xxxv) 387",
                  "Dishonest misappropriation.",
                  "(xxxvi) 389 to 392 (both inclusive)",
                  "Criminal breach of trust.",
                  "(xxxvii) 394 to 396 (both inclusive)",
                  "Dishonestly receiving stolen property, etc.",
                  "Prevention of Crimes (Amendment) Act, No. 29 of 2017 10",
                  "(xxxviii) 400 to 403 (both inclusive)",
                  "Cheating.",
                  "(xxxix) 404 to 407 (both inclusive)",
                  "Fraudulent deeds and dispositions of property, etc.",
                  "(x L ) 412 to 416 (both inclusive)",
                  "Mischief to animals, irrigation works and public roads & c.",
                  "(x L i) 418 to 426 (both inclusive)",
                  "Mischief, & c.",
                  "(x L ii) 435 to 451 (both inclusive)",
                  "House trespass, house breaking, & c.",
                  "(x L iii) 454 to 467 (both inclusive)",
                  "Forgery, fraudulent cancellation & c, of a will, etc. and falsification of accounts.",
                  "(x L iv) 478A to 478D (both inclusive)",
                  "Offences relating to currency notes and bank notes.",
                  "(x L v) 490",
                  "Attempting to commit offences of the Penal Code specified in this Schedule.",
                  "P OISONS , O PIUM   AND  D ANGEROUS  D RUGS  A CT  (C HAPTER  218)",
                  "(i) 54A Manufacture, trafficking, import or export and possession of dangerous drugs.",
                  "(ii) 54B Abetting in the commission of an offence under section 54A.",
                  "(iii) 78 Contravention or failure to comply with any provisions of Chapter 218 or any regulation, or any order or direction lawfully given thereunder.",
                  "P REVENTION   OF  M ONEY  L AUNDERING  A CT , N O . 5  OF  2006",
                  "(i) 3(1) Offences of money laundering.",
                  "(ii) 3(2) Attempting, conspiring and aiding or abetting money laundering.",
                  "P REVENTION   OF  T ERRORISM  (T EMPORARY  P ROVISIONS ) A CT , N O . 48  OF  1979",
                  "(i) 2 Offences under the Act.",
                  "(ii) 3 Preparation, abetment, conspiracy or incitement to commit an offence under the Act.",
                  "S RI  L ANKA  B UREAU   OF  F OREIGN  E MPLOYMENT  A CT , N O . 21  OF  1985",
                  "(i) 64 Illegal charging of fee",
                  ""
                ],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "8",
        "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
        "pre_block_list": [
          "Sinhala text to prevail in case of inconsistency.",
          "Prevention of Crimes (Amendment) Act, No. 29 of 2017 12"
        ],
        "child_level_list": []
      }
    ],
    "part_list": []
  }
}