{
  "n_pages": 5,
  "title_page": {
    "title": "Civil Procedure Code (Amendment) Act",
    "num": "17",
    "year": "2022",
    "date_certified": "2022-06-23",
    "date_published": "2022-06-24",
    "price": 10.0,
    "price_postage": 15.0
  },
  "body_pages": {
    "preamble": [
      "Civil Procedure Code (Amendment) Act, No. 17 Of 2022 1",
      "[Certified On 23Rd Of June, 2022]",
      "L.D.O. 58/2021",
      "A N  A Ct   To   Amend   The  C Ivil  P Rocedure  C Ode  (C Hapter  101)",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:-"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Civil Procedure Code (Amendment) Act, No. 17 of 2022.",
            "pre_block_list": [
              "Short title"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "The following new section is hereby inserted immediately after section 154 of the Civil Procedure Code (Chapter 101) and shall have effect as section 154 A  of that Code:",
            "pre_block_list": [
              "Insertion of new section 154 A  into Chapter 101",
              "154 A .   (1) Notwithstanding the provisions of the Evidence Ordinance (Chapter 14), in any proceedings under this Code, it shall not be necessary to adduce formal proof of the execution or genuineness of any deed, or document which is required by law to be attested, other than a will executed under the Wills Ordinance (Chapter 60), and on the face of  it purports to have been duly executed, unless",
              "Proof of deed or document unnecessary in certain events",
              "( a ) in the pleadings or further pleadings in an action filed under regular procedure in terms of this Code, the execution or genuineness of such deed or document is impeached and raised  as an issue; or",
              "( b ) the court requires such proof:",
              "Provided that, the provisions of this section shall not be applicable in an event, a party to an action seeks to produce any deed or document not included in the pleadings of that party at any proceedings under this Code."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The provisions of subsection (1), shall  mutatis mutandis  apply in the actions on summary procedure under this Code",
                "pre_block_list": [
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "Notwithstanding anything contained in section 2 of this Act, and the provisions of the Evidence Ordinance, in any case or appeal pending on the date of coming into operation of this Act",
            "pre_block_list": [
              "Transitional Provisions"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "i",
                    "text": "if the opposing party does not object or has not objected to it being received as evidence on the deed or document being tendered in evidence; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "if the opposing party has objected to it being received as evidence on the deed or document being tendered in evidence but not objected at the close of a case when such document is read in evidence,",
                    "pre_block_list": [
                      "the court shall admit such deed or document as evidence without requiring further proof;"
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "if the opposing party objects or has objected to it being received as evidence, the court may decide whether it is necessary or it was necessary as the case may be, to adduce formal proof of the execution or genuineness of any such deed or document considering the merits of the objections taken with regard to the execution or genuineness of such deed or document.",
                "pre_block_list": [
                  "Civil Procedure Code (Amendment) Act, No. 17 of 2022 3"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency",
              "English Acts of the Parliament can be purchased at the P RAKASHANA  P IYASA , D EPARTMENT   OF G OVERNMENT  P RINTING , N O . 118, D R . D ANISTER  D E  S ILVA  M AWATHA , C OLOMBO  8."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}