{
  "n_pages": 8,
  "title_page": {
    "title": "Information And Communication Technology (Amendment) Act",
    "num": "33",
    "year": "2008",
    "date_certified": "2008-09-26",
    "date_published": "2008-09-26",
    "price": 7.0,
    "price_postage": 5.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 26Th September 2008]",
      "L.D.O. 30/2008.",
      "A N  A Ct   To   Amend   The  I Nformation   And  C Ommunication T Echnology  A Ct , N O . 27  Of  2003",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Information and Communication Technology (Amendment) Act, No. 33 of 2008.",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "The long title to the Information and Communication Technology Act, No. 27 of 2003 (hereinafter referred to as the principal enactment) is hereby amended by the substitution for the words T O   PROVIDE   FOR   THE",
            "pre_block_list": [
              "Amendment of the long title to the Information and Communication Technology Act, No. 27 of 2003.",
              "ESTABLISHMENT   OF   THE  N ATIONAL  C OMMITTEE   ON  I NFORMATION   AND C OMMUNICATION  T ECHNOLOGY   OF  S RI  L ANKA ;  TO   PROVIDE   FOR   THE",
              "SETTING   OUT   OF   A  N ATIONAL  P OLICY   ON  I NFORMATION   AND C OMMUNICATION  T ECHNOLOGY   AND   FOR   THE   PREPARATION   OF   AN   ACTION",
              "PLAN ;  TO   PROVIDE   FOR   THE   APPOINTMENT   OF   A  T ASK  F ORCE   FOR I NFORMATION   AND  C OMMUNICATION  T ECHNOLOGY ;  TO   PROVIDE   FOR   THE",
              "ESTABLISHMENT   OF   THE  I NFORMATION   AND  C OMMUNICATION T ECHNOLOGY  A GENCY   OF  S RI  L ANKA   CHARGED   WITH   THE",
              "IMPLEMENTATION   OF   THE  N ATIONAL  P OLICY   IN   BOTH   THE  P UBLIC",
              "AND   PRIVATE   SECTORS  of the words  TO   PROVIDE   FOR   THE",
              "ESTABLISHMENT   OF   AN  I NTER - MINISTERIAL  C OMMITTEE   ON I NFORMATION   AND  C OMMUNICATION  T ECHNOLOGY ;  TO   PROVIDE   FOR",
              "THE   FORMULATION   AND   APPROVAL   OF   A  N ATIONAL   POLICY ;  TO   PROVIDE",
              "FOR   THE   ESTABLISHMENT   OF   THE  I NFORMATION  C OMMUNICATION T ECHNOLOGY  A GENCY   OF  S RI  L ANKA   WITH   AUTHORITY   TO  D EVELOP   AND I MPLEMENT  S TRATEGIES   AND  P ROGRAMMES   ON  I NFORMATION   AND C OMMUNICATION  T ECHNOLOGY   IN   BOTH   THE   PUBLIC   AND   PRIVATE",
              "SECTORS ."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "Section 1 of the principal enactment is hereby amended as follows:",
            "pre_block_list": [
              "Amendment of section 1 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the substitution for the words and figures 1. (1) This Act may be cited as of the words and figures 1. This Act may be cited as;",
                "pre_block_list": [
                  "2PL003213  4,300 (09/2008)",
                  "Information and Communication Technology (Amendment) Act, No. 33 of 2008 2"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the repeal of subsection (2) of that section; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "by the repeal of the marginal note of that section and the substitution therefor of the following:",
                "pre_block_list": [
                  "Short title and the date of operation",
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "The heading appearing immediately before section 2 of the principal enactment is hereby repealed and the following new heading substituted therefor:",
            "pre_block_list": [
              "Replacement of the heading appearing immediately before section 2.",
              "F ORMULATION   AND  A PPROVAL   OF  N ATIONAL  P OLICY   ON I NFORMATION   AND  C OMMUNICATION  T ECHNOLOGY ."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "Sections 3, 4 and 5 of the principal enactment are hereby repealed and the following sections substituted therefor:",
            "pre_block_list": [
              "Replacement of sections 3, 4 and 5 of the principal enactment. Inter- Ministerial Committee.",
              "3. There shall be established an Inter- Ministerial Committee ( hereinafter referred to as the Committee) appointed by the Cabinet of Ministers which shall consist of",
              "( a ) the Minister in charge of the subject of Information and Communication Technology or his nominee;",
              "( b ) the Minister to whom the Information and Communication Technology Agency is assigned or his nominee;",
              "( c ) the Minister in charge of the subject of Education and Higher Education or Education or Higher Education, or his nominee or their nominees as the case may be ;",
              "( d ) the Chairman of the Board of Directors of the Information and Communication Technology Agency",
              "of Sri Lanka and one other member of the Board, nominated by the Chairman; and",
              "( e ) such other number of persons representing the fields of  public administration and  telecommunications, and such other category of stakeholders, as may be determined by the Cabinet of Ministers.",
              "4. (1) The Committee shall be charged with the task of advising the Government on the formulation of policies in relation to Information and Communication Technology, which may be approved by the Cabinet of Ministers under section 2.",
              "Powers &c,. of the Committee."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Committee shall meet at least once every year.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The procedure to be followed at the meetings of the Committee shall be prescribed.",
                "pre_block_list": [
                  "5. Without prejudice to the generality of the powers conferred on the Committee by section 4, the functions of the Committee shall be, to",
                  "Functions of the Committee."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "formulate, on the recommendation of the Information and Communication Technology Agency of Sri Lanka, the National Policy Framework for submission to the Cabinet of Ministers for their approval under section 2;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "periodically review the National Policy Framework and advice the Cabinet of Ministers of any changes which may become necessary to the same;",
                    "pre_block_list": [
                      "Information and Communication Technology (Amendment) Act, No. 33 of 2008 4"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "provide guidance and facilitate the implementation of programmes and strategies by the Information and Communication Technology Agency of Sri Lanka, in both public and private sectors, as approved by the Cabinet of Ministers and were necessary issue directions from time to time to the relevant implementing agencies and stake holders;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "identify, develop and cause to be adopted appropriate standards and recommend best practices for human resources development and market creation relevant to the field of Information and Communication Technology and services;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "take steps to develop and deploy interoperable information technology systems,  and  improve  the infrastructure facilities necessary for the development of the Information and Communication Technology sector in Sri Lanka;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "promote and conduct research into all aspects  of  Information  and Communication Technology;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "g",
                    "text": "to do such other things as may be necessary for the performance and discharge of the functions of the Committee and for the development of Information and Communication Technology in Sri Lanka; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "h",
                    "text": "recommend where necessary the making of regulations to give effect to the provisions of the Act",
                    "pre_block_list": [
                      ""
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "Section 6 of the principal enactment is hereby amended as follows:",
            "pre_block_list": [
              "Amendment of section 6 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "in subsection (1) thereof by the substitution for the words the Task Force and the Committee of the words the Committee and implement strategies and  programmes  on  Information  and Communication Technology. The Agency shall render all assistance as shall be required by the Committee in the exercise of its powers and the discharge of its functions and shall also function as the Secretariat to such Committee.; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "in subsection (2) of that section",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "i",
                    "text": "by the omission of the words and action plan in paragraphs ( b ), ( c ), ( d ) and ( g ) thereof; and",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "by the repeal of paragraph ( f ) thereof and the substitution therefor of the following:",
                        "pre_block_list": [
                          "( f ) identify the matters which need to be taken into consideration in the preparation and amendment or revision of the National Policy;; and"
                        ],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "by the repeal of paragraph ( h ) thereof.",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "Section 7 of the principal enactment is hereby amended as follows:",
            "pre_block_list": [
              "Amendment of section 7 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the repeal of subsections (1) and (2) of that section and the substitution therefor of the following:",
                "pre_block_list": [
                  "(1) The Minister may, from time to time, in consultation with the stakeholders and consequent",
                  "Information and Communication Technology (Amendment) Act, No. 33 of 2008 6",
                  "to the decisions made by the Committee, issue to the Agency and other public entities such directions and guidelines on matters relating to the development of Information and Communication Technology.;"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the re-numbering of subsection (3) of that section as subsection (2) thereof; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "in subsection (2) of that section, by the omission of the words the Task Force.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency.",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , D EPARTMENT   OF G OVERNMENT  I NFORMATION , N O . 163, K IRULAPONA  M AWATHA , P OLHENGODA , C OLOMBO  05 before 15th December each year in respect of the year following ."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}