{
  "n_pages": 17,
  "title_page": {
    "title": "Institute Of Certified Management Accountants Of Sri Lanka Act",
    "num": "23",
    "year": "2009",
    "date_certified": "2009-04-20",
    "date_published": "2009-04-24",
    "price": 14.0,
    "price_postage": 7.5
  },
  "body_pages": {
    "preamble": [
      "[Certified On 20Th April, 2009]",
      "L.D.O 46/2006.",
      "A N  A Ct   To   Provide   For   The   Establishment   Of   The  I Nstitute   Of",
      "C Ertified  M Anagement  A Ccountants   Of  S Ri  L Anka   And   Of   A",
      "Council   Of   The   Institute   Which   Shall   Be   Responsible   For   The",
      "Management   Of   Its   Affairs ;  To   Provide   For   The   Registration   Of",
      "Members   Of   The   Institute   And   To   Specify   Criteria   For   And   The",
      "Maintenance   Of   Professional   Standards   And   Discipline   By",
      "Members   Of   The   Institute ;  And   To   Provide   For   Matters   Connected",
      "Therewith   Or   Incidental   Thereto .",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Institute of Certified Management Accountants of Sri Lanka Act, No. 23 of 2009.",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "I",
        "text": "",
        "pre_block_list": [
          "C ONSTITUTION ,  OBJECTS   AND   POWERS   OF   THE  I NSTITUTE   OF  C ERTIFIED",
          "M ANAGEMENT  A CCOUNTANTS   OF  S RI  L ANKA"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be established an Institute which shall be called the Institute of Certified Management Accountants of Sri Lanka (hereinafter referred to as the Institute) consisting of the persons who are for the time being members of the Society of Certified Management Accountants of Sri Lanka incorporated under the Societies Ordinance (Chapter 123).",
                "pre_block_list": [
                  "Establishment of the Institute of Certified Management Accountants of Sri Lanka."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Institute shall, by the name assigned to it by subsection (1), be a body corporate and shall have perpetual succession and a common seal and may sue and be sued in such name.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "The general objects for which the Institute is constituted are hereby declared",
            "pre_block_list": [
              "General objects of the Institute."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "to provide for a professional organization for management accountants;",
                "pre_block_list": [
                  "2PL 0037044,200 (02/2009)"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "to promote and develop the study of management Accountancy; to establish and issue management Accountancy Standards; and to encourage the application of correct principles, techniques and practices of Management Accountancy;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "to take necessary steps to promote the profession of Management Accountancy in its practice to industry, commerce, education, finance, public service and information technology;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "to conduct a Certified Management Accounting Program leading to the Professional Management Accounting qualification and to take steps to emphasize the importance of such a qualification;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "to provide for a post management accounting qualification for the professional development of members at both Masters and Doctorate levels;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "to monitor the admission of members to the membership of the Institution;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "g",
                "text": "to undertake and regulate the professional education and practical training of persons who are keen to qualify in Management Accountancy and to approve a Practical Training Scheme to be followed by the students;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "h",
                "text": "to prescribe and approve courses of study being conducted by the Institute, taking into consideration its functions in relation to education, training and examination;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "to conduct examinations for the grant of the required professional qualifications and to collaborate with recognized local and foreign professional and educational Institutions to promote studies in such institution and to obtain exemptions and recognition in the field of Management Accountancy for members of the Institute;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "j",
                "text": "to promote, collaborate and assist in the study of Management Accountancy, at Universities and other Higher Educational Institutions;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "k",
                "text": "to prescribe the qualifications and disqualifications applicable for membership to the Institute and to establish standards of professional conduct and ethics for members of the Institute;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "l",
                "text": "to organize, supervise and regulate continuing professional education for the benefit of the members;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "m",
                "text": "to maintain a library of both print and electronic media, books and periodicals, relating to Management Accountancy and related subjects for the use of members, students and those interested in the field of Management Accountancy;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "n",
                "text": "to encourage the publication of books and periodicals relating to Management Accountancy;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "o",
                "text": "to grant scholarships, awards and prizes for those who excel in the field of Management Accountancy; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "p",
                "text": "to award Diplomas and Certificates to the members of the Institute and to those who fulfill the conditions prescribed by the Institute.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "The following persons shall be eligible for membership of the Institute:",
            "pre_block_list": [
              "Eligibility for Membership of the Institute."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "any person who passes the qualifying examinations for membership of the Institute to be conducted by the Council under this Act and who possess such practical training as may, from time to time be prescribed  by the Council; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "any person who is a member of any professional body of Accountants by whatever name called and which is approved by rules made by the Council for the time being, and such Association is, in the opinion of the Council, an Association of equivalent status to the Institute.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The members of the Institute shall comprise Fellow Members and Associate Members.",
                "pre_block_list": [
                  "Classification of members."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "A student on completion of all examinations of the Institute and acquiring a minimum of three years of practical experience in an approved sector as prescribed by the Council upon application being made to the Council and payment to the Council of the prescribed fee shall be eligible for registration as an Associate of the Institute by the Council. Such member shall upon registration by the Council as an Associate of the Institute be entitled to use the addition ACMA after his name.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Any Member of the Institute who satisfies the Council that he has been an Accountant, Management Consultant or a lecturer in a university established under the Universities Act, No. 16 of 1978 for not less than five years with a minimum of three years Senior Managerial or equivalent experience and who has fulfilled such requirements as may be prescribed by the Council shall be eligible for registration as a Fellow of the Institute by the Council. Any person eligible for registration may forward an application to the Council for registration along with the prescribed fee.  A member shall, upon registration by the Council as a Fellow of the Institute, be entitled to use the addition FCMA after his name.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Every member of the Institute who is not registered under subsection (3) as a Fellow of the Institute shall be an Associate Member and shall have the right to use the addition of ACMA after his name to indicate that he is an Associate Member.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Every Member of the Institute shall be entitled to take and use the title Certified Management Accountant (CMA).",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "No person, not being a Member of the Institute shall take or use the title Certified Management Accountant (CMA) or any addition mentioned in subsections (3) and (4) above.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "( 1) No person shall take or use any title either by description or abbreviation or the logo of the Institute, unless such person is eligible under section 5 and has been authorized in writing by the Council of the Institute to do so.",
            "pre_block_list": [
              "Use of titles and logo."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any person who contravenes the provisions of subsection (1) shall be guilty of an offence.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "The Institute shall have such powers, duties and functions as may reasonably be necessary to carry out its objects and in particular may",
            "pre_block_list": [
              "Powers  &c.,  of the Institute."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "acquire in any manner whatsoever and hold, take or give on lease or hire, mortgage, pledge, sell or otherwise dispose of, any movable or immovable property;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "establish and operate management training and education centres;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "conduct, assist, co-ordinate and encourage research into all aspects of management;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "appoint, employ, remunerate and exercise disciplinary control over its officers and servants;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "levy fees or charges for any service rendered by the Institute;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "pay fees or charges for any services rendered to the Institute;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "g",
                "text": "import equipment required for the purposes of the Institute, and receive equipment, funds, and any other assistance for carrying out the objects of the Institute;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "h",
                "text": "obtain the services of personnel to carry out the objects of the Institute;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "establish work performance standards for its own personnel, evaluate such performance and take reasonable action thereupon;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "j",
                "text": "establish and maintain welfare and recreational facilities for its employees;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "k",
                "text": "make rules in relation to its officers and servants including the appointment, training, promotion, remuneration, disciplinary control, conduct and grant of leave;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "l",
                "text": "make rules in respect of the general administration of the Institute;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "m",
                "text": "to issue guidelines and standards in Management Accounting for the members of the Institute;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "n",
                "text": "to open and operate bank accounts, to borrow money, to receive grants and donations, and to invest funds;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "o",
                "text": "to defend the intellectual property rights of the Institute;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "p",
                "text": "to make rules, not inconsistent with the provisions of this Act for the management of the Institute and accomplishment of its objects. These rules when made may be altered, added, amended or rescinded, in the manner provided for herein.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be a Governing Council (hereinafter referred to as the Council) responsible for the management, control and administration of the Institute.",
                "pre_block_list": [
                  "Constitution of the Council."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Council shall consist of",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "President and Vice-President elected by the members of the Institute among its membership;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the following ex-officio members :",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "the Governor of the Central Bank of Sri Lanka or his nominee;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "the President of the Institute of Chartered Accountants of Sri Lanka or his nominee who is a current member of the Council of the Institute;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "the Head of the Department of Accounting of the University of Sri Jayawardanapura or his nominee; and",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "three members elected by the members of the Institute among its membership.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The members of the Council of the Society of Certified Management Accountants of Sri Lanka holding office on the day immediately preceding the date of the coming into operation of this Act, shall be the members of the first Council of the Institute established herein, and shall hold office for a period of four years.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Elections for the election of members in terms of paragraphs ( a ) and ( c ) of subsection (2) shall be conducted in accordance with the rules of the Council.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Every member of the Council shall, unless he earlier vacates office, hold office for a period of two years from the date of his appointment or election as the case may be:",
                "pre_block_list": [
                  "Term of office of members of the Council.",
                  "Provided however, that the members appointed under subsection (3) of section 8 holding office at the expiration of period of four years from the date referred to in that subsection shall thereupon vacate office, but shall be eligible for re-election."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "A member of the Council shall vacate office by resignation therefrom or if he ceases to be a member of the Institute.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "In the event of the death of, or vacation of office by a member of the Council, another person shall, in accordance with the provisions of section 7, be appointed or elected, as the case may be, in place of such member, and shall hold office during the remaining part of the term of office of such member.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Any member of the Council who vacates office by effluxion of time shall be eligible for reappointment or re-election as a member.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "A member of the Council shall be deemed to have vacated office on failure to attend three consecutive meetings of the Council unless excused by the Council or upon such member ceasing to be a member of the Institute.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "10",
            "text": "No act or proceeding of the Institute shall be deemed to be invalid by reason only of the existence of any vacancy in the Council or defect in the appointment of any member of the Council.",
            "pre_block_list": [
              "Acts or proceedings of the Institute deemed not to be invalid  by reason of any vacancy or defect in the appointment of a member."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "11",
            "text": "It shall be lawful for the Council to appoint an Advisory Board consisting of not more than ten eminent persons for a period not exceeding two years. The Council may, at its discretion, seek the views and advice of the Advisory Board, but it shall in no way be bound to accept or execute any such advice.",
            "pre_block_list": [
              "Appointment of an Advisory Board."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "12",
            "text": "The Council may from time to time invite distinguished local or foreign persons of eminence having a professional background to serve as Patrons of the Institute. They shall not be required to pay any entrance fees or annual subscriptions.",
            "pre_block_list": [
              "Patrons of the Institute."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "13",
            "text": "All or any of the members of the Council may be paid such remuneration out of the funds of the Institute as may be determined by the Council.",
            "pre_block_list": [
              "Remuneration of members."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "14",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The meetings of the Council shall  be held at least once a month.",
                "pre_block_list": [
                  "Meetings of the Council."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "At least seven days notice of every meeting of the Council shall be given  in writing to each of the members, and such notice shall specify the business to be dealt with at such meeting.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The President shall summon a special meeting of the Council within seven days after being requested in writing to do so by five members of the Council.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The quorum for a general meeting of the Council shall be three members present in person or by proxy.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Every member who attends a meeting of the Council shall be paid a fee or re-imbursement of any expenses incurred in attending such meeting, in such amount as may be determined by the Council.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "The President shall preside at meetings of the Council and in the absence of the President from any meeting of the Council a member chosen by the majority of members present shall preside at such meeting.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "If the President is by reason of illness or other infirmity or absence from Sri Lanka, temporarily unable to perform the duties of his office the Council may appoint one of the members to act in his place.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "8",
                "text": "Where three is an equality of votes on any matter or thing decided at a meeting of the Council, the President at such meeting shall, in addition to his vote, have a casting vote.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "9",
                "text": "Subject to the provisions herein contained, the Council may determine its own procedure for the transaction of business of the Council.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "II",
        "text": "",
        "pre_block_list": [
          "A PPOINTMENT   OF   OFFICERS   AND   SERVANTS   OF   THE  I NSTITUTE"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "15",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Council may appoint to the staff of the Institute, a Chief Executive Officer, who shall administer the affairs of the Institute.",
                "pre_block_list": [
                  "Appointment of the Chief Executive Officer of the Institute."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Chief Executive Officer shall exercise, perform and discharge such powers, duties and functions as may be delegated to him.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Council may remove from office the Chief Executive Officer appointed under subsection (1).",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The Chief Executive Officer may be paid such remuneration as may be determined by the Council.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "16",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Subject to the other provisions of this Act, the Council may",
                "pre_block_list": [
                  "Powers of the Institute in regard to appointments to the staff of the Institute."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "appoint to the staff of the Institute such other officers and servants as may be necessary for the purposes of the Institute;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "dismiss and exercise disciplinary control over the staff of the Institute;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "fix the wages or salaries or other remuneration of the staff;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "determine the terms and conditions of service of such staff; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "establish and regulate provident funds and schemes for the benefit of such staff and make contributions to any such fund or scheme.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Rules may be made in respect of any one or all matters specified in subsection (1).",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "17",
            "text": "( 1) The Council may delegate to the Chief Executive Officer any of its powers relating to the appointment of other officers or servants to the staff of the Institute. The conditions of employment including remuneration of any of the members of the professional staff appointed by the Chief Executive Officer under the powers delegated to him, shall be determined with the approval of the Council.",
            "pre_block_list": [
              "Delegation of powers of the Council of the Chief Executive Officer in regard to appointments."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The dismissal, by the Chief Executive Officer or any officer or servant or any member of the professional staff of the Institute shall not take effect unless it is approved by the Council.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "18",
            "text": "The Chief Executive Officer with the concurrence of the Council shall determine the duties of the officers and servants of the Institute.",
            "pre_block_list": [
              "Determination of duties."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "19",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Council may make rules in respect of",
                "pre_block_list": [
                  "Rules."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the classification of membership, fees payable by each class of member, their admission, withdrawal, expulsion for non payment of membership fees or resignation;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "appointment, employment and dismissal of various officers, agents and servants of the Institute, their powers, duties, functions and conduct and the payment of remuneration and the regulation of provident funds and other schemes for their benefit;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "fixing of the student registration fees, annual subscription, exam fees, lecture fees, prices of study texts and other publications;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "appointment of committees and sub-committees of the Council consisting  of members of the Council and the membership of the Institute to deal with specific subjects and the regulation of the functions of such committees;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "the administration and management of the property of the Institute;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "election of, or vacation of or removal from office of, the members of the Council and their resignation, from office, office-bearers and their powers, duties and conduct;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "g",
                    "text": "the procedure to be observed at the summoning and holding of meetings, Annual General Meetings and Extraordinary Meetings of the Council and the Institute, filling of vacancies, notices and agenda of such meeting, the quorum thereof and the conduct of business thereat;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "h",
                    "text": "the qualifications and disqualifications for membership of the Council and the Institute;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "i",
                    "text": "the setting up of disciplinary committees and formulation of code of ethics and the exercise of disciplinary control over the members, disciplinary procedure and expulsion of members or suspension of membership;  and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "j",
                    "text": "the entry criteria for admission of students for the Certified Management Accountancy (CMA) Programme.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every rule made by the Council under paragraphs ( f ) to ( j ) of subsection (1) of section 19 shall be approved by the Minister.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every rule made under this section shall be published in the  Gazette .",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "III",
        "text": "",
        "pre_block_list": [
          "F INANCE"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "20",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Institute shall have its own Fund.",
                "pre_block_list": [
                  "The Fund of Institute."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "There shall be credited to the Fund of the Institute all sums of money received by the Institute in the exercise, discharge and performance of its powers, functions and duties.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Council may invest moneys of the fund in any securities issued or guaranteed by the Government of Sri Lanka.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The Council may maintain, in any approved Bank or Banks in Sri Lanka, Call, Current, Savings or Deposit Accounts.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "All sums of money required to defray any expenditure incurred by the Institute in the exercise, performance and discharge of its powers, duties and functions shall be charged on the Fund.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "21",
            "text": "The financial year of the Institute shall be the calendar year.",
            "pre_block_list": [
              "Financial year of the Institute."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "22",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Institute shall cause proper accounts to be kept of its income and expenditure, assets and liabilities and all other transactions of the Institute.",
                "pre_block_list": [
                  "Audit of accounts."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The accounts of the Institute shall be audited annually by a qualified auditor appointed by the Institute.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "In this section qualified auditor means",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "an individual who, being a member of the Institute of Chartered Accountants of Sri Lanka, or of any other Institute established by law, possesses a certificate to practice as an Accountant issued by the Council of such Institute; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "a firm of Accountants, each of the resident partners of which being a member of the Institute of Chartered Accountants of Sri Lanka or of any other Institute established by law, possesses a certificate to practice as an Accountant issued by the Council of such Institute.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "23",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Any contract entered with on behalf of the Institute may be made as follows:",
                "pre_block_list": [
                  "Contracts."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "if made between private persons, would by law be required to be in writing, may be made on behalf of the Institute in writing under the common seal of the Institute;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "if made between private persons, would by law be required to be in writing, signed by the parties to be charged therewith, may be made on behalf of the Institute in writing signed by any person or persons duly authorized thereto by the Institute;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "if made between private persons, would by law be valid though made orally and not reduced into writing, may be made orally on behalf of the Institute by any person or persons duly authorized thereto by the Institute.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "A contract made according to this section shall be effectual in law and shall bind the Institute and all persons thereto and their legal representatives.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "24",
            "text": "Any expense incurred by the Institute in any suit or prosecution brought by or against the Institute before any court shall be paid out of the funds of the Institute and any cost paid to be recovered by the Institute in any suit or prosecution shall be credited to the Fund of the Institute.",
            "pre_block_list": [
              "Recovery of expenses incurred by the Institute."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "25",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "No civil or criminal proceedings shall be instituted",
                "pre_block_list": [
                  "Protection of acts done under this Act or on the directions of the Institute."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "against the Institute for any lawful act which in good faith is done or purported to be done by the Institute under this Act; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "against any member, officer, servant or agent for any act which in good faith is done or purported to be done by such member, officer, servant or agent under this Act or on the directions of the Council, as the case may be.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any expense incurred by any person specified in subsection (1) in any suit or prosecution brought against such person before any Court for any act done under this Act or on the direction of the Institute shall if the Court determines that such act was done in good faith be paid out of the Fund of the Institute.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "26",
            "text": "No writ against person or property shall be issued against a member of the Council in any action brought against the Institute.",
            "pre_block_list": [
              "No writ to issue against person or property of a member of the Council."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "27",
            "text": "Every person who commits an offence under this Act shall on conviction after trial before a Magistrate be liable to imprisonment of either description for a period not exceeding six months or to a fine not exceeding five hundred rupees or to both such fine and imprisonment.",
            "pre_block_list": [
              "Offences and penalties."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "28",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency.",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS   B UREAU , D EPARTMENT   OF G OVERNMENT   I NFORMATION ,  N O . 163,  K IRULAPONA  M AWATHA , P OLHENGODA , C OLOMBO  05  before  15th December each year in respect of the year following."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}