{
  "n_pages": 6,
  "title_page": {
    "title": "Act",
    "num": "25",
    "year": "2024",
    "date_certified": "2024-05-03",
    "date_published": "2024-05-03",
    "price": 12.0,
    "price_postage": 150.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 03Rd Of May, 2024]",
      "L. D.- O 29/2022",
      "A N  A Ct   To   Amend   The  C Ode   Of  C Riminal  P Rocedure A Ct , N O . 15  Of  1979",
      "Be   It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows: -"
    ],
    "pre_section_list": [
      {
        "class_name": "ActL1Section",
        "num": "1",
        "text": "This Act may be cited as the Code of Criminal Procedure (Amendment) Act, No. 25 of 2024.",
        "pre_block_list": [
          "Short title"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "2",
        "text": "Section 185 of the Code of Criminal Procedure Act, No. 15 of 1979 (hereinafter referred to as the principal enactment) is hereby amended as follows: -",
        "pre_block_list": [
          "Amendment of section 185 of Act, No. 15 of 1979"
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "by the renumbering of that section as subsection (1) of that section; and",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "by the addition immediately after the renumbered subsection (1), of the following new subsections: -",
            "pre_block_list": [
              "(2) At the time of passing the sentence, the Magistrate may, after considering all relevant facts take into cognizance the time spent by such accused in custody prior to the conviction of the offence he is convicted of, and in such cases the time so spent in custody shall be considered to be part of his sentence:",
              "Provided that, where the time spent by such accused in custody is not considered to be part of his sentence, the Magistrate shall record reasons therefor:",
              "Provided further, the time so spent in custody by the accused prior to the conviction shall not",
              "Code of Criminal Procedure (Amendment) Act, No. 25 of 2024 2",
              "be taken into consideration where a mandatory minimum sentence is stipulated by law in respect the offence the accused is charged with."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "For the purpose of this section, custody means the time spent in remand custody",
            "pre_block_list": [
              ""
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "3",
        "text": "Section 203 of the principal enactment is hereby amended as follows: -",
        "pre_block_list": [
          "Amendment of section 203 of the principal enactment"
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "by the renumbering of that section as subsection (1) of that section; and",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "by the addition immediately after the renumbered subsection (1), of the following new subsections:-",
            "pre_block_list": [
              "(2) At the time of passing the sentence, the Judge may, after considering all relevant facts take into cognizance the time spent by such accused in custody prior to the conviction of the offence he is convicted of, and in such cases the time so spent in custody, shall be considered to be part of his sentence:",
              "Provided that, where the time spent by such accused in custody is not considered to be part of his sentence, the Judge shall record reasons therefor:",
              "Provided further, the time so spent in custody by the accused prior to the conviction shall not be taken into consideration where a mandatory minimum sentence is stipulated by law in respect of the offence the accused is charged with."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "For the purpose of this section, custody means the time spent in remand custody",
            "pre_block_list": [
              ""
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "4",
        "text": "The following new section is hereby inserted immediately after section 238  of the  principal enactment and shall have effect as section 238 A  of that enactment: -",
        "pre_block_list": [
          "Insertion of new section 238 A  in the principal enactment",
          "238 A . (1) At the time of passing the sentence, the Judge may, after considering all relevant facts take into cognizance the time spent by such accused in custody prior to the conviction of the offence he is convicted of, and in such cases the time so spent in custody, shall be considered to be part of his sentence:",
          "Passing the sentence",
          "Provided that, where the time spent by such accused in custody is not considered to be part of his sentence, the Judge shall record reasons therefor:",
          "Provided further, the time so spent in custody by the accused prior to the conviction shall not be taken into consideration where a mandatory minimum sentence is stipulated by law in respect of the offence the accused is charged with."
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "For the purpose of this section, custody means the time spent in remand custody",
            "pre_block_list": [
              ""
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "5",
        "text": "Section 323 of the principal enactment is hereby amended in subsection (5) thereof, by the substitution for the words the time so spent, of the words the time spent.",
        "pre_block_list": [
          "Amendment of section 323 of the principal enactment",
          "Code of Criminal Procedure (Amendment) Act, No. 25 of 2024 4"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "6",
        "text": "Section 333 of the principal enactment is hereby amended in subsection (5) thereof, by the substitution for the words received into prison under the sentence., of the following:-",
        "pre_block_list": [
          "Amendment of section 333 of the principal enactment",
          "received into prison under the sentence:",
          "Provided that, the Court of Appeal may, in appropriate cases, order that the time spent by an appellant in custody pending the determination of his appeal and any time spent in custody prior to the conviction, such time not having been considered as part of his sentence passed at the time of his conviction by the court of first instance, be considered as part of his sentence ordered at the conclusion of his appeal",
          ""
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "7",
        "text": "In the event of any inconsistency between the Sinhala and the Tamil texts of this Act, the Sinhala text shall prevail. Sinhala text to prevail in case of inconsistency",
        "pre_block_list": [
          "English Acts of the Parliament can be purchased at the P RAKASHANA  P IYASA , D EPARTMENT   OF G OVERNMENT  P RINTING , N O . 118, D R . D ANISTER  D E  S ILVA  M AWATHA , C OLOMBO  8."
        ],
        "child_level_list": []
      }
    ],
    "part_list": []
  }
}