{
  "n_pages": 9,
  "title_page": {
    "title": "Tax Appeals Commission Act",
    "num": "23",
    "year": "2011",
    "date_certified": "2011-03-31",
    "date_published": "2011-04-01",
    "price": 5.0,
    "price_postage": 10.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 31St March, 2011]",
      "L.D.O. 19/2011.",
      "A N  A Ct   To   Provide   For   The  C Onstitution   Of   A  T Ax  A Ppeals",
      "C Ommission ;  To  S Pecify   The  P Owers   Of   Such  C Ommission   And",
      "The   Procedure   To   Be   Followed   In  H Earing   And  D Isposing",
      "Of   Such  A Ppeals ;  And   To   Provide   For   Matters   Connected",
      "Therewith   Or   Incidental   Thereto .",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Tax Appeals Commission Act, No. 23 of 2011.",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be established a Commission to be called and known as the Tax Appeals Commission (hereinafter referred to as the Commission) which shall charged with the responsibility of hearing all appeals in respect of matters relating to imposition of any tax, levy or duty.",
                "pre_block_list": [
                  "Establishment of the Tax Appeals Commission and its composition."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Commission shall comprise not more than three members who shall be appointed from amongst retired Judges of the Supreme Court and the Court of Appeal, persons who have wide knowledge of, and have gained eminence in the fields of Taxation, Finance and Law, by the Minister to whom the subject of Finance is assigned. One of the members shall be appointed as the Chairman of the Commission by the Minister.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every member of the Commission shall hold office for a term not exceeding three years, and shall be eligible for reappointment.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "There shall be a Secretary to the Commission who shall be appointed by the Minister in charge of the subject of Finance.",
            "pre_block_list": [
              "Secretary to the Commission."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Minister shall appoint a Panel of Legal Advisors (hereinafter referred to as the Panel) comprising",
                "pre_block_list": [
                  "Panel of Legal Advisors.",
                  "2 PL 005602 4,090 (03/2011)",
                  "not more than ten persons, who have gained eminence in the field of Law,  for the purpose  of assisting the Commission in the exercise, performance and discharge of powers, duties and functions under this Act."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Three or more members of the Panel shall be nominated by the Minster to attend the hearings of the Commission and assist in the progress of the appeal proceedings and investigations if any, before such Commission.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "At the request of the Chairman, the Secretary to the Commission shall summon once a month a meeting of all the members of the Commission and the Panel. The quorum for such meeting shall be five members.",
            "pre_block_list": [
              "Meetings of Members of the Commission and the Panel."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "The members of the  Commission and the Panel shall be remunerated in such amount as shall be determined by the Minister.",
            "pre_block_list": [
              "Remuneration of the Members of the Commission and the Panel."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "A person who is aggrieved by the determination of the Commissioner-General of Inland Revenue given in respect of any matter relating to imposition of any tax, levy or duty under the provisions of any of the enactments specified in the Schedule to this Act, may appeal to the Commission in accordance with the provisions hereinafter set out:",
                "pre_block_list": [
                  "Right to appeal to the Commission against the decision given under any law specified in the Schedule.",
                  "Provided that, every person who wishes to appeal to the Commission as provided for above, shall, at the time of making the appeal, be required to pay into a special account which shall be opened and operated by the Commission for such purpose, an amount as is equivalent to twenty-five  per centum  of the sum as assessed by the Commissioner-General as being payable by such person as tax under any   of the said enactments and which assessment is the subject of the appeal, or a bank guarantee for the equivalent amount."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "A person to whom a right to appeal has accrued in terms of the provisions of the enactments specified in the Schedule to this Act, shall notify the Commission within",
                "pre_block_list": [
                  "thirty days of the determination being communicated to him under the respective laws, of the fact that he intends to prefer an appeal to the Commission against such determination. He shall state all relevant details of the determination in such notification including the name and address of his authorized representative, if any."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where the aggrieved person has notified the Commission in accordance with the provisions of  subsection (2) that he intends to prefer an appeal to the Commission against such determination, the Commission shall forward a copy of such notification to the Commissioner-General and require him to transmit in writing, to the Commission and the aggrieved party and his authorized representative, within thirty days of receipt of the notification, his reasons for the determination against which such person seeks to appeal.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The manner and form of submitting an appeal under this Act and the fees if any, payable in respect thereof, and the time within which a petition ought to be preferred, shall be as prescribed.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "The person aggrieved may, if he is not satisfied with the reasons given by the Commissioner-General prefer an appeal therefrom, to the Commission, and the Commission shall hear and determine such appeal in accordance with such rules as may be made in that behalf.",
            "pre_block_list": [
              "Procedure for preferring an appeal."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Within thirty days of the receipt of an appeal, the Secretary to the Commission shall fix a date and time and place for the hearing of the appeal, and shall give forty-two days notice thereof, both to the appellant and to the Commissioner-General.",
                "pre_block_list": [
                  "The hearing of the appeal."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Commissioner-General shall on receipt of a notice under subsection (1), transmit to the Commission the extracts of the provisions of the applicable enactments specified in the Schedule to this Act and the record of evidence maintained under such enactments.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every appellant shall attend in person or by an authorized representative, on the day fixed for the hearing of the appeal by the Commission:",
                "pre_block_list": [
                  "Provided that, where an authorized representative of the appellant is present at the hearing of an appeal, the Commission may postpone the hearing for such time as it thinks necessary to enable the attendance in person, of the appellant."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The Assessor who made the assessment appealed against or a person authorized by the Commissioner-General in that behalf, shall attend the hearing of the Commission at which such appeal is heard, in support of the determination of the Commissioner-General.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "The onus of proving that the assessment as determined by the Commissioner-General in terms of the respective enactments specified in the Schedule to the Act, is excessive or erroneous, shall be on the appellant.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "All appeals shall be heard in  camera .",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "The Commission shall have power to summon to a hearing, the attendance of any person whom it considers capable of giving evidence respecting the appeal and may examine him as a witness, either on oath or otherwise. Any person so attending may be allowed by the Commission to be paid any reasonable expenses necessarily incurred by him in so attending.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "8",
                "text": "Except with the consent of the Commission and on such terms as the Commission may determine, the appellant shall not at the hearing, be allowed to produce any document which was not produced before the Commissioner-General, or to adduce the evidence of any witness whose evidence was not led before the Commissioner-General, or adduce evidence of a witness whose evidence has already  been recorded at the hearing before the Commissioner-General.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "9",
                "text": "At the hearing of the appeal the Commission may, admit or reject any evidence adduced whether oral or documentary, and the provisions of the Evidence Ordinance relating to the admissibility of evidence shall not apply in respect of such evidence.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "10",
                "text": "After hearing the evidence, the Commission shall on appeal either confirm, reduce, increase or annul, as the case may be, the assessment as determined by the Commissioner- General or may remit the case to the Commissioner-General with the decision of the Commission on such appeal. Where a case is so remitted by the Commission, the Commissioner- General  shall revise the assessment in order that it is in conformity with such amount as stated in the decision of the Commission. The decision of the Commission shall be notified to the appellant and the Commissioner-General in writing.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "10",
            "text": "The Commission shall hear all appeals received by it and make its decision in respect thereof, within one hundred and eighty days from the date of the commencement of the hearing of the appeal:",
            "pre_block_list": [
              "Determination of appeals by the Commission.",
              "Provided that, all appeals pending before the respective Board or Boards of Review in terms of the provisions of the respective enactments specified in the Schedule to this Act, shall with effect from the date of coming into operation of the provision of this Act be deemed to stand transferred to the Commission, and the Commission shall make its decision in respect thereof, within hundred and eighty days from the date of such transfer notwithstanding anything contained in any other written law."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "11",
            "text": "Where under subsection (10) of section 9 the Commission does not reduce or annul an assessment in respect of which an appeal had been preferred in terms of this Act, the Commission may order the appellant to pay as costs a sum not exceeding rupees five thousand, in addition to the assessed amount, which shall be added to the tax charged by the assessment, and recovered therewith.",
            "pre_block_list": [
              "Costs to be recovered with assessment if Commission does not reduce or annul the assessment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "12",
            "text": "No suit or prosecution shall lie against any member, officer or servant of the Commission for any lawful act done or omitted to be done in good faith under this Act or which is done on the directions of the Commission.",
            "pre_block_list": [
              "No suit or prosecution to lie."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "13",
            "text": "The provisions of the enactments specified in Column I of the Schedule to this Act, are hereby amended or repealed in the sections or parts thereof as are specified in Column II of the Schedule to the extent and in the manner as shall be specified in Column III of such Schedule.",
            "pre_block_list": [
              "Repeals."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "14",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the  Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency.",
              "AA",
              "SCHEDULE",
              "1. Inland Revenue Act, No. 10 of 2006",
              "Sections 166,167, 168, 169",
              "The Inland Revenue Act is hereby amended by the repeal of section 166, section 167, section 168 and section169.",
              "2. Value Added Tax Act, No. 14 of 2002",
              "Sections 35, 35(1 A ), 36",
              "The Value Added Tax Act is hereby amended by the repeal of section 35, section 35(1 A ) and section 36.",
              "3. Nation Building Tax Act, No. 9 of 2009",
              "Section 8",
              "Section 8 of the Nation Building Tax Act is hereby amended by the omission therefrom of the words and figures Chapter XXIII relating to Appeals.",
              "4. Economic Service Charge Act, No. 13 of 2006",
              "Section 11",
              "Section 11 of the Economic Service Charge Act is hereby amended by the omission therefrom of the word Appeals.",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , D EPARTMENT   OF G OVERNMENT  I NFORMATION , N O . 163, K IRULAPONA  M AWATHA , P OLHENGODA , C OLOMBO  05 before 15th December each year in respect of the year following ."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}