{
  "n_pages": 84,
  "title_page": {
    "title": "Agrarian Development Act",
    "num": "46",
    "year": "2000",
    "date_certified": "2000-08-18",
    "date_published": "2000-08-18",
    "price": 58.25,
    "price_postage": 17.5
  },
  "body_pages": {
    "preamble": [
      "[Certified On 18Th August, 2000]",
      "L. D. O.11/98.",
      "A N  A Ct   To   Provide   For ,  Matters   Relating   To   Landlords",
      "And   Tenant   Cultivators   Of   Paddy   Lands ,  For   The",
      "Utilization   Of   Agricultural   Lands   In   Accordance   With",
      "Agricultural   Policies  ;  For   The   Establishment   Of A Grarian  D Evelopment  C Ouncils ,  To   Provide   For   The",
      "Establishment   Of   A  L And   B Ank  ;  To   Provide   The",
      "Establishment   Of  A Grarian  T Ribunals ,  To   Provide   For",
      "The   Repeal   Of   The  A Grarian  S Ervices  A Ct , N O . 58  Of 1979 ;  And   For   Matters   Connected   Therew Ith Or",
      "Incidental   Thereto .",
      "Whereas It Has Become Necessary To Set Out A National Policy In Relation To The Rights Of Tenant Cultivators And The Restrictions To Be Imposed On Persons Using Agricultural Land For Non-Agricultural Purposes In Order To Ensure Maximum Utilization Of Agricultural Land For Agricultural Production :",
      "Preamble.",
      "Now Therefore Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Agrarian Development Act, No. 46 of 2000.",
            "pre_block_list": [
              "Short Title."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "I",
        "text": "",
        "pre_block_list": [
          "R IGHTS OF  P ERSONS WHO  C ULTIVATE  P ADDY  L ANDS"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The owner of an extent of paddy land in respect of which there is a tenant cultivator, who intends to sell such extent, shall in the first instance make an offer to sell such extent to the tenant cultivator. Such offer shall be made to the tenant cultivator by communication in writing, and sent by registered post, stating the price at which he offers to sell such extent. The owner shall cause a copy of such communication to be sent by registered post to the Agrarian Development Council within whose area of authority such paddy land is situated.",
                "pre_block_list": [
                  "Paddy lands cultivated by a tenant cultivator to be offered for sale to tenant cultivators.",
                  "2 PP 012867 5,000 (2000/09)",
                  "Agrarian Development Act, No. 46 of 2000 2"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "If upon receipt of the communication under subsection (1), the tenant cultivator is willing to purchase such extent of paddy land at the price offered by the owner, he shall indicate his willingness to the  owner and the Agrarian Development Council by communication in writing sent by registered post and the Council shall fix a period within which the transfer shall be  completed.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "Where the tenant cultivator is willing to purchase such extent of paddy land but states that the price offered by the owner is excessive, the Agrarian Development Council may in consultation with the owner determine a price which in its opinion is reasonable, having regard to the market value of paddy lands in the area and proceed to fix a period within which the transfer shall be completed.",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "On the price being fixed, the tenant cultivator shall thereupon purchase such extent of paddy land either at the price offered by the owner or as determined by the Agrarian Development Council, as the case may be, and shall complete the transfer within the period fixed.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where the Commissioner-General is satisfied, after inquiry, that a tenant cultivator has failed and neglected to act in accordance with the provisions of subsection (2) or (3), the Commissioner-General shall take action to evict such tenant cultivator in accordance with the provisions of section 8.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Any transfer by the owner of any extent of paddy land in contravention of the provisions of this section shall after inquiry be declared null and void  by the Commissioner- General and shall render the person in occupation of such extent under such transfer, liable to be evicted in accordance with the provisions of   section 8.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "Where a transfer of any extent of paddy land is declared null and void by the Commissioner-General a copy of such declaration shall be transmitted under section 5 to the Registrar of Lands of the District in which such extent of paddy land is situated.",
                "pre_block_list": [
                  "Transfer and cession of rights of tenant cultivator."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "A tenant cultivator of any extent of paddy land may after giving written notice of his intention to transfer or to cede his rights which intention shall be intimated to the Farmers Organisation and the Agrarian Development Council within whose area of authority such extent is situate by registered post  transfer or cede his rights in respect of such extent to the owner or landlord of such extent.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every transfer or cession under subsection (1) shall be notarially executed. A copy of the instrument of transfer or cession shall be forwarded by the landlord or owner of the extent of paddy land by registered post to the Farmers Organisation and the Agrarian Development Council within whose area of authority such  extent is situated.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Any person who contravenes the provisions of subsection (1) or subsection (2) shall be guilty of an offence under this Act.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Viharadipathi or trustee of a temple may, within twelve months of the enactment of this section make an application in writing to the Commissioner-General to have an extent of paddy land not exceeding two acres owned by such temple and being cultivated by tenant cultivators exempted from the application of section 6.",
                "pre_block_list": [
                  "Exemption of paddy lands owned by a temple from tenant cultivators rights."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "The Commissioner-General shall thereupon cause an inquiry to be held in respect of that application and if there is a tenant cultivator in that extent of paddy land the Commissioner-General shall make order exempting such extent of paddy land from the application of the provisions of section 6, only after affording such tenant cultivator an opportunity to make representations.",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "The Commissioner-General shall in such order require the tenant cultivator or tenant cultivators to vacate the extent of paddy land on or before the date specified in the order.",
                    "pre_block_list": [
                      "Agrarian Development Act, No. 46 of 2000 4"
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where the tenant cultivator fails to vacate the extent of paddy land in compliance with such Order, he may be evicted therefrom in accordance with the provisions of section 8, provided that the Commissioner-General shall take action to evict such tenant cultivator only after any compensation payable to him under this section has been paid in full by the applicant.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where the tenant cultivator refuses to accept the compensation specified in the Order such compensation may be deposited with the Agrarian Development Council within whose area of authority such paddy land is situate. Any compensation so deposited on or before the specified date shall be deemed to have been accepted by the tenant cultivator, and that Agrarian Development Council shall, on the application of the tenant cultivator to whom such compensation is payable, make payment to him.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The maximum extent of paddy land that can be cultivated by a tenant cultivator shall be five acres. For the purposes of this section a paddy land which is cultivated by the spouse of a tenant cultivator or by a child of such tenant cultivator who is less than eighteen years of age shall be deemed to be a paddy land which is being cultivated by such tenant cultivator.",
                "pre_block_list": [
                  "Order determining the maximum extent of paddy land."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Minister may, subject to the provisions of subsection (1), by Order published in the Gazette, determine the extent of paddy land which can be cultivated by a tenant cultivator within any district to which such Order relates :",
                "pre_block_list": [
                  "Provided however, that, where the Commissioner-General is satisfied after holding a due inquiry that a tenant cultivator is also an owner cultivator of an extent, of paddy land which is not less than five acres in extent the Commissioner-General may declare that the tenant cultivator shall not be entitled to the rights to which a tenant cultivator is entitled under the provisions of this Act and accordingly the provisions of subsections (3) and (4) shall be applicable to such tenant cultivator."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where a tenant cultivator is in possession of an extent of paddy land which is greater in extent than the extent of paddy land which has been determined by an Order made under subsection (2), he shall be entitled to select the extent of paddy land which he is entitled to cultivate, and shall vacate the balance extent of paddy land on being ordered to do so by Commissioner-General.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where a tenant cultivator fails to comply with the provisions of subsection (3) he shall be evicted from the extent of paddy land in excess of the extent specified in the Order under subsection (2) and the provisions of section 8 shall apply to any such eviction.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Where the tenant cultivator vacates such extent of paddy land the landlord shall be entitled to cultivate such extent of paddy land.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "When a person who leases out an extent of paddy land under an oral or written contract such person shall, if he is the cultivator of such land and is a citizen of Sri Lanka, be the tenant cultivator of such extent of paddy land for the purposes of this Act.",
                "pre_block_list": [
                  "Where the lessee of a paddy land should be deemed to be a tenant cultivator."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where two or more persons have leased out an extent of paddy land under an oral or written agreement and cultivated such extent of land either jointly or in rotation, each one of such persons shall if he is a citizen of Sri Lanka be the tenant cultivator of such extent of paddy land for the season in which he is the cultivator of such paddy land.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where a new oral or written agreement is entered into in respect of an extent of paddy land after the date of commencement of this Act, subsections (1) and (2) shall not be applicable to such paddy land.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where any person who is a permit holder holding an extent of paddy land upon a permit issued under the Land Development Ordinance subject to the condition that such permit holder himself shall cultivate such extent of paddy",
                "pre_block_list": [
                  "Agrarian Development Act, No. 46 of 2000 6",
                  "land, leases out such extent of paddy land to a person who cultivates such extent of paddy land the person so cultivating shall not be deemed to be a tenant cultivator within the meaning of this Act."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "A tenant cultivator of any extent of paddy land shall have the right to occupy and use such extent in accordance with the provisions of this Act and shall not be evicted from such extent notwithstanding anything to the contrary in any oral or written agreement by which such extent has been let to such tenant cultivator, and no person shall interfere with the occupation and use of such extent by the tenant cultivator and the landlord shall not demand or receive from the tenant cultivator any rent in excess of the rent required by this Act, to be paid in respect of such extent to the landlord.",
                "pre_block_list": [
                  "Right of tenant cultivators ; provision in regard to certain evicted tenants of paddy lands ; and restriction of eviction of tenants of paddy lands."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Notwithstanding anything in any other written law, the tenant cultivator of any extent of paddy land which is purchased by any person under the Partition Law, No. 21 of 1977, or which is allotted to a co-owner under a decree for partition shall be deemed to be the tenant cultivator of that extent of paddy land of such purchaser or such co-owner, as the case may be, and the provisions of this Act, shall apply accordingly.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where a tenant cultivator of any extent of paddy land notifies the Commissioner-General in writing that he has been evicted from such extent, the Commissioner-General shall refer the matter to the Agrarian Tribunal and direct the Tribunal to hold an inquiry for the purpose of deciding the question whether or not such person has been evicted.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The notification referred to in subsection (3) shall be made within six months from the date of such eviction.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "If at the inquiry held by the Agrarian Tribunal, it is proved to the satisfaction of the Agrarian Tribunal that the tenant cultivator had been evicted from such extent, it shall be presumed, unless the contrary is proved, that such eviction had been made by, or at the instance of, the landlord.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "The landlord of the extent of paddy land and the person evicted shall be given an opportunity of being heard in person or through a representative, at the inquiry held by the Agrarian Tribunal. The decision of the Agrarian Tribunal after such inquiry shall be communicated in writing and, sent by registered post to the Commissioner-General, the landlord and the person evicted. If the landlord or the person evicted is aggrieved by the decision of the Agrarian Tribunal, he may, within thirty days of the communication of the decision to him, by petition in writing in which the other person shall be mentioned as respondent, appeal to the Court of Appeal against the decision, on a question of law. A copy of the petition shall be sent to the Commissioner-General under registered post at the time when the appeal is made. Where no appeal is made against the decision within the time allowed therefor, such decision shall be final and conclusive.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "Where at any inquiry referred to in subsection (3) the Agrarian Tribunal holds",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "that eviction has been established and no appeal has been made against such decision within the time allowed therefor, or the Court of Appeal has on any such appeal confirmed the decision of the Agrarian Tribunal that eviction has been established ; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "that eviction has not been established and the Court of Appeal has in appeal varied the decision of the Agrarian Tribunal and held that eviction has been established, then",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "the person evicted shall be entitled to have the use and occupation of the extent of paddy land restored to him ; and",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "the Commissioner-General shall on receipt of the decision of the Agrarian Tribunal or the Court of Appeal, as the case may be, in writing order that every person in occupation of the extent of paddy land shall vacate it on or before such date as shall",
                        "pre_block_list": [
                          "Agrarian Development Act, No. 46 of 2000 8",
                          "be specified in such order and if such person fails to comply with such order, he shall be evicted from such extent in accordance with the provisions of section 8 ; and"
                        ],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "the landlord of such extent shall for each day during which a person in respect of whom an order has been made continues to occupy such extent after the date specified in that order, pay to the person mentioned in sub-paragraph (i), damages at such rate as may be prescribed unless the Agrarian Tribunal or the Court of Appeal has decided that such person was evicted without the knowledge, consent or connivance of such landlord :",
                        "pre_block_list": [
                          "Provided that no damages shall be paid in respect of any portion of that extent of paddy land which is cultivated under section 27 during the period specified in this sub-paragraph."
                        ],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "8",
                "text": "Where the landlord of the extent of paddy land fails or refuses to pay within fourteen days after demand, any sum which he is required to pay as damages under subsection (7), such sum may, on application made by the person evicted to the Magistrates Court having jurisdiction over the place where such extent is situated, be recovered in like manner as a fine imposed by such Court notwithstanding that such sum may exceed the amount of the fine which that Court may in the exercise of its ordinary jurisdiction impose.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "9",
                "text": "For the purposes of subsection (8) an order made by the Commissioner-General that the sum specified in such order, as being due from the landlord, shall be proof that such sum is due.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "10",
                "text": "Where a person (hereafter in this subsection referred to as the lessor) lets any extent of paddy land to any other person (hereafter in this subsection referred to as the lessee) and the lessee does not become the tenant cultivator of such extent by reason of the fact that he is not the cultivator thereof,",
                "pre_block_list": [
                  "then if the lessee lets such extent to any person (hereafter in this subsection referred to as the sub-tenant cultivator) and the sub-tenant cultivator become the tenant cultivator of such extent by reason of his being the cultivator thereof, the sub- tenants right as the tenant cultivator of such extent shall not be affected in any manner by the termination of the lease granted by the lessor to the lessee :",
                  "Provided, that the lessee shall not let such extent of paddy land to a sub-tenant cultivator unless he"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "obtains the consent in writing of the owner of such extent of paddy land ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "thereafter notifies the Agrarian Development Council within whose area of authority such extent   of paddy land wholly or mainly lies :",
                    "pre_block_list": [
                      "Provided further that where any extent of paddy land is let by a lessee to a sub-tenant cultivator without obtaining the consent in writing of the owner of such extent of paddy land such sub-tenant cultivator shall not be entitled to any of the rights of a tenant cultivator in respect of such extent of paddy land. The Commissioner-General, after inquiry, shall in writing order that the sub-tenant cultivator shall vacate such extent of paddy land on or before such date as shall be specified in that order and if such sub-tenant cultivator fails to comply with such order he shall be evicted from such extent in accordance with the provisions of section 8 and the landlord shall be entitled to cultivate such extent of paddy land."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "11",
                "text": "The rights of a tenant cultivator of any extent of paddy land shall not be affected in any manner by the sale (whether voluntary or in execution of a decree of Court), the transfer by gifts, testamentary disposition or by assignment, or by devolution under the law of inheritance, of the right, title and interest of the landlord of such extent.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "12",
                "text": "The rights of a tenant cultivator to occupy and use any extent of paddy land shall not be sequestered, seized or sold in execution of a decree or process of any court.",
                "pre_block_list": [
                  "Agrarian Development Act, No. 46 of 2000 10"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "13",
                "text": "Nothing in Chapter LXVI of the Civil Procedure Code (inserted in that Code by the Civil Procedure Code (Amendment) Act, No. 79 of 1988,) shall be read or construed as empowering a Judge of the Small Claims Court to hold an inquiry or make any Order under the aforesaid Chapter in respect of a dispute affecting paddy lands within the meaning of this Act.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "14",
                "text": "If any person directly or indirectly makes use of, or threatens to make use of, force, violence or restraint, or inflicts or threatens to inflict, any harm, damage or loss upon or against a tenant cultivator of any extent of paddy land in order to induce, compel or prevail upon that tenant cultivator to refrain from exercising any right or privilege conferred upon him by or under this Act, such person shall be deemed to interfere in the occupation and use of such extent by that tenant cultivator.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "15",
                "text": "Any person who contravenes the provisions of this section shall be guilty of an offence under this Act, and shall on conviction after summary trial before a Magistrate be liable to a fine not exceeding five thousand rupees.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where any person who has been ordered under this Act, by the Commissioner-General to vacate any extent of agricultural land, fails to comply with such order, the Commissioner-General or any other person authorised in that behalf by the Commissioner-General may present to the Magistrates Court within whose local jurisdiction such extent wholly or mainly lies, a written report",
                "pre_block_list": [
                  "Procedure for eviction."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "setting out the nature of such order and the person to whom it was issued, describing the extent of land to which such order relates ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "stating that the person who has been ordered to vacate has failed to so vacate such extent of land ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "praying for an order to evict such person and all other persons in occupation of such extent of land from such extent, and stating the name of the person to whom delivery of possession of such extent should be made.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where a written report is presented to a Magistrates Court under subsection (1), such court shall direct the Fiscal or peace officer to  forthwith evict the person specified in such report and all other persons in occupation of the extent of agricultural land specified in the order and to deliver possession of such extent to the person mentioned in such report as the person to whom delivery of possession of such extent should be made.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Fiscal or peace officer entrusted with the execution of the order of eviction shall comply with the directions of the Magistrates Court by which such order was made and shall make a due return setting out the manner in which he executed such order.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "In executing an order of eviction the Fiscal or the peace officer or any person authorised by either of them may use such force as may be necessary to enter the extent of agricultural land to which the order relates and evict any person bound by the order and to deliver possession of such extent in accordance with the direction of the Magistrate's Court which issued the order.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Any person who unlawfully dispossesses any person who has been placed in possession of an extent of agricultural land by the Fiscal under subsection (3), shall be guilty of an offence under this Act. A certificate by the Commissioner- General that any person has been so dispossessed shall be evidence of that fact.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "Upon conviction for an offence under subsection (5) the Magistrate shall direct the Fiscal to place the person who has been unlawfully dispossessed from such extent, in possession of such extent by evicting any person in occupation of such extent.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Commissioner-General shall by notification published in the Gazette, determine from time to time in accordance with the provisions of this section, the rent to be paid by the tenant cultivator of any extent of paddy land.",
                "pre_block_list": [
                  "Rent to be determined by the Commissioner- General.",
                  "Agrarian Development Act, No. 46 of 2000 12"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "A determination under subsection (1) shall specify the number of bushels of paddy, not less than ten, in respect of each cultivated acre of any extent of paddy land in any region to which such determination applies or a portion, not less than one-quarter of the total yield of the paddy from that extent reduced by the amount of any charge which may be imposed under this Act, whichever is greater, as the rent payable for that extent, for each paddy cultivation season.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The rent determined under subsection (1) may be varied in respect of different administrative districts or in respect of different parts of any administrative district.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where the rent determined under subsection (1) is computed on the basis of a specified number of bushels or kilos of paddy for each cultivated acre, the rent for any cultivated area of less than one acre shall be computed in the proportion that such area bears to one acre.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "The rent payable for any extent of paddy land shall for each paddy cultivation season, consist of",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the quantity of paddy computed for that extent in accordance with such determination in force under the provisions of this section as is applicable to paddy lands of the administrative district or part thereof in which that extent lies ; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the equivalent in money of the rent payable in paddy under paragraph ( a ) of this subsection computed according to the price fixed for the time being for paddy of the same description as the paddy from that extent in accordance with the provisions of this Act.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "Where the Commissioner-General is satisfied after inquiry that the tenant cultivator of any extent of paddy land has willfully neglected the cultivation of such extent during any paddy cultivation season in which cultivation was possible, or has without reasonable cause, committed during any paddy cultivation season a breach of any established custom relating to cultivation, the Commissioner-General may",
                "pre_block_list": [
                  "order that the rent for such season payable in paddy under the provisions of this Act in respect of such extent shall be computed on such basis as is specified by the Commissioner- General and according to the rent in paddy so computed, the rent in money shall be computed."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "Where the cultivation of the extent of paddy land of a tenant cultivator is a partial failure during any paddy cultivation season for any cause other than his fault or neglect, the rent payable by him in such season in respect of such extent shall be reduced by such reasonable amount as shall be determined by the Commissioner-General.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "8",
                "text": "Where any dispute arises between the tenant cultivator of any extent of paddy land and his landlord as to the amount of the rent payable in respect of such extent under the determination made under subsection (1), such dispute may be referred for decision to the Commissioner-General. The decision of the Commissioner-General on such dispute shall be communicated in writing and be sent by registered post to such tenant cultivator and to his landlord and such decision on any such dispute shall be final.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "10",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "When the landlord informs the Commissioner- General that the tenant cultivator is in arrears of rent in respect of an extent of paddy land the Commissioner-General shall cause the Agrarian Tribunal to hold an Inquiry into such matter. Where the Agrarian Tribunal determines after such inquiry, that the rent is in arrears and the amount of such arrears of rent, it shall communicate its  decision in writing to the tenant cultivator, the landlord and the Commissioner-General.",
                "pre_block_list": [
                  "Consequence of failure by tenant cultivator to pay rent."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "On receipt of the notice of such decision the Commissioner-General shall give notice in writing to the tenant cultivator that his tenancy in respect of such extent would be terminated if he fails to pay such arrears in either paddy or money, within the time specified in such notice.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "A tenant cultivator who fails to pay the arrears of rent within the time specified therefor in the notice shall be deemed to have forfeited his tenancy and shall vacate such extent on being ordered to do so by the Commissioner-General.",
                "pre_block_list": [
                  "Agrarian Development Act, No. 46 of 2000 14"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "If the tenant cultivator fails to vacate such extent of paddy land within the time specified in the notice the Commissioner-General shall cause such tenant cultivator to be evicted from such extent of paddy land in accordance with the provisions of section 8.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "When the tenancy rights of a tenant cultivator has been terminated in accordance with the provisions of this section the possession of such extent of paddy land shall be handed over to the owner or the person entitled to such extent of paddy land, or where there is a dispute as to the ownership of such extent, to the agrarian Development Council of the area in which such extent is situated.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "11",
            "text": "Where the extent of paddy land of a tenant cultivator is not cultivated during any paddy cultivation season or the cultivation of such extent during such season completely fails for any cause other than his fault or neglect, no rent for such season shall be payable in respect of such extent.",
            "pre_block_list": [
              "When rent is not payable."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "12",
            "text": "The rent for any paddy cultivation season shall be paid at the threshing floor itself, on or before the fifteenth day after harvesting of the crop from such extent for such season and if not so paid shall commence to be in arrears on the first day after the said fifteenth day.",
            "pre_block_list": [
              "Time and place for paying rent and when rent commences to be in arrears."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "13",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "It shall be the duty of the tenant cultivator of any extent of paddy land to give to his landlord and the Agrarian Development Council within whose local jurisdiction such extent wholly or mainly lies",
                "pre_block_list": [
                  "Tenant cultivator to inform landlord of the dates of harvesting and removal of paddy."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "at least ten days notice of the date on which it is intended to commence the harvesting of the crop from such extent ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "at least seven days notice of the date on which it is intended to remove from the threshing floor, the crop harvested from such extent.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any tenant cultivator who fails to comply with the provisions of paragraph ( a ) or ( b )  of subsection (1) shall be guilty of an offence under this Act.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "14",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The rent in respect of any extent of paddy land shall be paid by the tenant cultivator of such extent to the landlord of such extent or to his authorised agent either directly or through the Agrarian Development Council within whose area of authority such extent is situate, where such landlord fails or refuses to accept such rent.",
                "pre_block_list": [
                  "To whom rent is payable."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where there are two or more landlords of an extent of paddy land they shall appoint a person for the purpose of collecting the rent from the tenant cultivator of such extent, and shall in writing sent by registered post notify the name and address of the person appointed for such purpose, to the Agrarian Development Council  within whose area of authority such extent is situate. If no such notification is made, such rent shall be paid directly or through such Development Council to the person, if any, who customarily collects such rent for such landlord.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "If there is no person entitled to collect such rent or if there is any dispute as to the proportion in which such rent should be paid to each landlord, or as to the person to whom such rent should be paid, such rent computed in money in accordance with the provisions of this Act, shall be paid by such tenant cultivator to the Agrarian Development Council within whose area of authority such extent is situate, and such Development Council shall pay such amount less any expenses incurred by such Development Council in handling such rent to the appropriate District Court within whose local jurisdiction such extent wholly or mainly lies, to be drawn by the person or persons entitled thereto.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where the amount referred to in subsection (3) is not drawn by the person or persons entitled thereto within one year after the date on which such sum was paid to the Court, the Court shall cause such sum to be paid into the Agrarian Development Fund and no person thereafter shall be entitled to receive such amount.",
                "pre_block_list": [
                  "Agrarian Development Act, No. 46 of 2000 16"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "15",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where the tenant cultivator of any extent of paddy land instead of paying the rent for such extent directly to the landlord of such extent or to his authorised agent pays it to the Agrarian Development Council within whose area of authority such extent is wholly or mainly situate, such Council shall",
                "pre_block_list": [
                  "Provisions applicable where rent is paid through the Agrarian Development Council to the landlord or to his authorised agent."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "if such rent is paid in money, cause the amount of such rent to be transmitted to such landlord or to his authorised agent, as the case may be ; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "if such rent is paid in paddy, cause to be sent to such landlord or to his authorised agent, as the case may be, a written notice sent by registered post requesting him to take delivery of such paddy within thirty days of the date of such notice ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "deduct from such rent any expenses incurred by such Council in the handling of such rent.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where the rent for any extent of paddy land is paid in paddy to the Agrarian Development Council within whose area such extent is wholly or mainly situate, and such rent is not claimed by the person entitled thereto within thirty days of the date of the notice sent to him under subsection (1), such Council may cause the paddy to be sold and shall cause the proceeds of the sale to be transmitted to such persons.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where any sum of money transmitted (otherwise than by money order or postal order) to any person under this section by the Agrarian Development Council within whose area auch extent is wholly or mainly situate is not claimed by such person within one year after the date on which such sum was transmitted, such sum shall be paid into the Agrarian Development Fund by such Council and no person thereafter shall be entitled to demand or receive such sum or the rent which such sum represents.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "16",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The person entitled to collect the rent in respect of any extent of paddy land shall, on receiving the rent, issue a receipt to the person by whom the rent is paid.",
                "pre_block_list": [
                  "Receipts to be given for payment of rent."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every such receipt shall contain such particulars as may be prescribed by regulation.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The person entitled to collect the rent under subsection (1) shall if he fails to comply with that subsection and the regulations made under subsection (2), be guilty of an offence under this Act.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "17",
            "text": "Where any rent in respect of any extent of paddy land is in arrears, the amount of rent in arrears computed in money in accordance with the provisions of this Act, shall bear simple interest at the prescribed rate.",
            "pre_block_list": [
              "Interest to be paid on rent in arrears."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "18",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where any sum is due from the tenant cultivator of any extent of paddy land to his landlord as rent in arrears or interest on such rent or both, the landlord may apply in writing to the Commissioner-General who shall upon such application cause the Agrarian Tribunal to hold an inquiry in respect of such application. If the Agrarian Tribunal decides that any amount is due to be paid to the landlord by the tenant cultivator and informs the Commissioner-General of the same, then the Commissioner-General shall make an order for the payment of such amount in money or in paddy or both in money and in paddy in the manner prescribed in such order and within the period specified therein.",
                "pre_block_list": [
                  "Recovery of rent and interest in arrears."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "If such tenant cultivator fails to pay such sum within the period specified by the order under subsection (1) such sum may be recovered upon application being made by the landlord to the Magistrate's Court having jurisdiction over the place where the paddy land in respect of which the rent is due is situated in like manner as a fine imposed by such Court notwithstanding that such sum may exceed the amount of the fine which that Court may in the exercise of its ordinary jurisdiction impose, and any sum so recovered shall be paid by such Court to the applicant landlord.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "For the purposes of subsection (2) an order by the Commissioner-General that the sum specified in the certificate is due to the landlord from the tenant cultivator shall be  prima facie  proof that such sum is due.",
                "pre_block_list": [
                  "Agrarian Development Act, No. 46 of 2000 18",
                  "Fixing of compensation to be paid to the tenant cultivator."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "19",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The landlord of any extent of paddy land may make application to the Commissioner-General to have such extent exempted from the application of the provisions of section 6.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Commissioner-General shall, after inquiry, make order that the provisions of section 6 shall cease to apply to the extent of paddy land in respect of which an application has been made to him under subsection (1), upon being satisfied that the applicant has paid to the tenant cultivator of that extent, compensation of a sum not less than the equivalent in money of the number of bushels of paddy that can be obtained from such extent during one season (regard being had, for this purpose, to the number of bushels of paddy that can be obtained from an acre of paddy land in the area in which such extent is situated) multiplied by ten.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "20",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Any paddy land specified in section 6, being a paddy land which is cultivated by a tenant cultivator and which has not been sold to such tenant cultivator at the expiration of a period of two years from the date of commencement of this Act, shall be deemed to be required for the purposes of this Act, and may be acquired under the Land Acquisition Act.",
                "pre_block_list": [
                  "Application of Land Acquisition Act."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "A paddy land acquired under the provisions of subsection (1) shall vest in the Land Bank established by this Act.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The tenant cultivators of any paddy land acquired under subsection (1) shall be paid compensation computed in accordance to section 19 of this Act.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "21",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Every landlord who owns an extent of paddy land and every tenant cultivator of an extent of paddy land shall furnish information regarding such extent of paddy land to the Commissioner-General. Regulations may be made prescribing the nature of the information required to be furnished and the forms to be used for such purpose.",
                "pre_block_list": [
                  "Particulars of land to be submitted by landlord and the tenant cultivator."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The landlord and the tenant cultivator shall for the purpose of furnishing the information required under subsection (1) examine the Agricultural Lands Register in operation for the time being, in the area in which such extent of paddy land is situated.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where there is a change in the information furnished under subsection (1) the landlord and the tenant cultivator shall notify the Commissioner-General of such change within six months of the occurrence of such change.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "A landlord or tenant cultivator who fails to comply with the requirements of subsection (1) shall be guilty of an offence under this Act.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "II",
        "text": "",
        "pre_block_list": [
          "U TILISING  A GRICULTURAL  L ANDS   IN  A CCORDANCE   WITH A GRICULTURAL  P OLICIES"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "22",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "It shall be the duty and responsibility of every owner cultivator or occupier of any agricultural land to cultivate such land with such crops or rear such breeds of livestock and breed inland fish for the efficient management and better cultivation of agricultural land, as are best suited for the land, having regard to the extent and the situation and the natural resources of the land, in accordance with standards of cultivation as are hereinafter provided by this Act or any regulation made thereunder, with a view to improving the productivity and maintaining efficient standards of production both as to quantity and quality of the produce.",
                "pre_block_list": [
                  "Duties of owner cultivators or occupiers relating to the cultivation and management of agricultural land."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Regulations may be made for prescribing the crops to be cultivated, the livestock to be reared, the fish to be bred according to the situation and natural resources of the land, and generally for the efficient management of agricultural land and for better cultivation.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "23",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where the Commissioner-General is informed by the Farmers Organisation within whose area of authority any agricultural land is situated that such agricultural land is not being cultivated in accordance with the provisions of this",
                "pre_block_list": [
                  "Issuing supervision orders.",
                  "Agrarian Development Act, No. 46 of 2000 20",
                  "Act or the regulations made in that regard or when the Commissioner-General becomes aware in any other manner that an agricultural land is not being cultivated according to the provisions of this Act or regulations made thereunder, the Commissioner-General may, after giving the owner cultivator or occupier of such agricultural land an opportunity of making representations to him or to his authorised representative, by order (hereinafter referred to as a Supervision Order) place the owner cultivator or occupier under the Commissioner-Generals supervision for such period as may be specified in such order."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Regulations may be made prescribing, the manner in which inquiries under subsection (1) are to be conducted, the procedure to be followed in the issuing and implementation of Supervision Orders, and the manner of revoking the same.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "24",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where a Supervision Committee appointed under section 25 reports to the Commissioner-General that the cultivation of the extent of land to which a Supervision Order under section 23 relates has not shown improvement during the period specified in such order, the Commissioner-General shall after inquiry issue an order requiring the owner cultivator or occupier of such land to pay compensation of a sum not exceeding rupees five thousand for each acre of land comprised in such extent or portion thereof, to the credit of the Agrarian Development Fund.",
                "pre_block_list": [
                  "Compensation to be paid in respect of agricultural land which is not properly cultivated."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "A person aggrieved by an order made under subsection (1) may appeal against the order to the Agrarian Tribunal within whose local jurisdiction the land in respect of which the order is made is situate,within one month at the date of the order. A copy of  such appeal shall simultaneously be sent by registered post to the Commissioner-General.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where no appeal is preferred against an order made by the Commissioner-General under subsection (1) to an Agrarian Tribunal or where such order has been confirmed by the Agrarian Tribunal  on appeal, the Commissioner- General shall notify the owner cultivator or occupier by written notice sent by registered post of the final date before which the compensation specified in the order shall be paid.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where the landlord or occupier fails to pay the compensation on or before the date specified by the Commissioner-General, the Commissioner-General shall make an application to the Magistrates Court within whose local jurisdiction the land in respect of which the compensation has to be paid is situated, praying that such sum be recovered in like manner as a fine imposed by such Court notwithstanding that such sum may exceed the amount of the fine which that court may in the exercise of its ordinary jurisdiction, impose.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "A certificate issued by the Commissioner-General that such sum is due as compensation shall be proof that such sum is so due.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "25",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Commissioner-General may appoint Supervision Committees for every Agrarian Development Council Area.",
                "pre_block_list": [
                  "Appointment of Supervision Committees."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The members of a Supervision Committee referred to in subsection (1) shall be appointed by the Commissioner- General and shall consist of not more than five persons appointed from amongst employees of  such departments, public corporations and statutory bodies as are functioning in that Agrarian Development Council Area.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Commissioner-General shall appoint a Secretary for  every Supervision Committee referred to in subsection (1).",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Regulations may be made in providing for the manner of appointment of members of the Supervision Committees, their periods of office, the quorum for, and the procedure for transaction of business at, meetings of the Committees.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "26",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where the Commissioner-General is informed by a Supervision Committee that the cultivation of an agricultural land which has been subject to a Supervision Order for one year is not being satisfactorily cultivated even in the succeeding year, the Commissioner-General shall after affording an  opportunity to the owner cultivator or occupier",
                "pre_block_list": [
                  "Issuing of Order of Dispossession.",
                  "Agrarian Development Act, No. 46 of 2000 22",
                  "of that land to show cause to the Commissioner-General or his representative as to why he should not be dispossessed of the land, issue an order (hereinafter called an order  of dispossession) dispossessing the owner or occupier of the land of his right to cultivate such land and to receive the crop from such land for such period as is specified in the order."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where the person on whom the order under subsection (1) is served is aggrieved by such order he shall within thirty days of the receipt of such order prefer an appeal to the Secretary to the Ministry of the Minister. A copy of such appeal shall be simultaneously sent to the Commissioner-General by registered post.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where no appeal is preferred against such order under subsection (2), such order shall be final and conclusive.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where an order of Dispossession is final and conclusive under subsection (3), the Commissioner-General shall evict such owner cultivator or occupier of such agricultural land in accordance with the  provisions of section 8 of this Act and shall deliver such agricultural land to the Land Bank.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Where an Order of Dispossession has been entered into in respect of an agricultural land, such land shall not be handed back to the owner cultivator or occupier except on payment by him of all expenses incurred on improvements effected to such land and all such other expenses as have been incurred in relation to such land.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "Regulations may be made in respect of the manner of issuing, service of, and giving effect to an Order of Dispossession, the procedure for revocation of such Order, and the procedure for handing back possession.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "27",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where the Commissioner-General is satisfied that any agricultural land is not being cultivated due to the existence of a dispute relating to that land, the Commissioner- General may, after affording an opportunity to, the owner or",
                "pre_block_list": [
                  "Cultivation of land subject to a dispute.",
                  "occupier of such agricultural land to make representations to the  Commissioner-General or his authorised representative, issue an order requiring the person on whom the order is served to vacate the land within the period specified in that order and deliver possession of such land to the Commissioner- General or his authorised representative."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every order shall be sent by registered post to the person to whom it relates :",
                "pre_block_list": [
                  "Provided, however that where there are several owner cultivators or occupiers of such land and  the addresses of such owner cultivators or occupiers cannot be ascertained, the exhibition of such order in a conspicuous place in or upon the land to which the order relates, shall be deemed to be service of the order on all the owner cultivators and occupiers thereof."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where a person on whom an order under subsection (1) is served fails to vacate the land within the period specified in such order the  Commissioner-General shall evict such person in  accordance with the provisions of section 8.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Until the dispute relating to that land is settled or a decision is made in respect of that dispute such agricultural land may be delivered to the Land Bank for the purpose of cultivation of such agricultural land, and the income derived therefrom shall be disposed of in the manner directed by the Commissioner-General.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "28",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Commissioner-General may decide whether an extent of land is a paddy land.",
                "pre_block_list": [
                  "The Commissioner- General may decide that certain land is a paddy land."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Commissioner-General may, for the purpose of making a decision under subsection (1), call for and obtain the observations and information from the Agrarian Development Council within whose area of authority the extent of land is situate, and from the relevant government departments statutory boards and institutions. It shall be the duty of every such government department, statutory board and institution to furnish such observations and information as soon as practicable.",
                "pre_block_list": [
                  "Agrarian Development Act, No. 46 of 2000 24",
                  "Identification of paddy lands which can be cultivated with paddy and other crops."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "29",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Commissioner-General shall identify paddy lands from which sufficient production can be obtained when cultivated with paddy and paddy lands from which sufficient production can be obtained when cultivated with other agricultural crops. The Commissioner-General shall for the purposes of such identification, obtain the observations of the Farmer Organisation and the Agrarian Development Councils, within whose area of authority such land is situated.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Commissioner-General shall appoint Productivity Committees for each administrative district or for different portions of an administrative district for the purpose assisting in the identification of lands for the purposes of subsection (1).",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Productivity Committees shall consist persons employed in government departments, statutory bodies or institutions and of persons engaged in agriculture, in each such administrative district.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Every Productivity Committee shall appoint a Secretary to its Committee.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Upon identification of the paddy lands from which sufficient production can be obtained by cultivating other agricultural crops, the Commissioner-General may by a notification published in the Gazette declare that the provisions of subsections (1) and (2) of section 6 shall cease to apply to such paddy lands.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "The provisions of subsections (1) and (2) of section 6 of this Act, shall not apply to any person who cultivates any paddy land in respect of which a Notification has been published under subsection (5).",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "30",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Paddy lands which have been identified by the Commissioner-General as paddy lands from which the maximum production can be obtained by the cultivation of paddy shall be cultivated with paddy during every season in which paddy can be cultivated thereon.",
                "pre_block_list": [
                  "Every paddy land which can be cultivated with paddy shall be utilised for the cultivation of paddy."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where paddy cannot be cultivated during any season in an extent of paddy land which has been identified under subsection (1), due to a natural or other cause an agricultural crop which is not a perennial crop may be cultivated on such paddy land after obtaining the written permission of the Commissioner-General.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "In the case of paddy lands from which satisfactory production can be obtained by the cultivation of any crop other than paddy, such paddy land may, subject to the provisions of section 29(5), be cultivated with half yearly crops other than paddy after obtaining the written permission of the Commissioner-General. For the purpose of cultivating long term crops in such paddy lands, the written permission of the Commissioner-General shall be obtained prior to the commencement of such cultivation.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Every person who contravenes the provisions of this section shall be guilty of an offence under this Act.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "A certificate issued by the Commissioner-General to the effect that the provisions of this section have been contravened, shall be admissible in evidence and shall be prima facie  proof of such fact.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "31",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Commissioner-General or an officer appointed under subsection (2) of section 38 may for the purpose of implementing the provisions of this Act, at all reasonable times enter upon any extent of agricultural land and may inspect such extent of agricultural land.",
                "pre_block_list": [
                  "The Commissioner- General  and the officers to have the power to inspect agricultural lands to find out the purpose for which such land is used."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any officer inspecting an agricultural land under subsection (1) shall make such inspections and inquiries as may be necessary to ascertain whether",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the extent of agricultural land is being filled up or is about to be filled up with soil or other material ;",
                    "pre_block_list": [
                      "Agrarian Development Act, No. 46 of 2000 26"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "action is being taken to construct some structure on, or any construction is being done in, that extent of agricultural land ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "action is being taken to remove soil or soil is being removed from that extent of agricultural land ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "such extent of agricultural land is being prepared for, or is being used for some other purpose and not for the cultivation of an agricultural crop and whether such agricultural land is being efficiently cultivated ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "acts in violation of the terms and conditions of any permission issued under subsection (1) of section 32 or subsection (1) of section 33 of this Act, are being committed on the agricultural land.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The officers referred in subsection (1) may where necessary examine the permission issued under subsection (1) of section 32 or subsection (1) of section 33 in order to ascertain whether the terms and conditions subject to which permission has been issued are being complied with.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Any person who obstructs any officer referred to in subsection (1), in the exercise of the powers conferred on him by subsections (2) and (3) shall be guilty of an offence under this Act, and shall on conviction after a summary trial before a Magistrate be liable to imprisonment of either description for a period not exceeding two years or to a fine not  exceeding twenty five thousand rupees or to both such imprisonment and fine.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Where any person obstructs an officer referred to in subsection (1) from exercising the powers conferred on him by subsections (1), (2) and (3) such  officer shall make a complaint about such obstruction to the officer in charge of the Police Station of the  area within which the agricultural land is situated.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "An affidavit sworn by an officer inspecting any agricultural land under subsection (1) to the  Magistrates",
                "pre_block_list": [
                  "Court, stating that a person named therein obstructed or resisted the exercise by him of  the powers conferred on him by subsections (2) and (3) shall be admissible in evidence and shall be  prima facie  evidence of such fact."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "32",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Any person who, without obtaining written permission from the Commissioner-General",
                "pre_block_list": [
                  "Using a paddy land for a purpose other than an agricultural cultivation without the permission of the Commissioner- General to be punishable."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "fills up an extent of paddy land with soil or other material or attempts to fill up such extent of paddy land ; ( b ) uses any extent of paddy land for a purpose other than an agricultural purpose or does any other act for such purpose ;",
                    "pre_block_list": [
                      "( c ) constructs any structure within any extent of paddy land or does any act in furtherance of such purpose ; ( d ) removes soil from an extent of paddy land or attempts to do so ; or ( e ) utilises an extent of paddy land in violation of the terms and conditions of the permission issued by the Commissioner-General, shall be guilty of an offence under this Act."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any person who aids or abets a person in committing any of the acts specified in subsection (1) shall be guilty of the same offence.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "When any person commits an offence under subsection (1) the Commissioner-General or an officer appointed in accordance with subsection (2) of section 38 shall forthwith issue notice to all such persons involved, to abstain from committing such offence. The exhibition of such notice in or on a prominent place in such extent of paddy land shall be deemed to be service on all such persons.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "A notice which is exhibited under subsection (3) on any extent of paddy land, shall contain a brief statement giving the nature of the offence committed in respect of that extent of paddy land, and the penalty to which such person could be made subject for the commission of the offence, if proved.",
                "pre_block_list": [
                  "Agrarian Development Act, No. 46 of 2000 28"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Where an offence under subsection (1) is being committed by any person or when any course of action is taken to do so, an officer appointed under subsection (2) of section 38 shall complain to the officer in charge of the police station of the  area where such  extent of paddy land is situated.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "Upon a complaint under subsection (5) being made the officer in charge of such police station shall take into custody all persons mentioned in such complaint and all persons as he believes are involved in such offence and any implements, instruments, machinery, vehicle or any other article or document.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "All such persons as are taken into custody under subsection (6) and any implement, instrument, machine, vehicle or any other article or document shall forthwith be produced before the Magistrates Court.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "8",
                "text": "Every person guilty of an offence under this section shall, on conviction after summary trial before a Magistrate, be liable to a fine not exceeding one hundred thousand rupees or to imprisonment of either discription for a term not exceeding six months.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "9",
                "text": "Upon conviction of a person of an offence under this section, the person so convicted shall for every day in respect of which the offence is so continued after conviction be required to pay a fine of one thousand rupees for each such day.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "10",
                "text": "Where a person is convicted of an offence under this section, the court may order such person to remove any soil, material or construction with respect to which such offence was committed within such period as may be specified by court.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "33",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "No person shall fill any extent of paddy land or remove any soil from any extent of paddy land or erect any structure on any extent of paddy land except with the written permission of the Commissioner-General.",
                "pre_block_list": [
                  "Filling up of paddy land or utilising paddy land for any purpose other than cultivation."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any person who contravenes the provisions of subsection (1) shall be guilty of an offence under this Act.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where the Commissioner-General, or the Additional Commissioner-General or Commissioner or Deputy Commissioner or Assistant Commissioner is informed that any person is acting in contravention of the provision of subsection (1) the Commissioner-General or the Additional Commissioner-General or Commissioner or Deputy Commissioner or Assistant Commissioner may make an application in writing, substantially in the Form set out in the Schedule to this Act to the Magistrates Court within whose local jurisdiction such extent of paddy land or any part thereof, is situated and praying for the issue of an order restraining the person so contravening the provisions of subsection (1) and his agents and servants from acting in contravention of the provisions of subsection (1).",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Every application under this section shall be supported by an affidavit verifying to the matters set forth in the application.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Upon receipt of the application the Magistrate shall determine whether an act has been committed in contravention of this section and upon arriving at such determination the Magistrate shall make an interim order restraining the person named in the application and his servants or agents from acting in contravention of subsection (1) and shall forthwith issue summons on the person or persons named in the application to appear and show cause on the date specified in such summons,  as to why such person or and servants or agents should not be restrained, as prayed for in the application.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "If on the date specified in the summons the person to whom such summons has been issued fails to appear or informs the court that he has no cause to show against the issuing of such order the court shall confirm the interim order.",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "If the person on whom summons has been issued duly appears in court and states that he has cause to show against issuing of such order, the Magistrates Court may proceed forthwith to inquire into the same or may set the case for inquiry on a later date.",
                    "pre_block_list": [
                      "Agrarian Development Act, No. 46 of 2000 30"
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "Court shall not be competent to call for any evidence from the Commissioner-General, or Additional Commissioner-General or Commissioner or Deputy Commissioner or Assistant Commissioner in support of the application.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "8",
                "text": "If after the inquiry the Magistrate is not satisfied that the person showing cause has lawful authority to fill the extent of paddy land or remove any soil therefrom or erect a structure thereon, he shall confirm the interim order made under subsection (5) restraining such person and his servants and agents from doing any act in contravention of this section.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "9",
                "text": "",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "Where any person is convicted for an offence under subsection (2) of this section the Court may make order that any implements, instruments, machinery or vehicles used in, or in connection with, the commission of the offence shall be forfeited to the  State. Any implement, instrument, machinery or vehicle so forfeited to the State shall vest in the State free from all encumbrances. Such vesting shall take effect",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "where no appeal has been preferred to the Court of Appeal or a High Court established by Article 154P of the Constitution against the order of forfeiture, upon the expiry of the period within which an appeal may be preferred to Court of Appeal or such High Court ;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "where an appeal has been preferred to the Court of Appeal or to the High Court established under Article 154P of the Constitution against the order of forfeiture, upon the determination of the Appeal confirming or upholding the order of forfeiture.",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "The Commissioner-General shall take possession of any implement, instrument, machinery or vehicle vested in the State under this section and may sell or otherwise dispose of the same as he may think fit. The proceeds of such sale shall be credited to the Agrarian Development Fund.",
                    "pre_block_list": [
                      "Agrarian Development Act, No. 46 of 2000 31"
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "34",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "No person shall use an extent of paddy land for any purpose other than for agricultural cultivation except with the written permission of the Commissioner-General.",
                "pre_block_list": [
                  "Paddy lands should not be used for purposes other than agricultural cultivation."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Commissioner-General may at any time withdraw such written permission by notice served on such person having regard to the need to increase agricultural production or for the contravention of the conditions attached to such permission by the Commissioner-General.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "If any extent of paddy land is used by any person in contravention of the provisions of subsection (1) such person shall be guilty of an offence under this Act.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where the written permission under the provisions of subsection (2) has been withdrawn the extent of paddy land shall be restored, on or before a date specified by the Commissioner-General, to the same condition as it was before such written permission was given.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Any person who fails to so restore the land as required by subsection (4) shall be guilty of an offence under this Act, and shall after summary trial before a Magistrate  be liable to a fine not exceeding twenty five thousand rupees and in default of payment of the fine shall be liable to imprisonment of either description for a period not exceeding three months.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "Where the offence is continued after conviction the offender shall be liable to a fine of rupees one thousand for each day in respect of which such offence is continued after conviction. The fine so imposed shall be recovered in like manner as a fine imposed by Court and shall be credited to the Agrarian Development Fund.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "35",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where any extent of paddy land is cultivated with any other agricultural crop as permitted under this Act, Commissioner-General shall determine from time to time in accordance with the provisions of this section, the rent to be paid by the tenant cultivator of that extent of paddy land, to the landlord, in respect of such extent.",
                "pre_block_list": [
                  "Rent to be paid in respect of other agricultural crops.",
                  "Agrarian Development Act, No. 46 of 2000 32"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "In determining the rent payable in respect of any extent of paddy land cultivated with any other agricultural crop, the Commissioner-General shall have regard to the cost of production and the market value, of such crop.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The rent determined under subsection (1) may vary in respect of different administrative districts or in respect of different parts of an administrative district.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where the rent determined under subsection (1) is computed on the basis of a specified sum of money for each cultivated acre the rent for any cultivated area of less than one acre shall be computed in the proportion that such area bears to one acre.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "The rent determined under subsection (1) shall be paid within thirty days of the harvesting of the crop on such extent. If the rent is not so paid such rent shall commence to be in arrears on the first day after the said thirtieth day.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "Action may be taken in respect of the rent in arrears for that extent, in accordance with the provisions of section 10 of this Act.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "36",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where the tenant cultivator of any extent of paddy land refuses to give his consent to the owner of such extent of paddy land to extract any mineral resources from that extent of paddy land, the Commissioner-General may permit the owner of such extent of paddy land to use an extent not exceeding twenty perches of that extent of paddy land for the purpose of extracting such mineral resources during a specified period of time. The permission granted under this section is permission granted for the use of such extent of paddy land and shall not be construed as a licence permitting the extraction of such mineral resources.",
                "pre_block_list": [
                  "Permission given to obtain mineral resources in a paddy land."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Prior to granting the owner of that extent of paddy land permission under subsection (1), the Commissioner- General shall order the landlord to pay the tenant cultivator, compensation for the loss of possession of that extent for the",
                "pre_block_list": [
                  "Agrarian Development Act, No. 46 of 2000 33",
                  "period of time during which the owner is given permission to obtain mineral resources from that extent of paddy land. In determining the amount of compensation to be paid the Commissioner-General shall take into consideration the bushels of paddy which can be obtained from that extent of paddy land during the period of time for which permission has been granted."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where the tenant cultivator refuses to accept the compensation ordered under subsection (2), the compensation shall be deposited with the Agrarian Development Council within whose area of authority such paddy land is situated.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "When compensation is deposited with an Agrarian Development Council under subsection (3), the Council shall inform the person to whom such compensation is due, by letter sent by registered post, to take necessary steps to collect such compensation within a period of six months of the date of the letter.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "If such compensation is not collected by such person within the period of six months referred to in subsection (4) such compensation shall be credited to the Agrarian Development Fund.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "The permission granted by the Commissioner-General under subsection (1) shall be deemed not to be an eviction of the tenant cultivator from the occupation of such extent of paddy land.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "37",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be established a Land Bank entrusted with the possession of certain agricultural lands, under this Act for all or any of the following purposes :",
                "pre_block_list": [
                  "Establishment of the Land Bank."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "granting of such agricultural lands to cultivators who can improve agricultural productivity of such lands ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "enabling agricultural lands which are not satisfactorily cultivated to be cultivated according to the provisions of this Act ;",
                    "pre_block_list": [
                      "Agrarian Development Act, No. 46 of 2000 34"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "the provision of financial assistance to tenant cultivators to purchase the ownership of the paddy land in respect of which they are the tenant cultivators ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "enabling owners of paddy lands to purchase the right of cultivation of such paddy lands, by the granting of monetary assistance.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Until a Land Bank is constituted under the provisions of subsection (1) each Agrarian Development Council shall discharge the functions of the Land Bank :",
                "pre_block_list": [
                  "Provided that when an Agrarian Development Council is discharging the functions of the Land Bank it shall act in accordance with  the directions of the Commissioner-General."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Regulations may be made in respect of the powers and activities, of the Land Bank.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "III",
        "text": "",
        "pre_block_list": [
          "A PPOINTMENT   AND   POWERS   AND   DUTIES   OF   THE  C OMMISSIONER - G ENERAL ,  THE  A DDITIONAL  C OMMISSIONER -G ENERAL ,  THE C OMMISSIONERS ,   THE   D EPUTY   C OMMISSIONERS ,   THE   A SSISTANT C OMMISSIONERS   AND  A GRARIAN  D EVELOPMENT  O FFICERS"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "38",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be appointed for the purposes of this Act a Commissioner-General of Agrarian Development. (hereinafter referred to in this Act as the Commissioner- General), and every reference in any other law to the Commissioner of Agrarian Services shall be deemed to be a reference to the Commissioner General.",
                "pre_block_list": [
                  "Appointment of Commissioner- General, Additional Commissioner- General Deputy Commissioners, Assistant Commissioners and Divisional Officers."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "There may be appointed an Additional Commissioner- General, Commissioners, Deputy Commissioners, Assistant Commissioners, Agrarian Development Officers and other officers as may be necessary for the purposes of this Act.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Additional Commissioner-General and Commissioners of Agrarian Development may exercise all or any of the powers of the Commissioner-General under this Act.",
                "pre_block_list": [
                  "Agrarian Development Act, No. 46 of 2000 35"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Every Deputy Commissioner may exercise all or any of the powers of the Commissioner-General under this Act, within the area to which such Deputy Commissioner is appointed.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Every Assistant Commissioner may exercise all or any of the powers of the Commissioner-General under this Act, within the area to which such Assistant Commissioner is appointed.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "Every Agrarian Development Officer expressly authorized to do so by the Additional Commissioner, the Deputy Commissioner or the Assistant Commissioner within whose area, the area of authority of such Agrarian Development Officer falls, may exercise all or any of the powers of the Commissioner General under this Act, within the area to which such Agrarian Development Officer is appointed.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "The Additional Commissioner General, The Commissioners, the Deputy Commissioner General, every Assistant Commissioner and every Agrarian Development Officer shall in the exercise of his powers and the performance of his duties under this Act, be subject to the direction and control of the Commissioner-General.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "IV",
        "text": "",
        "pre_block_list": [
          "E STABLISHMENT   OF  A GRARIAN  T RIBUNALS"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "39",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There may be appointed for every administrative district or for one or more administrative districts, one or more Agrarian Tribunals consisting of not more than three persons, appointed from among retired Judges or attorneys-at-law with more than seven years experience or persons who have had seven years experience at the executive level in the field of agriculture.",
                "pre_block_list": [
                  "Establishment of Agrarian Tribunals."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where a member of an Agrarian Tribunal vacates office by reason of death, resignation, removal from office, absence from Sri Lanka or ill health, another person shall be appointed to act in his place.",
                "pre_block_list": [
                  "Agrarian Development Act, No. 46 of 2000 36"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every member of Agrarian Tribunal shall unless he earlier vacates his office, hold office for a period of two years :",
                "pre_block_list": [
                  "Provided that"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "a person appointed in place of a member who has died, resigned or been removed from office, shall hold office for the unexpired period of the term of office of the member whom he succeeds ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "a person appointed to act for a member who is absent from Sri Lanka or is ill, shall hold office for the period of absence or illness of such member.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "A member vacating office by effluxion of time shall be eligible for re-appointment.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "The quorum for a meeting of an Agrarian Tribunal shall be two.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "There may be appointed to every Agrarian Tribunal a Secretary.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "An Agrarian Tribunal may examine any witness on oath if it thinks fit so to do, and may summon any person to appear before it or to produce any documents which in the opinion of the Tribunal, may be relevant to the application, complaint or reference being inquired into by the Tribunal.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "8",
                "text": "If any person upon whom a summons issued by an Agrarian Tribunal has been served",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "fails without reasonable cause to appear before the Agrarian Tribunal at the time and place mentioned in such summons ; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "refuses without reasonable cause to be sworn, or having been sworn, fails or refuses without reasonable cause to answer any question put to him by a member of the Agrarian Tribunal touching the matters being inquired into by such Tribunal or willfully gives a false answer to any such question ; or",
                    "pre_block_list": [
                      "Agrarian Development Act, No. 46 of 2000 37"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "fails or refuse without reasonable cause, to produce before the tribunal any document which is in his possession or power and which he has been required to produce,",
                    "pre_block_list": [
                      "he shall be guilty of an offence under this Act and shall on conviction after summary trial before a Magistrate be liable to a fine not exceeding one thousand rupees or to imprisonment of either description for a term not exceeding six months or to both such fine and imprisonment."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "9",
                "text": "An Agrarian Tribunal shall inquire into all applications, complaints or appeals referred to it under this Act and shall inform the parties thereto and the Commissioner-General of its decisions thereon.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "10",
                "text": "A certificate issued by the Agrarian Tribunal that any person has acted in the manner set out in subsection (8), shall be  prima facie  proof of the facts stated therein.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "11",
                "text": "Regulations may be made setting out the manner in which applications, complaints or appeals to an Agricultural Tribunal shall be made, the particulars to be included in any such application, complaint or appeal and the procedure to be followed at meetings of the Tribunal.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "40",
            "text": "A decision made upon an application, complaint or reference at a meeting of the Agrarian Tribunal by a majority of the members of the Agrarian Tribunal shall be deemed to be the decision of the Agrarian Tribunal.",
            "pre_block_list": [
              "The decision of the Agrarian Tribunal."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "41",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where any party to any such application, complaint or appeal has not preferred an appeal to the Court of Appeal against the decision of the Agrarian Tribunal within thirty days of the receipt by him of the notice of the decision of the Agrarian Tribunal, the decision of the Agrarian Tribunal shall be given effect to.",
                "pre_block_list": [
                  "When the decision of an Agrarian Tribunal shall be executed."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where any such party has preferred an appeal to the Court of Appeal against the decision of the Agrarian Tribunal, within thirty days of the receipt by him of the decision of the Agrarian Tribunal, the decision of the Court of Appeal once given shall be given effect to.",
                "pre_block_list": [
                  "Agrarian Development Act, No. 46 of 2000 38"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "42",
            "text": "The decision of an Agrarian Tribunal on any application, complaint or appeal referred to it, shall be final :",
            "pre_block_list": [
              "Right of Appeal.",
              "Provided that an aggrieved party may prefer an appeal to the Court of Appeal within thirty days of the receipt by him, of such decision, on a question of law."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "V",
        "text": "",
        "pre_block_list": [
          "I NSTITUTIONAL  S TRUCTURE   OF  F ARMERS  O RGANISATIONS"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "43",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There may be established one or more Farmers Organisations for any area determined by the Commissioner- General and consisting of persons who are eligible to be members thereof.",
                "pre_block_list": [
                  "Establishment of Farmers Organisations."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Commissioner-General shall where an application on that behalf is made to him by a Farmers Organisation, register such Farmers Organisation. Upon registration the Commissioner-General shall assign a number to such Farmers Organisation :",
                "pre_block_list": [
                  "Provided that the Commissioner-General shall not register a Farmers Organisation for any area under a major irrigation scheme or for any area which comes under the area of authority of a public corporation, except with the concurrence of the Secretary to the Ministry of the Minister in charge of Irrigation or such public corporations, as the case may be."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every registered Farmers Organisation shall be a body corporate having perpetual succession and a common seal and may sue and be sued in its corporate name.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Every person whose livelihood is agriculture shall be eligible for membership of a Farmers Organisation established under subsection (1), if",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "he is a citizen of Sri Lanka ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "he is not less than sixteen years of age ; and",
                    "pre_block_list": [
                      "Agrarian Development Act, No. 46 of 2000 39"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "he is a resident of the area of authority of the Farmers Organisation in which he is seeking membership or he has been engaged in agricultural activities in that area of authority for a period exceeding two years.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Associate membership of a Farmers Organisation established under subsection (1) may be obtained by",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "an owner or occupier of agricultural land within the area of authority of the Farmers Organisation, whose main livelihood is not agriculture ; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "any person who is engaged in any production relating to agriculture or in the marketing of agricultural produce or goods.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "Every Farmers Organisation shall elect its own office bearers. Regulations may be made in respect of the manner of election of office bearers and their terms of office, manner of transaction of business at meetings of the organisations, functions of the organisations, maintenance of the accounts of the organisation and audit of such accounts.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "Persons not eligible for enrolment as members of a Farmers Organisation under this section shall be eligible for enrolment as observers.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "8",
                "text": "Any Farmers Organisation may when necessary for the purposes of this Act call meetings of owner cultivators and occupiers of agricultural lands within its area of authority or of its members.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "9",
                "text": "A General Meeting of the members of a Farmers Organisation shall be called in every year. When a Farmers Organisation fails to convene a general meeting at least once in two years, the Agrarian Development Council of that area shall have the power to convene such meeting.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "10",
                "text": "Regulations may be made setting out the manner of election of the Committee of a Farmers Organisation, the terms of office of the members thereof, the transaction of business at meetings of the Farmers Organisation, removal",
                "pre_block_list": [
                  "Agrarian Development Act, No. 46 of 2000 40",
                  "or resignation of members of the Committee, the staff of a Farmers Organisation, filling up of vacancies, the quorum for a meeting of the Farmers Organisation, the enroling of members of a Famers Organisation, the recovery of membership fees, convening of meetings of owner cultivators and occupiers or members, and the procedure to be followed at such meetings."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "44",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Commissioner-General or a representative authorised generally or specially in that behalf shall be entitled to examine the accounts of every Farmers Organisation.",
                "pre_block_list": [
                  "Commissioner- General may examine accounts of Farmers Organisations."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Funds of a Farmers Organisation shall be deposited in an account in a prescribed Bank.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Regulations may be made in respect of the manner in which accounts of a Farmers Organisation shall be maintained and the persons responsible for maintaining such accounts.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "45",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Every Farmers Organisation may",
                "pre_block_list": [
                  "Farmers Organisations to have the power to obtain loan facilities."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "obtain loans or advances, from prescribed Banks or State Institutions ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "obtain loans from prescribed banks or State Institutions for its members under joint loan schemes on the basis of recovering and paying bank such loans within a prescribed period ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "acquire, hold, take or give on lease or hire, mortgage, pledge, sell or otherwise dispose of, any movable or immovable property ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "utilize the moneys of a Farmers Organisation in the performance of its duties ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "utilize the moneys obtained in the exercise of its powers to give loans to its members.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "A Farmers Organisation may obtain deposits from its members and utilise the same to grants loans to its members.",
                "pre_block_list": [
                  "Agrarian Development Act, No. 46 of 2000 41"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "When a member of a Farmers Organisation gives fourteen days notice to the organisation that he intends to withdraw any money deposited with the organisation, the Farmers Organisation shall pay that member the money so deposited with interest thereon.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Regulations may be made prescribing the manner in which the powers conferred by this section may be exercised.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "46",
            "text": "It shall be the duty of a Farmers Organisation to encourage small groups of farmers to organise themselves together having regard to the agricultural activities carried on by them or the relationships amongst them.",
            "pre_block_list": [
              "Small groups of farmers."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "47",
            "text": "Every Registered Farmers Organisation established in an Agrarian Development Council Area shall elect a representative or representatives to represent its membership in the Agrarian Development Council established for that area.",
            "pre_block_list": [
              "Farmers Organisation to appoint a member to the Agrarian Development Council."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "48",
            "text": "Every Farmers Organisation shall assist the Agrarian Development Council in the following manner :",
            "pre_block_list": [
              "Farmers Organisation to assist the Agrarian Development Council."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "by inducing the owner cultivators and occupiers of agricultural lands within its area of authority to cultivate their agricultural lands in accordance with the provisions of this Act and by formulating programmes for the cultivation of paddy lands for each season and by formulating annual programmes for the cultivation of high lands ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "by collecting information and making reports regarding agricultural lands within its area authority which are not being satisfactorily cultivated ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "by collecting data regarding agricultural lands, agricultural machinery and agricultural animals and inland fish in its area of authority and furnishing such data to the Agrarian Development Council ;",
                "pre_block_list": [
                  "Agrarian Development Act, No. 46 of 2000 42"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "by encouraging soil conservation, efficient water use, the use of compost manure, within its area of authority and by recommending the cultivation of agricultural crops which are recommended for that area, and the breeding of such breeds of livestock and inland fish as are best suited for that area ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "by taking measures to ensure that such crops and animals are free from diseases and pests ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "by implementing programmes to educate owner cultivators, occupiers and agriculturalists in its area of authority, and by encouraging them to adopt methods which are environmentally friendly.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "49",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Every registered Farmers Organisation shall prepare annually in duplicate a register of information of the owner cultivators and the occupiers of agricultural land in its area of authority and deliver it to the Agrarian Development Council.",
                "pre_block_list": [
                  "Farmers Organisations to submit information of owner cultivators and occupiers to Agrarian Development Councils."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "It shall be lawful for a registered Farmers Organisation engage in the supply of goods and services relating to agriculture.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "50",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Commissioner-General may cancel the registration of a Farmers Organisation and appoint a liquidator or liquidators to wind up its affairs if",
                "pre_block_list": [
                  "Cancellation of Registration."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the number of members of that Farmers Organisation becomes less than twenty five ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the Farmers Organisation has not been functioning for a period exceeding one year from the date of its registration ; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "not less than one fourth of the number of members of that Farmers Organisation makes an application to the Commissioner-General stating that the Farmers Organisation has acted contrary to the objectives of the Farmers Organisation, or has failed to act for the welfare of its members.",
                    "pre_block_list": [
                      "Agrarian Development Act, No. 46 of 2000 43"
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Notification of such cancellation shall be published in a Newspaper circulating in the Sinhala, Tamil and English languages respectively.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The liquidator or liquidators appointed to wind up the affairs of the Organisation shall have the power to",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "decide any question relating to priority among the creditors of the Organisation ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "sell the property of the Organization ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "compound any claims by or against the Organisation with the prior approval of the Commissioner- General ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "arrange for the distribution of the assets of the Organisation in the prescribed manner.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "In the liquidation of the Organisation its funds shall be applied first to settle the cost of liquidating and then to the discharge of its liabilities. Any surplus remaining after the closure of the liquidation shall be credited to the Agrarian Development Fund.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "VI",
        "text": "",
        "pre_block_list": [
          "A GRARIAN  D EVELOPMENT  C OUNCILS"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "51",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be established an Agrarian Development Council and the office of that council shall be established in the agrarian center for each such area as may be determined by the Commissioner-General.",
                "pre_block_list": [
                  "Establishment of Agrarian Development Councils."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every Agrarian Development Council shall be a body corporate with perpetual succession and a common seal and may sue or be sued in its corporate name.",
                "pre_block_list": [
                  "Agrarian Development Act, No. 46 of 2000 44"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every Agrarian Development Council shall consist of",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "i",
                    "text": "at least one representative each from each Farmers Organisation established under this Act in the Agrarian Development Area for which that Council is established ; and",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "such number of persons appointed by the Commissioner-General to represent government departments and public corporations engaged in the field of agriculture in that Agrarian Development Area.",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "A person appointed to be a member of an Agrarian Development Council by the Commissioner-General under subsection 3 (ii) shall not have the power to vote at any meeting of such Council.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "The term of office of a member of an Agrarian Development Council shall be two years, provided however, that a member who ceases to hold office by effluxion of time shall be eligible for re-appointment.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "A person appointed as a member of an Agrarian Development Council under subsection (3) (i) may resign his office by a letter addressed to the Agrarian Development Council, the Commissioner-General and the Farmers Organisation which he represents.",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "Where a representative of a Farmers Organisation vacates office, such Farmers Organisation shall appoint another person in his place.",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "The member so appointed shall hold office for the unexpired period of the term of office of the member whom he succeeds.",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "When a member of an Agrarian Development Council fails to attend three consecutive meetings of such Council without reasonable cause, such Council shall",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "if he is a member appointed under subsection (3) (i), terminate his appointment and inform, in writing, the Farmers Organisation which such member represented, of such termination and appoint another member in his place ; and",
                        "pre_block_list": [
                          "Agrarian Development Act, No. 46 of 2000 45"
                        ],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "if he is a member appointed under subsection (3) (ii), inform the Commissioner-General of such termination, and appoint another member in his place.",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "Regulations may be made with regard to the appointment of the Chairman of the Agrarian Development Council, the duties of the Chairman and the appointment of standing committees and the election of the Secretary and the Treasurer.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "52",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Every Agrarian Development Council shall before every cultivation season fromulate an agricultural programme for its Agrarian Development area and prepare necessary development plans. A copy of same shall be submitted to the Divisional Agriculture Committee.",
                "pre_block_list": [
                  "Functions of Agrarian Development Councils."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Without prejudice to the generality of the provisions of subsection (1) an Agriculture Development Council shall have the power",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "i",
                    "text": "to acquire, hold, take or give on lease or hire, mortgage, pledge, sell or otherwise dispose of, any movable or immovable property ;",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "subject to the provisions of subsection (1) to impose on, and recover from the owner cultivators or occupiers of any agricultural land within its area of authority, an acreage tax based on the extent of such agricultural land, and to recover other charges for services rendered under this Act ;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "to form Farmers Peoples Companies ;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iv",
                        "text": "to purchase shares in Farmers Peoples Companies ;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "v",
                        "text": "assiat and encourage farmers to maintain farmers market places ;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "vi",
                        "text": "to promote Farmers Organisations and small farmer groups ;",
                        "pre_block_list": [
                          "Agrarian Development Act, No. 46 of 2000 46"
                        ],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "vii",
                        "text": "to educate Farmers Organisations and agriculturists by means of workshops ;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "viii",
                        "text": "to act as a guaranter for registered Farmers Organisations which obtain loans from prescribed banks or from State institutions ;",
                        "pre_block_list": [
                          "(ix) to give advances in money to registered Farmers Organisations as approved by the Commissioner- General ;",
                          "(x) to give loans, to registered Farmers Organisations or to groups of small farmers or to owner cultivators or occupiers of agricultural land, within its area of authority ;",
                          "(xi) to act as agents of commercial organisations or companies engaged in agricultural activities ;",
                          "(xii) to implement programmes initiated by the Ministry of the Minister in charge of the subject of Agriculture ;",
                          "(xiii) to maintain an account in a prescribed bank and to operate such account in accordance with instructions issued from time to time by the Commissionser- General ;",
                          "(xiv) to utilise its funds to repair, maintain and develop irrigation works within its area of authority ;",
                          "(xv) to provide financial assistance to trained officers and farmers with a view to developing agriculture."
                        ],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "53",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Every Agrarian Development Council shall prepare, amend and maintain, a register of the agricultural lands within its area of authority :",
                "pre_block_list": [
                  "Registers of Agricultural lands.",
                  "Provided that, the first register relating to agricultural lands within the area of authority of such Council shall be prepared and certified by the Commissioner-General.",
                  "Agrarian Development Act, No. 46 of 2000 47"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every such register shall contain the name and extent of each agricultural land, the name of the landlord, the occupier, or owner cultivator, as the case may be, and such other particulars as may be prescribed.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "An application to amend an Agricultural Lands Register by entering the name of a new tenant cultivator in respect of an extent of paddy land included in the register shall be made in writing to the Commissioner-General and it shall be accompanied by a letter from the owner consenting to the registration of the applicant as the tenant cultivator in respect of that extent of paddy land, and the Commissioner- General shall make order thereon.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "The Commissioner-General shall inspect and certify every such register once in every three years after the date of commencement of this Act.",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "The Agricultural Lands Register shall kept open for public inspection in the months of January and July of every year.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "When the Commissioner-General is satisfied that certain information in respect of an agricultural land has not been entered in the Agricultural Lands Register maintained in the area where the land is situated, the Commissioner- General shall, after hearing any parties affected, have the power to enter the particulars relating to that agricultural land in the Agricultural Lands Register.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "An entry in a register prepared or amended under the provisions of this section and which is for the time being in force shall be admissible in evidence and, shall be  prime facie proof of the facts stated therein.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "A person who is aggrieved by a decision made in respect of an application to amend the Agricultural Lands Register may forward an appeal in writing to the Agricultural Tribunal of the area where the land is istuated with a copy to the Agriculture Development Council.",
                "pre_block_list": [
                  "Agrarian Development Act, No. 46 of 2000 48"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "8",
                "text": "The Order of the Agrarian Tribunal in respect of such appeal regarding the amendment of the Agricultural Lands Register, shall be final and conclusive.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "9",
                "text": "Regulations may be made in respect of the procedure to be followed in preparing, or amending or maintaining the register mentioned in subsection (1) and the procedure for appeals in respect of amendments, and in respect of the preparation of Rotation Paddy Land Registers.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "54",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The owner cultivator or occupier of every agricultural land shall in writing, inform, the Agricultural Development Council within whose area of authority such land is situated, the prescribed particulars regarding such agricultural land, the ownership, the occupation for the time being and all agricultural activities carried out thereon, within such period as may be specified by such Council.",
                "pre_block_list": [
                  "Agriculturalists to give information to Agrarian Development Council."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where the Agrarian Development Council informs the Commissioner-General that any occupier cultivator or occupier has failed to comply with the provisions of subsection (1), the Commissioner-General shall cause an inquiry to be held by the Agrarian Tribunal established for that area.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Agrarian Tribunal shall determine whether the owner cultivator or occupier has contravened the provisions of subsection (1) and the Agrarian Tribunal shall forthwith inform the Commissioner-General, and the Agrarian Development Council of its decision in writing by registered post. Where the Agrarian Tribunal determines that a owner cultivator or occupire has contravened the provisions of subsection (1), the Tribunal shall require him to pay a penalty of one thousand rupees to the Agrarian Development Council.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "If any person defaults in the payment of the penalty imposed on him under subsection (1), the Agrarian Development Council or any officer authorised on that behalf may make an application to the Magistrates Court within whose jurisdiction such agricultural land is situated, to recover that sum of money as though it were a fine imposed by court and the sum of money so recovered shall be paid to the Agrarian Development Council.",
                "pre_block_list": [
                  "Agrarian Development Act, No. 46 of 2000 49"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "A certificate from the Agrarian Tribunal to the effect that such sum of money is due to the Agaraian Development Council from the person specified therein for contravention of the provisions of subsection (1), shall be  prima facie evidence that such sum of money is due to the Agrarian Development Council from such person.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "55",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Every Agrarian Development Council shall in accordance with the directions of the Commissioner-General, cause a survey to be made, of the Agricultural lands within its area of authority.",
                "pre_block_list": [
                  "Survey of agricultural lands."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Agrarian Development Council may recover the proportionate costs of surveying the agricultural lands within its area of authority, from the owners or occupiers of those agricultural lands, and it shall be the duty of such owners and occupiers to pay the same.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "When any person defaults in the payment of the costs of survey required to be paid by him under the provisions of subsection (2), the Commissioner-General on being informed in writing by the Agrarian Development Council of such default, shall cause the Agrarian Tribunal of the area to hold an inquiry in respect of such default.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where the Agrarian Tribunal determines that any person has defaulted in the payment of the costs of survey required to be paid by him under subsection (2), the Tribunal shall order such person to pay such costs to the Agrarian Development Council before a specified date. Copies of such order shall be sent to the Commissioner-General and the Agrarian Development Council.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "When any person defaults in the payment of the costs he is ordered to pay under subsection (4), the Agrarian Development Council or any officer authorised in that behalf by the Council may apply to the Magistrates Court within whose jurisdiction such person resides for the recovery of such costs in the same manner as a fine imposed by such court and the costs so recovered shall be paid to the Agrarian Development Council.",
                "pre_block_list": [
                  "Agrarian Development Act, No. 46 of 2000 50"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "A certificate of the Agrarian Tribunal that the sum of money specified therein is due to be paid to the Agrarian Development Council as costs of survey by the person specified therein shall be  prima facie  evidence of the facts stated therein.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "56",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Every owner or occupier of agricultural land who is required to pay acreage tax to the Agricultural Development Council shall pay such tax to the Agrarian Development Council on or before the thirty first day of March each year.",
                "pre_block_list": [
                  "Recovery of acreage tax."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "If any person fails to pay the acreage tax for any year in accordance with the provisions of subsection (1) he shall be deemed to be in default.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where any person has defaulted in the payment of the acreage tax the Agrarian Development Council shall by a written notice require him to pay such tax on or before the date mentioned in such notice.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "When the Commissioner-General is satisfied after inquiry that a person to whom a notice has been sent under subsection (3), has defaulted in the payment of the sum of money mentioned in such notice within the period allowed therefor and that such sum is due as acreage tax such sum shall on application made by an officer authorised in that behalf by the Commissioner-General to the Magistrates Court within whose jurisdiction such land is situated, be recovered in the same manner as a fine imposed by such court.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "A certificate issued under the signature of the Commissioner-General or of any officer authorised in that behalf for the purpose of subsection (4), stating that the sum of money mentioned therein is due to be paid to the Agrarian Development Council by the person whose name is specified in such Certificate, as acreage tax shall be  prima facie  evidence that such sum of money is due to be paid to the Agrarian Development Council by such person.",
                "pre_block_list": [
                  "Agrarian Development Act, No. 46 of 2000 51"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "57",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "When any person who has defaulted in the payment of a loan given to him by an Agrarian Development Council or by a Farmers Organisation, such Council or organisation may by a written notice by registered post require such person to repay such loan within the period mentioned in such notice.",
                "pre_block_list": [
                  "Loans given by Farmers Organisations and by Agrarian Development Councils to be recoverable."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "When the Commissioner-General is informed in writing that a person to whom a written notice has been sent under subsection (1), has failed to pay the sum of money specified in such notice within the period specified therein, the Commissioner-General shall cause the Agrarian Tribunal to hold an Inquiry in respect of that matter.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where the Agrarian Tribunal determines that any person has defaulted in the payment of a loan given to him by the Agrarian Development Council or a Farmers Organisation, it shall by written notice require such person to pay the sum in default within a specified period of time.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where a person fails to pay a sum of money he is required to pay by a notice under subsection (3) within the period specified in such notice, an application shall be made by the Agrarian Development Council or the Famers Organistation to the Magistrates Court within whose jurisdiction such person resides or the land in respect of which the loan has been given is situated and such sum of money shall be recovered in the same manner as a fine imposed by such Court.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "A certificate under the hand of the Agrarian Tribunal to the effect the sum of money stated therein is due from the person specified therein as repayment of a loan, shall be  prima facie  evidence of the facts stated therein.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "58",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The accounts of every Agrarian Development Council shall be maintained in such form and shall contain such particulars as the Commissioner-General may with the concurrence of the Minister in charge of the subject of Finance for the time being specify. The accounts of every Agrarian Development Council for each year shall be audited by the Auditor-General.",
                "pre_block_list": [
                  "Audit and accounts.",
                  "Agrarian Development Act, No. 46 of 2000 52"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The accounts of every Agrarian Development Council shall be maintained by the Administrative Co-ordinating Secretary who has been appointed to such Agrarian Development Council on the directions of the Commissioner- General.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Co-ordinating Secretary of an Agrarian Development Council shall make the accounts of the Council available for inspection by the members of such Agrarian Development Council.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "59",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Article 154 of the Constitution shall apply to the audit of the accounts of every Agrarian Development Council as if such Council were a public corporation within the meaning of the Constitution. However, there shall not be any obstacle to the Commissioner-General setting out the auditing procedure to be followed by any of the above Councils.",
                "pre_block_list": [
                  "Audit of Accounts of Agrarian Development Council."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Auditor-General shall disallow every item of the accounts which in his opinion is irregular or unlawful and recommend that the Commissioner-General surcharge the same on the officer or employee of such Agrarian Development Council making or effecting such payment and that the Commissioner-General charge against any officer or employee any sum which ought to have been but is not brought into account by such officer or employee. The Commissioner- General shall thereupon certify the amount due from such person.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Prior to certifying any such surcharge or disallowance the Commissioner-General shall notify such person of the proposed surcharge or disallowance and afford such person an opportunity to make representations or be heard against such surcharge or disallowance. The Commissioner-General shall thereupon inform such person of his decision together with his reasons therefor.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where a surcharge or disallowance against any person has been certified by the Commissioner-General such certificate shall be conclusive proof of the matters stated therein.",
                "pre_block_list": [
                  "Agrarian Development Act, No. 46 of 2000 53"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Any person aggrieved by any surcharge or disallowance may within thirty days of the date on which the decision of the Commissioner-General is communicated to him appeal against the decision to the  Secretary to the Ministry of the Minister with a copy of the appeal to the Commissioner-General. It shall be lawful for such Secretary upon any such appeal to decide the question at issue according to the merits of the case.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "The Secretary to the Ministry of the Minister may by order, direct the recovery from the person making such appeal the whole or any portion of the amount surcharged or disallowed, as the case may be, if he thinks that there are grounds therefor, and if he finds that the surcharge or disallowance has been lawfully made but in the particular circumstance of the case it is fair and equitable that the surcharge or disallowance be remitted, he may, by order, direct that the same shall be remitted but that the amount of the costs and expenses which may have been incurred by the Commissioner-General in the enforcing of such surcharge or disallowance or such portion of it as may be determined by the Secretary, shall be recovered from such person.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "Upon receipt of the certificate regarding the surcharge or disallowance or the decision of the Secertary made upon an appeal the Commissioner-General shall by a notification sent by registered post require such person to pay the sum set out in the notification before the date specified therein, being a date not later than three months from the date of the notification.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "8",
                "text": "Where any person fails to comply with the requirements of a notification under subsection (7), the Commissioner-General shall file a certificate  setting out the details of the sum of money that is due, the name of the person and his last known place of residence and the Magistrates Court within whose jurisdiction such place of residence is situated and such sum shall be recovered from such person in like manner as a fine imposed by such Court.",
                "pre_block_list": [
                  "Agrarian Development Act, No. 46 of 2000 54"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "9",
                "text": "All sums of money paid or recovered under this section other than the money paid or recovered as costs or expenses incurred in enforcing a disallownace  or a surcharge, shall be creidted to the Agrarian Development Fund.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "60",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There may be established a Farmers Organisation District Federation for each district by the Agrarian Development Councils which have been established within such district. Every such Farmers Organisation District Federation may be registered under a name to be designated by the Commissioner-General.",
                "pre_block_list": [
                  "Establishment of the Farmers Organisations District Federation."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every Agrarian Developmetn Council in a district shall elect two representatives to the Farmers Organisation District Federation established for that District.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "There shall be appointed by the Commissioner-General to every Farmers Organisation District Federation such number of persons as are connected to the field of agriculture in the district, to represent government departments and public corporations in the Federation. Such person shall not be entitled to vote at meetings of the Farmers  Organisations District Federation.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "From and after the date of registration of a Farmers Organisation District Federation under subsection (1),  such Federation shall be a body corporate with perpetual succession and a common seal and shall be able to sue and be sued in the name under which it has been registered.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "No act or proceeding of a Farmers Organisation District Federation shall be deemed to be invalid by reason only of the existence of any vacancy among its members.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "Every Farmers Organisation District Federation shall cause a meeting of its members to be held annually.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "The Commissioner-General shall appoint a Co- ordinating Secretary to every Farmers Organisation District Federation.",
                "pre_block_list": [
                  "Agrarian Development Act, No. 46 of 2000 55"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "8",
                "text": "Regulations may be made in respect of the duration of the term of office of members of the Federation, the vacation of office by such members, meetings of the Federation and the procedure to be followed at such meetings.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "61",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Every Farmers Organisation District Federation shall assist in the review of agricultural activities in the District and assist in the carrying out of agricultural policies of the government within the District.",
                "pre_block_list": [
                  "The powers and functions of Farmers Organisations District Federation"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Without prejudice to the generality of the provisions of subsection (1), a Farmers Organisations District Federation shall have the power to",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "to acquire, hold, take or give on lease or hire, mortgage, pledge, sell or otherwise dispose of, any movable or immovable  property ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "to form Farmers Peoples Companies ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "to submit proposals and views in respect of Government agricultural policies to the Sri Lanka National Farmers Organisation Federation;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "to select three representatives to the Sri Lanka national Farmers Organisation Federation.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "62",
            "text": "Every Farmers Organisation District Federation may",
            "pre_block_list": [
              "Membership fees &c."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "collect a membership fees from all the Farmers Organisations within the district, for its activities ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "obtain assistance by way of loans or otherwise for carrying out its activities ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "maintain an account in a prescribed bank ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "require the treasurer to maintain accounts of the income and expenditure of the Federation ;",
                "pre_block_list": [
                  "Agrarian Development Act, No. 46 of 2000 56"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "63",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Every Farmers Organisation District Federation shall maintain its accounts in the manner prescribed by the Commissioner-General. The Commissioner-General shall make provision for the auditing of such accounts.",
                "pre_block_list": [
                  "Maintaining of accounts of a Fermers Organisation District Federation."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Commissioner-General or any officer authorised by him may examine the books and accounts of a Farmers Organisation District Federation.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "For the purposes of subsection (2) a Farmers Organisation District Federation shall submit all the necessary books, documents, and accounts and  shall give all such assistance as may be necessary for the purposes of the examination referred to in subsection (2).",
                "pre_block_list": [
                  "Establishment of Farmers Organisation Provincial Federations."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "64",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Farmers Organisation District Federation in a Province may establish a Provincial Federation for that Province.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The provisions regarding the Farmers Organisation District Federation shall,  mutatis mutandis,  apply to Farmers Organisation Provincial Federation.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "65",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Farmers Organisation District Authorities in the Isalnd may establish a Sri Lanka National Farmers Organization Federation. The Sri Lanka National Farmers Organization Federation shall be registered by the Commissioner-General.",
                "pre_block_list": [
                  "Establishment of Sri Lanka National Farmers Organisation Federation."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Sri Lanka National Farmers Organisation Federation shall consist of three representatives each elected from every Farmers Organisation District Authority.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "From and after the date of registration of the Sri Lanka National Farmers Organisation Federation under subsection (1) such Federation shall be a body corporate with perpetual succession and a common seal and shall be able to sue and be sued under the  name assigned to it by subsection (1).",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The Sri Lanka National Farmers Organisation Federation shall maintain its office in Colombo.",
                "pre_block_list": [
                  "Agrarian Development Act, No. 46 of 2000 57"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "No act or proceeding of the Sri Lanka National Farmers Organisation Federation shall be deemed to be invalid by reason only of the existence of any vacancy among its members.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "The Commissioner-General shall appoint such number of persons not exceeding seven as members of the Sri Lanka National Farmers Organisation Federation to represent Goverment Departments and Public Corporations. The members so appointed shall not be entitled to vote at meetings of Sri Lanka National Farmers Organisation Federation.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "The Commissioner-General shall appoint a co- ordinating Secretary to the Sri Lanka National Farmers Organisation Federation.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "8",
                "text": "Regulations may be made in respect of the term of office of members of the Federation, vacation of office by such members, appointment of the staff of the  Federation, and procedure to be followed at meetings of the Federation.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "66",
            "text": "The Sri Lanka National Farmers Organisations Federation may",
            "pre_block_list": [
              "Sri Lanka National Farmers Organisations Federation may obtain membership fees &c."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "recover membership fees from Farmers Organisation District Federations ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "obtain financial assistance  or assistance in kind from the State or public corporations or from non governmental organisations ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "maintain accounts at a prescribed bank ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "maintain proper books of accounts ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "expend its funds in order to attain its objectives.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "67",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Sri Lanka National Farmers Organisation Federation shall review the agricultural policies of the Government and assist in the implementation of such policies.",
                "pre_block_list": [
                  "The powers and functions of the Sri Lanka National Farmers Organisations Federation."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Without prejudice to the generality of the provisions of subsection (1) shall have the power.",
                "pre_block_list": [
                  "Agrarian Development Act, No. 46 of 2000 58"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "to acquire, hold, take or give on lease, or hire, mortgage, pledge, sell or otherwise dispose of, any movable or immovable property ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "to provide aid and assistance to registered Farmers Organisations, Agrarian Development Councils, and Farmers Organisation District Federations and Farmers Organization Provincial Federations ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "to provide the necessary guidance and  assistance to such Councils, organisations and Federations to enable them to discharge their functions under this Act ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "to select a representative to the National Agricultural Committee ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "to submit proposals and views to the Government regarding the Governments agricultural policies ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "to provide advice and assistance to Farmers Organisations, Agrarian Development Councils, Farmers Organisation District Federations, Farmers Organisation Provincial Federations and Farmers Companies regarding the marketing of agricultural produce ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "g",
                    "text": "to assist and encourage small farmers groups in the marketing of agricultural produce.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "68",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Sri Lanka National Farmers Organisation Federations shall maintain books, and accounts in the manner specified by the Commissioner-General. The Commissioner- General shall make provision for the auditing of such accounts.",
                "pre_block_list": [
                  "Provisions for the maintenance of an examination of accounts of the Sri Lanka National Farmers Organisation Federations."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Commissioner-General or an officer authorised by him in that behalf may examine the books, papers, documents and accounts of the Sri Lanka National Farmers Organisation Federations.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Sri Lanka National Farmers Organisation Federations shall submit all books, papers, documents and accounts necessary for the purposes of audit under subsection (1).",
                "pre_block_list": [
                  "Agrarian Development Act, No. 46 of 2000 59",
                  "Farmers Organisation, Agrarian Developmetn Council, Farmers Organisation District Federations Farmers Organisation Provincial Federations the Sri Lanka National Farmers Organisation Federations exempt from stamp duty and fees."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "69",
            "text": "Every registered Farmers Organisation, every Agrarian Development  Council, every Farmers Organisation District Federation, every Farmers Organisation Provincial Federation and the Sri Lanka National Farmers Organisation Federation shall be exempt from",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "any stamp duty chargeable under any written law in respect of any instrument executed by or on behalf of, or in favour of, such Organisation, Council or Federation or in respect of any document filed in a Court by such Organization, Council or Federation in cases where, but for the exemption granted by this section it would have been liable to pay the duty chargeable in respect of such instrument or document ; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "any fees payable under the law for the time being in force relating to the registration of documents.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "70",
            "text": "Every registered Farmers Organisation and every Agrarian Development Council and  every Farmers Organisation District Federation and every Farmers Organisation Provincial Federation and the Sri Lanka National Farmers Organisation Federation shall be exempt from the payment of any tax on the income or profits made by such Organisation, Council or Federation, as the case may be, under the provisions of the Inland Revenue Act, No. 28 of 1979.",
            "pre_block_list": [
              "Farmers Organisations, Agrarian Development Councils, Farmers Organisation District Federation, Farmers Organisation Provincial Federation and Sri Lanka National Farmers Organisation Federation exempted from the  Inland Revenue Act."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "71",
            "text": "Every registered Farmers Organisation and every Agrarian Development Council, and every Farmers Organisation District Federation, and every Farmers Organisation Provincial Federation and the Sri Lanka National Farmers Organisation Federation shall be deemed to be scheduled institutions within the meaning of the  Bribery Act and the provisions of that Act shall be construed accordingly.",
            "pre_block_list": [
              "Application of Bribery Act.",
              "Agrarian Development Act, No. 46 of 2000 60",
              "Officers' and Servants of Farmers Organisations Agrarian Development Council, Farmers Organisation District Federation, Farmers Organisation Provincial Federation, and Sri Lanka National Farmers Organisation Federation to be deemed to be public officers."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "72",
            "text": "All officers and servants of a registered Farmers Organisation or an Agrarian Development Council, or a Farmers Organisation District Federation, or a Farmers Organisation Provincial Federation or the Sri Lanka National Farmers Organisation Federation shall be deemed to be public officers within the meaning, and for the purposes, of the Penal Code.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "73",
            "text": "No suit or prosecution shall lie against any member of a Farmers Organisation or an Agrarian Development Council or a Farmers Organisation District Federation or a FarmersOrganisation Provincial Federation or the Sri Lanka National Farmers Organisation Federation established by or under this Act, or against any servant or agent of such organisation or Council or Federation for any act which in good faith is done or purported to be done by him under this Act, or under any regulation made thereunder.",
            "pre_block_list": [
              "No suit to lie against member or servant of Farmers Organisations, Agrarian Development Councils, Farmers Organisation District Federation Farmers Organisations Provincial Federations or the Sri Lanka National Farmers Organisation Federation.",
              "The powers and functions of Agricultural Research and Production Assistants."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "74",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There may be appointed Agricultural Research and Production Assistants and such number of other persons by name or office as may be necessary for the purposes of this Act and the officers so appointed shall be subject to the general control and direction of the Commissioner- General.",
                "pre_block_list": [
                  "Agrarian Development Act, No. 46 of 2000 61"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every Agricultural Research and Production Assistants shall within his area of authority act also as the convenor for the area.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "75",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Every Agrarian Development Council shall in the prescribed manner cause indentity cards to be issued to owner-cultivators or occupiers of agricultural lands within its area of authority.",
                "pre_block_list": [
                  "Agrarian Development Council to issue identity cards"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "In the issue of identity cards reference shall be made inter alia  to the last certified Agricultural Lands Register of the Area.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "76",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Commissioner-General may, by notice in writing, require the owner-cultivator or the occupier of any agricultural land or any other person having a connection with such land to furnish to him, on or before a date specified in such notice, information regarding the extent of agricultural land held by him, the nature of the cultivation done by him in that agricultural land and other relevant information mentioned in such notice.",
                "pre_block_list": [
                  "Commissioner- General may call for information."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any person who fails to comply with the provisions of subsection (1) shall be guilty of an offence under this Act.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "77",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where the Commissioner-General is of opinion that any power conferred on any Farmers Organisation or Agrarian Development Council or Farmers Organisations District Federation or any Farmers Organisation Provincial Federation or the Sri Lanka Farmers Organisations National Federation by this Act, or by any regulations made thereunder has been misused, he shall forthwith take steps to prevent the continuation of such misuse.",
                "pre_block_list": [
                  "Powers of the Commissioner- General."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where any registered Farmers Organisation or Agrarian Development Council or any Farmers Organisation District Federation or any Farmers Organisations Provincial Federation or the Sri Lanka Farmers Organisations National Federation omits to exercise any power conferred on such",
                "pre_block_list": [
                  "Agrarian Development Act, No. 46 of 2000 62",
                  "Organisation Council or Federation by this Act, or by any regulation made under this Act the Commissioner-General may require such Organisation, Council or Federation, in writing, to exercise such power."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Any registered Farmers Organisation or Agrarian Development Council or any Farmers Organisation District Federation or any Farmers Organisations Provincial Federation or the Sri Lanka Farmers Organisations National Federation which fails to comply with any requirement imposed on such Organisation, Council or Federation by the Commissioner-General under subsection (1) or subsection (2) may be dissolved by the Commissioner-General and the Commissioner-General may, until such Farmers Organisation or Farmers Organization District Federation or Farmers Organisation Provincial Federation, Agrarian Development Council or the Sri Lanka National Federation of Farmers Organisation Federation so dissolved is re-established, take suitable measures to ensure that its powers are exercised.",
                "pre_block_list": [
                  "Commissioner- General to be subject to the general direction of the Minister."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "78",
            "text": "The Commissioner-General shall, in the exercise of his administrative powers and in the performance of his duties under this Act be subject to the general direction of the Minister.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "79",
            "text": "The Commissioner-General or any officer of the Department of Agrarian Services authorized in that behalf by the Commissioner-General in writing, shall be entitled to initiate proceedings in respect of offences under this Act.",
            "pre_block_list": [
              "Persons authorised to prosecute."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "80",
            "text": "The Commissioner-General shall, for the purpose of hearing and deciding any dispute referred to him under this Act, have all the powers of a District Court namely :",
            "pre_block_list": [
              "Commissioner- General to have powers of a District Court."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "to summon and compel the attendance of any witness ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "to compel the production of documents ; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "to administer any oath or affirmation to witnesses.",
                "pre_block_list": [
                  "Agrarian Development Act, No. 46 of 2000 63"
                ],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "VII",
        "text": "",
        "pre_block_list": [
          "I RRIGATION  W ORK   AND   THE  M ANAGEMENT   OF  I RRIGATION W ATER"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "81",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Every tank, dam, canal, water course, embankment reservation or other irrigation work, within the area of authority of any Farmers' Organisation, shall be subject to the supervision of that Farmers' Organisation.",
                "pre_block_list": [
                  "Supervision and administration of irrigation works to be under the Farmers' Organisation."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Regulations may be made setting out the manner in which such supervision shall be exercised by a Farmers Organisation.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every person who without lawful cause resists or obstructs any person authorised by a Farmers' Organisation in the exercise by such person of any powers conferred on him by regulations made under subsection (2) shall be guilty of an offence under this Act.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "82",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where any government department, public corporation, person or body of persons proposes to construct a tank, dam canal watercourse or commence any development project, within the area of authority of Farmers' Organisation, it shall be the duty of the head of such department or corporation or such person or such body of persons to inform the Farmers' Organisation of the proposed construction or project and invite its comments thereon.",
                "pre_block_list": [
                  "Farmers Organisations to be informed of any construction projects &c."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Upon receipt of the comments of a Farmers' Organisation under subsection (1), the head of such department or corporation or person or body of persons shall forthwith inform the Farmers' Organisation whether and how he has taken into account the comments of the Farmers' Organisation in the finalisation of the plans for construction or the development project, as the case may be, or why he has not been able to give effect to such comments in such plan or project, as the case may be.",
                "pre_block_list": [
                  "Agrarian Development Act, No. 46 of 2000 64"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "83",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Commissioner-General may, if it appears to him that any person has",
                "pre_block_list": [
                  "Interference with the protection of irrigation work."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "blocked up, obstructed or encroached upon or caused to be blocked up, obstructed or encroached upon, damaged or caused to be damaged, any irrigation channel, water course, bund, bank, reservation tank, dam,  tank-reach or irrigation reserve; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "wilfully or maliciously caused the waste of water conserved in any irrigation work; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "without the prior written approval of the Commissioner-General carried out any cultivation in, or removed earth from or caused earth to be removed from, a tank, canal within the catchment area  or from a minor irrigation channel, water- course, bund, bank, reservation tank, dam, tank-reach or  irrigation reserve,",
                    "pre_block_list": [
                      "make an order requiring such person to take such remedial measures as are specified in the order."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "For the purpose of ensuring compliance with the provisions of an order made under subsection (1), the Commissioner-General may seek the assistance of the Peace Officer within whose area of authority such channel, canal, water course, bund, embankment, reservation tank, dam, tank- reach or irrigation reserve in respect of which such order is made lies, and it shall be the duty of such Peace Officer to render such assistance as is sought and the Peace Officer may for such purpose use such force as may be necessary to ensure compliance with such order.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every person who fails to  comply with an order under subsection (1) shall be guilty of an of an fence undoer this Act.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "A certificate issued by the Commissioner-General to the effect that the person specified in the certificate has failed to take the measures specified in an order made under subsection (1), and committed the acts specified therein shall be  prima facie  evidence of the facts stated therein.",
                "pre_block_list": [
                  "Agrarian Development Act, No. 46 of 2000 65"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "84",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "No person shall release, cause to be released, or allow the flow of, waste matter into any channel, canal, watercourse, irrigation reservation or paddy land.",
                "pre_block_list": [
                  "Allowing the flow of waste matter to paddy lands or watercourses."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where it appears to the Commissioner-General that any person is committing an act in contravention of the provisions of subsection (1), he may make order, requiring such person to desist from continuing such act.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "For the purpose of ensuring compliance with the provisions of an order made under subsection (2) the Commissioner-General may seek the assistance of the Peace Officer within whose area of authority such channel, canal, watercourse, irrigation reservation or paddy land in respect of which such order is made lies, and it shall be the duty of such Peace Officer to render such assistance as is sought and the Peace Officer may for such purpose use such force as may be necessary to ensure compliance with such order.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "An order under subsection (2) shall be binding on the person in respect of whom it is made until set aside by a Court of Competent Jurisdiction.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Every person who fails to comply with the requirements of an order under subsection (2),  shall be guilty of an offence under this Act.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "A certificate issued by the Commissioner-General to the effect that the person specified in the certificate has failed to comply with requirements of an order made under subsection (2) shall be  prima facie  evidence of the facts stated therein.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "85",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "No person shall dump any waste matter into any channel,  canal, watercourse, irrigation reservation or paddy land.",
                "pre_block_list": [
                  "Offence relating to dumping of waste matter into paddy lands and watercourses."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any person who contravenes the provisions of subsection (1), shall be guilty of an offence under this Act.",
                "pre_block_list": [
                  "Agrarian Development Act, No. 46 of 2000 66"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where any person does any act in contravention of the provisions of subsection (1), the Farmers' Organisation within whose area of authority such channel, irrigation reservation, canal, watercourse or paddy land is situated may report the same to the Agrarian Tribunal within whose jurisdiction such channel, irrigation reservation or land or watercourse or paddy land is situated.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Such Agrarian Tribunal shall hold an inquiry into a report made to it under subsection (3) and if it is satisfied after inquiry that any person has acted in contravention of the provisions of subsection (1), such Tribunal shall issue a certificate to that effect.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "A certificate issued under subsection (4) shall be prima facie  evidence that the person specified in the certificate has committed the acts specified therein.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "86",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Every Farmers Organisation shall, within its area of authority",
                "pre_block_list": [
                  "Meetings of the Owner cultivators and occupiers."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "encourage and extend the cultivation of agricultural lands or paddy cultivation or any  other form of cultivation ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "enforce the established customs affecting paddy cultivation or other forms of cultivation;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "ensure the proper timing of agricultural operations;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "ensure the efficient management of water,  irrigation works and water used for agricultural activities;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "attend to matters relating to irrigation works in accordance with established customs of cultivation;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "take measures for the conservation of soil and the protection of crops against pests and diseases;",
                    "pre_block_list": [
                      "Agrarian Development Act, No. 46 of 2000 67"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "g",
                    "text": "every farmers organisation shall within its area of authority take such steps to ensure the cutting and removal of thicket in highland adjoining any extent of paddy land and the cutting and removal of shrub forest which interferes with an agricultural crop which has been cultivated on an extent of paddy land or an extent of highland; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "h",
                    "text": "for the purpose of making rules relating to the development of land and collective agricultural activities, convene meetings of the owner-cultivators and occupiers of agricultural land of the area.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where any meeting is convened under the provisions of this section, the Farmers' organisation or any other person generally or specially authorized in that behalf by such Farmers' Organisation shall cause notice to be given of the date, time and place of the meeting and its objects.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The notice referred to in subsection (2), shall be given by exhibiting written notices in suitable places within the area and in such other manner as may appear adequate for giving publicity thereto.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "A person named by the Farmers Organisation or any other person generally or specially authorized in that behalf by the Farmers'  Organisation shall preside at  every meeting held under the provisions of this section.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "The Commissioner-General of Agrarian Development or any person generally or specially authorised by him in that behalf shall maintain minutes of every meeting held under the provisions of this section.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "A meeting convened under the provisions of this section shall not be deemed to be validly constituted unless there are present at such meeting at least one fourth or twenty- five  per centum  of the total number of owner cultivators or occupiers of agricultural land in the area of authority of the Farmers Organisation. If there has been no quorum at two",
                "pre_block_list": [
                  "Agrarian Development Act, No. 46 of 2000 68",
                  "consecutive meetings, the person acting as the Presiding Officer shall adjourn the second meeting and shall fix a date for the third meeting. If there is no quorum for the third meeting, it shall be deemed to be validly constituted for all purposes, notwithstanding the lack of a quorum."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "In the event of any failure to convene the meetings in compliance with the provisions of this section by any Farmers Organisation it shall be lawful for the Agrarian Development Council of that area of authority to comply with the provisions of this section.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "8",
                "text": "Any rule made at a meeting under the provisions of this section shall be adopted by those present at the meeting and shall thereafter be binding on the owner cultivators and occupiers in the area of the authority of Farmers' Organisation.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "9",
                "text": "",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "If at any meeting held under the provisions of this section any question arises as to the right of any person to vote, the Presiding Officer shall decide that question.",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "Where there is an equality of votes in respect of any matter, the Presiding Officer shall have a casting vote.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "10",
                "text": "The minutes of the proceedings of every such meeting shall be maintained by the person authorized under subsection (5) of this section and such minutes shall be signed by such authorized person and the Presiding Officer, and shall be evidence of the contents thereof.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "11",
                "text": "Where a landlord or occupier of any agricultural land acts in contravention of a rule adopted at a meeting held as provided in this section he shall be guilty of an offence under this Act.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "87",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where any act is committed or any omission made by any person within the area of authority of any Farmers Organisation contrary to any established custom or any rule relating to irrigation or cultivation whereby damage may be caused to the owner cultivator or occupier of agricultural land within such area of authority, the Farmers Organisation shall,",
                "pre_block_list": [
                  "Action to be taken when it is contrary to any custom or rule relating to the field of agriculture.",
                  "Agrarian Development Act, No. 46 of 2000 69",
                  "if the act or omission be of such a nature as to call for prompt action to prevent damage, take steps and incur such expenditure as may be necessary in the circumstances and shall forthwith make a report on the steps taken and expenditure incurred if any, to the Commissioner-General  and the Agrarian Development Council within whose area of authority such act or omission has occurred."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "Any person in consequence of whose act or omission any expenditure under subsection (1) was incurred, shall be liable to pay such sum as  was incurred to the Farmers Organisation.",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "The Farmers Organisation shall by notice in writing and sent by registered post require such person to pay the said sum of money within period specified in the notice.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where such person fails to pay such sum within the period specified in the notice, the Farmers' Organisation may make an application in writing to the Commissioner-General to recover such sum of money.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "In order to decide the question whether the expenditure in respect of which such sum is due, was properly incurred the Commissioner -General may require the Agrarian Tribunal to hold an inquiry.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "The Farmers' Organisation and the person who has to pay the expenditure incurred shall be given an opportunity of making representations in person or through an agent at such Inquiry. If the Tribunal decides after  inquiry that such expenditure was properly incurred, the Tribunal shall make order that such person shall pay such sum of money to the Farmers ' Organisation  within a period of fourteen days from the date of the order and shall send copies to the Commissioner-General and to the parties.",
                "pre_block_list": [
                  "Agrarian Development Act, No. 46 of 2000 70"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "Where any person fails to pay any sum he is required to pay by an order under subsection (5) such sum may be recovered, upon application being made by the Farmers Organisation to the Magistrates Court having jurisdiction over the place where such person resides, in like manner as a fine imposed by such Court and any sum so recovered shall be paid by such court to the applicant Farmers Organisation.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "For the purposes of subsection (6) the order of the Agrarian Tribunal that such sum is due to the Farmers Organisation from such person shall be admissible in evidence and shall be  prime facie  proof that such sum is due.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "88",
            "text": "Where an Agrarian Development Council is satisfied that any expenditure has to be incurred by a Farmers Organisation for the purposes of section 87, it may make an advance payment to such Farmers Organisation to meet such expenditure.",
            "pre_block_list": [
              "Agrarian Development Council to make advances."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "89",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "No person shall dig any well or construct any well for the purposes of cultivation, or maintain any well, for the purposes of cultivation except with the written permission of the Commissioner-General and subject to such conditions as he may impose.",
                "pre_block_list": [
                  "Procedure to be followed in digging wells for cultivation."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every person who uses well water for cultivation shall take steps to prevent wastage of water.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Commissioner-General may obtain the recommendations of the following institutions before giving the written permission required by the provisions of subsection (1):",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the relevant Farmers' Organisation;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the relevant Agrarian Development Council;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "the Department of Agriculture;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "the Water Resources Board;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "the Central Environmental Authority.",
                    "pre_block_list": [
                      "Agrarian Development Act, No. 46 of 2000 71"
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "If any person acts in contravention of the provisions of subsection (1) or (2) he shall be guilty of an offence under this Act.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "VIII",
        "text": "",
        "pre_block_list": [
          "G ENERAL  P ROVISIONS"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "90",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where a complaint is made to the Commissioner General by any owner cultivator or occupier of agricultural land that any person is interfering with or attempting to interfere with the cultivation rights, threshing rights, rights of using a threshing floor, the right of removing agricultural produce or the right to the use of an agricultural road of such owner cultivator or occupier, the Commissioner -General after inquiry may if he is satisfied that such interference or attempted interference will result in damage or loss of crop or livestock, issue an order on such person cultivator or occupier requiring him to comply with such directions as may be specified in such order necessary for the protection of such rights :",
                "pre_block_list": [
                  "Interference with cultivation rights of owner cultivator or occupier.",
                  "Provided that an order under this section shall not be made for the eviction of any person from such agricultural land :",
                  "Provided further that an order issued under subsection (1) shall not prejudice the right title or interest of such person, cultivator or occupier to such land, crop or livestock in respect of which such order is made."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "For the purpose of ensuring compliance with the provisions of an order under subsection (1) the Commissioner- General may seek the assistance of a peace officer within whose area of authority such agricultural land in respect of which such order is made lies, and it shall be the duty of such Peace Office to render such assistance as is sought and the Peace Officer may for such purpose use such force as may be necessary to ensure compliance with such order.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "An order under subsection (1) shall be binding on the person in respect of whom it is made until set aside by a court of competent jurisdiction.",
                "pre_block_list": [
                  "Agrarian Development Act, No. 46 of 2000 72"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Any person who fails to comply with an order made under subsection (1) shall be guilty of an offence under this Act.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "A certificate in writing issued by the Commissioner- General to the effect that the directions contained in an order made by him under subsection (1) has not been complied with by the person specified therein shall be  prima facie  evidence of the facts stated therein.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "91",
            "text": "Any person who does not own agricultural land or land less than half an acre in extent may apply to the President for the grant of any State land, or the grant of land by any other institution. For the purposes of this section agricultural land owned by the spouse or minor children of such person shall be deemed to be land owned by such person.",
            "pre_block_list": [
              "Right of owners of agricultural lands not exceeding half an acre."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "92",
            "text": "It shall be lawful for any Farmers Organisation or any authorised representative of a Farmers Organisation or the owner cultivator or the occupier of any agricultural land to seize or tie up any animal found loitering in such agricultural land or irrigation work until such animal is claimed by the owner. Such organization may lay down rules to be followed when an animal is found to be loitering.",
            "pre_block_list": [
              "Action to be taken regarding stray animals."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "93",
            "text": "Every office bearer and officer or servant of an organisation, Council or Authority referred to in this Part of this Act, shall be entitled to receive remuneration of such sum, not exceeding the amount prescribed by regulation, for their services.",
            "pre_block_list": [
              "Remuneration to employees."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "94",
            "text": "Where the Minister certifies by Notification published in the Gazette that it is necessary that any agricultural land specified in the Notification should be acquired for any of the purposes of this Act, that land shall, for the purposes of the application of the Land Acquisition Act, be deemed to be required for a public purpose and may be acquired under that Act:",
            "pre_block_list": [
              "Compulsory acquisition of agricultural land.",
              "Agrarian Development Act, No. 46 of 2000 73",
              "Provided that notwithstanding anything to the contrary in that Act the amount of compensation to be paid for the acquisition of that land under that Act shall be equal to ten times  the annual rental value of that land computed in the prescribed manner."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "95",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Minister may  make regulations in respect of all matters which are stated or required by this Act, to be prescribed or for which regulations are required by this Act to be made.",
                "pre_block_list": [
                  "Regulations."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every regulation made by the Minister shall be published in the Gazette and shall come into operation on the date of such publication or upon such later date as may be specified in the regulation.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every regulation made by the Minister shall as soon as convenient after its publication in the Gazette, be brought before Parliament for approval. Every regulation which is not so approved shall be deemed to be rescinded as from the date of such disapproval but without prejudice to anything previously done thereunder. Notification of the date on which any regulation is deemed to be rescinded shall be published in the Gazette.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "96",
            "text": "Any person who is guilty of an offence under this Act or under any regulation made thereunder shall on conviction after trial before a Magistrate and except as otherwise provided in this Act, be liable to a fine not exceeding five thousand rupees or to imprisonment of either description for a term not exceeding six months or to both such fine and imprisonment.",
            "pre_block_list": [
              "Penalty."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "97",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be established a Fund to be known as the Agrarian Development Fund.",
                "pre_block_list": [
                  "Agrarian Development Fund."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "There shall be paid into the Fund",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "all fines imposed by  Court for any offence under this Act;",
                    "pre_block_list": [
                      "Agrarian Development Act, No. 46 of 2000 74"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "all sums required under this or any other law to be paid into the Fund and all such sums which are received as donation;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "all sums of money as may be voted from time to time by Parliament to the Fund;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "all such sums of money as the Commissioner- General may from time to time require to be paid into the Fund; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "such percentage as may be prescribed of all sums of money collected as acreage tax under the provisions of this Act.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The moneys of such fund may be utilised for the enforcement of new agricultural policies, for the improvement and development of supplies, for the administration and development of Agrarian Centres, for the maintenance and repair of buildings, vehicles and equipment of such centres, for the purchase of furniture, for the purpose of training and research, supply of transport facilities to officers and in general for the administration and development of Agrarian Development Councils and for the provision of financial aid to Agrarian Development Councils and Farmers Organisations.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The accounts of the Fund shall be maintained in such form and shall contain such particulars as the Commissioner- General may, with the concurrence of the Minister, from time to time specify.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "The accounts of the Fund for each financial year shall be audited by the Auditor - General",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "The financial year of the Fund shall be the period of twelve months commencing on the first day of January each year.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "98",
            "text": "The provisions of this Act shall haver effect notwithstanding anything to the contrary in any other written law, and accordingly, in the event of any conflict or inconsistency between the provisions of this Act and such other law, the provisions of this Act shall prevail.",
            "pre_block_list": [
              "This Act to prevail over other written Law.",
              "Agrarian Development Act, No. 46 of 2000 75"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "99",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Agrarian Services Act, No. 58 of 1979 is hereby repealed.",
                "pre_block_list": [
                  "Repeal of Act No. 58 of 1979."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Notwithstanding the repeal of the Agrarian Services Act, No. 58 of 1979",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "all sums of money that have been credited to the Agrarian Services Fund which has been established by section 60 of the Agrarian Services Act, No. 58 of 1979, shall be transferred to the Agrarian Development Fund established by this Act;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "the assets and liabilities of the Agrarian Services Committees established by the Agrarian Services Act, No. 58 of 1979 shall be transferred to the Agrarian Development Council established by this Act;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "the assets and liabilities of the Farmers Organisations established under the Agrarian Services Act, No. 58 of 1979, shall be transferred to the corresponding Farmers Organisations established under this Act;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "the assets and liabilities of the Farmers, Orgaization District Authority established under the Agrarian Services Act, No. 58 of 1979 shall be transferred to the corresponding Farmers Organisation District Authorities established by this Act.",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "the Agrarian Services Committees established under the Agrarian Services Act, No. 58 of 1979, shall continue to function  till the Agrarian Development Councils are established under this Act;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "the Farmers Orgainsations established under the Agrarian Services Act, No. 58 of 1979, shall continue to function until Farmers Organisations are established under this Act;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "the Farmers Organisations District Authority established under the Agrarian Services Act, No. 58 of 1979 shall continue to function until Farmers Organisation District Authorities are established under this Act.",
                        "pre_block_list": [
                          "Agrarian Development Act, No. 46 of 2000 76"
                        ],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "notwithstanding anything to the contrary in the Prescription Ordinance all claims for damages accruing to tenant cultivators under section 4(7A) of the Paddy Lands Act, No. 1 of 1958, or under section 3 (9) of the Agricultural Lands Law, No. 42 of 1973, or under section 5(8) of the Agrarian Services Act, No. 58 of 1979, shall be deemed to be claims accruing to such tenant cultivator under the provisions of this Act and shall be recoverable in the manner provided by the corresponding provisions of this Act;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "all proceedings pending before an inquiring officer or a Board of Review under the provisions of the Agrarian Services Act, No. 58 of 1979 on the day preceding the date of commencement of this Act, shall be deemed to be proceedings instituted before the corresponding Agrarian Tribunal established by this Act and may be continued and concluded before such Agrarian Tribunal under this Act.",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "all proceedings pending before a Magistrates Court under section 21 of the Paddy Lands Act, No. 1 of 1958, or the Agricultural Lands Law, No. 42 of 1973, or the Agrarian Services Act, No. 58 of 1979 on the day preceding date of commencement of this Act, shall be deemed not to have abated or to have been discontinued or in any way prejudicially affected by reason of the repeal of the said Acts, or Law and accordingly all such proceedings shall be continued and concluded under the corresponding provisions of this Act;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "g",
                    "text": "all proceedings pending in any court under the provisions of the Agricultural Productivity Law No. 2 of 1972, or the Agricultural Lands Law No. 42 of 1973, or under the provisions of the  Agrarian Services Act, No. 58 of 1979 on the day preceding to the date of commencement of this Act, shall be heard and concluded under the corresponding provisions of this Act;",
                    "pre_block_list": [
                      "Agrarian Development Act, No. 46 of 2000 77"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "h",
                    "text": "Every regulation made under the Agrarian Services Act, No. 58 of 1979 and in force on the day preceding the date of commencement of this Act, shall insofar as such regulation is not inconsistent with the provisions of this Act, be deemed to be a regulation made under this Act, and may accordingly be amended, added to or rescinded by regulations made under this Act.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "100",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "101",
            "text": "In this Act, unless the context otherwise requires",
            "pre_block_list": [
              "Interpretation.",
              "agriculture includes "
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "the growing of rice, field crops, spices and condiments, industrial crops, vegetables, fruits, flowers, pasture or fodder ;",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "dairy farming, livestock rearing and breeding;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iii",
                    "text": "plant and fruit nurseries;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iv",
                    "text": "bee keeping and inland fisheries;",
                    "pre_block_list": [
                      "agricultural activity means any activity involving agriculture and includes the supply of agricultural inputs for, and the use of machinery and equipment used in, such activity and any activity involving minor irrigation;",
                      "agricultural land means land used or capable of being used for agriculture within the meaning of this Act, and includes private lands, lands alienated under the Land Development Ordinance or the Crown Lands Ordinance or any other enactment;",
                      "Agrarian Development Act, No. 46 of 2000 78",
                      "agricultural road means a road used to transport agricultural crops or to transport the harvest or to drive or transport animals, or to transport agricultural equipment and machinery or for the purposes of supplying agricultural services or for any other agricultural activity and includes a road used for the purpose of gaining access to agricultural land and includes a road which prior to this date had been used for any of the purposes stated above;",
                      "bank of any watercourse means any river, rivulet, oya, creek,  canal , natural water course or canal constructed for the constant or intermittent flow of water or a stream or water way or outlet of a water way or channel leading therefrom to a reservoir or any branch thereof and the bank of such water course shall include an extent of highland extending upto thirty-three feet from the edge of the bank of such water course ;",
                      "construction with reference to any minor irrigation work includes any improvement or extension of any minor irrigation work, or the repair or restoration of any abandoned minor irrigation work or (subject to the definition of maintenance hereinafter contained, any operation for the protection of any minor irrigation work, or the irrigable areas thereunder, or of any part of such work or area;",
                      "cultivator with reference to an extent of paddy land means any person other than a Farmers Organisation or an Agrarian Development Council, who by himself or by any member of his family or jointly with any other person, carries out on such extent of paddy land",
                      "( a ) two or more of the operations of ploughing, sowing and reaping; and",
                      "( b ) the operation of tending or watching the crop in each season during which paddy is cultivated on such extent;",
                      "Agrarian Development Act, No. 46 of 2000 79",
                      "evict in relation to a tenant cultivator, of paddy land means to deprive a tenant cultivator of his right to use, occupy and cultivate the whole or any part of the extent of paddy land let to him. by the use of direct or indirect methods;",
                      "irrigation work includes ",
                      "( a ) any tank, bund, anicut, ela, channel, distributary field channel, or watercourse comprised in or incidental or ancillary to the irrigation work;",
                      "( b ) any structure, road, bridge, sluice-gate or other engineering work comprised in, or incidental or ancillary to, the construction or maintenance of the irrigation work;",
                      "( c ) any structure, bund, sluice or other engineering work erected for the purpose of draining any cultivated area or of preventing or regulating the flow of  salt water into or out of any such areas or of protecting such areas from floods;",
                      "landlord with reference to an extent of paddy land means the person other than an owner cultivator, who is for the time being  entitled to the rent in respect of such extent if it were let on rent to any person, and includes any tenant of such extent who lets it to any subtenant;",
                      "let with reference to any extent of paddy land, means to permit any person, under an oral or written agreement to occupy and use such extent in consideration of the performance of any service by him or the payment of rent consisting of a sum of money or a share of the produce from such extent;",
                      "loan means any loan, advance or overdraft together with interest thereon;",
                      "Agrarian Development Act, No. 46 of 2000 80",
                      "maintenance with reference to any minor irrigation works includes any operation for the protection of any existing irrigation work or the irrigable areas thereunder;",
                      "member of the family with reference to any person means the spouse or a son or daughter of that person who is less than eighteen years of age;",
                      " irrigation work means an irrigation work serving up to two hundred acres of agricultural land;",
                      "occupier means the person for the time being entitled to the use and occupation of agricultural land by virtue of his being the lessee or usufructuary mortgagee and shall include a person in use and occupation of agricultural lands alienated under the land Development Ordinance, the Crown Lands Ordinance or any other enactment and includes a tenant cultivator within the meaning of this Act;",
                      "owner cultivator with reference to any extent of paddy land means the person who is the owner or usufructuary mortgagee of such extent and who is the cultivator of the entirety of such extent and in the case of an extent of paddy land which has been alienated under the Land Development Ordinance the person who derives title to such extent and who is the cultivator of the entirety of such extent shall be deemed to be the owner cultivator of such extent;",
                      "paddy land means land which is cultivated with paddy or is prepared for the cultivation of paddy or which, having at any time previously been cultivated with paddy, is suitable for the cultivation of paddy, and includes such other land adjoining or appertaining to it as may be used by the cultivator for a threshing floor or for constructing his dwelling house, but does not include chena land or any land,",
                      "Agrarian Development Act, No. 46 of 2000 81",
                      "which, with the permission of the Commissioner- General is used for any purpose other than cultivation in accordance with the provisions of this Act, or which is determined by the Commissioner-General not to be paddy land;",
                      "peace officer has the same meaning as in the Code of Criminal Procedure Act, No. 15 of 1979;",
                      "prescribed means prescribed by this Act, or by any regulation made thereunder;",
                      "prescribed bank means any bank which is prescribed;",
                      "statutory tenant means a person who cultivates an extent of paddy land under a deed under the Land Development  Ordinance or under a written contract obtained from the Commissioner -General.",
                      "threshing floor means a floor which has been prepared or is being used, for the purpose of threshing paddy, clearing paddy or for the purpose of heaping paddy manually or by the use of cattle or machinery;",
                      "watercourse means any river or small rivulet, oya,  ela or a natural ela or a ela which has been prepared for the water to flow from time to time,  rivulet or a waterway from which the water flows or a branch of such rivulet and includes a width on either side of the bank equivalent to the width from the centre of the stream to the bank of the stream.",
                      "Agrarian Development Act, No. 46 of 2000 82",
                      "SCHEDULE (section 33)",
                      "To the Magistrates Court of(state name of the Magistrates Court)",
                      "I, (state name) the Commissioner-General/Additional Commissioner-General/Commissioner/Deputy Commissioner/Assistant Commissioner, do by virtue of the powers vested in my by section 33 of the Agrarian Development Act, No 46 of 2000 do by this application",
                      "( a ) set forth the following matters, namely :",
                      "(i) that I am the Commissioner General/Commissioner/Deputy Commissioner/Assistant Commissioner;",
                      "(ii) that the land described in the Schedule to this application is paddy land;",
                      "(iii) that of  is acting in contravention of subsection (1) of section 33 of the Agrarian Development Act, No. 46 of 2000.",
                      "( b ) pray for the issue of an order restraining the said or his agent or servants from acting in contravention of the said provisions of subsection (1) of section 33 of the Agrarian Development Act.",
                      "SCHEDULE ABOVE REFERRED TO",
                      "The paddy land situated in : The Village  in the Grama Niladari  Division of  in the Divisional Secretarys Division of Bounded on the North South East West",
                      "and containing in extentacresroods perches.",
                      "Signature of the Commissioner-General/Additional Commissioner- General/Commissioner/Deputy Commissioner/ Assistant Commissioner of Agrarian Development.",
                      "Date:",
                      "Agrarian Development Act, No. 46 of 2000 83",
                      "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), payable to the S UPERINTENDENT , G OVERNM   ENT  P UBLICATIONS  B UREAU , N O . 32, T RANSWORKS  H OUSE , L OTUS  R OAD , C OLOMBO  01 before 15th December each year in respect of the year following."
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}