{
  "n_pages": 4,
  "title_page": {
    "title": "Shop And  Office  Employees (Regulation Of Employment And Remuneration)   (Amendment) Act",
    "num": "14",
    "year": "2018",
    "date_certified": "2018-06-18",
    "date_published": "2018-06-22",
    "price": 8.0,
    "price_postage": 10.0
  },
  "body_pages": {
    "preamble": [
      "1",
      "[Certified On 18Th Of June, 2018]",
      "L.D.O. 29/2009.",
      "A N   Act   To   Amend   The  S Hop   And  O Ffice  E Mployees  (R Egulation   Of E Mployment   And  R Emuneration ) A Ct  (C Hapter  129)",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Shop and Office Employees (Regulation of  Employment and Remuneration) (Amendment)   Act, No. 14 of  2018.",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "Section 18 of the Shop and Office Employees (Regulation of Employment and Remuneration) Act (Chapter 129) is hereby amended, as follows:",
            "pre_block_list": [
              "Amendment of section 18 of Chapter 129."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "in section 18 B  thereof",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "by the repeal of subsection (2) of that section and the substitution therefor of the following subsection:",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "A female employee to whom this Part applies, shall, if she is confined, be entitled to take leave for a period of:",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "seventy days commencing on the date of her confinement, if the confinement results in the delivery of live child; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "twenty eight days commencing on the date of her confinement, if the confinement does not result in the delivery of a live child,",
                    "pre_block_list": [
                      "and the employer shall allow such leave.;",
                      "( b ) by the repeal of subsection (4) of that section.",
                      "(2)  by the insertion immediately after section 18 H  of that section which shall have effect as section 18 I thereof:",
                      "18 I . The employer of a female employee in any shop or office shall, if she is nursing a child under one year of age, allow her, in any period of nine hours, two nursing intervals at such times as she may require. Each interval shall, where a creche or other suitable place is provided by such employer to such female employee for nursing such child, be not less than thirty minutes, and where no creche or other suitable place is so provided, be not less than one hour, and shall be in addition to any interval provided to such female employee for meals or rest under any written law and be regarded, for the purposes of her employment, as time during which she has worked in her employment",
                      "",
                      "Provision of nursing intervals for nursing mothers."
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency.",
              "3",
              "English Acts of the Parliament can be purchased at the P RAKASHANA  P IYASA , D EPARTMENT   OF G OVERNMENT  P RINTING , N O . 118, D R . D ANISTER  D E  S ILVA  M AWATHA , C OLOMBO  8."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}