{
  "n_pages": 5,
  "title_page": {
    "title": "Industrial Disputes (Amendment) Act",
    "num": "56",
    "year": "1999",
    "date_certified": "1999-12-31",
    "date_published": "2025-12-31",
    "price": 4.5,
    "price_postage": 3.5
  },
  "body_pages": {
    "preamble": [
      "Industrial Disputes (Amendment) Act, No. 56 Of 1999 1",
      "[Certified On December 31, 1999]",
      "A N  A Ct   To   Amend   The  I Ndustrial  D Isputes  A Ct",
      "L.D.O. 16/95.",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as Industrial Disputes (Amendment) Act, No. 56 of 1999.",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "The following new Part is hereby inserted immediately after Part V of the Industrial Disputes Act (hereinafter referred to as the Principal enactment) and shall have effect as Part V A  of that Act :",
            "pre_block_list": [
              "Insertion of new part V in Chapter 131.",
              "Part V A",
              "U NFAIR  L ABOUR  P RACTICES",
              "32 A No employer shall ",
              "Prohibition of unfair labour practices by employers."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "require a workman to join, or refrain from joining, any trade union, or to withdraw  from or to refrain from withdrawing from, his membership of a trade union of which he is a member, as a condition of his employment ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "dismiss a workman by reason only of his membership of a trade union or of his engaging in trade union activities ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "give any inducement or promise to a workman for the purpose of preventing him from becoming, or continuing to be, a member, office bearer or representative of a trade union ;",
                "pre_block_list": [
                  "H-022545",
                  "Industrial Disputes (Amendment) Act, No. 56 of 1999 2"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "prevent a workman from",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "i",
                    "text": "forming a trade union ; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "supporting a trade union by financial or other means ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "interfere with the conduct of the activities of a trade union ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "dismiss, or otherwise take disciplinary action against, any workman or office- bearer of a trade union",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "i",
                    "text": "for any statement made by such workman or office-bearer in good faith before any tribunal or person in authority ; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "for any statement regarding acts or omissions of the employer relating to the terms and conditions of employment, of the members of such trade union made by such workman or office-bearer, in pursuance of an industrial dispute for the purpose of securing redress or amelioration of working conditions of such members ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "g",
                "text": "refuse to bargain with a trade union which has in its membership not less than forty  per centum  of the workmen on whose behalf such trade union seeks to bargain.",
                "pre_block_list": [
                  "Industrial Disputes (Amendment) Act, No. 56 of 1999 3",
                  "For the purpose of this paragraph the Commissioner of Labour or an officer authorized by him in that behalf may conduct a poll at any work place in order to ascertain whether at least forty  per centum  of the workmen on whose behalf the trade union seeks to bargain with the employer, are members of such trade union",
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "Section 40 of the principal enactment is hereby amended in subsection (1) of that section, by the insertion immediately after paragraph ( S ) of that subsection of the following  new paragraph :",
            "pre_block_list": [
              "Amendment of section 40 of the principal enactment.",
              "( ss ) being an employer, contravenes the provisions of section 32 A  ;."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "Section 43 of the principal enactment is hereby amended as follows :",
            "pre_block_list": [
              "Amendment of section 43 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "in subsection (1) of that section, by the substitution, for the words commits any offence under this Act shall, of the words  commits any offence under this Act, other than an offence under section (40) (1) (ss), shall ; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the insertion, immidiately after subsection (1) of that section, of the following subsection :",
                "pre_block_list": [
                  "(1A) Every person who commits an offence under section 40 (1) ( ss ) shall be liable on conviction after summary trail before a magistrate to a fine not exceeding twenty thousand rupees",
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala Text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency.",
              "Annual subscription of English Bills and Acts of the Parliament Rs.885 (Local). Rs.1,180 (Foreign). Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , N O . 32, T RANSWORKS  H OUSE , L OTUS  R OAD , C OLOMBO  01 before 15 th December each year in respect of the year following."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}