{
  "n_pages": 10,
  "title_page": {
    "title": "Public  Service  Pensioners  Trust Fund  Act",
    "num": "40",
    "year": "1999",
    "date_certified": "1999-11-30",
    "date_published": "1999-12-03",
    "price": 6.75,
    "price_postage": 3.5
  },
  "body_pages": {
    "preamble": [
      "[Certified On 30Th November, 1999]",
      "L.D. - O. 57/96. A N  A Ct   To   Provide   For   Establishment   Of   A   Trust   Fund",
      "Called   The  P Ublic  S Ervice  P Ensioners  T Rust  F Und  ;  To",
      "Specify   Its   Objects   And   Powers   And   To   Provide   For   Matters                Connected   Therewith   Or   Incidental   Thereto",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :-"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Public Service Pensioners Trust Fund Act, No.40 of 1999, and shall come into operation on such date (hereinafter referred to as the appointed date) as the Minister may appoint by Order published in the Gazette.",
            "pre_block_list": [
              "Short title and date of operation."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be established a Trust Fund which shall be called the Public Service Pensioners Turst Fund  (hereinafter referred to as  the Fund) (2) The Fund shall, by the name assigned to it by subsection (1), be a body corporate and shall have perpetual succession, and a common seal and may sue and be sued in such name.",
                "pre_block_list": [
                  "Establishment of the Public Service Pensioners Trust Fund."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The administration, management and control of the Fund shall be vested in an Executive Committee consitituted as hereinafter provided, subject to the direction and control of the General Council. (2) The Executive Committee shall consist of -",
                "pre_block_list": [
                  "Executive Committee."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "a Chairman, three Vice- Chairmen, a Secretary, and Assistant Secretary, a Treasurer and an Assistant Treasurer, elected by the General Council ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "one  representative    from    each   district   level Pensioners Association.",
                    "pre_block_list": [
                      "(3) A member of the Executive Committee shall, unless he dies, resigns from office by letter addressed to the Chairman or Secretary , or is removed from office  by the General Council or the district level Pensioners Association, as the case may",
                      "H- 022545",
                      "be, hold office from the date of his election or nomination, as the case may be, until the next annual general meeting of the General Council."
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "The General Council shall consist of the members of the Executive Committee, one representative from each district level Pensioners Association and one representative from each divisional leval Pensioners Association. It shall be the duty of the General Council to determine the guidelines for the administration and management of the Fund, by the Executive Committee.",
            "pre_block_list": [
              "General Council."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The General Council shall meet once a year.",
                "pre_block_list": [
                  "Meetings of the General Council."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "the Director of Pensions shall summon the first annual meeting of  the General Council, and shall preside at, and conduct that meeting.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The District Secretary for an Adminstrative District shall summon the first meeting of the Pensioners Association formed for that Administrative District, and shall preside at, and conduct such meeting.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The Divisional Secretary for a Divisional Secretarys Division shall summon the first meeting of the Pensioners Association formed for that Divisional Secretary;s  Division and shall preside at, and conduct such meeting.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "The Executive Committee shall be elected or nominated as the case may be at the Annual Meeting of the General Council.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "At least fourteen days notice in writing shall be given by any member of the General Council to the Secretary, of any motion required to be brought up at the annual meeting of the General Council.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "The agenda of the annual meeting , of the General Council shall be notified in writing , by the Secretary , to all members of the General Council at least seven days before such meeting.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "The quorum at the annual meeting of the General Council shall be one third of the total membership of the General Council.",
            "pre_block_list": [
              "Quorum at Annual Meeting."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "the Executive Committee shall meet at least once in every month.",
                "pre_block_list": [
                  "Meetings of the Executive Committee."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Executive Committee may call a special meeting of the General Council at any time to deal with urgent matters.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The agenda of such a special meeting of the General Council shall be notified in writing by the Secretary to all members of the General Council at least seven days before such meeting.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "No business other than that specified in the notice summoning a special meeting of the General Council shall be transacted at such meeting.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "The quorum at a special meeting of the General Council shall be one third of the total membership of the General Council.",
            "pre_block_list": [
              "Quorum at special Meeting"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Chairman shall preside at every meeting of the Executive Committee. In the absence of the Chairman from any meeting of the Executive Committee, one of the Vice- Chairmen shall preside at such meeting.",
                "pre_block_list": [
                  "Meetings of the Executive Committee"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Subject to the provisions of this Act and any rules made thereunder, the Executive Committee may regulate the procedure in regard to its meetings and the transaction of business at such meetings.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "No act or proceeding of the Executive Committee shall be deemed to be invalid by reason only of the existence of a vacancy among its members or any defect in the election or nomination of a member thereof.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "10",
            "text": "The object of the Fund shall be to promote the gen- eral well- being of pensioners, by assisting them to maintain their integrity dignity.",
            "pre_block_list": [
              "The object of the Fund."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "11",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "the Executive Committee shall, in the name of the Fund but subject to the direction and control of the General Council have the power to do all things necessary for, or conducive or incidental to, the carrying out of the object of the Fund.",
                "pre_block_list": [
                  "Powers and functions of the Executive Committee."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Without prejudice to the generality of the powers conferred by subsection (1) the Executive Committee shall have the following powers :-",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "to acquire, hold, take or give on lease or hire, mortgage, pledge and sell or otherwise dispose of, any movable or immovable property ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "to open and maintain current, savings or deposit accounts in any bank or banks ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "to employ such officers and servants as may be necessary for the purpose of administering and managing the fund ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "to enter into all such agreements as may be necessary for the purpose of carrying out the object of the Fund ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "to do all such other acts and things as are incidental or conducive to the carrying out the object of the Fund.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "12",
            "text": "The seal of the Fund shall be in the custody of such persons as the Executive Committee may from time to time determine. The seal shall not be affixed to any instrument or document except with the sanction of the Executive Committee and in the presence of the Chairman and the Treasurer or Vice chairman or an Assistant Secretary, who shall sign the instrument or document in token of their presence, and such signing shall be independent of the signing of any person as a witness.",
            "pre_block_list": [
              "Seal of the Fund.",
              "Monthly deduction from pensions."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "13",
            "text": "There shall be deducted from the monthly pension payable to a pensioner, such sum as may be determined if such pensioner consents in writing to such deduction. All deductions made in pursuance of the provisions of this section, shall be credited to the Fund.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "14",
            "text": "there shall be paid into the Fund -",
            "pre_block_list": [
              "Payment to the Fund."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "All deductions made under section 13 ; (b)  all funds raised, or grants, gifts or donations received, by the Fund, from local or foreign sources; (c)  all income derived from investments of the Fund.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "15",
            "text": "There shall be paid out of the Fund -",
            "pre_block_list": [
              "Payment out of Fund."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "all expenses incurred in the working, establishment or maintenance of the Fund ; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "all such other payments as are approved by the Executive Committee as being necessary for the purpose of carrying out the object of the Fund or as are authorised by this Act, to be paid out of the Fund.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "16",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Executive Committee shall cause proper accounts to be kept of the income and expenditure, assets and liabilities, and all other transactions of the Fund.",
                "pre_block_list": [
                  "Audit and Accounts."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "the accounts of the Fund shall be audited, by a qualified auditor elected by the General Council at the previ- ous annual general meeting.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The audit or referred to in subsection (2) shall as soon as practicable after the thirty-first day of December of each year, prepare a report on the administration of the affairs of the Fund, during that year, together with a statement of the income and expenditure of the Fund and of the investment of the money belonging to the Fund during that year. The auditor shall transmit such reports to the Executive Committee which shall cause a copy thereof to be placed before the General Council at the next annual meeting of the General Council.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "In this section the expression qualified auditor means -",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "an individual who, being a member of the Institute of Chartered Accountants of  Sri Lanka or of any other Institute established by law, possesses a certificate to practise as an accountant issued by the Council of such Institute ; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "a firm of Chartered Accountants, each of the resident partners of which, being a member of the Institute, of Chartered Accountants of Sri Lanka, or of any other Institute established by law, possesses a certificate to practise as an Accountant issued by the Council of such Institute.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "17",
            "text": "The Executive Committee may make such rules as it may consider necessary in relation to any matter affecting, or connected with, or incidental to, the exercise, discharge and performance of its powers, duties and  functions. (including provision relating to the election of the Executive Committee by the General Council, election of representatives, of district level Pensioners Associations to the Executive Committee and the summoning and conduct of meetings of the General Council and all matters relating to district level and divisional level Pensioners Associations).",
            "pre_block_list": [
              "Power to make rules."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "18",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "No suit or prosecution shall be instituted against any member of the Executive Committee, or any officer or servant of the Fund for any act which is in good faith done or purported to be done by such member, officer or servant un- der this Act or on the direction of the Executive Committee.",
                "pre_block_list": [
                  "Protection of members of the Executive Committee for action taken under this Act."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any expenses incurred by the Fund in any suit or prosecution brought by or against the Fund before any Court shall be paid out of the Fund, and any costs paid to or received by the Fund in any such suit or prosecution, shall be credited to the Fund.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Any expenses incurred by any member, officer or servant as is referred to in subsection (1) in any suit or prosecution brought against him before any Court in respect of any act which is done or purported to be done, by him under this Act, or on the direction of the Executive Committee shall, if the Court holds that such act was done in good faith, be paid out of the Fund, unless such expenses are recovered by him in such suit or prosecution.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "19",
            "text": "No writ against person or property shall be issued against any member of the Executive Committee in any action brought against the Fund.",
            "pre_block_list": [
              "No writ to issue against person or property of member of the Executive Committee."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "20",
            "text": "The Fund shall be deemed  to be a Scheduled Institution within the meaning of the Bribery Act and the provisions of that Act shall  apply accordingly.",
            "pre_block_list": [
              "Fund deemed to be a Scheduled Institution within the meaning of the Bribery Act."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "21",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "22",
            "text": "in this Act, unless the context otherwise requires -",
            "pre_block_list": [
              "Interpretation.",
              " District Level Pensioners Association means an association of  pensioners formed for an administrative district ;",
              " Divisional Level Pensioners Association means an association of pensioners formed for a divisional secretaries division ;",
              "Pensioner means a person who is in receipt of pension out of funds provided by the Government _"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "by virture of his service as a public officer, a mem- ber of the Local Government Service constituted under the Local Government Service Law, No.16 of 1974 or a member of the armed forces ;",
                "pre_block_list": [
                  "Annual subscription of English Bills and Acts of the Parliament Rs.885 (Local). Rs.1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , No. 32, T RANSWORKS  H OUSE , L OTUS  R OAD , C OLOMBO  01 before 15th December each year in respect of the year following."
                ],
                "child_level_list": []
              }
            ]
          }
        ]
      }
    ]
  }
}