{
  "n_pages": 14,
  "title_page": {
    "title": "Economic Service Charge Act",
    "num": "13",
    "year": "2006",
    "date_certified": "2006-03-31",
    "date_published": "2006-03-31",
    "price": 16.75,
    "price_postage": 5.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 31St March, 2006]",
      "L.D.O. 11/2006.",
      "A N  A Ct   To   Impose   An  E Conomic  S Ervice  C Harge   On   The   Relevant",
      "Turnover   Of   Any   Person   Or   Partnership   In   Respect   Of   Every",
      "Quarter   Of   Every   Year   Of   Assessment   Commencing   On   Or   After A Pril  1, 2006 ;  To   Amend  P Art  I  Of   The  F Inance  A Ct , N O . 11  Of 2004 ;  And   To   Provide   For   Matters   Connected   Therewith   Or",
      "Incidental   Thereto",
      "Be    It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:-"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Economic Service Charge Act, No. 13 of 2006.",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "I",
        "text": "",
        "pre_block_list": [
          "I MPOSITION   OF   AN  E CONOMIC  S ERVICE  C HARGE"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "An Economic Service Charge (hereinafter referred to as  the service charge) shall, subject to the provisions of this Act, be charged from every person and every partnership for every quarter of every year of assessment commencing on or after April, I, 2006 (hereinafter in this Act referred to as a relevant quarter) in respect of every part of the relevant turnover of such person or partnership for that relevant quarter, at the appropriate rate specified in the Schedule to this Act:",
                "pre_block_list": [
                  "Imposition of an Economic Service Charge."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Notwithstanding the provisions of subsection (1), the service charge shall not be charged from any person or partnership for any relevant quarter, in circumstances wherein the relevant turnover of such person or partnership for that relevant quarter does not exceed rupees ten million:",
                "pre_block_list": [
                  "Provided that the service charge chargeable from any person or partnership for any relevant quarter shall in no case exceed rupees fifteen million.",
                  "2PL 00106611,150 (03/2006)"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "In this section",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "relevant turnover in relation to any person or partnership and to any relevant quarter means  the aggregate turnover for that relevant quarter of   every trade, business, profession or vocation carried on or exercised  by such person or partnership, as the case may be, in Sri Lanka whether directly or through an agent or more than one agent :",
                    "pre_block_list": [
                      "Provided that the relevant turnover for any relevant quarter shall not include the turnover for that relevant quarter of any trade, business profession or vocation, the commercial operations of which commenced, whether by such person or partnership or any other person or partnership, on a date which falls within the period of thirty six months immediately preceding the first day of that relevant quarter.",
                      "For the purposes  of the  proviso the expression trade or business in relation to any person or partnership shall not include any trade or business which deals in the wholesale or retail of any goods not manufactured or produced by such person or partnership."
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "turnover in relation to any trade, business, profession or vocation and to any relevant quarter means the total amount receivable, whether actually received or not, from every transaction entered  into in that relevant quarter in the course of such trade, business, profession or vocation carried on or exercised by such person or partnership, -",
                    "pre_block_list": [
                      "( a ) after deducting therefrom "
                    ],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "any sum included in such total amount being a sum which represents the value added tax in   respect of that transaction, provided that the person or partnership",
                        "pre_block_list": [
                          "who or which carries on or exercises such trade, business, profession or vocation is at the time of such transaction registered under section 10 of the Value Added Tax Act, No. 14 of 2002;"
                        ],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "any sum included in such total amount being the proceeds from the disposal of any capital asset;  and",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "the amount of any bad debt incurred by that trade, business, profession or vocation during that relevant quarter, being an amount which had been included in the relevant turnover of such trade, business, profession or vocation of that or any previous relevant quarter; and",
                        "pre_block_list": [
                          "( b ) after adding thereto, any sum received during that relevant quarter on account of any bad debt written off or allowed in any previous quarter :",
                          "Provided that ",
                          "( a ) in the case of a bank, the receipts of such bank by way of, or on account of , interest, discounts, dividend, exchange, service charges, commissions, brokerage or any other income derived by the bank in the course of its business shall be deemed to form part of the turnover of such bank; and",
                          "( b ) in the case of a person carrying on insurance business, insurance premia received, or receivable, in respect of ",
                          "(i) life insurance; and",
                          "(ii) insurance against damages or destruction by strike, riot, civil commotion, or acts of terrorism and paid into the Consolidated Fund,",
                          "shall be deemed not to form part of the turnover of such person."
                        ],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The amount of any service charge paid by any person for any relevant quarter shall be deducted from the income tax if any, payable by that person for the year of assessment of which that relevant quarter is a quarter (hereinafter referred to as the first  mentioned year of assessment).",
                "pre_block_list": [
                  "Service charge to be deducted from relevant income tax."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The amount of any service charge paid by any partnership for any relevant quarter shall be apportioned among the partners of such partnership in the ratio in which such partners share the profits or losses of such partnership for the year of assessment of which that relevant quarter is a quarter. The amount of the service charge so apportioned to any partner, shall be deducted from the income tax, if any payable by such partner for the year of assessment of which that relevant quarter is a quarter (hereinafter referred to as the first  mentioned year of assessment).",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The balance, if any, of such service charge paid by any person, after its deduction in accordance with subsection (1) shall be deducted from the income tax payable by such person for the year of assessment immediately succeeding the first mentioned year of assessment (hereinafter referred to as the first succeeding  year of assessment).",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The balance, if any, of any service charge apportioned to any partner in accordance with subsection (2), after its deduction in accordance with subsection (2),  shall be deducted from the income tax payable by such partner for",
                "pre_block_list": [
                  "the year of assessment immediately succeeding the first- mentioned year of assessment (hereinafter referred to as the first succeeding year of assessment)."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "The residue, if any, of the balance referred to in subsection (3) or subsection (4), as the case may be, after its deduction in accordance with subsection (3) or subsection (4) as the case may be, shall be deducted from the income tax payable by such person or such partner of such partnership, as the case may be, for the year of assessment immediately succeeding the first succeeding year of assessment (hereinafter referred to as the second succeeding year of assessment).",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "In no circumstances shall",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the aggregate deduction of the amount of the service charge paid by any person or paid by any partnership and apportioned to any partner, as the case may be, from the income tax payable by such person or such partner of such partnership, as the case may be, exceed the amount of such service charge,",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the remaining portion, if any of the residue referred to in subsection(5) after its deduction in accordance with subsection (5), be deducted from any income tax payable for any year of assessment succeeding the second succeeding year of assessment.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "Notwithstanding anything to the contrary in any law, the remaining portion of the service charge referred to in sub- paragraph ( b ) of subsection (6) of section 3, shall not be refunded.",
            "pre_block_list": [
              "Remaining portion of the service charge not to be refunded"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "Every person and every partnership chargeable or likely to be chargeable with the service charge for any relevant quarter shall, by communication in writing addressed to the Commissioner General, give notice of such chargeability or likely chargeability, before the fifteenth day of the last month of that relevant quarter. Such communication",
            "pre_block_list": [
              "Notice of chargeability",
              "shall disclose the income tax file number or the personal identification number as the case may be, assigned by the Commissioner-General, to such person or partnership."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "The service charge which any person or partnership is chargeable with for any relevant quarter shall, notwithstanding that no assessment has been made on such person or partnership by an Assessor, be paid to the Commissioner-General on or before the twentieth day of the month immediately succeeding the end of that relevant quarter.",
            "pre_block_list": [
              "Date on which service charge is to be paid."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "Every person and partnership chargeable with the service charge for any relevant quarter shall, whether or not required by an Assessor in that behalf, furnish to an Assessor, on or before the twentieth day of the month immediately succeeding the end of that relevant quarter, a return in such form and containing such particulars as may be specified by the Commissioner General, of his or its, as the case may be relevant turnover.  The return shall also show the basis of the calculation of the service charge and other details, if any specified by the Commissioner General under this section.",
            "pre_block_list": [
              "Furnishing of returns."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "Every person and partnership chargeable with the service charge shall maintain a record of the transactions of every trade, business, profession or vocation carried on or exercised by such person or partnership, in such manner as would facilitate the reconciliation of the return of relevant turnover furnished by such person or partnership under section 7 of this Act, with such record.",
            "pre_block_list": [
              "Maintenance of records."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "Where in the opinion of an Assessor, any person or partnership who or which being chargeable with the service charge for any relevant quarter -",
            "pre_block_list": [
              "Assessor to make assessment in certain cases."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "has not paid the service charge: or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "has paid an amount less than the proper amount which such person or such partnership ought to have paid as service charge for such relevant quarter,",
                "pre_block_list": [
                  "such Assessor may, assess the amount of the service charge which, in his opinion, ought to have been paid by such person or partnership as the service charge for that relevant quarter and shall by notice in writing require such  person or partnership to forthwith pay "
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "i",
                    "text": "the amount of the service charge so assessed for that relevant quarter, if that person or that partnership has not paid any service charge for that relevant quarter; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "the difference between the amount of the service charge so assessed and the amount of the service charge actually paid by such person or partnership for that relevant quarter, if such person has paid any amount as service charge for that relevant quarter.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "10",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where any service charge or any part of such service charge for any relevant quarter is not paid on or before the date specified in section 6 for the payment of such service charge, such instatement or part thereof shall be deemed to be in default.",
                "pre_block_list": [
                  "Service charge not paid deemed to be in default"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where the service charge or part thereof which is in default is payable, -",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "by an individual;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "by a partnership;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "by a company or body of persons,.",
                    "pre_block_list": [
                      "then such individual, every partner of such partnership or every director or other principal officer of such company or body of persons as the case may be, shall be deemed to be a defaulter for the purposes of this Act.",
                      "Certain provisions of the Inland Revenue Act to apply"
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "11",
            "text": "The provisions of Chapter XXIII, XXIV, XXV, XXVI, XXVII, XXVIII, XXIX, XXX and XXXI of the Inland Revenue Act, relating respectively to  Appeals,  Finality of Assessments and Penalty for Incorrect Returns, Tax in Default and Sums Added thereto, Recovery of Tax, Miscellaneous Matters, Repayment, Penalties and Offences, Administration and General matters shall  mutatis mutandis , apply respectively to  Appeals, Finality of Assessments and Penalty for Incorrect Returns, Service Charge in Default and Sums Added Thereto, Recovery of Service Charge, Miscellaneous Matters, Repayment, Penalties and Offences, Administration and General matters under this Act.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "12",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Minister may make regulations in respect of all matters which are required by this Act to be prescribed or in respect of which regulations are required or authorized to be made under this Act.",
                "pre_block_list": [
                  "Regulations"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "In particular and without prejudice to the generality of the powers conferred by subjection (1), the Minister may make regulations-",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "specifying the guidelines relating to the ascertainment of turnover for the purposes of section 2 in relation to any case to which the proviso to the definition of the expression turnover in that section does not apply; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "specifying the instances as to whether or not the non-chargeability referred to in subsection (2) of section 2, in the circumstances referred to in that subsection shall apply.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every regulation made under subsection (1) shall be published in the  Gazette  and shall come into operation on the date of publication, or on such later date as may be specified therein.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Every regulation made under subsection (1) shall, as soon as convenient after its publication in the  Gazette , be placed before Parliament for approval.  Every regulation which is not so approved shall be deemed to be rescinded as from the date of disapproval, but without prejudice to anything previously done thereunder.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "13",
            "text": "In this Act unless the context otherwise requires",
            "pre_block_list": [
              "Interpretation.",
              "agent, allowance for depreciation and Assessor shall have the respective meanings assigned to them in the Inland Revenue Act;",
              "BOI enterprise in relation to any relevant quarter means any enterprise in relation to which the exemption of its profits and income from income tax, in terms of any agreement entered into by the Board of Investment of Sri Lanka with such enterprise under section 17 of the Board of Investment of Sri Lanka Law, No. 4 of 1978, subsists during the whole or any part of that  relevant quarter ;",
              "body of persons, business, capital asset, Commissioner General, and company shall have the respective meanings assigned to them in the Inland Revenue Act ;",
              "distributor in relation to any manufacturer or producer of any goods in Sri Lanka means any person or partnership appointed by such manufacturer or producer for the sale in the wholesale market, of such goods, at such price as may be determined by such manufacturer or producer, from time to time ;",
              "Inland   Revenue  Act  means  the    Inland   Revenue Act, No.10 of  2006 or any successor thereto providing for the taxation of income ;",
              "partnership, proceeds and profits or income shall have the respective meanings assigned to them in the Inland Revenue Act ;",
              "person includes a company or a body of persons, but does not include "
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "any registered society, within the  meaning of the Co-operative Societies Law,  No. 5 of 1972:",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "any non-resident person carrying on business as an owner or charterer of an  aircraft or ship:",
                "pre_block_list": [
                  "quarter in relation to any year of assessment means the period of three months commencing on the first day respectively of April, July, October or January of that year of assessment ; and",
                  "statutory income, taxable income, trade and  years of assessment shall have the respective meanings assigned to them in the Inland Revenue Act."
                ],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "II",
        "text": "",
        "pre_block_list": [
          "A MENDMENT   OF  P ART  I  OF   THE  F INANCE A CT , N O . 11  OF  2004"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "14",
            "text": "Part I of the Finance Act, No. 11 of 2004 is hereby amended as follows:-",
            "pre_block_list": [
              "Amendment of Part I of Act, No. 11 of 2004."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "in subsection (1) of section 2 thereof, by the substitution for the words on or after April 1, 2004 (hereinafter in this Act referred to as the relevant year of assessment) of the words on or after April 1, 2004 (hereinafter in this Act referred to as the relevant year of assessment) and ending on March 31, 2006,;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "in paragraph ( b ) of subsection (2) of section 7  thereof, (inserted by Act, No. 7 of 2005) by the substitution for the words and figures item (2) of the words and figures item (3).",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "15",
            "text": "It is hereby declared for the avoidance of doubts, that the provisions of Part I of the Finance Act No. 11 of 2004 shall not apply to the levy of the Economic Service Charge from any person or partnership in respect of any relevant year of assessment commencing on or after April 1, 2006.",
            "pre_block_list": [
              "Part I of the Finance Act No.11 of 2004 not to apply"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "16",
            "text": "Where there is any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency",
              "SCHEDULE (Section 2)",
              "0.25  percentum",
              "1. Such  part  of  the relevant  turnover as  consists  of  the  turnover  from any trade, business, profession  or vocation the  profits  and  income from which  are exempt  from income  tax.",
              "2. Such  part  of  the  relevant  turnover as  consists of  the  turnover  from any trade, business, profession  or vocation  of any enterprise which has entered into an agreement under the Board of Investment of Sri Lanka Law, N O . 4 of 1978.",
              "0.25  percentum"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "being the relevant turnover during the period for which the profits and income of such enterprise are exempt from income  tax  under  such agreement.",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "being the relevant turnover during the period for which the profits and income of such",
                    "pre_block_list": [
                      "0.50  percentum",
                      "enterprise are taxable at the rate equal to a rate specified in the Fifth Schedule to the Inland Revenue Act",
                      "3. Such  part  of  the  relevant   turnover as  consists of  the  turnover  from any  trade, business, profession  or vocation  the  profits  and  income from  which are  chargeable  with income  tax  at  any  rate  specified in  the   Fifth Schedule  to  the Inland  Revenue  Act other than in item 28 of that schedule",
                      "0.5  percentum",
                      "1.0  percentum",
                      "4. Such  part  of  the   relevant   turnover as  consists of  the  turnover  from any  trade, business, profession  or vocation the  profits  and  income from  which  are  chargeable  with income  tax  at  any  rate  other than any  rate  specified  in  the  Fifth Schedule  to  the  Inland  Revenue Act.",
                      "5. Such  part  of  the  relevant  turnover as  consists of  the  turnover  from any  trade or business which deals in the wholesale (other than as a distributor) or retail of such goods, not manufactured or produced by the dealer.",
                      "0.5  percentum",
                      "6. Such  part  of  the   relevant   turnover as  consists of  the  turnover  from the primary conversion of any produce of any tea, rubber or coconut plantation other than any such conversion which produces any alcoholic beverage.",
                      "0.5  percentum",
                      "7. Such part of the relevant turnover as consists of the turnover from any trade, or business of a distributor",
                      "0.1  percentum",
                      "1.00  percentum",
                      "8. Such part of the relevant turnover as consists of the turnover from any trade or business of carrying on any activity referred to in item 28 of the Fifth Schedule to the Inland Revenue Act.",
                      "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , N O . 32, T RANSWORKS H OUSE , L OTUS  R OAD , C OLOMBO  01 before 15th December each year in respect of the year following."
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}