{
  "n_pages": 47,
  "title_page": {
    "title": "National  Audit   Act",
    "num": "19",
    "year": "2018",
    "date_certified": "2018-07-17",
    "date_published": "2018-07-20",
    "price": 48.0,
    "price_postage": 105.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 17Th Of July, 2018]",
      "L.D.O. 3/2015",
      "A N  A Ct   To   Provide   For   The   Powers ,  Duties   And   Functions   Of   The A Udit  S Ervice  C Ommission ;  The   Establishment   Of   The   Office   Of",
      "The  N Ational  A Udit  O Ffice   And   The  S Ri  L Anka  S Tate  A Udit S Ervice ;  To   Specify   The   Role   Of   The  A Uditor -G Eneral   Over",
      "Public   Finance   And   To   Make   Provision   For   Matters   Connected",
      "Therewith   Or   Incidental   Thereto .",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "This Act may be cited as the National Audit Act, No. 19 of 2018.",
                "pre_block_list": [
                  "Short title and date of operation."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The provisions of this Act shall come into operation on such date as the President may appoint by Order published in the  Gazette  (hereinafter referred to as the appointed date).",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "The provisions enshrined in Articles 153, 153 A , 153 B , 153 C , 153 D , 153 E , 153 F , 153 G , 153 H  and 154 of the Constitution, the provisions of this Act and any other written law, as may be applicable, shall apply to audits of auditee entities and matters connected therewith.",
            "pre_block_list": [
              "Applicable law pertaining to audits."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "I",
        "text": "",
        "pre_block_list": [
          "S COPE   OF   AUDITS   CARRIED   OUT   BY    THE  A UDITOR -G ENERAL"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Auditor-General shall",
                "pre_block_list": [
                  "Scope of audit in relation to auditee entities."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "audit all income recevied to the Consolidated Fund and all expenditure from the Consolidated Fund;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "ascertain whether the moneys shown in the accounts of auditee entities as having been",
                    "pre_block_list": [
                      "disbursed were legally available for and applicable to, the services or purposes to which they have been applied for or charged with;"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "determine whether the expenditure conforms to the authority which governs it; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "in each audit, examine income, expenditure, transactions and events.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The scope of an audit carried out by the Auditor- General includes examining the accounts, finances, financial position and prudent management of public finance and properties of auditee entities.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Auditor General shall be responsible to Parliament in carrying out the provisions of this Act.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "Subject to the provisions of section 3, the Auditor-General may examine any matter relating to an auditee entity brought to his notice by any member of the public in writing along with substantial proof of the matters asserted, and report thereon to Parliament.",
            "pre_block_list": [
              "Public to notify Auditor General."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Sri Lanka Auditing Standards determined by the Auditing Standards Committee established under the Sri Lanka Accounting and Auditing Standards Act, No.15 of 1995 shall be applicable to audits undertaken by the National Audit Office established under section 29.",
                "pre_block_list": [
                  "Applicable auditing standards."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where there are no auditing standards specified in the Sri Lanka Auditing Standards for performance audits, environmental audits, technical audits and any other special audits, the Audit Service Commission may, by Order published in the  Gazette , specify the provisions of the International Standards of the Supreme Audit Institutions determined by the International Organization of Supreme Audit Institutions which shall apply to such audits, with necessary amendments to suit local requirements.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "II",
        "text": "",
        "pre_block_list": [
          "P OWERS ,  DUTIES   AND   FUNCTIONS   OF   THE  A UDITOR -G ENERAL"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Auditor-General or any person authorized by him in carrying out an audit shall",
                "pre_block_list": [
                  "Duties and functions of the Auditor- General."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "inspect accounts of any auditee entity including treasuries and initial or subsidiary accounts of such auditee entities;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "require that any accounts, books, papers and other documents which deal with or form the basis of or is otherwise relevant to the transactions to which his duties extend, shall be sent to such place as he may appoint for his inspection;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "question or make such observations as he may consider necessary, from the Chief Accounting Officer of the auditee entity and call for such information as he may require for the preparation of any account or report;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "ensure that the set of financial statements presented for audit by the auditee entity",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "is in accordance with the applicable financial reporting standards;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "have been designed to present a true and fair view of the affairs of the auditee entity for the year under review;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "is consistent with the preceding year; and",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iv",
                        "text": "includes any recommendations made by the Auditor-General in the previous year.",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Auditor-General shall assist the Committee on Public Accounts and the Committee on Public Enterprises to carry out their functions more efficiently and effectively. The Auditor-General shall assist all other Committees of Parliament when such assistance is required.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Notwithstanding the provisions of subsection (1) of section 3, the Minister in charge of any public corporation, business or other undertaking vested in the Government under any written law and companies registered or deemed to be registered under the Companies Act, No. 7 of 2007 in which the Government or a public corporation or a local authority holds fifty  per centum  or more of the shares of that company directly or indirectly may, with the concurrence of the Minister assigned the subject of Finance and in consultation with the Auditor-General, appoint a qualified auditor or auditors to audit the accounts of such auditee entity. Where such appointment has been made by the Minister, the Auditor-General may, in writing, inform such auditor or auditors that he proposes to utilise his or their services for the performance and discharge of the Auditor- Generals duties and functions in relation to such auditee entity and thereupon such auditor or auditors shall act under the direction and control of the Auditor-General.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "In addition to the powers and functions conferred on the Auditor-General under Article 154 (5) of the Constitution, the Auditor-General or any person authorized by him may exercise the following powers in respect of an audit of an auditee entity",
                "pre_block_list": [
                  "Powers of the Auditor-General in carrying out an audit."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "access or call for any written or electronic records or other information relating to the activities of an auditee entity;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "call any person whom the Auditor-General has reasonable grounds to believe to be in possession",
                    "pre_block_list": [
                      "of information and documents, as he may consider necessary to carry on the functions under this Act, to obtain written or oral statements and require the production of any document, from any person, who may be either in - service or otherwise;"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "examine and make copies of or take extracts from any written or electronic records and search for information whether or not in the custody of the auditee entity;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "after obtaining permission from the relevant Magistrates Court, examine and audit any account, transaction or activity of a financial institution, of any person, where the Auditor-General has reason to believe that money belonging to an auditee entity has been fraudulently, irregularly or wrongfully paid into such persons account;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "require any officer of financial   institution to produce any document or provide any information relating to an account, transaction, dealing or activity of person referred to in paragraph ( d ) and to take copies of any document so produced, if necessary;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "obtain the views from the governing body of each auditee entity, on the results of the audit carried out by such officer;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "g",
                    "text": "pay rewards and incentives out of the Audit Fund; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "h",
                    "text": "do all other matters connected or incidental thereto to achieve the purposes of this Act.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any information relating to national security of Sri Lanka the disclosure of which is prejudicial, shall be audited personally by the Auditor-General with the concurrence of the Minister assigned the subject of Defence.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every person shall comply with the provisions of this section, and such compliance shall not be considered as a violation of any written law pertaining to secrecy, confidentiality or non-disclosure.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where any person is called, by the Auditor-General or any person authorized by him, for the purposes of paragraph ( b ) of subsection (1) and such person is unable to appear in person due to unavoidable circumstances, he may nominate with the consent of the Auditor-General a person conversant on the subject to appear before the Auditor-General or any other person authorized by him, on that behalf.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "In the performance and discharge of the duties and functions, the Auditor-General or any officer authorized by him shall not be subject to interference or influence by any person or authority.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "The Auditor-General shall himself exercise, perform and discharge the following powers, duties and functions",
            "pre_block_list": [
              "Powers, duties and functions to be solely carried out by the Auditor- General."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "the appointment of a qualified auditor or an institution having technical, professional or scientific expertise  under Article 154 (4) of the Constitution;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "reporting to Parliament on the performance and discharge of his duties and functions under Article 154 (6) of the Constitution;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "administering the Audit Fund.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The members of the Audit Service Commission, any person appointed to any office under this Act or any other person assisting any such person for the purpose of carrying out the provisions under this Act or a qualified auditor engaged by the Auditor-General for such purpose, except in the performance of his duties under this Act, shall not disclose any information received by him in the performance of his duties under this Act, and shall",
                "pre_block_list": [
                  "Non-disclosure of information."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "not be compelled by any person to disclose any information except on a request of Parliament or by an Order of court or subject to paragraph ( b ) to give effect to the provisions of any written law;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "not disclose any information under any law requiring the disclosure of information without prior consent given in writing of the relevant person or institution providing such information and until the report or statement prepared by the Auditor- General relating to such information has been presented in Parliament, as may be required; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "not enter upon the duties of his office until he makes and subscribes an oath of secrecy as set out in the Schedule hereto. The members of the Audit Service Commission shall subscribe an oath of secrecy before the Speaker of Parliament, while all other persons specified herein shall subscribe the said oath before the Auditor-General.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Subject to the provisions of subsection (1) of this section, any such member or person or qualified auditor who communicates any such matter to any person or suffers or permits any unauthorized person to have access to any books, papers or other records relating to any such matter, commits an offence.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "III",
        "text": "",
        "pre_block_list": [
          "S UBMISSION   OF   REPORTS   AND   STATEMENTS   BY   THE A UDITOR -G ENERAL"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "10",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Auditor-General shall, after the closure of each financial year submit a report to Parliament, within the time limits specified under written law, on the results of the audits carried out by him during the year. The Auditor- General shall include in such report any observation expressed by any auditee entity in regard to his findings.",
                "pre_block_list": [
                  "Auditor-General to submit a Report to Parliament annually."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The submission of the report to Parliament in respect of a particular year shall be completed by the Auditor-General within the time limits specified under written law.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The report under subsection (1) may be made available by the Auditor-General through the official website of the National Audit Office, after such report has been submitted to Parliament.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "11",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Auditor-General shall issue a Summary Report within five months after the closure of each financial year to an auditee entity in respect of any financial statement or any account submitted by such entity, other than an entity referred to in section (12).",
                "pre_block_list": [
                  "Summary Report and Annual Detailed Management Audit Report."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Auditor-General shall present an Annual Detailed Management Audit Report to the governing body of each auditee entity within the five months after the end of each financial year with a copy each to the Minister to whom the respective auditee entity is assigned and the Minister assigned the subject of Finance.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "12",
            "text": "The Auditor-General shall, within three months of the receipt of the approved annual financial statement and other relevant documents and information of a public corporation or a company in which the Government or a public corporation holds fifty  per centum  or more of the shares, present a report to the Chairman of the governing",
            "pre_block_list": [
              "Content of the Auditor- Generals Report pertaining to corporations and companies.",
              "body of such public corporation or company for publication in its annual report, and such report shall state"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "whether the relevant  information and explanations have been obtained reasonably, which in the opinion of the Auditor-General were necessary for the purpose of the audit;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "whether the financial statements have been prepared in accordance with the Sri Lanka Accounting Standards as may be determined by the Auditing Standards Committee, or Sri Lanka Public Sector Accounting Standards, as the case may be, so as to give a true and fair view of the financial position of the entity and the financial performance and the cash flows thereof;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "whether the consolidated financial statements have been prepared in accordance with the Sri Lanka Accounting Standards as may be determined by the Auditing Standards Committee or Sri Lanka Public Sector Accounting Standards ,  as the case may be, so as to give a true and fair view of the financial position of the entity and its financial performance and the cash flows of  such entity and of its subsidiaries and associates as may be applicable;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "whether any member of the governing body of such entity has any direct or indirect interest in any contract entered into by such entity, and if so, the nature of such members interest and the Auditor- Generals own views and comments thereon;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "the reasons for expressing  a qualified, disclaimer, adverse or similar audit opinion on the annual financial statements examined by the Auditor- General;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "whether the auditee entity has or has not complied with any applicable written law or other general or special directions issued by the governing body of the auditee   entity;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "g",
                "text": "whether the auditee entity has performed according to its powers, functions and duties;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "h",
                "text": "whether the resources of the auditee entity had been procured and utilized economically, efficiently and effectively within the time frames and in compliance with the applicable laws; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "any other matter the Auditor-General considers necessary to achieve the purposes of the Act.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "13",
            "text": "The Auditor-General shall report to Parliament on any audit carried out during any financial year and may make such report publicly available through the official website of the National Audit Office and shall not publish the report if he has or intends to provide any report, information, document, book, record or computer generated transcript obtained in the course of the audit to the law enforcement authorities.",
            "pre_block_list": [
              "Special Reports."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "14",
            "text": "The Auditor-General shall table   in Parliament the Status Report of every auditee entity, within nine months after the end of each period of three financial years. The Report shall include the major deficiencies identified, recommendations made by him and preventive measures taken by the auditee entity and the position thereon as at the submission of the report to the Parliament.",
            "pre_block_list": [
              "Triennial Reports."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "15",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Secretary to the Treasury shall submit the financial statements of the Government to the Auditor- General not later than three months after the close of each financial year of the Government.",
                "pre_block_list": [
                  "Submissions of the financial statements of the Government to the Auditor- General."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The annual report of the Ministry of Finance along with the audited financial statements of the Government",
                "pre_block_list": [
                  "and the Auditor-Generals opinion thereon shall be tabled in Parliament by the Minister assigned the subject of Finance before 31 st  May of the following financial year."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "For the purposes of this section",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "financial statement of the Government shall include",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "the statement of financial performance during the financial year, a statement of financial position showing the assets and liabilities of the Government and a cash flow statement for the financial year, accounting policies applied and notes thereto, together with a performance report for such year;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "any other documents which the Auditor- General may require to express his opinion on the said financial statement; and",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "a statement listing of the auditee entities considered in the said financial statement.",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "Government means the Government Institutions for which funds are being allocated by the annual Appropriation Act.   The President may declare by Order published in the  Gazette  any other institution which may be considered as the Government for the purpose of this section;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "Performance report shall include the objectives achieved, future goals, key performance indicators and progress in the use of resources.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "16",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Every auditee entity shall maintain proper books and records of all its income, expenditure, assets and liabilities, to enable annual and periodic financial statements to be prepared in respect of such entity.",
                "pre_block_list": [
                  "Annual financial statements of audited entities."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Annual financial statements including the annual appropriation account, the revenue account and the accounts relating to Advance Account Activities in respect of each Ministry, Department, and any other specified institution and Commission and the annual financial statements in respect of every other auditee entity, shall be submitted by the Chief Accounting Officer to the Auditor-General along with the annual performance reports, within such period as may be provided by rules.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "17",
            "text": "Every public corporation or company in which the Government or a public corporation or a local authority holds fifty  per centum  or more of the shares of that company, shall include in its annual report",
            "pre_block_list": [
              "Annual report of a public corporation or company."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "the report presented by the Auditor-General under section 12 to the Chairman of the governing body of such entity;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "the performance report for the relevant year;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "annual audited financial statements of the entity for the relevant year; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "a future projection report, based on  sustainable development, which may include details of activities to safeguard the environment and mitigate any negative impact on the environment and where necessary include environment and disaster impact assessment analysis.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "18",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Auditor-General shall charge a fee for conducting an audit from the following auditee entities:",
                "pre_block_list": [
                  "Audit fees."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "public corporations and statutory Funds or Boards;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "businesses and other undertakings vested in the Government by or under any written law; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "any company registered or deemed to be registered under the Companies Act, No. 7 of 2007 in which",
                    "pre_block_list": [
                      "the Government or a public corporation or local authority holds fifty  per centum  or more of the shares of that company."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The fee to be charged shall be determined by the Auditor-General in consultation with the Secretary to the Ministry of the Minister assigned the subject of Finance with the concurrence of the Secretary to the relevant Ministry of the Minister assigned the respective auditee entity.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The fee received by the Auditor-General under this section shall be credited to the Consolidated Fund after having deducted the costs incurred in carrying out the audit.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "An   auditee entity shall settle the accounts for audit fees within thirty days from the date of invoice.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "If an auditee entity defaults on the payment of audit fees the Auditor-General shall promptly notify the Ministry of Finance and where applicable, the relevant Provincial Council to recover such fees.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "The Secretary to the Treasury or the Chief Secretary of the relevant Provincial Council, shall after consulting the relevant parties, direct that the audit fees recoverable from an auditee   entity, be defrayed from a vote on the national or a provincial budget identified by the Treasury or relevant Provincial Council.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "IV",
        "text": "",
        "pre_block_list": [
          "I MPOSITION   OF  S URCHARGE"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "19",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "Unless otherwise specifically provided for, in any other written law, the Audit Service Commission shall report the amount of any deficiency or loss in any transaction of an auditee entity where the Audit Service Commission has reasonable grounds to believe that such transaction has been made",
                    "pre_block_list": [
                      "Audit Service Commission   to impose a surcharge.",
                      "contrary to any written law and has caused any deficiency or loss due to fraud, negligence, misappropriation or corruption of those involved in that transaction to the Chief Accounting Officer of the auditee entity for imposition of  a surcharge on the value of the deficiency or loss in every transaction of such auditee entity;"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "Any person involved in causing the deficiency or loss referred to in paragraph ( a ) shall hereinafter be referred to as the person who is responsible for the deficiency or loss.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Chief Accounting Officer of the auditee entity shall charge the surcharge under subsection (1), against any person who is responsible for the deficiency or loss, either jointly or severally, followed by a formal disciplinary action by the Disciplinary Authority or a judicial process.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Chief Accounting Officer of the auditee entity shall, in charging the amount to be recovered, adopt the following procedure:",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "issue a notice to each person in respect of whom the surcharge is to be imposed specifying the reasons for such imposition, and afford an opportunity for each such person to make representation to show cause, in writing in respect of subsections (1) and (2), within a period of twenty one days from the date of receipt of the Notice.The Chief Accounting Officer shall report thereof to the Audit Service Commission;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "consider the representations made under paragraph ( a ) prior to making a decision on the surcharge to be imposed;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "where no representations have been made within the time specified, the Chief Accounting Officer of",
                    "pre_block_list": [
                      "the auditee entity shall proceed to make a decision on the surcharge to be charged;"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "the surcharge shall be decided on the cumulative of the amount of the deficiency or loss and such interest as may have accrued, as charged on the rates for Treasury bills when the deficiency or loss arose;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "the decision of the Chief Accounting Officer of the auditee entity under paragraphs ( b ) and ( c ) shall be communicated forthwith to each person who is responsible for the deficiency or loss by issuing a Surcharge Certificate, specifying the following:",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "the reasons for surcharging;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "the amount to be charged, which includes the deficiency or loss of the transaction, the surcharge decided and any interest percentage, as may be determined, for any delay of payment of the said amounts exceeding two months from the date of payment specified;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "the action contemplated for its recovery;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iv",
                        "text": "the date on or before which the amount specified under item (ii) is to be paid;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "v",
                        "text": "the details of the manner in which payment shall be made.",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The Chief Accounting Officer of the auditee entity shall charge the amount specified under subsection (3)( e )(ii) from the person who is responsible for the deficiency or loss who may be in-service or not in-service at the time of the",
                "pre_block_list": [
                  "audit, within one month of the date of payment as specified in the Surcharge Certificate."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "20",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Any person aggrieved by a decision made by the Chief Accounting Officer of the auditee entity under section 19 may, within one month from the date of receiving the Surcharge Certificate, appeal against such decision to the Surcharge Appeal Committee appointed under section 21.",
                "pre_block_list": [
                  "Appeals to be made to the Surcharge Appeal Committee."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The said Surcharge Appeal Committee may",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "allow the appeal;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "amend, alter or vary the decision; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "disallow the appeal.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "The decision referred to in subsection (1) shall be communicated in writing to the appellant and the Chief Accounting Officer of the auditee entity and the Chairman of the Audit Service Commission through the Chairman of the Surcharge Appeal Committee;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "The Chief Accounting Officer of the auditee entity shall immediately execute the decision and report back to the Audit Service Commission in writing, within one month from the date of issue of such communication.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where any person is dissatisfied by the decision of the Committee, he may appeal to the Court of Appeal within thirty working days from the date of issue of the communication under subsection (3)( b ) of this section.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "The Order of the Court of Appeal shall be communicated by the Chief Accounting Officer of the",
                "pre_block_list": [
                  "auditee entity, in writing to the Chairman of the Audit Service Commission."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "21",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be a Surcharge Appeal Committee (hereinafter referred to as the Committee). The Constitutional Council shall appoint the Committee and its Chairman. The Committee shall consist of not less than five members, from among those having experience in the fields of  auditing, law and public finance management, public administration and engineering,   to hear and determine appeals of any person aggrieved by a decision referred to in section 20.",
                "pre_block_list": [
                  "Appointment of the Surcharge Appeals Committee."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "No member of the National Audit Office and the Sri Lanka State Audit Service shall be a member of the Committee. The Auditor-General shall not be a member of the Committee. The Committee shall act independently of the Auditor-General.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "22",
            "text": "The Chief Accounting Officer of the auditee entity shall credit, all such sums of money collected as surcharge and interest accrued, if any, under section 19 (3)( e )(ii), to the Consolidated Fund:",
            "pre_block_list": [
              "Crediting of moneys paid as Surcharge.",
              "Provided that where the surcharge is related to a transaction made in respect of a Provincial Council or a local authority, the sum collected as surcharge shall be credited to the Provincial Fund of such Provincial Council or the Fund of the relevant local authority, as the case may be."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "23",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where any sum to be charged under section 19 (3)( e )(ii) has not been paid within the time specified and where the Audit Service Commission is satisfied that",
                "pre_block_list": [
                  "Proceedings for recovery before a Megistrate.",
                  "immediate action is necessary for the recovery of such sum, unless an appeal is pending before the Committee under section 20(1), in the Court of Appeal under section 20(4), the Audit Service Commission may issue a certificate containing particulars of such sum to be recovered and the name and last known place of employment or residence of the person who is responsible for the deficiency or loss, to a Magistrate having jurisdiction in the division in which such place is situated within a period of ninety working days."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "The Magistrate shall thereupon summon such person who is responsible for the deficiency or loss to show cause as to why further proceedings for the recovery of the sum to be recovered shall not be taken against him.",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "Where the person who is responsible for the deficiency or loss fails to show sufficient cause, the sum to be recovered shall be deemed to be a fine imposed by a sentence of the Magistrate on such person who is responsible for the deficiency or loss for an offence punishable with fine only and not punishable with imprisonment.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "The certificate issued by the Audit Service Commission shall be  conclusive proof that the sum to be recovered has been duly assessed and is in default in any proceeding before the Magistrate under subsection (1).",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "The proceeding under this section shall be conducted within thirty days from the date of issue of the certificate under subsection (1) unless an appeal has been made to the Surcharge Appeal Committee under section 20 (1) or to the Court of Appeal under section 20 (4), as the case may be.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The provisions of Chapter XXIV of the Code of Criminal Procedure Act, No. 15 of 1979, shall  mutati s mutandis  apply in relation to default of payment of a fine, and in addition the Magistrate may make any direction which, he could have made at the time of imposing such sentence.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Nothing in subsection (2) to (5) of section 291 of the Code of Criminal Procedure Act, No. 15 of 1979, shall apply in any case referred to in subsection (1).",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "In any case referred to in subsection (2), where in default of payment of the fine, the person who is responsible for the deficiency or loss shall be sentenced to imprisonment for a period not exceeding one year. The Magistrate may allow time for the payment of the amount of that fine or direct payment of that amount to be made in instalments.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "Where a Magistrate directs that the payment be made in instalments and default is made in the payment of any one instalment, proceedings may be taken as if default had been made in payment of all the instalments then remaining unpaid.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "8",
                "text": "Any person aggrieved by the decision of the Magistrate may appeal to the High Court established under Article 154 P  of the Constitution not later than thirty days from the date of such decision.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "9",
                "text": "Wherever the Audit Service Commission issues a certificate under subsection (1), he shall at the same time issue to the person who is responsible for the deficiency or loss, whether resident or non-resident, a notification thereof by personal service, registered letter sent through the post or tele mail service; and the non- receipt of such notification by the person who is responsible for the deficiency or loss shall not invalidate proceedings under this section.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "10",
                "text": "For the purpose of Part IV of this Act, in the event the Audit Service Commission finds that the Chief Accounting Officer of the auditee entity has caused or has been involved in causing any deficiency or loss due to fraud, negligence, misappropriation or corruption in a transaction made contrary to any written law, the Secretary to the Treasury shall charge the amount as referred to in subsection (3)( e )(ii) of section 19 from the Chief Accounting Officer of the auditee entity.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "V",
        "text": "",
        "pre_block_list": [
          "A UDIT  S ERVICE  C OMMISSION"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "24",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be an Audit Service Commission (hereinafter referred to as Commission) established under Article 153 A  (1) of the Constitution consisting of the Auditor- General and four other members appointed by the President on the recommendation of the Constitutional Council.",
                "pre_block_list": [
                  "Establishment of an Audit Service Commission."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Commission shall have its own Secretariat.",
                "pre_block_list": [
                  "Powers, duties and functions of the Commission."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "25",
            "text": "In addition to the powers and functions of the Commission as set out under Article 153 C  of the Constitution, the Commission shall",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "appoint Committees to assist in the affairs of the Commission;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "introduce schemes to enhance the quality of performance of the staff of the National Audit Office referred to  in section 29; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "make rules for which specific provision has been given in this Act.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "26",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Chairman of the Commission shall preside at all meetings of the Commission and, in his absence, a member elected by the members present from among themselves shall preside at such meeting.",
                "pre_block_list": [
                  "Meetings of the Commission."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The quorum for a meeting of the Commission shall be three members. All decisions of the Commission shall be made by a majority of the members present at the meeting. In the event of an equality of votes, the member presiding at the meeting as Chairman shall have a casting vote.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Commission shall have power to act notwithstanding any vacancy in its membership, and no act, proceeding or decision of the Commission shall be or deemed to be invalid by reason only of any such vacancy or any defect in the appointment of a member thereof.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The Commission shall meet at least once in a month.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "In the event a written request is made by at least three members to summon an urgent meeting of the Commission, the Chairman of the Commission shall summon such meeting as soon as possible, but in any case not later than ten days after the receipt of such request.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "There shall be a Secretary to the Commission who shall be appointed by the Commission. The Secretary shall be responsible for proper recording and maintenance of minutes of the meetings of the Commission and the common seal of the Commission and its custody.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "27",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The President may grant any member of the Commission leave from the discharge of his functions as a member of the Commission for a period not exceeding two months and shall for the duration of such period, on the recommendation of the Constitutional Council and having",
                "pre_block_list": [
                  "Leave from the discharge of functions as a member of the Commission.",
                  "regard to the provisions of Article 153 A  (1) of the Constitution, appoint a person to be a temporary member of the Commission, for the period of such leave."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "A member of the Commission who without obtaining leave from the President is absent from three consecutive meetings of the Commission, shall be deemed to have vacated office with effect from the date of the third of such meetings, and shall not be eligible thereafter to be reappointed as a member of the Commission.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "28",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The appointment, promotion, transfer, disciplinary control and dismissal of the members belonging to the Sri Lanka State Audit Service recruited by the Commission shall be vested in the Commission.",
                "pre_block_list": [
                  "Commission to appoint, promote &c. officers and staff."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Commission may appoint a qualified Secretary and such other officers and Non-Audit Staff to the Commission and  to the National Audit Office on such terms and conditions as may be determined by the Commission.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The salaries and other allowances and any other benefits of persons recruited by the Commission, except those who have been attached to the National Audit Office from the Combined Services, shall be determined by the Commission,  after having obtained the  views of the Salaries and Carders Commission, and shall be charged on the Consolidated Fund.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "VI",
        "text": "",
        "pre_block_list": [
          "E STABLISHMENT   OF   THE  N ATIONAL  A UDIT   O FFICE   AND   THE S RI  L ANKA  S TATE  A UDIT  S ERVICE"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "29",
            "text": "There shall be a National Audit Office (hereinafter referred to as the Audit Office) to assist the Auditor General in the discharge of his duties and functions, which shall consist of the Auditor-General and a staff comprising the members belonging to the Sri Lanka State Audit Service established under section 30 of this Act and the Non-Audit Staff (hereinafter referred to as the staff of the Audit Office).",
            "pre_block_list": [
              "Establishment of the National Audit Office."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "30",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be established a service known as the Sri Lanka State Audit Service.",
                "pre_block_list": [
                  "Establishment of the Sri Lanka State Audit Service."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The members of the Sri Lanka Audit Service and the Audit Examiners Service serving on the date immediately prior to the date of operation of this Act, shall be deemed to be members of the Sri Lanka State Audit Service as at the date of operation of this Act.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "31",
            "text": "Any member of the staff of the Audit Office recruited by the Commission may resign his office by writing under his hand, addressed to the Chairman of the Commission.",
            "pre_block_list": [
              "Resignation of a member of the Staff of the Audit Office."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "32",
            "text": "A person aggrieved by the decision of the Commission in the exercise of its powers under section 28, may appeal against such decision to the Administrative Appeals Tribunal as specified under Article 153 G .",
            "pre_block_list": [
              "Appeals to the Administrative Appeals Tribunal."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "33",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Auditor-General may deploy any of the officers of the Sri Lanka State Audit Service or qualified auditor or any other person lawfully engaged by him, to carry out any audit of an auditee entity in any part of Sri Lanka.",
                "pre_block_list": [
                  "Stationing of the Officers."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "All auditee entities shall cooperate with the Auditor- General and any officer deployed by him and shall provide a safe and secure working environment to facilitate the carrying out of an effective audit.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "34",
            "text": "The Commission shall prepare the annual budget estimates of the Audit Office within the period as specified by the Minister assigned the subject of Finance. The said estimates shall be submitted to the Speaker on such date as may be decided by the Speaker after consultation with the said Minister of Finance and the Chairman of the",
            "pre_block_list": [
              "The Commission to submit annual budget estimates for incorporation in the national budget.",
              "Commission. The Speaker shall table the said estimates in Parliament for its review with the observations of the Minister assigned the subject of Finance, who shall provide his observations to the Speaker within ten working days from its receipt of such annual budget estimates from the Speaker. The Parliament shall after having reviewed the annual budget estimates of the Audit Office forward the estimates to the Minister assigned the subject of Finance for incorporation in the national budget with such modifications, if any, as Parliament thinks fit.",
              "The Auditor- General to submit annual work programme."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "35",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "At least sixty days before the beginning of each financial year, the Auditor-General shall prepare and submit to the Speaker a draft annual work programme that describes the Auditor-Generals proposed work programme for the forthcoming year.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Speaker shall cause the draft annual work programme to be reviewed by a committee of Parliament established under the Standing Orders calling for any comments or amendments including the programme priorities. The Speaker or the said committee may be required to forward the said comments or amendments within thirty days from the date of receipt of the work programme. The Speaker shall forward the same to the Auditor-General.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where there are no reviews made under subsection (2) the Speaker shall directly table the work programme submitted by the Auditor-General in Parliament.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where there are reviews made under subsection (2), the Auditor-General may, after considering any comments or amendments, amend the work programme as suggested by the Speaker or the said committee.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "The Auditor -General shall present a completed annual work programme to the Speaker before the beginning of",
                "pre_block_list": [
                  "each financial year and the Speaker shall then table the work programme in Parliament."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "36",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Notwithstanding the provisions in any other law to the contrary, the Speaker shall appoint an independent qualified auditor to carry out the audit of the financial statements, accounts and other information relating to the financial year of the Audit Office and for this purpose the Audit Office shall be deemed an auditee entity under this Act. Any reference to an auditee entity and the Auditor- General shall,  mutatis mutandis  apply in relation to the Audit Office and the independent qualified officer.",
                "pre_block_list": [
                  "Power to appoint an independent qualified auditor to audit the Audit Office."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The appointment of an independent qualified auditor under subsection (1) shall be subject to such terms and conditions as the Commission may determine, including the remuneration to be paid to such auditor, which shall be defrayed as part of the expenses of the Audit Office.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "On completion of the audit, such independent qualified auditor shall be required to submit such report thereon to the Commission, and the Commission shall cause such report to be tabled in Parliament together with any observations or views that the Auditor General may have expressed on such audit at the time of carrying out the same by the independent qualified auditor.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The report of the independent qualified auditor shall include",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the audited financial statements prepared in accordance with section 5 of this Act and in compliance with any other written law; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "an account of the implementation of the annual work programme required under section 35.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "37",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be established a fund to be known as the Audit Fund (hereinafter referred to as the Fund).",
                "pre_block_list": [
                  "Audit Fund."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "There shall be paid into the Fund-",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "fifteen  per centum  of the moneys collected by the Auditor-General as Audit fees;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "all payments credited by the Government, with the concurrence of the Parliament;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "any cost recovered in any suit or prosecution under section 50.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "There shall be paid out of the Fund-",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "any expense incurred in any suit or prosecution under section 50;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "all expenses incurred in the administration of the Fund;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "all payments given as rewards or incentives in accordance with the rules made in that behalf to persons who have shown exceptional performance in the discharge of their duties under this Act;",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Any sum not utilized within the financial year shall be credited to the Consolidated Fund.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "The accounts of the Fund shall be audited under section 36.",
                "pre_block_list": [
                  "National Audit Act, No. 19 of 2018 27"
                ],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "VII",
        "text": "",
        "pre_block_list": [
          "R ESPONSIBILITIES   OF   A  C HIEF  A CCOUNTING  O FFICER   AND A CCOUNTING  O FFICER"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "38",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Unless otherwise specified in the provisions of this Act or any other written law, the Chief Accounting Officer or an Accounting Officer of an auditee entity, for the purpose of this Act shall:-",
                "pre_block_list": [
                  "Responsibilities of a Chief Accounting Officer or an Accounting Officer."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "be the Officer responsible within the auditee entity to co-ordinate with the Auditor-General to successfully carry out the audit of such entity;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "ensure that financial planning, internal controls, maintenance of proper books and accounts, financial management and a mechanism for providing management information, are effectively in place;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "ensure that an effective internal control system for the financial control exists in each such entity and carry out periodic reviews to monitor the effectiveness of such systems and accordingly make any alterations as  required for such systems to be effectively carried out;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "ensure the timely preparation and submission of annual and other financial statements and in addition the Chief Accounting Officer shall be required to submit annual reports to Parliament pertaining to the auditee entity;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "ensure that all audit queries be answered within the specified time as required by the Auditor-General;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "ensure that an effective mechanism exists to conduct an internal audit;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "g",
                    "text": "ensure that adequate office space and facilities necessary for the officers authorized by the Auditor- General, be provided to discharge their duties in a proper manner; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "h",
                    "text": "upon receipt of a notice by the Auditor-General of any apparent fraud or any criminal activity, he shall without delay make a complaint to a law enforcing authority.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The review to be carried out by a Chief Accounting Officer referred to in paragraph ( c ) of subsection (1) shall be in writing and copies of the same shall be made available to the Auditor-General.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "39",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Chief Accounting Officer of a Ministry, the Accounting Officer of a Department, or the governing body or the Head of any other auditee entity concerned shall, on receipt of the Annual Detailed Management Audit Report of the Auditor-General referred to in section 11, consider such report and inform the Auditor-General, the Secretary to the Treasury and the appropriate Minister, of the concerns and remedial actions proposed.",
                "pre_block_list": [
                  "Chief Accounting Officer & c., to consider the Detailed Management Audit Report submittedby the Auditor- General."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The remedial actions referred to in subsection (1) shall be submitted to the Auditor-General within three months from the submission of the reports to the auditee entities, giving reasons for the ability or inability, if any, to take action on any of the matters pointed out in such Detailed Management Audit Report.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "40",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Chief Accounting Officer of a Ministry shall appoint an Internal Auditor to such Ministry and the Accounting Officer of each Department coming under such Ministry shall appoint a competent auditor to carry out the Internal Audit of such Department, and every other auditee entity shall have its own Internal Auditor, who is to perform an internal audit duly appointed by the governing body of such auditee entity.",
                "pre_block_list": [
                  "Internal audit.",
                  "National Audit Act, No. 19 of 2018 29"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where an Internal Auditor has not been appointed under subsection (1), such appointment shall be made within a period not exceeding two years from the date of operation of this Act.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "An Internal Auditor appointed under subsection (1) shall directly report to the Chief Accounting Officer, the Head or the governing body of such auditee entity, as the case may be, for the purposes of this Act.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Copies of all reports submitted by the internal auditors under subsection (3) shall be forwarded to the Department of Management Audit.",
                "pre_block_list": [
                  "Audit and Management Committees."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "41",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be an Audit and Management Committee for every auditee entity specified under subsection (2), referred to by that name or by any other name, appointed by the respective Chief Accounting Officer or accounting officer or the respective governing body, as the case may be, to assist him by undertaking continuous review of operations of each auditee entity and, to periodically report to the said Chief Accounting Officer, accounting officer or the respective governing body. The said Committee shall in particular-",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "review all audit and management aspects of the auditee entity to ensure that its resources, are used economically and efficiently for the purpose of achieving the predetermined objectives of such entity as a whole, or in respect of any specific project or programme undertaken giving priority to the resources available in Sri Lanka; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "ascertain whether such objectives have actually been achieved within the authorized time limits, for the disbursement of funds allocated for such activity, and whether any completed project or programme is in actual operation as envisaged in the plans.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "For the purposes of this section an auditee entity referred to in subsection (1) shall be:",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "a Ministry;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "a Provincial Council;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "a public corporation;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "a Commission constituted under the Constitution or a Special Presidential Commission of Inquiry;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "the Presidential Secretariat;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "the Office of the Secretary General of Parliament;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "g",
                    "text": "a company registered or deemed to be registered under the Companies Act, No. 7 of 2007 in which the Government or a public corporation or a local authority holds fifty  per centum  or more of the shares of that company;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "h",
                    "text": "any business or other undertaking vested in the Government under any written Law; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "i",
                    "text": "any  body corporate or incorporate established by law or otherwise.",
                    "pre_block_list": [
                      "National Audit Act, No. 19 of 2018 31"
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "VIII",
        "text": "",
        "pre_block_list": [
          "O FFENCES   AND  P ENALTIES"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "42",
            "text": "An auditee entity shall fulfill any requirement of the Auditor General or any person authorized by him, in the performance and discharge of the duties and functions under this Act and any person who",
            "pre_block_list": [
              "Failure to assist the Auditor- General to be an offence."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "fails or refuses to furnish any information, document, explanation, report or material when requested to do so within a period of not less than twenty one working days from the date of receipt of such request;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "refuses or fails to nominate a person conversant on the subject, to appear before the Auditor-General or any person authorized by him, when requested to do so;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "makes any statement or submits a document to the Auditor-General or any person authorized by him knowing it to be false or misleading;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "resists or obstructs the functions and duties of the Auditor-General or any person authorized by him,",
                "pre_block_list": [
                  "commits an offence and shall on conviction after summary trial by a Magistrate, be liable to a fine not less than five thousand rupees and not more than twenty five thousand rupees."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "43",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "A person who otherwise than in the course of his duty, directly or indirectly, in person or through another, influences or attempts to influence, any decision of the",
                "pre_block_list": [
                  "Influencing or attempting to influence a decision of the Commission or any officer of the Sri Lanka State Audit Service &c. to be an offence."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "Commission;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "any member of the Commission;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "any officer of the Sri Lanka State Audit Service;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "any Qualified Auditor appointed under section 36; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "any person as may be appointed by the Commission or by the Auditor-General to undertake any function under this Act,",
                    "pre_block_list": [
                      "commits an offence and shall on conviction be liable to a fine not less than five thousand rupees and not more than twenty five thousand rupees."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every High Court established under Article 154 P  of the Constitution shall have jurisdiction to hear and determine any matter referred to in subsection (1).",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "44",
            "text": "Where an offence under this Act is committed by a body of persons, then",
            "pre_block_list": [
              "Offences by bodies of persons."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "if such body of persons is a body incorporate or unincorporate, or a corporation every director or officer or agent thereof; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "if such body of persons is a firm, every partner,",
                "pre_block_list": [
                  "shall be liable to a fine as specified for the respective offences under sections 42 and 43:   Provided however, a director or an officer or agent of such body incorporate, unincorporate or of such corporation or partner of such firm shall not be deemed to be guilty of such offence if he proves that such offence was committed without his knowledge or that he used all such diligence to prevent the commission of such offence."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "45",
            "text": "Any person who contravenes the provisions of this Act or any rule made thereunder, commits an offence and shall on conviction after summary trial before a Magistrate",
            "pre_block_list": [
              "Other offences.",
              "National Audit Act, No. 19 of 2018 33",
              "be liable to a fine not more than one hundred thousand rupees or to imprisonment for a term not exceeding one year or to both such fine and imprisonment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "46",
            "text": "Any person convicted for an offence under the provisions of this Act shall not be precluded from being punished for any other offence committed in the process under any another written law.",
            "pre_block_list": [
              "Convicted persons to be punished for other offences in the process."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "IX",
        "text": "",
        "pre_block_list": [
          "G ENERAL"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "47",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "A Centre for Public Audit Training and Development shall be established under the Audit Office with a view to enhancing the capacity of human resources in the field of public finance and auditing.",
                "pre_block_list": [
                  "Establishment of a Centre for Public Audit Training and Development."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Commission shall formulate rules pertaining to the management of the Centre.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "48",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Commission may make rules in respect of all or any of the matters in respect of which rules are authorized or required to be made under this Act.",
                "pre_block_list": [
                  "Power of the Commission to make rules."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every rule made under subsection (1) shall be published in the  Gazette  and shall come into operation on the date of publication or on such later date as may be specified therein.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every rule made under subsection (1) shall, within three months from the date of its publication in the  Gazette be placed before Parliament for approval. Every rule which is not so approved shall be deemed to be rescinded as from the date of disapproval, but without prejudice to anything previously done thereunder.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "49",
            "text": "The Auditor-General may, from time to time, give the staff of the Audit Office or any person authorized by him such general and special directions, in writing as to the exercise and discharge of its powers and functions when conducting an audit and the staff or any person authorized by him shall give effect to such direction.   50. (1) No liability, whether civil or criminal, shall attach to the Auditor-General, any officer of the Sri Lanka State Audit Service, any officer of the National Audit Office or any other person assisting in the discharge of the duties of the Auditor-General as referred to in section 9(1)( a ), for anything which in good faith is done in the performance or exercise of any function or power imposed or assigned under the provisions of this Act.",
            "pre_block_list": [
              "Auditor-General to give directions.",
              "Protection from law suits."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any expense incurred by the Auditor-General, an officer of the Sri Lanka State Audit Service, any officer of the National Audit Office or any other person assisting in the discharge of the duties of the Auditor-General as referred to in section 8( a ), as the case may be, in any suit or prosecution brought against him before any court in respect of any act which is done by him under this Act shall, if the court holds that such act was done in good faith, be paid out of the Consolidated Fund, unless such expenses are recovered by him in such suit or prosecution.",
                "pre_block_list": [
                  "51. All members of the Commission, officers and staff of the Audit Office shall be deemed to be public servants within the meaning and for the purposes of the Penal Code.",
                  "Members of the Commission, officers and staff of the Audit Office deemed to be public servants.",
                  "52. The Audit Office shall be deemed to be a Scheduled Institution within the meaning of the Bribery Act, and the provisions of that Act, shall be construed accordingly.",
                  "The Audit Office deemed to be a Scheduled Institution within the meaning of the Bribery Act.",
                  "National Audit Act, No. 19 of 2018 35",
                  "53. Auditor-Generals Fees Act, No. 26 of 1958 is hereby repealed.",
                  "Repeal of Act, No. 26 of 1958.",
                  "54. (1) The Auditor Generals Department shall cease to be in operation from the date of operation of this Act.",
                  "Transitional provisions.",
                  "(2) Notwithstanding the provision of subsection (1),"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "all moneys lying to the credit of the Auditor- Generals Department on the day immediately preceding the date of operation of this Act, shall stand transferred with effect from that date to the Audit Office  established  under this Act;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "all property and other rights over movable or immovable owned by the Auditor-Generals Department and used for the purposes of the Department on the day immediately   preceding the date of operation of this Act shall vest in the Audit Office  with effect from that date;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "all debts, obligations and liabilities  of the Auditor-Generals Department subsisting on the day immediately  preceding the date of operation of this Act shall be deemed to be debts, obligations and liabilities of the Audit Office with effect from that date;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "all contracts and agreements entered into for the purposes of the Auditor-Generals Department and subsisting on the day immediately preceding the date of operation of this Act shall be contracts and agreements entered into by the Audit Office  deemed with effect from that date;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "all actions and proceedings instituted by or against  the Auditor-Generals Department and",
                    "pre_block_list": [
                      "pending on the day immediately  preceding the date of operation of this Act shall be deemed with effect from the date of operation of this Act to be actions and proceedings instituted  by or against the Audit Office;"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "all decrees and orders entered or made by any competent court in favour of or against the Auditor-Generals Department which remain unsatisfied on the day preceding the date of operation of this Act shall with effect from that date be deemed to have been  entered or made in favour of or against the Audit Office  and may be enforced accordingly;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "g",
                    "text": "every rule in force on the  day immediately preceding the date of operation of this Act and which are not inconsistent with the provisions of this Act shall be deemed to be a rule made under this Act;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "h",
                    "text": "all audits that are pending shall be continued by the Auditor-General under this Act.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where an Internal Auditor is not appointed to an auditee entity, the internal auditors function as carried out immediately before the date of operation of this Act shall continue until such appointment.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Members of the Sri Lanka State Audit Service and the Audit Examiners Service employed in the Auditor Generals Department immediately before the establishment of the National Audit Office shall be deemed to be employees of the National Audit Office and shall be employed under the same terms and conditions as may be applicable to that employee immediately before that date.",
                "pre_block_list": [
                  "National Audit Act, No. 19 of 2018 37"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "The offer of employment to all officers and staff of the Auditor Generals Department on the day immediately preceding the date of operation of this Act, shall be as follows:",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "The Commission shall, within three months of the date of operation of this Act, offer all members of the Sri Lanka Audit Service and the Audit Examiners Service serving on the date immediately prior to the date of operation of this Act in the Auditor-Generals Department, employment in the Audit Office on such terms and conditions of employment as are not less favourable than were applicable to them on the date on which the offer is made;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "The offer made by the Commission under paragraph ( a ) shall be open until the expiry of a period of two months from the date on which the offer was made, and any member of the Sri Lanka Audit Service and the Audit Examiners Service serving on the date immediately prior to the date of operation of this Act in the Auditor-Generals Department, who opts to join the Audit Office shall become a member of the Sri Lanka State Audit Service;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "Where a member of the Sri Lanka Audit Service and the Audit Examiners Service serving on the date immediately prior to the date of operation of this Act or an Non-Audit Staff member recruited by the Auditor-Generals Department and employed in the Auditor-Generals Department on the date immediately prior to the date of operation of this Act, becomes an employee of the Audit Office, his period of employment in the public service as an employee of the Auditor-Generals Department shall be counted as a period of employment as a member of the Sri Lanka State Audit Service and the change in his status of employment shall not break the continuity of his period of employment in the public service;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "Any member of the Sri Lanka Audit Service and the Audit Examiners Service serving on the date immediately prior to the date of operation of this Act in the Auditor-Generals Department or any Non- Audit Staff member of the Auditor Generals Department who does not opt to serve the Audit Office may retire under the provisions of the Minutes on Pensions. Until the Commission formulates its procedural rules relating to appointment, promotions and transfer, the procedural rules formulated and published in  Gazette  Extraordinary No.1589/3 on February 20, 2009 by the Public Service Commission shall  mutatis mutandis  be applied to the members of the Staff of the National Audit Office;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "A member of the Combined Services or any other Service employed in the Audit Office shall remain in the Audit Office subject to the terms and conditions of the Service Minutes of the respective Combined Services;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "A member of a Combined Services employed in the Auditor-Generals Department on the date immediately prior to the date of operation of this Act shall have the option to serve the Audit Office or to be transferred out of the Audit Office, subject to the terms and conditions of the respective Combined Service Minutes;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "g",
                    "text": "The Officers who have been directly recruited by the Auditor General and serve in the Auditor Generals Department at the time of operation of this Act who opt to remain as the Non-Audit Officers in the Audit Office within the Department Service shall be distinctly separate from the Sri Lanka State Audit Service.",
                    "pre_block_list": [
                      "National Audit Act, No. 19 of 2018 39",
                      "55. In  this  Act,  unless  the  context  otherwise requires",
                      "Interpretation.",
                      "any person authorized by the Auditor-General means any person appointed in writing or whose services are engaged by the Auditor-General by name or office, to discharge the functions assigned to him under this Act or any rules made thereunder, who are members of the State Audit Service of the National Audit Office, qualified auditor or any other person having expertise in a required field; and shall discharge such functions until he ceases to hold office;",
                      "auditee entity includes -",
                      "( a ) Offices of the Cabinet of Ministers;",
                      "( b )  all Departments of  the Government;",
                      "( c )  the Presidential Secretariat;",
                      "( d )  Office of the Secretary to the Prime Minister;",
                      "( e )  the Judicial Service Commission;",
                      "( f )  the Constitutional Council;",
                      "( g ) the Commissions referred to in the Schedule to Article 41 B  of the  Constitution and the Special Presidential Commission of Inquiry established under the special Presidential Commissions of Inquiry (Special Provisions) Act, No. 4 of 1978;"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "h",
                    "text": "the  Parliamentary  Commissioner  for Administration;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "i",
                    "text": "the  Office of the Secretary General of Parliament;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "j",
                    "text": "Provincial Councils and local authorities;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "k",
                    "text": "public corporations and statutory Funds or Boards;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "l",
                    "text": "businesses and other undertakings vested in the Government by or under any written law;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "m",
                    "text": "any company registered or deemed to be registered under the Companies Act, No. 7 of 2007 in which the Government or a public Corporation or local authority holds fifty  per centum  or more of the shares of that company;",
                    "pre_block_list": [
                      "Auditing Standards Committee means the Auditing Standards Committee established under the provisions of the Sri Lanka Accounting and Auditing Standards Act, No.15 of 1995;",
                      "Accounting Officer includes, except where other arrangements are made by the Ministry of the Minister assigned the subject of Finance or as provided for in any other written law, Head of each Department who shall be immediately responsible to the Chief Accounting Officer in the manner specified in the Financial Regulations;",
                      "Auditor-General means the Auditor General appointed under Article 153 of the Constitution;",
                      "Concurrent Audit includes examination of the financial transactions at the time the transaction takes place or examining any parallel transaction;",
                      "Chief Accounting Officer includes, unless otherwise specifically provided for in any other written law-",
                      "( a ) the Secretary to a Ministry, appointed to be the Chief Accounting Officer of such Ministry, by the Minister assigned the subject of Finance;",
                      "National Audit Act, No. 19 of 2018 41",
                      "( b ) an officer in charge of a department specified in Article 52(4) of the Constitution; or",
                      "( c ) an officer in charge of any other department or entity, not supervised by a Secretary to a Ministry as specified in paragraph ( a );",
                      "Constitution means the Constitution of the Democratic Socialist Republic of Sri Lanka;",
                      "financial institution includes ",
                      "( a ) any licensed commercial bank within the meaning of the Banking Act, No 30 of 1988;",
                      "( b ) any licensed specialized bank within the meaning of the Banking Act, No. 30 of 1988;",
                      "( c ) any banking institution within the meaning of the Monetary Law Act (Chapter 422);",
                      "( d ) any registered finance company within the meaning of the Finance Business Act, No. 42 of 2011;",
                      "( e ) any finance leasing company within the meaning of Finance Leasing Companies Act, No. 56 of 2000;",
                      "( f ) any money broker within the meaning of the Money Broking Regulations No.1 of 2013 published in the  Gazette  Extraordinary No. 1796/ 21 dated February 8, 2013 issued under the Monetary Law Act (Chapter 422);",
                      "( g ) any primary dealer within the meaning of the Registered Stock and Securities Ordinance (Chapter 420) and the Local Treasury Bills Ordinance (Chapter 417);",
                      "( h ) any insurance company within the meaning of the Regulation of Insurance industry Act, No. 43 of 2000;"
                    ],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "any insurance broker and loss adjuster within the meaning of the Regulation of Insurance industry Act, No. 43 of 2000;",
                        "pre_block_list": [
                          "( j ) any insurance agent adjuster within the meaning of the Regulation of Insurance industry Act, No. 43 of 2000;",
                          "( k ) any stock exchange within the meaning of the Securities and Exchange Commission of Sri Lanka Act, No. 36 of 1987;",
                          "( l ) any stock broker or stock dealer within the meaning of the Securities and Exchange Commission of Sri Lanka Act, No. 36 of 1987;",
                          "( m ) any managing company to operate a unit trust within the meaning of the Securities and Exchange Commission of Sri Lanka Act, No. 36 of 1987; and"
                        ],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "n",
                    "text": "any person who carries on business as a market intermediary within the meaning of the Securities and Exchange Commission of Sri Lanka Act, No. 36 of 1987;",
                    "pre_block_list": [
                      "governing body means the body entrusted with the administration and management of the affairs of any statutory body or entity or any company registered or deemed to be registered under the Companies Act, No. 7 of 2007 in which the Government or a public corporation or a local authority holds fifty  per centum or more of the shares of that company;",
                      "Head means the Head of a Department coming under a Ministry;",
                      "National Audit Act, No. 19 of 2018 43",
                      "information shall include any oral or written evidence including data generated by electronic means;",
                      "local authority means a Municipal Council, Urban Council or a Pradeshiya Sabha and includes any authority created or established by or under any law to exercise, perform and discharge powers, duties and functions corresponding or similar to the powers, duties and functions exercised, performed or discharged by any such Council or Sabha;",
                      "Non-Audit Staff means persons other than members of the Sri Lanka Audit Service and the Audit Examiners Service serving on the date immediately prior to the date of operation of this Act in the Auditor Generals Department and  persons recruited by the Commission after the operation of this Act and includes persons attached to the Combined Services Staff;",
                      "Provincial Council means a Provincial Council established for a Province by virtue of Article 154 A of the Constitution;",
                      "public corporation means any corporation, board or other body which was or is established by or under any written law other than the Companies  Act, No. 7 of 2007, with funds or capital wholly or partly provided by the Government by way of grant, loan or otherwise;",
                      "resources includes public finance, public property, human, physical or natural resources and debt;",
                      "Sri Lanka Accounting Standards means the Sri Lanka Accounting Standards specified under the Sri Lanka Accounting and Auditing Standards Act, No. 15 of 1995;",
                      "Sri Lanka Public Sector Accounting Standards means the Sri Lanka Public Sector Accounting Standards issued from time to time by the Ministry of the Minister assigned the subject of Finance, under section 8 (3) and section 12 of the Finance Act, No. 38 of 1971 and as may be specified under the provisions of the Sri Lanka Accounting and Auditing Standards Act, No. 15 of 1995;",
                      "Sri Lanka State Audit Service means the Sri Lanka State Audit Service established under Article 153 B (2) of the Constitution of the Democratic Socialist Republic of Sri Lanka; and",
                      "transaction includes any activity connected with a finance business or non-finance business; and in relation to property includes:",
                      "( a ) a purchase, sale, loan, charge, mortgage, lien, pledge, transfer, delivery, assignment, subrogation, transmission, gift, donation, creation of a trust, settlement, deposit including the deposit of any article, withdrawal, transfer between assets, extension of credit;",
                      "( b ) any agency or grant of power of attorney;",
                      "( c ) any other disposition or dealing of property in whatever form, or whatsoever description or nature, however described, which results in any right, title, interest or privilege, whether present or future, or whether vested or contingent, in the whole or any part of such property being conferred on any person.",
                      "56. In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
                      "Sinhala text to prevail in case of inconsistency.",
                      "National Audit Act, No. 19 of 2018 45",
                      "S CHEDULE [Section 9 (c)]",
                      "Oath of Secrecy",
                      "In terms of Section 9 of the National Audit Act, No. of 2018.",
                      "I, ................. being member of the Audit Service Commission/ an employee of the *, and expert person assisting in the discharge of the duties of the Auditor-General as referred to in section 8(a), do solemnly declare and affirm / swear that I shall maintain in utmost secrecy the information whatsoever which is given, stated, discussed or otherwise gathered in the performance of my duties and such information will not be disclosed, discussed or stated in any form whatever to any person in public or private, except",
                      "( a )  when required to do so by a Court of Law;",
                      "( b ) when required by Parliament; or",
                      "( c ) when   specified   under   any   written   law,    subject   to section 9( b ) of the National Audit Act, No.   of 2018.",
                      "The obligations herein set out shall bind me during my term of office in the ..................................* and shall continue thereafter except in relation to any information that has come into public domain due to no breach of my obligations hereunder.",
                      "I append my signature to this oath  on this ........... day of......................   Two Thousand ......................",
                      ". Signature",
                      "Taken oath  on this  day of",
                      "20 in before me.",
                      "",
                      "Speaker / Auditor-General",
                      "* National Audit Office/Auditor Generals Department/Combined Services",
                      "English Acts of the Parliament can be purchased at the P RAKASHANA  P IYASA , D EPARTMENT   OF G OVERNMENT  P RINTING , N O . 118, D R . D ANISTER  D E  S ILVA  M AWATHA , C OLOMBO  8."
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}