{
  "n_pages": 3,
  "title_page": {
    "title": "Regional Infrastructure Development Levy (Repeal)  Act",
    "num": "16",
    "year": "2011",
    "date_certified": "2011-03-31",
    "date_published": "2011-04-01",
    "price": 2.0,
    "price_postage": 5.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 31St March 2011]",
      "L. D.O. 6/2011.",
      "A N  A Ct   To   Provide   For   The  R Epeal   Of   The  R Egional I Nfrastructure  D Evelopment  L Evy  A Ct , N O . 51  Of  2006",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Regional Infrastructure Development Levy (Repeal) Act,  No. 16 of 2011.",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Regional Infrastructure Development Levy Act, No. 51 of 2006 is hereby deemed to be repealed with effect from January 1, 2011.",
                "pre_block_list": [
                  "Repeal and Savings."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The provisions of this Act shall, notwithstanding such repeal, in respect of the matters set out in subsection (3), be in operation for a period of one year from the date of the coming into operation of this Act.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Notwithstanding the repeal of the Regional Infrastructure Development Levy Act, No. 51 of 2006 with effect from  January 1, 2011, the Director-General of Customs is hereby empowered to recover all sums due under section 2 of the repealed Act, as Regional Infrastructure Development Levy with effect from January 1, 2011, to the day immediately preceding the day on which the period of operation of one year specified in subsection (2) expires, and transmit all sums so recovered by him as Regional Infrastructure Development Levy, to the Consolidated Fund in terms of section 5 of the repealed Act.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "In the event of an inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text to prevail. In case of an inconsistency the Sinhala text to prevail.",
            "pre_block_list": [
              "2PL 005590  4,090 (03/2011)",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , D EPARTMENT   OF G OVERNMENT  I NFORMATION , N O . 163, K IRULAPONA  M AWATHA , P OLHENGODA , C OLOMBO  05 before 15th December each year in respect of the year following ."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}