{
  "n_pages": 6,
  "title_page": {
    "title": "Value  Added  Tax   (Amendment) Act",
    "num": "44",
    "year": "2022",
    "date_certified": "2022-12-14",
    "date_published": "2022-12-16",
    "price": 15.0,
    "price_postage": 15.0
  },
  "body_pages": {
    "preamble": [
      "Value Added Tax (Amendment) Act, No. 44 Of 2022 1",
      "[Certified On 14Th Of December, 2022]",
      "L. D. O. 16/2022",
      "A N  A Ct   To   Amend   The  V Alue  A Dded  T Ax   A Ct , N O . 14  Of  2002",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:-"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Value Added Tax (Amendment) Act, No. 44 of 2022.",
            "pre_block_list": [
              "Short title"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "Section 2 of the Value Added Tax Act, No.14 of 2002 (hereinafter referred to as the principal enactment) is hereby amended as follows:-",
            "pre_block_list": [
              "Amendment of section 2 of Act, No.14 of 2002"
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "in item (v) of sub-paragraph (v) of subsection (1) of that section by the  substitution for the words and figures November 30, 2019; and of the words and figures November 30, 2019;;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "in item (vi) of sub-paragraph (v) of subsection (1) of that section by the substitution for the words and figures,  commencing on or after January 1, 2020 of the words and figures commencing on or after January 1, 2020 but ending on or before May 31, 2022;; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "by the insertion immediately after the item (vi) of subparagraph (v) of subsection (1) of that section of the following:-",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "vii",
                    "text": "for the period commencing on June 1, 2022 and ending on June 30, 2022 and for any taxable period commencing on or after July 1, 2022 but ending on August 31, 2022 at the rate of twelve  per centum  (of which the tax fraction is 3/28); and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "viii",
                    "text": "for the period commencing on September 1, 2022 and ending on September 30, 2022 and for any taxable period commencing on or after October 1, 2022 at the rate of fifteen per centum  (of which the tax fraction is 3/23)",
                    "pre_block_list": [
                      ""
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "Section 10 of the principal enactment is hereby amended in subsection (1) of that section as follows:-",
            "pre_block_list": [
              "Amendment of section 10 of the principal enactment"
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the substitution in paragraph (vi), for the words and figures,  on or after January 1, 2020, carries on of the words and figures on or after January 1, 2020 but on or before September 30, 2022, carries on;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the insertion immediately after paragraph (vi), of the following:-",
                "pre_block_list": [
                  "(vii) on or after October 1, 2022, carries on or carries out any taxable activity in Sri Lanka shall be required to be registered under this Act, if"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "at the end of any taxable period of one month or three months, as the case may be, the total value of the taxable supplies of goods or services or goods and services of such person, made in Sri Lanka in that taxable period of one month or three months, as the case may be, is twenty million rupees or more; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "in the twelve months period then ending, the total value of the taxable supplies of goods or services or goods and services of such person, made in Sri Lanka has exceeded eighty million rupees; or",
                    "pre_block_list": [
                      "Value Added Tax (Amendment) Act, No. 44 of 2022 3"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "at any time, there are reasonable grounds to believe that the total value of the taxable supplies of goods or services or goods and services of such person, made in Sri Lanka, in the succeeding one month or three months taxable period, as the case may be, is likely to exceed twenty million rupees or in the succeeding twelve months period is likely to exceed eighty million rupees",
                    "pre_block_list": [
                      ""
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "in the second proviso to subsection (1), by the substitution for the words and figures from May 2, 2016. of the following:-",
                "pre_block_list": [
                  "from May 2, 2016:",
                  "Provided further, for the purposes of paragraph (vii), the requirement for the registration shall arise from the date on which this (Amendment) Act comes into operation.;"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "The First Schedule to the principal enactment is hereby amended in Part II thereof as follows:-",
            "pre_block_list": [
              "Amendment of the First Schedule to the principal enactment"
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the substitution in sub-item ( d ) of item (xi) of paragraph ( b ) of that PART, by the substitution for the words and figures if such supply has taken place on or after December 1, 2019, by any person,, of the words and figures if such supply has taken place on or after December 1, 2019, but on or before December 31, 2022, by any person,; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the addition immediately after sub-item ( d ) of item (xi) of paragraph ( b ), of the following:-",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "if such supply has taken place on or after January 1, 2023, by any person, other than any  lease  or  rent  of  residential accommodation  or  supply  of  any condominium residential accommodation",
                    "pre_block_list": [
                      ""
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency",
              "Value Added Tax (Amendment) Act, No. 44 of 2022 5",
              "English Acts of the Parliament can be purchased at the P RAKASHANA  P IYASA , D EPARTMENT   OF G OVERNMENT  P RINTING , N O . 118, D R . D ANISTER  D E  S ILVA  M AWATHA , C OLOMBO  8."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}