{
  "n_pages": 9,
  "title_page": {
    "title": "National  Security  Levy  (Amendment) Act",
    "num": "15",
    "year": "2002",
    "date_certified": "2002-07-30",
    "date_published": "2002-08-02",
    "price": 6.0,
    "price_postage": 4.5
  },
  "body_pages": {
    "preamble": [
      "National Security Levy (Amendment) 1",
      "L.D.O. 57/2001.",
      "A N  A Ct   To   Amend   The  N Ational  S Ecurity  L Evy  A Ct , N O . 52",
      "Of  1991 ;  And   To   Provide   For   Matters   Connected   Therewith",
      "Or   Incidental   Thereto",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the National Security Levy (Amendment) Act, No.  of 2002.",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "Section 3 of the National Security Levy Act, No. 52 of 1991 (hereinafter referred to as the principal enactment) as last amended by Act, No. 4 of 2001 is hereby amended in subsection (2) of that section as follows :",
            "pre_block_list": [
              "Amendment of section 3 of Act, No. 52 of 1991."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the insertion, immediately after paragraph ( c ) of that subsection, of the following new paragraphs :",
                "pre_block_list": [
                  "( cc ) the value of any wheat or wheat flour imported by such person ;",
                  "( ccc ) proceeds from the sale of any wheat flour or bread manufactured in Sri Lanka by such person ; and"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the repeal of paragraph ( k ) of that subsection.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "Section 4 of the principal enactment as last amended by Act, No. 4 of 2001, is hereby further amended as follows :",
            "pre_block_list": [
              "Amendment of section 4 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "in paragraph ( l ) of that section, by the substitution, for the words and figures on or   after April 1, 2001 , of the words and figures on or after April 1, 2001 but prior to October 1, 2001- ; and",
                "pre_block_list": [
                  "2H 0155191,100 (2002/06)",
                  "National Security Levy (Amendment) 2"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the addition at the end of that section, of the following new paragraphs :",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "m",
                    "text": "for the quarter commencing on October 1, 2001",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "an amount equivalent to",
                        "pre_block_list": [
                          "(A) Seven and one half  per centum  of the turnover of that person, not being turnover referred to in item (B) of this sub-paragraph ; and",
                          "(B) One half  per centum  of the turnover of that person arising from the import or manufacture of any  plant,  machinery  or equipment, not being any motor car, motor coach or lorry, within the meaning of the Motor Traffic Act [Chapter 203],",
                          "for the period commencing on October 1, 2001, and ending on October 12, 2001, on or before the fifteenth day of November, 2001 ;"
                        ],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "an amount equivalent to",
                        "pre_block_list": [
                          "(A) Six and one half  per centum  of the turnover of that person, not being turnover referred to in item (B) of this sub-paragraph ; and",
                          "(B) One half  per centum  of the turnover of that person arising from the import or manufacture of any  plant,  machinery  or equipment, not being any motor",
                          "National Security Levy (Amendment) 3",
                          "car, motor coach or lorry within the meaning of the Motor Traffic Act [Chapter 203],",
                          "for the period commencing on October 13, 2001, and ending on November 30, 2001, on or before the fifteenth day of December, 2001 ; and"
                        ],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "the amount of the levy payable by such person for that quarter, reduced by the aggregate of the amounts paid by him in accordance with the provisions of sub- paragraphs (i) and (ii) of this paragraph, on or before the fifteenth day of the month immediately succeeding the end of that quarter ; and",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "n",
                    "text": "for every quarter commencing on or after January 1, 2002",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "an amount equivalent to",
                        "pre_block_list": [
                          "(A) six and one half  per centum  of the turnover of that person, not being turnover referred to in item (B) of this sub-paragraph ; and",
                          "(B) one half  per centum  of the turnover of that person arising from the import or manufacture of any  plant,  machinery  or equipment, not being any motor car, motor coach or lorry, within the meaning of the Motor Traffic Act (Chapter 203),",
                          "for the first month of that quarter, on or before the fifteenth day of the second month of that quarter,",
                          "National Security Levy (Amendment) 4"
                        ],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "an amount equivalent to",
                        "pre_block_list": [
                          "(A) six and one half  per centum of the turnover of that person, not being turnover referred to in item (B) of this sub-paragraph ; and",
                          "(B) one half  per centum  of the turnover of that person arising from the import or manufacture of any  plant,  machinery  or equipment, not being any motor car, motor coach or lorry, within the meaning of the Motor Traffic Act (Chapter 203),",
                          "for the second month of that quarter, on or before the fifteenth day of the third month of that quarter ; and"
                        ],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "the amount of the levy payable by such person for that quarter, reduced by the aggregate of the amounts paid by him in accordance with the provisions of sub-paragraph (i) and sub-paragraph (ii) of this paragraph, on or before  the fifteenth day of the month immediately succeeding the end of that quarter ;.",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "The Schedule to the principal enactment, as last amended by Act, No. 4 of 2001, is hereby further amended as follows :",
            "pre_block_list": [
              "Amendment of the Schedule to the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the substitution, in item 12 of that Schedule, for the words and figures on or after April 1, 2001, of the words and figures on or after April 1, 2001, but prior to October 1, 2001; and",
                "pre_block_list": [
                  "National Security Levy (Amendment) 5"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the addition, at the end of that Schedule, of the following new items :",
                "pre_block_list": [
                  "(13) For the quarter commencing on October 1, 2001"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "i",
                    "text": "on turnover other than turnover referred to in paragraph (ii)",
                    "pre_block_list": [
                      "( a ) arising for the period commencing on October 1, 2001, and ending on October 12, 2001",
                      "( b ) arising for the period commencing on October 13, 2001 and ending on December 31, 2001"
                    ],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "on turnover arising from the import or manufacture of any plant, machinery or equipment, not being any motor car, motor coach or lorry, within the meaning of the Motor Traffic Act (Chapter 203).",
                        "pre_block_list": [
                          "(14) For every quarter commencing on or after January 1, 2002",
                          "(i) on  turnover other than turnover referred to in paragraph (ii) of this item,",
                          "(ii) on turnover arising from the import or manufacture of any plant, machinery or",
                          "National Security Levy (Amendment) 6",
                          "equipment, not being any motor car, motor coach or lorry, within the meaning of the Motor Traffic Act (Chapter 203)."
                        ],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "Where the Director General of Customs collects during the period commencing on October 13, 2001, and ending on the date on which this Act is certified as an Act of Parliament, from an importer of an article not being plant, machinery or equipment, an amount less than seven and one half  per centum but not less than six and one half  per centum  of the value of such article, such collection shall be deemed for all purposes to have been, and to be, validly made, and the Director-General of Customs is hereby indemnified against all actions, civil or criminal, in respect of such collection.",
            "pre_block_list": [
              "Validation."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "Where a person to whom this Act applies is liable, by reason of the operation of section 2 of this Act, read with Save the Nation Contribution (Abolition) Act, to pay any sum to the Commissioner-General as National Security Levy for the period commencing on October 13, 2001 and ending on the date on which this Act is certified as an Act of Parliament, such person shall be deemed for all purposes, to have complied with the provisions of the principal enactment as amended by this Act, if he pays that sum to the Commissioner-General within thirty days of the date on which this Act is certified as an Act of Parliament. Where such sum is not so paid, such sum shall be deemed to be in default after the expiration of thirty days from the date on which this Act is certified as an Act of Parliament and such person shall be deemed to be a defaulter with effect from that date.",
            "pre_block_list": [
              "Transitional provisions."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "The amendments made to section 3 of the principal enactment :",
            "pre_block_list": [
              "Retrospective effect."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "by paragraph (1) of section 2 of this Act, shall be deemed for all purposes to have come into force on February 21, 2002 ; and",
                "pre_block_list": [
                  "National Security Levy (Amendment) 7"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "by paragraph (2) of section 2 of this Act, shall be deemed for all purposes to have come into force on October 13, 2001.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency.",
              "National Security Levy (Amendment) 8",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180(Foreign), payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , N O . 32, T RANSWORKS  H OUSE , L OTUS  R OAD , C OLOMBO  01 before 15th December each year in respect of the year following."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}