{
  "n_pages": 8,
  "title_page": {
    "title": "Ports And Airports Development Levy Act",
    "num": "18",
    "year": "2011",
    "date_certified": "2011-03-31",
    "date_published": "2011-04-01",
    "price": 5.0,
    "price_postage": 10.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 31St March 2011]",
      "L.D.O. 9/2011.",
      "A N  A Ct   To   Make   Provision   For   The   Imposition   And   Collection   Of   A",
      "Levy   To   Be   Called   The  P Orts   And  A Irports  D Evelopment   L Evy",
      "On   Every   Article   Originating   From   Outside  S Ri  L Anka   And",
      "Imported   Into  S Ri  L Anka ;  To   Amend   Part  I  Of   The  F Inance  A Ct , N O . 11  Of  2002;  And   To   Provide   For   Matters   Connected",
      "Therewith   Or   Incidental   Thereto .",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Ports and Airports Development  Levy Act, No. 18 of 2011.",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "I",
        "text": "",
        "pre_block_list": [
          "I MPOSITION   OF  P ORTS   AND  A IRPORTS  D EVELOPMENT   L EVY"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "Subject to the provisions of section 7, there shall be charged and levied on the cost, insurance and freight value of every article originating from outside Sri Lanka and imported into Sri Lanka, a levy to be called the Ports and Airports Development  Levy ( hereinafter in this Part referred to as the Levy).",
            "pre_block_list": [
              "Levy on articles imported into Sri Lanka."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The levy to be charged and levied in respect of the cost, insurance and freight value of any article referred to in section 2 shall be calculated, at the rate of 5.0 percentum , for the period commencing on January 1, 2011.",
                "pre_block_list": [
                  "Manner of calculating the levy."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "With effect from January 1, 2011, no levy shall be charged in respect of the cost, insurance and freight value of any article imported into Sri Lanka",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "for the purpose of processing and re-export; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "to be used for the manufacture of goods for exports.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Minister may, from time to time having regard to the interests of the national economy, by Order published in the  Gazette",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "exempt from the operation of the above levy, any article specified therein; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "specify a concessionary rate to be charged and levied in respect of any article or articles specified therein.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Every Order, made in terms of subsection (3) by the Minister shall",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "i",
                    "text": "be in operation immediately upon the Minister affixing his signature thereto;",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "be published in the  Gazette  as soon as convenient;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "be approved by resolution of Parliament as soon as convenient thereafter; and",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iv",
                        "text": "if not approved by Parliament, be deemed to be rescinded with effect from the date of such resolution",
                        "pre_block_list": [
                          ""
                        ],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The following articles shall be exempt from the Ports and Airports Development  Levy",
                "pre_block_list": [
                  "No levy to be charged in respect of specified articles."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "i",
                    "text": "foreign currency notes as specified under the relevant Harmonized Commodity  Description and coding System Numbers for the purposes of Customs Ordinance (Chapter 235) (with effect from June 1, 2010);",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "goods for the use of international events conducted in Sri Lanka, on donations from abroad, as approved by the Minister in charge of the subject of Finance having regard to the interests of the national economy (with effect from May 12, 2010);",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "goods for any infrastructure development project out of the donations directly to Government Ministries, as approved by the Minister in charge of the subject of Finance;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iv",
                        "text": "goods for any specified project funded through foreign loans and on which project the tax is borne by the Government, as approved by the Minister in charge of the subject of Finance having regard to the interests of the national economy; and",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "v",
                        "text": "any other article which the Minister in charge of the subject of Finance may, by Order published in the  Gazette , in terms of subsection (3) of section 3, declare as being an exempted article.",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Notwithstanding the provisions of sections 2 and 3, the Director-General of Customs shall defer the collection of the levy on the importation of any article, for the use of any specified project identified by the Minister in charge of the subject of Finance, by an Order published in the  Gazette , having regard to the interests of the national economy on which the tax is borne by the government, with effect from July 1, 2009 until such time the article is re-exported after the completion of such project, subject to the furnishing of a corporate guarantee which covers the amount of the tax due on the articles so imported.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "The levy payable under section 2 on an article imported into Sri Lanka, shall be paid by the person importing the article to the Director-General of Customs, at the time of the import of the article, and upon payment of the levy the Director-General of Customs shall cause an endorsement specifying the amount recovered as the levy to be made on the import invoice relating to that article.",
            "pre_block_list": [
              "Levy to be paid to the Director- General of Customs."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "Where any article originating from outside Sri Lanka and imported into Sri Lanka is sold",
            "pre_block_list": [
              "Purchase of certain articles deemed to be imported for the purpose of this Act."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "by the Director-General of Customs for the recovery of any customs duty, surcharge or other levy payable",
                "pre_block_list": [
                  "or deemed to be payable under the Customs Ordinance or for any contravention of the provisions of the Customs Ordinance (Chapter 235);"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "by the Sri Lanka Ports Authority established by the Sri Lanka Ports Authority Act, No. 51 of 1979, for the recovery of any dues under that Act; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "by the Commissioner-General of Inland Revenue, for any taxes administered by him,",
                "pre_block_list": [
                  "the purchaser of that article shall be deemed for the purposes of section 5 to be the person importing that article and the provisions of this Act shall accordingly apply to such purchaser."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "Nothing in section 2 shall apply to any article imported into Sri Lanka in respect of the provision of any service by a mission of any State or any organization to whom the provisions of the Diplomatic Privileges Act, No. 9 of 1996 applies.",
            "pre_block_list": [
              "Exemptions."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "The levy shall, for purposes of recovery of the levy and notwithstanding anything to the contrary in this Act, be deemed to be a customs duty payable under the Customs Ordinance (Chapter 235), and accordingly the provisions of the Customs Ordinance (Chapter 235) shall apply to the recovery of such levy.",
            "pre_block_list": [
              "Customs Ordinance to apply to the recovery of levy."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "The Director-General of Customs shall transmit to the Consolidated Fund, all sums recovered by him as the levy under this Act.",
            "pre_block_list": [
              "Amount recovered as levy to be credited to the Consolidated Fund."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "10",
            "text": "In this Part, unless the context otherwise requires, article means any goods, materials, foreign currency notes, any agricultural or horticultural products or merchandise but does not include diamonds, gems, gold, jewellery  and electronic items, imported for the purpose of processing and re-export.",
            "pre_block_list": [
              "Interpretation."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "11",
            "text": "The provisions of",
            "pre_block_list": [
              "Retrospective effect."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "paragraph (i) of subsection (1) of section 4 of this Act shall be deemed for all purposes to have come into effect on June 1, 2010;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "paragraph (ii) of subsection (1) of section 4 of this Act shall be deemed for all purposes to have come into effect on May 12, 2010;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "paragraph (iii) of subsection (1) of section 4 of this Act shall be deemed for all purposes to have come into effect on September 8, 2010;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "paragraph (iv) of subsection (1) of section 4 of this Act shall be deemed for all purposes to have come into effect on January 1, 2010;",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "12",
            "text": "The provisions of this Act shall, be deemed for all purposes to have come in to operation on January 1, 2011.",
            "pre_block_list": [
              "Operation of the provisions of this Act,"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "13",
            "text": "Where the Director-General of Customs collects, during the period commencing on January 1, 2011 and ending on the date of the commencement of this Act, from a person importing any article, the levy on such amount as is equal to five  percentum  as specified in section 3 of this Act on the cost, insurance and freight value of such article, such collection, shall be deemed for all purposes  to have been, and to be, validly made, and the Director-General of Customs is hereby indemnified against all action, civil or criminal, in respect of such collection.",
            "pre_block_list": [
              "Indemnity."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "14",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Minister may make regulations in respect of all matters which are required by this Act to be prescribed or in respect of which regulations are required or authorized to be made under this Act.",
                "pre_block_list": [
                  "Regulations."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every regulation made under subsection (1) shall be published in the  Gazette  and shall come into operation on the date of publication, or on later date as may be specified therein.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every regulation made under subsection (1) shall, as soon as convenient after its publication in the  Gazette , be placed before Parliament for approval. Every regulation which is not so approved shall be deemed to be rescinded as from the date of disapproval, but without prejudice to anything previously done thereunder.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Notification of the date on which any regulation is deemed to be so rescinded shall be published in the  Gazette .",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "II",
        "text": "",
        "pre_block_list": [
          "A MENDMENT   OF  P ART  I  OF   THE  F INANCE  A CT , N O . 11  OF  2002"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "15",
            "text": "Section 2 of the Finance Act, No. 11 of 2002 (Part I) is hereby amended in the first proviso to that section, by the repeal of paragraph ( d ) thereof and the substitution therefor of the following paragraph:",
            "pre_block_list": [
              "Amendment of section 2 of Part I of the Finance Act, No. 11 of 2002."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "for the period commencing on January 1, 2009 and ending on December 31, 2010 at the rate of 5.0  per  centum",
                "pre_block_list": [
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "16",
            "text": "It is hereby declared for the avoidance of doubts, that the provisions of Part I of the Finance Act, No. 11 of 2002 relating to the payment of the Ports and Airports Development Levy shall not apply to any article originating from outside Sri Lanka and imported into Sri Lanka or after January 1, 2011.",
            "pre_block_list": [
              "Part I of the Finance Act, No. 11 of 2002 not to apply."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "17",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of any inconsistency.",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , D EPARTMENT   OF G OVERNMENT  I NFORMATION , N O . 163, K IRULAPONA  M AWATHA , P OLHENGODA , C OLOMBO  05 before 15th December each year in respect of the year following ."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}