{
  "n_pages": 5,
  "title_page": {
    "title": "Law Commission (Amendment) Act",
    "num": "19",
    "year": "2016",
    "date_certified": "2016-10-17",
    "date_published": "2016-10-21",
    "price": 10.0,
    "price_postage": 10.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 17Th October, 2016]",
      "L. D.O. 52/2015.",
      "A N  A Ct   To   Amend   The  L Aw  C Ommission A Ct , N O . 3  Of  1969",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:"
    ],
    "pre_section_list": [
      {
        "class_name": "ActL1Section",
        "num": "1",
        "text": "This Act may be cited as the  Law Commission (Amendment) Act, No. 19 of 2016.",
        "pre_block_list": [
          "Short title."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "2",
        "text": "Section 2 of the  Law Commission  Act,  No. 3 of 1969 (hereinafter referred to as the principal enactment) as last amended by Act, No. 11 of 1978 is hereby repealed and the as following section substituted therefor:",
        "pre_block_list": [
          "Replacement of section 2 of Act, No. 3 of 1969.",
          "2. (1) There shall be established a Commission which shall be called the Law Commission, and which shall consist of",
          "Establishment and constitution of the Law Commission.",
          "( a ) the following  ex-officio  members:",
          "(i) the Secretary to the Ministry of the Minister assigned the subject of Justice or his nominee not below the rank of a Senior Assistant Secretary;",
          "(ii) an officer not below the rank of an Additional Solicitor- General nominated by the Attorney-General; and",
          "(iii) the Legal Draftsman or his nominee not below the rank of a Senior Assistant Legal Draftsman; and",
          "2PL 0101192,961  (08/2016)",
          "Law Commission (Amendment) Act, No. 19 of 2016 2",
          "( b ) not less than ten and not more than fourteen other members appointed by the President (hereinafter referred to as the appointed member) from among persons appearing to the President to be suitably qualified for such appointment and the majority of whom shall be persons who have held or hold judicial office, or have experience as attorneys-at-law or teachers in law, or are academically qualified in law."
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "The President shall appoint one of the members of the Commission to be the Chairman of the Commission.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "An appointed member shall, unless he earlier vacates his office, hold office for such period, not exceeding five years, as may be determined by the President at the time of his appointment, and shall be eligible for reappointment:",
            "pre_block_list": [
              "Provided, however, that if an appointed member vacates his office prior to the expiration of his term of office, his successor shall, unless he earlier vacates his office, hold office only for the unexpired portion of the term of the member whom he succeeds."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "4",
            "text": "An appointed member may resign from his office by writing under his hand addressed to the President.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "5",
            "text": "There shall be paid to the members of the Commission for their services such remuneration as may be determined by the Minister, with the prior concurrence of the Minister assigned the subject of Finance",
            "pre_block_list": [
              ""
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "3",
        "text": "Section 8 of the principal enactment is hereby amended by the substitution for the words any Commissioner of the words any member of the Commission.",
        "pre_block_list": [
          "Amendment of section 8 of the principal enactment."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "4",
        "text": "Section 11 of the principal enactment is hereby amended by the substitution for the words The Permanent Secretary to the Ministry of the words The Secretary to the Ministry.",
        "pre_block_list": [
          "Amendment of section 11 of the principal enactment."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "5",
        "text": "Section 12 of the principal enactment is hereby amended by the substitution for the words the Commissioners of the words the members of the Commission.",
        "pre_block_list": [
          "Amendment of section 12 of the principal enactment."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "6",
        "text": "Section 13 of the principal enactment is hereby amended by the repeal of the definition of the expressionCommissioner.",
        "pre_block_list": [
          "Amendment of section 13 of the principal enactment."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "7",
        "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
        "pre_block_list": [
          "Sinhala text to prevail in case of inconsistency.",
          "Law Commission (Amendment) Act, No. 19 of 2016 4",
          "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , D EPARTMENT   OF G OVERNMENT  I NFORMATION , N O . 163, K IRULAPONA  M AWATHA , P OLHENGODA , C OLOMBO  05 before 15th December each year in respect of the year following ."
        ],
        "child_level_list": []
      }
    ],
    "part_list": []
  }
}