{
  "n_pages": 4,
  "title_page": {
    "title": "Local Authorities Elections (Amendment) Act",
    "num": "16",
    "year": "2007",
    "date_certified": "2007-04-30",
    "date_published": "2007-05-04",
    "price": 4.25,
    "price_postage": 5.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 30Th April, 2007]",
      "L.D.O. 10/2007.",
      "A N  A Ct   To   Amend   The  L Ocal  A Uthorities E Lections  O Rdinance",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :-"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Local Authorities Elections (Amendment) Act, No. 16 of 2007.",
            "pre_block_list": [
              "Short title ."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "Section 65 A  of the Local Authorities Elections Ordinance is hereby amended as follows :",
            "pre_block_list": [
              "Amendment of section 65 A  of Chapter 262."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the renumbering of subsection (2) of that section as subsection (2) ( a ) of the subsection ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "in the renumbered subsection (2) ( a ) by the omission therefrom, of all the words from Where all the candidates whose names were in such nomination paper to the end of that subsection ; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "by the addition immediately after the renumbered subsection (2) ( a ) of the following :",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "Where all the candidates whose names appear in the nomination paper submitted by any recognized political party or independent group in respect of an electoral area have been elected or where none of the candidates whose names remain on such nomination paper have secured any preferences, and therefore a vacancy occurs in the relevant local authority, the returning officer shall notify such fact to the Secretary of the recognized political party or group leader of the independent group who",
                    "pre_block_list": [
                      "submitted the nomination paper of the member vacating office, requiring him to nominate within the period specified in the notice relating to the filling of the vacancy a person eligible under the Ordinance to be a member of a local authority, to fill such vacancy. If such secretary or group leader nominates within the specified period an eligible person to fill such vacancy and such nomination is accompanied by an oath or affirmation as the case may be, in the form set out in the Seventh Schedule to the Constitution taken and subscribed or made and subscribed as the case may be, by the person nominated to fill such vacancy, the returning officer shall declare such person elected as a member of the relevant local authority."
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "The person elected to fill the vacancy occurring in the manner specified in paragraph ( b ), in the relevant local authority, shall hold office only for the unexpired period of the term of office of the member whom he succeeds",
                    "pre_block_list": [
                      ""
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency.",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT   P UBLICATIONS  B UREAU , N O . 32, T RANSWORKS  H OUSE ,  L OTUS   R OAD ,  C OLOMBO  01  before  15th  December  each  year  in  respect of the year following."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}