{
  "n_pages": 16,
  "title_page": {
    "title": "Safety And Health  Act",
    "num": "38",
    "year": "2009",
    "date_certified": "2009-07-23",
    "date_published": "2009-07-24",
    "price": 10.0,
    "price_postage": 5.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 23Rd July, 2009]",
      "L.D.O. 24/2007",
      "A N  A Ct   To   Provide   For   The   Establishment   Of   The  N Ational",
      "I Nstitute   Of  O Ccupational  S Afety   And  H Ealth   For   The",
      "Formulation   Of   A   Policy   On   Occupational   Safety   And   Health",
      "Standards ;  To   Create   An   Environment   For   Occupational   Safety",
      "And   Health   At   All   Workplaces   To   Protect   Both   The   Employers",
      "And   Employees ;  And   For   Matters   Connected   Therewith   Or",
      "Incidental   Thereto .",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the National Institute of Occupational Safety and Health Act, No. 38 of 2009 and shall come into operation on such date as the Minister may appoint by Order published in the Gazette (hereinafter referred to as the appointed date).",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "I",
        "text": "",
        "pre_block_list": [
          "E STABLISHMENT   OF   THE   NATIONAL  I NSTITUTE   OF  O CCUPATIONAL",
          "S AFETY   AND  H EALTH"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be established an Institute which shall be called the National Institute of Occupational Safety and Health (hereinafter referred to as the Institute).",
                "pre_block_list": [
                  "Establishment of the National Institute of Occupational Safety and Health."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Institute shall by the name assigned to it by subsection (1) be a body corporate and shall have perpetual succession and a common seal and may sue and be sued in such name.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The general objects of the Institute shall be",
                "pre_block_list": [
                  "General objects of the Institute."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "to advise the Government in the formulation of a national policy on occupational safety and health and on the working environment both for employers and employees taking into consideration the nature of the occupation and the safety of the employers and employees;",
                    "pre_block_list": [
                      "2PL 003679   4,250 (2/2009)"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "to advise the Government on measures required for the prevention of accidents and injuries relating, to occupation at work places;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "to conduct, undertake and assist in investigations, study programmes, surveys and research in the field of occupational safety and health;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "to provide advisory services to any institution or person on the correct use of equipment, hazardous substances, physical, chemical or biological agents or products or any other hazards;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "to educate and provide necessary training to employees, occupiers, workers or any other person required of knowledge and training in occupational safety and health and related subjects either in collaboration with any other institution or university in Sri Lanka or abroad, or by the Institute and award certificates or diplomas on completion of such education or training;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "to provide required services on the correct use of equipment, hazardous substances, physical, chemical, biological agents or products and psychosocial hazards and avoidance of known hazards;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "g",
                    "text": "",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "to advise the Minister on legislative requirements with regard to standards, codes, practices and guidelines in matters relating to occupational safety and health;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "to evaluate and determine the work process, the substances and agents, the exposure to which is be prohibited, limited or made subject to supervision ;",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "h",
                    "text": "to undertake or collaborate in the collection, preparation, dissemination  and publishing of information relating to occupational safety and health;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "i",
                    "text": "to organize or to sponsor conferences, seminars, workshops, symposiums or such other similar programmes and publish papers in connection with occupational safety and health;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "j",
                    "text": "to co-ordinate inter-ministerial projects, programmes and activities on occupational safety and health;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "k",
                    "text": "to establish and maintain libraries and laboratories for the purpose of promoting and furthering of the practice of occupational safety and health;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "l",
                    "text": "to develop research and special laboratories;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "m",
                    "text": "to liaise and establish links and networks with relevant National and International Institutions, Universities or any other organizations in the field of occupational safety and health; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "n",
                    "text": "to establish national standards in the field of occupational safety and health.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Institute shall advise the Minister in addition to advise relating to the matter specified in paragraph ( g ) of subsection (1), on all or any of the matters specified in subsection (1), and on any other matter that may be referred to the Institution, from time to time, by the Minister.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Institute shall have the power to do all such acts as may be necessary for the discharge of any or all of its functions specified in section 3 of this Act.",
                "pre_block_list": [
                  "Powers of the Institute."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Institute without prejudice to the generality of the powers conferred on it by subsection (1), may",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "assess and evaluate, from time to time, the standards to be maintained in workplaces or working environments and advise the Minister on the legislative requirements relating to such standards, and to provide advisory services to occupiers,",
                    "pre_block_list": [
                      "workers or any other persons, when requested to do so, on all matters relating to occupational safety and health and working environment;"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "levy and charge a fee for services rendered or facilities or equipments provided by the Institute to any other institution, organization or any other person;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "acquire, hold, take or give on lease or hire, mortgage, pledge, sell or otherwise dispose of any movable or immovable property for the purpose of discharging the functions of the Institute; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "to enter into and execute, by the Institute or any other officer or agent authorized in that behalf by the Institute, all such contracts or agreements as may be necessary for the discharge of the functions of the Institute.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "II",
        "text": "",
        "pre_block_list": [
          "T HE  G OVERNING   COUNCIL   OF   THE   INSTITUTE"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Institute shall have a Governing Council (hereinafter referred to as the Council) in which the powers and duties of the Institute shall subject to the provisions of this Act, be vested in.",
                "pre_block_list": [
                  "Constitution of the Governing Council."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Council shall consist of",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "seven members appointed by the Minister (hereinafter referred to as the appointed members)",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "two of whom shall be representatives of employers organizations;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "two of whom are representing the workers organization;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "three persons distinguished in the fields of occupational safety and health and who shall be members of any Institution established",
                        "pre_block_list": [
                          "under the provisions of an Act, the functions of which include safety or health."
                        ],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the following  ex-officio  members:",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "the person for the time being holding office as the Secretary to the Minister of the Ministry in charge of the subject of Labour, who shall be the Chairman of the Council;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "the person for the time being holding office as the Commissioner-General of Labur, who shall be the Vice Chairman of the Council;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "the person for the time being holding office as the Commissioner of Labour (Industrial Safety);",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iv",
                        "text": "the person for the time being holding office as  the  Commissioner  of  Labour (Occupational Hygiene);",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "v",
                        "text": "one member, being an officer not below the rank of a Senior Assistant Secretary nominated by the Minister in charge of the subject of Finance;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "vi",
                        "text": "one member, being an officer not below the rank of a Senior Assistant Secretary nominated by the Minister in charge of the subject of Health;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "vii",
                        "text": "one member, being an officer not below the rank of a Senior Assistant Secretary nominated by the Minister in charge of the subject of Industries;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "viii",
                        "text": "one member, being an officer not below the rank of a Senior Assistant Secretary nominated by the Minister in charge of the subject of Agriculture; and",
                        "pre_block_list": [
                          "(ix) the person for the time being holding office as the Director-General of the Institute."
                        ],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "There shall be a Secretary to the Council who shall keep and maintain records of the Council. The Council shall appoint a Director of the Institute as the Secretary.",
            "pre_block_list": [
              "Secretary to the Council."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Every appointed member of the Council shall, unless he vacates office earlier by death, resignation or removal, hold office for a term of three years from the date of his appointment and unless he has been removed from office shall be eligible for reappointment.",
                "pre_block_list": [
                  "The term of office of the members of the Council."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any appointed member may, at any time resign from office by a letter addressed to that effect to the Minister. Such resignation shall take effect upon it being accepted by the Minister, in writing.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where an appointed member is temporarily unable to discharge the functions of his office by reason of ill health, absence from Sri Lanka or any other reason, the Minister may appoint another person to act in his place.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The Minister, in consultation with the relevant Minister in charge of the subject, when required, may, if he thinks it expedient to do so, remove from office, any appointed member for reasons assigned therefor, and thereupon such member shall deemed to have vacated his office.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "In the event of vacation of office, resignation or removal of any member, the Minister may appoint a suitable person to act in his place. Any member so appointed shall hold office for the unexpired period of the term of office of the member whom he succeeds.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "A person shall be disqualified from being appointed or continuing as an appointed member of the Council",
            "pre_block_list": [
              "Disqualification for membership of Council."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "if he is or becomes a Member of Parliament, Provincial Council or any local authority; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "if he is under any law in force in Sri Lanka or in any other country, found or declared to be of unsound mind; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "is a person who, having being declared an insolvent, or a bankrupt under any law in force in Sri Lanka or in another country, is an undischarged  insolvent or bankrupt; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "if he is serving or has served a sentence of imprisonment imposed by any court of law in Sri Lanka or in any other country.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Chairman of the Council shall summon a meeting of the Council at least once in every three months.",
                "pre_block_list": [
                  "Meetings."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Chairman shall summon a special meeting of the Council within fourteen days after being requested in writing to do so by seven members of the Council and shall specify in such notice the business to be dealt with at such meeting.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Chairman shall give at least seven days notice in writing of every meeting of the Council to each of the members and shall specify in such notice the business to be dealt with at such meeting.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The Chairman or in his absence the Vice-Chairman shall preside at all meetings of the Council.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "The quorum at any meeting of the Council shall be seven members.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "All questions for decision by the Council shall be decided by a vote of majority of members present and voting. In case of an equality of votes, the presiding officer shall have a casting vote.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "The proceedings at every meeting of the Council shall be recorded.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "8",
                "text": "Subject to the provisions herein, the Council may make rules determining the procedure to be followed at meetings of the Council.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "9",
                "text": "No act, decision or proceedings of the Board shall be deemed to be invalid by reason of the existence of any vacancy in the Council or any defect in the appointment or nomination of election of a member thereof.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "10",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be appointed by the Council a person to be the Director-General of the Institute (hereinafter referred to as the Director- General) who possesses sufficient knowledge and at least ten years experience in the practice of occupational safety and health.",
                "pre_block_list": [
                  "Director-General of the Institute."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Director-General shall be a full time officer of the Institute and shall subject to the direction of the Council, be responsible for the implementation of the decisions of the Council and shall discharge such other duties as may be assigned to him.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Council may, for reasons assigned therefor, remove from office the Director-General appointed under subsection (1).",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "11",
            "text": "There shall be appointed by the Council such number of persons to be Directors of the Institute, as shall be necessary for the efficient administration of the Institute. The persons so appointed shall possess seven years experience in a position with similar function as such Director and possess sufficient knowledge as is relevant to such position.",
            "pre_block_list": [
              "Directors of the Institute."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "12",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Institute may appoint to the staff of the Institute such officers and servants as it may deem necessary for the efficient exercise, perform and discharge of its powers, duties and functions under this Act.",
                "pre_block_list": [
                  "Appointment of staff."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Institute may subject to the other provisions of this Act",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "exercise disciplinary control of officers and servants of the Institute;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "fix the wages, salaries or other remuneration of the staff; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "determine the terms and conditions of service of the officers and servants of the Institute.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "13",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "At the request of the Council, any officer in the public service may with the consent of that officer and the Chairman of the public Service Commission, be temporarily appointed to the staff of the Institute for such period as may be determined by the Council or, with like consent, be permanently appointed to such staff.",
                "pre_block_list": [
                  "Appointment of Public officers to the Institute."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where any officer in public service is temporarily appointed to the staff of the Institute, the provisions of subsection (2) of section 14 of the National Transport Commission Act, No. 37 of 1991 shall  mutatis mutandis apply to, and in relation to, such officer.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where any officer in public service is permanently appointed to the staff of the Institute, the provisions of subsection (3) of section 14 of the National Transport Commission Act, No. 37 of 1991 shall,  mutatis mutandis apply to, and in relation to such officer.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where the Institute employs an person who has entered into a contract with Government by which he has agreed to serve the Government for a specific period, any period of service to the Institute by that person shall be regarded as service to the Government for the purpose of discharging the obligations of that person under such contract.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "At the request of the Council, a member of the Local Government Service or any officer of any Local Authority may with the consent of that member, officer or employee be temporarily appointed to the staff of the Institute for such period as may be determined by the Institute, or with like",
                "pre_block_list": [
                  "consent be permanently appointed to such staff on such terms and conditions including those relating to pension or provident fund rights as may be agreed upon by the Institute and the Local Government Service Advisory Board or the Local Authority, as the case may be."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "Where a person is temporarily appointed to the staff of the Institute under subsection (5) of this section, that person shall be subject to the same disciplinary control as any other member of the staff.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "14",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Director-General may with the approval of the Council, and whenever he considers it necessary to do so, delegate in writing to any officer of the Institute any power of function conferred or assigned to him under this Act and such officer shall exercise and discharge any power or function subject to the direction and control of the Director-General.",
                "pre_block_list": [
                  "Delegation of powers."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Notwithstanding any such delegation, the Institute may continue to exercise or perform or discharge any such power, duty or function.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "15",
            "text": "The Director-General may by notice in writing require any occupier or head of Institution in Government or private sector to furnish to the Institute, within such time as may be specified in that notice, all such information relating to the functions of the Institution concerning occupational safety and health within the purview of such Institution to enable to exercise and discharge of his powers and functions of the Institute under this Act.",
            "pre_block_list": [
              "Collection of Information."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "III",
        "text": "",
        "pre_block_list": [
          "F UND   AND   THE  F INANCES   OF   THE  I NSTITUTE"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "16",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Institute shall have its own fund (hereinafter referred to as the Fund).",
                "pre_block_list": [
                  "Fund of the Institute."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "There shall be paid into the Fund",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "all sums of money as may be voted from time to time by Parliament for the use of the Institute and any funds provided to the Institute by the Government by way of grant, loan or otherwise;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the proceeds of any cess levied and collected under this Act;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "all sums that may be received by the Institute by way of fees and charges;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "all sums that may be received by the Institute as income from any investments made by the Institute;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "all sums that may be received by the Institute in exercise, performance and discharge of its powers, duties and functions; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "all sums as may be received by the Institute by way of loans, donations, gifts or grants from any source whatsoever whether from Sri Lanka or outside Sri Lanka.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "There shall be paid out of the Fund",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the remuneration payable to the members of the Governing Council as may be determined by the Minister with the concurrence of the Minister in charge of the subject of Finance;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the salaries, allowances and such other fees or payments payable to lecturers, consultants, experts, officers, servants and employees of the Institute; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "all sums as are required to defray any expenditure incurred by the Institute in the exercise, performance and discharge of its powers, duties and functions under this Act.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "17",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The financial year of the Institute shall be the calendar year.",
                "pre_block_list": [
                  "Financial year and audit of accounts."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Institute shall cause to be prepared in respect of each financial year a statement of receipts and payments, a statement of income and expenditure, a statement of assets and liabilities and a statement of investments showing the face value, purchase price and market value of each of the investments. A copy of each of the statements prepared under this subsection shall be transmitted to the Minister before the thirtieth day of September of the succeeding year.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The provisions of Article 154 of the Constitution relating to the audit of the accounts of public corporations shall apply to and in relation to the audit of accounts of the Institute.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "18",
            "text": "The Institute shall prepare an annual report of the work of the Institute and forward such report before the lapse of the year succeeding the year to which such report relates, to the Minister who shall table such report in Parliament.",
            "pre_block_list": [
              "Report to be tabled in Parliament."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "IV",
        "text": "",
        "pre_block_list": [
          "G ENERAL"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "19",
            "text": "The Institute may make rules in respect of the administration of the affairs of the Institute and in relation to its officers and servants, including their appointments, promotions, remuneration, disciplinary control and of grant of leave to them. Every such rule shall be published in the Gazette .",
            "pre_block_list": [
              "Rules of the Institute."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "20",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Minister may make regulations in respect of matters which are required to be prescribed or in respect of which regulations are authorized to be made or where it is necessary for giving effect to the principles of this Act.",
                "pre_block_list": [
                  "Power to make regulations."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every regulation made under subsection (1), shall be published in the  Gazette  and shall come into operation on the date of such publication or on such later date as may be specified in the regulation.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every regulation shall, as soon as practicable, after its publication in the  Gazette,  be brought before Parliament for approval. Any regulation which is not so approved shall be deemed to be rescinded from the date of its disapproval but without prejudice to anything previously done thereunder.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "21",
            "text": "The seal of the Institute shall be in the custody of such person as the Council may decide from time to time and may be altered in such manner as may be determined by the Council. It shall not be affixed to any instrument or document except in the presence of two members of the Institute both of whom shall sign the instrument or document in token of their presence. The Council shall maintain a register of all documents to which the seal of the Institute is affixed.",
            "pre_block_list": [
              "Seal of the Institute."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "22",
            "text": "It shall be lawful for the Director-General or an officer or agent authorized in that behalf by the Director-General to enter any work place at all reasonable hours and to do all such acts as may be required to perform all or any of the functions and duties of the Institute. Every officer or agent so authorized shall be issued with such a certificate of appointment, or authorization as may be prescribed, and, when visiting any workplace or premises in order to perform any function or act under this Act, shall if so required produce such certificate or authority to the occupier or to the person holding responsibility of the workplace or premises.",
            "pre_block_list": [
              "Power of entry and inspection."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "23",
            "text": "Where any immovable property is required to be acquired for any specific purpose of the Institute and the Minister by order published in the  Gazette  approves of the proposed acquisition for that purpose, that property shall be deemed to be required for a public purpose and may accordingly be acquired under the Land Acquisition Act (Chapter 420).",
            "pre_block_list": [
              "Acquisition of immovable property under the Land Acquisition Act.",
              "Expenses to be paid out of Fund of the Institute."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "24",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Any expenses incurred by the Institute in any suit or prosecution brought against the Institute, shall be paid out of the Fund of the Institute and any costs paid to or recovered by the Institute in any such suit or prosecution, shall be credited to the Fund of the Institute.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any expenses incurred by any member of the Council or any officer or servant of the Institute in any suit or prosecution brought against him before any Court in respect of any act which is done or purported to be done by such person under this Act or on the direction of the Council shall, if the Court holds that such act was done in good faith, be paid out of the Fund of the Institute, unless such expenses are recovered by him in such suit or prosecution.",
                "pre_block_list": [
                  "Sinhala text to prevail in case of inconsistency."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "25",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "26",
            "text": "For the purposes of this Act unless the context otherwise requires the occupier means any person who manages or administers the affairs of the government or any private establishment, institution, public corporation or statutory body, factory or any industry and includes any Authority to whom the function of management or administration is delegated.",
            "pre_block_list": [
              "Interpretation.",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , D EPARTMENT   OF G OVERNMENT  I NFORMATION , N O . 163, K IRULAPONA  M AWATHA , P OLHENGODA , C OLOMBO  05 before 15th December each year in respect of the year following ."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}