{
  "n_pages": 8,
  "title_page": {
    "title": "Nation Building Tax (Amendment)  Act",
    "num": "22",
    "year": "2016",
    "date_certified": "2016-11-07",
    "date_published": "2016-11-11",
    "price": 6.0,
    "price_postage": 10.0
  },
  "body_pages": {
    "preamble": [
      "Nation Building Tax  (Amendment) Act, No. 22 Of 2016 1",
      "[Certified On 07Th November, 2016]",
      "L.D.O. 28/2016",
      "A N  A Ct   To   Amend   The  N Ation  B Uilding  T Ax  A Ct , N O . 9  Of  2009",
      "Be   It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:-"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Nation Building Tax (Amendment) Act, No. 22 of 2016,  and shall be deemed to have come into operation from  November 1, 2016 unless different dates of operation are specified hereunder.",
            "pre_block_list": [
              "Short  title and date of operation."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "Section 3 of the Nation Building Tax Act, No. 9 of 2009  (hereinafter referred to as the principal enactment), as last amended by Act, No. 12 of 2015 is hereby further amended in subsection (4) thereof as follows:-",
            "pre_block_list": [
              "Amendment of Section 3 of Act, No. 9 of 2009."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "in paragraph (iii) of that subsection",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "in sub-paragraph ( b ) thereof, by the substitution for the words and figures but prior to January 1, 2015; and of the words and figures but prior to January 1, 2015;;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "in sub-paragraph ( c ) thereof, by the substitution for the words and figures on or after January 1, 2015; of the words and figures on or after January 1, 2015 but prior to April 1, 2016; and;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "by the insertion immediately after sub- paragraph ( c ) thereof, of the following new sub-paragraph:-",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "the sum of three million rupees if such relevant quarter is any quarter commencing on or after April 1, 2016:",
                    "pre_block_list": [
                      "2PL 0101832,961  (09/2016)",
                      "Provided that, in case of any person whose liable turnover for the quarter commencing on April 1, 2016 exceeds the sum of three million rupees and does not exceed the sum of three million seven hundred and fifty thousand rupees, such person shall be chargeable with the tax only on the liable turnover accrued on or after May 2, 2016 but prior to July 11, 2016, and on or after the date on which this Act comes into operation;; and"
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the repeal of paragraph (iv) of that subsection, and the substitution therefor of the following paragraph:-",
                "pre_block_list": [
                  "(iv) such quarter is a quarter commencing-",
                  "(A) on or after January 1, 2011 but prior to April 1, 2016 and the liable turnover of such person from-"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "operating a hotel, guest house, restaurant or other similar business;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the processing of any locally procured agricultural produce in the preparation for sale;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "providing educational services by any institution established locally for that purpose; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "supply of labour (manpower),",
                    "pre_block_list": [
                      "and which does not exceed the sum of twenty five million rupees:",
                      "Nation Building Tax  (Amendment) Act, No. 22 of 2016 3",
                      "Provided that, in the case of any person whose liable turnover from any business referred to in sub- paragraphs ( a ), ( c ) and ( d ) for the quarter commencing on April 1, 2016 exceeds the sum of three million rupees and does not exceed the sum of twenty five million rupees, such person shall be chargeable with the tax only on the liable turnover accrued on or after May 2, 2016 but prior to July 11, 2016, and on or after the date on which this Act comes into operation;",
                      "(B) on or after April 1, 2016 and the liable turnover of such person from the processing of any locally procured agricultural  produce  in  the preparation for sale and which does not exceed the sum of twenty five million rupees;."
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "Section 8 of the principal enactment as last amended by Act, No. 32 of 2009 is hereby further amended by the addition immediately after paragraph ( d ) of that section, of the following new paragraph:-",
            "pre_block_list": [
              "Amendment of section 8 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "no assessment or additional assessment shall be made under this Act in respect of any person-",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "i",
                    "text": "who has furnished a return for the relevant quarter in the year of assessment on or before the date referred to in paragraph ( d ) of this section, after the expiry of eighteen months from the thirtieth day of November of the year of assessment immediately succeeding the year of assessment in which such relevant quarter falls, if his return of income has been",
                    "pre_block_list": [
                      "furnished under subsection (1) or subsection (7) of section 106 of the Inland Revenue Act, No. 10 of 2006; or"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "who has failed to furnish a return on or before such date as is referred to in paragraph ( d ) of this section, after the expiry of four years from the thirtieth day of November of the year of assessment immediately succeeding the year of assessment within which such relevant quarter falls",
                    "pre_block_list": [
                      ""
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "The First Schedule to the principal enactment as last amended by Act, No. 12 of 2015, is hereby further amended as follows:-",
            "pre_block_list": [
              "Amendment of the First Schedule to the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "in PART I of that Schedule-",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "by the substitution for item (xi) thereof, of the following item:-",
                    "pre_block_list": [
                      "(xi) petroleum and petroleum products calssified  under  Harmonized Commodity Description and Coding Numbers for Customs purposes, for any period prior to May 2, 2016, and for the period commencing from July 11, 2016, and ending on or before the date on which this Act comes into operation;; and"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "by the substitution for item (xvi) thereof, of the following item:-",
                    "pre_block_list": [
                      "(xvi) any goods imported or supplied to a specified project, other than any housing project, as approved by the Minister prior to May 2, 2016, and for the period commencing from July 11,",
                      "Nation Building Tax  (Amendment) Act, No. 22 of 2016 5",
                      "2016, and ending on or before the date on which this Act comes into operation, considering economic benefit to the country and carried on, out of foreign funds or donations received by the Government;; and"
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "in Part II of that Schedule-",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "by the substitution for item (ii) thereof, of the following item:-",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "for any period ended prior to May 2, 2016, and for the period commencing from July 11, 2016, and ending on or before the date on which this Act comes into operation, supply of electricity;; and",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "by the substitution for item (xxviii) thereof, of the following item:-",
                    "pre_block_list": [
                      "(xxviii) for any period ended prior to May 2, 2016, and for the period commencing from July 11, 2016, and ending on or before the date on which this Act comes into operation, telecommuni- cation services liable to the telecommunication levy under the Telecommunication Levy Act, No. 21 of 2011, and the services specially excluded from such liability in defining the telecommunication services in that Act;."
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "Where the Commissioner-General of Inland Revenue or the Director-General of Customs as the case may be, collects under the provisions of section 4 or section 5",
            "pre_block_list": [
              "Validation.",
              "respectively of the principal enactment, the tax calculated considering the provisions of this Act, during the period commencing from January 1, 2016 and ending on the date of coming into operation of this Act from a person to whom the provisions of this Act applies, such collection shall be deemed for all purposes to have been, and to be, validly made:",
              "Provided that the aforesaid provisions of this section shall not affect any decision or order made by any Court or any proceeding pending in any Court in respect of any tax collected during the aforesaid period."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency.",
              "Nation Building Tax  (Amendment) Act, No. 22 of 2016 7",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , D EPARTMENT   OF G OVERNMENT  I NFORMATION , N O . 163, K IRULAPONA  M AWATHA , P OLHENGODA , C OLOMBO  05 before 15th December each year in respect of the year following ."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}