{
  "n_pages": 22,
  "title_page": {
    "title": "Udarata  Development  Authority Of Sri  Lanka  Act",
    "num": "26",
    "year": "2005",
    "date_certified": "2005-08-24",
    "date_published": "2005-08-26",
    "price": 16.25,
    "price_postage": 7.5
  },
  "body_pages": {
    "preamble": [
      "[Certified On 24Th August, 2005]",
      "L. D.O. 19/2004",
      "A N  A Ct   To   Provide   For   The   Establishment   Of   The  U Darata D Evelopment  A Uthority   Of  S Ri  L Anka   For   The   Purpose   Of",
      "Identifying ,  Formulating   And   Co - Ordinating   The   Implementation",
      "Of   Development   Projects   Within   The   Udarata   Area ,  And   For",
      "Matters   Connected   Therewith   And   Incidental   Thereto",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :-",
      "Short Title And Date Of Operation.",
      "Chapter I",
      "E Stablishment   Of   The  U Darata  D Evelopment   A Uthority   Of S Ri  L Anka"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be established an Authority which shall be called the Udarata Development Authority of Sri Lanka (hereinafter referred to as the Authority).",
                "pre_block_list": [
                  "Establishment of the Udarata Development Authority of Sri Lanka."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Authority shall by the name assigned to it by subsection (1), be a body corporate and shall have perpetual succession and a common seal and may sue be sued in such name.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "For the purposes of this Act, the area of authority  of the Authority shall be limited to any area falling within the Administrative Districts of Kandy, Matale,  Nuwara Eliya, Kegalle, Ratnapura, Badulla, Monaragala and Ampara.",
                "pre_block_list": [
                  "Area of authority."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Minister may from time to time by Order published in the  Gazette  identify any Divisional Secretaries Division or  part thereof, falling within any one of the aforesaid Administrative Districts, to be a designated area for the purposes of this Act :",
                "pre_block_list": [
                  "Provided however, that the Authority may maintain branch offices and engage in any other activity outside the designated area, insofar as the same is necessary for the attainment of the objects of this Act.",
                  "2PL 0003275,650 (06/2005)"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "The management of the affairs of the Authority shall be vested in a Board of Management appointed by the President (hereinafter referred to as the Board), which shall consist of the following :",
            "pre_block_list": [
              "Constitution of the Board of Management of the Authority."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "ex-officio  members, namely-",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "i",
                    "text": "the Secretary to the Ministry of the Minister in charge of the subject of Udarata Development ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "an officer holding the position of the Deputy Secretary to the Treasury of the Ministry of the Minister in charge of the subject of Finance, nominated by such Minister ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iii",
                    "text": "an officer of the Ministry of the Minister in charge of the subject of Plantation Infrastructure, nominated by such Minister; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "five members appointed by the President on the recommendation of the Minister, (hereinafter referred to as the appointed members).",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The President shall nominate a member to be the Chairman of the Authority (hereinafter referred to as the Chairman) from amongst the members of the Board.",
                "pre_block_list": [
                  "Chairman of the Authority."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where the Chairman by reason of illness or absence from Sri Lanka is temporarily unable to perform the duties of his office, the  President may appoint another member of the Board to act in his place.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The President may for reasons assigned, remove the Chairman from the office of the Chairman.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The Chairman may resign from office by letter addressed to the President and such resignation shall be effective from the date on which it is accepted by the President.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "A person shall be disqualified from being appointed or continuing as member of the Board if",
            "pre_block_list": [
              "Disqualification from being a member of the Borad."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "he is or becomes a member of Parliament or Provincial Council or local authority ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "he is not or ceases to be a citizen of Sri Lanka ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "he is under any law in force in Sri Lanka or in any other country found or declared to be of unsound mind ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "he is serving or has served a sentence of imprisonment imposed by any court in Sri Lanka or any other country ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "he holds  or enjoys any right or benefit  under any contract made by or on behalf of the Authority ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "he is a person having been declared as an insolvent or a bankrupt person under any law in Sri Lanka or any other country and is an undischarged insolvent or bankrupt.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "An appointed member may resign his office by letter addressed to the President and such resignation shall be effective from the date on which it is accepted by the President.",
                "pre_block_list": [
                  "Removal and resignation of appointed members."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The President may for reasons assigned, remove an appointed member from office.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where an appointed member dies, resigns or is removed from  office the President shall, having regard to the provisions of section 4, appoint another member in his place.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "A member appointed under subsection (3) shall hold office for the unexpired period of the term of office of the member whom he succeeds.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Subject to the provisions of subsections (1) and (2) of section 7 the term of office of an appointed member of the Board shall be five years and such member shall be eligible for re-appointment.",
                "pre_block_list": [
                  "Term of office of members."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "An appointed member who has been removed from office shall not be eligible for re-appointment as a member of the Board or to serve the Authority in any other capacity.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Chairman of the Authority shall, if present preside at every meeting of the Board. In the absence of the Chairman from any such meeting, the members present shall elect one of the members present to preside at such meeting.",
                "pre_block_list": [
                  "Meetings of the Board."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The quorum for any meeting of the Board shall be four members.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Subject to the preceding provisions of this section, the Board may regulate the procedure in regard to the meetings of the Board and the  transaction of business at such meetings.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "10",
            "text": "The members of the Board shall be paid remuneration out of the Fund of the Authority at such rates as may be determined by the Minister, with the concurrence of the Minister in charge of the subject of Finance.",
            "pre_block_list": [
              "Remuneration of members."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "11",
            "text": "No act, decision or proceeding of the Board shall be deemed to be invalid by reason only of the existence of any vacancy in the Board or of any defect in the appointment of any member thereof.",
            "pre_block_list": [
              "Acts not invalidated by reason of a vacancy."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "12",
            "text": "In the exercise of its powers, discharge of its functions and performance of its duties, the Authority shall comply with the general policy of the Government and with any general or special directions issued to it by the Minister in relation to the implementation of such policy.",
            "pre_block_list": [
              "Authority to comply with the general policy of the Government."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "13",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The seal of the Authority shall be in the custody of such person as the Board may from time to time decide .",
                "pre_block_list": [
                  "Seal of the Authority."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The seal of the Authority may be altered in such manner as may be determined by the Board.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The seal of the Authority shall not be affixed to any instrument or document except in the presence of the Chairman, and one other member of the Board both of whom shall sign the instrument or document in token of their presence :",
                "pre_block_list": [
                  "Provided that where the Chairman is unable to be present at the time when the seal of the Authority is affixed to any instrument or document, any other member of the Board authorized in writing by the Chairman in that behalf, shall be competent to sign such instrument or document in accordance with the preceding provisions of this subsection."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The Board shall maintain a register of the instruments and documents to which the seal of the Authority is affixed.",
                "pre_block_list": [
                  "CHAPTER II",
                  "O BJECTS   OF   THE  A UTHORITY   AND   P OWERS , D UTIES   AND  F UNCTIONS",
                  "OF   THE  B OARD"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "14",
            "text": "The objects of the Authority shall be to :",
            "pre_block_list": [
              "Objects of the Authority."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "plan and implement development projects within any designated area to improve productivity, foster economic, social, cultural and environmental development and generate income and employment opportunities ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "carry out detailed studies of the projects identified in the overall development plan for the designated area, on a priority basis ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "identify groups of people handicapped due to historical, social  and other factors and prepare proposals, raise funds and execute projects to uplift their social and economic conditions ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "extend special attention to the preservation of the city of Kandy,  its heritage, cultural institutions, environment and infrastructure in consideration of its historical significance, cultural and economic importance to the entire nation ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "secure the co-operation of government departments, state institutions, local authorities, public corporations, provincial authorities and other persons natural or legal whether private or public, in carrying out studies referred to in paragraph ( b ) and in the implementation of development projects within any designated area ; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "secure the participation of foreign and local private sector agencies, in carrying out detailed studies referred to in paragraph ( b ) and the implementation of development projects within any designated area.",
                "pre_block_list": [
                  "Powers, duties and functions of the Board."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "15",
            "text": "For the purpose of carrying out the objects of the Authority, the Board may exercise, perform and discharge all or any of the following powers, duties and functions :",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "identify and approve development projects for implementation within any designated area ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "secure and obtain technical and financial assistance from local and foreign sources in carrying out the objects of the Authority ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "obtain local and foreign assistance in carrying out studies aimed at implementing development projects within any designated area ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "require any Ministry, government department or other agency responsible for the implementation of the projects being carried on in any designated area, to co-operate in the planning and implementation of such projects ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "request any Ministry, government department or other agency to take over, maintain and operate any development project of the Authority ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "establish its own divisions or agencies as are necessary for the discharge of its functions within any designated area ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "g",
                "text": "carry out research relating to the economic, social, cultural and environmental development of the designated areas ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "h",
                "text": "prepare an environmental impact assessment report in respect of any development project to be implemented within any designated area ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "award in accordance with the tender procedure laid down by the government from time to time, tenders for the procurement of goods and services necessary for the implementation of the development projects ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "j",
                "text": "impose or levy a charge for the services rendered by the Authority within the designated area ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "k",
                "text": "purchase, acquire, erect, maintain, reconstruct or adopt any offices, plants, machinery or other material that may become necessary for   the implementation of any development project ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "l",
                "text": "implement development projects through any public or private institution or jointly by private and public institutions ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "m",
                "text": "to borrow or raise money or secure obligations from sources in Sri Lanka as is necessary for the implementation of any development project ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "n",
                "text": "to acquire and hold any movable or immovable property;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "o",
                "text": "in collaboration with relevant Ministries, take such measures as may be necessary for water -shed management and control of soil erosion ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "p",
                "text": "in collaboration with the relevant Ministries and private entrepreneurs manage farms and engage in farming, agricultural and horticultural activites  ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "q",
                "text": "provide advisory and farmer training services to improve cultivation techniques, water management, soil management, and preservation of the physical environment ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "r",
                "text": "in collaboration with State and Private Banks, manage and operate schemes of supervised credit to farmers ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "s",
                "text": "provide agricultural inputs such as seed materials, fertilizers, agro-chemicals, power, agricultural machinery and equipment to farmers ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "t",
                "text": "in collaboration with the relevant Ministries, facilitate or contract research relating to the development of agriculture and agro-based specific agricultural or related activities ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "u",
                "text": "promote the establishment of agro-based or related industrial and commercial enterprises ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "v",
                "text": "promote the establishment of marketing services for the purchase, storage, processing and sale of farm and other produce ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "w",
                "text": "promote manufacture and trade of any plant, machinery, tools, goods or things of any description ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "x",
                "text": "import, export, buy, sell and otherwise deal in goods, produce, articles or merchandise ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "y",
                "text": "acquire by subscription, purchase or otherwise and to accept  and take, hold and sell, shares or stock in any company, society or undertaking such as may be likely to promote or advance the objects of the Authority ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "z",
                "text": "accept any stocks or shares in or debentures or other securities of any company in payment or part payment for any sale made to, or debt owing from, any such company ;",
                "pre_block_list": [
                  "( aa ) promote, invest and participate in subsidiary companies in order to achieve the objects of the Authority ; and",
                  "( bb ) subject to the provisions of the Constitution and any other written law, do all such other acts as may be incidental or conducive to the attainment of the objects of the Authority or  the exercise of its powers under this Act."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "16",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Board shall have the power to enter into any agreement with any government department, Provincial Council, local authority or any  other body, or person whether private or public, including joint ventures, for the purpose of exercising, performing and discharging the powers, duties and functions of the Authority.",
                "pre_block_list": [
                  "Powers of the Board to enter into any agreement."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every such agreement shall be in writing and shall upon registration with the Authority constitute a valid and binding contract  between the Authority and such goverment deparment, local authority or other body or person.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "17",
            "text": "The Board may, in writing under the seal of the Authority or in such other manner as may be provided by the rules made by the Authority, empower any other person either generally or in respect of any specific matter, to act for and on behalf of the Authority, in any place outside Sri Lanka.",
            "pre_block_list": [
              "Empowering of persons to act for Authority outside Sri Lanka."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "18",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where the Board considers it necessary for the purposes of this Act, it may with the approval of the President in or in relation to a designated area give special or general directions to any government department or corporation after consultation with such department or corporation to perform and discharge such duties and functions relating to the implementation of any development project as the Authority may determine.",
                "pre_block_list": [
                  "Power of Board to issue directions to any government department or corporation."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "It shall be lawful for any such department or corporation to whom any such direction is given by the Authority under subsection (1) to comply with such direction.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Subject to the provisions of the Constitution, a department or corporation to which any direction is given under subsection (1), shall be subject to the supervision and control of the Authority in respect of all matters connected with such direction.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "19",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where any land or any interest in any land within any designated area is required by the Authority for the implementation of any of the projects and the Minister by Order published in the  Gazette  approves of the  proposed acquisition, that land or interest in any land may accordingly be acquired under the Land Acquisition Act (Chapter 460) and be transferred to the Authority, as if such land or interest in land is required for a public purpose :",
                "pre_block_list": [
                  "Compulsory acquisition of land.",
                  "Provided however, where any land or any interest in any land of an estate situated within the designated area is required by the Authority the Minister shall consult the Minister in charge of the subject of Plantation Infrastructure, before publishing an Order, under this section for the acquisition of such land or interest in such land."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "In any case where any land or any interest in any land within any designated area is to be acquired under the Land Acquisition Act for any purpose of the Authority and public notice of the intention to acquire that land or interest is",
                "pre_block_list": [
                  "published as required by the aforesaid Act at any time within period of three years commencing from the date of publication of the Order under subsection (1), the following provisions shall apply for the purpose of determining the amount of compensation to be paid in respect of that land or interest, notwithstanding anything to the contrary in that Act"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the market value of the land shall be deemed to be the market value the land would have had on the date of publication of such Order, if it then were in the same condition as it is in the time of acquisition, increased by a reasonable amount on account of bona fide  improvements if any, effected to such land after such date ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "in ascertaining the market value of the land at the date of publication of such Order, no account shall be taken of any benefit or increase in value which may have accrued, or any expectation of benefit or increase in value likely to accrue directly or indirectly, from any development work or other operation of the Authority in pursuance of the provisions of this Act.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Notwithstanding the provisions of subsection (2), where any person suffers loss or damage to his permanent residence or livelihood, due to the acquisition of any land or any interest in any land situated within the designated area, such person shall, in addition to the compensation paid to such person under subsection (2) be compensated in accordance with the National Involuntary Resettlement Policy of the Government.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Any sum payable as compensation for the acquisition of any land or interest in any land under subsection (1) for the purposes of the Authority shall be paid by the Authority.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "20",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where any immovable property of the State is required for any purpose of the Authority, such purpose shall be deemed to be a purpose for which a special grant or lease may be made under section 6 of the Crown Lands Ordinance (Chapter 454) and the provisions of that Ordinance shall accordingly apply to a special grant or lease of such property to the Authority.",
                "pre_block_list": [
                  "State property both movable and immovable to be made available to the Authority."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where any movable property of the State is required for any purpose of the Authority, the Minister may by Order published in the  Gazette,  transfer to, and vest in the Authority the possession and use of such movable property :",
                "pre_block_list": [
                  "Provided however, that no Order affecting any movable property of the State shall be made by the Minister under the preceding provisions of this subsection, without the concurrence of the Minister having control over such property.",
                  "CHAPTER III",
                  "F INANCE"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "21",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Authority shall have its own Fund (hereinafter referred to as the Fund).",
                "pre_block_list": [
                  "Fund of the Authority."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "There shall be paid into the Fund",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "all such sums of money as may be voted from time to time by the Parliament for the use of the Authority;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "all such sums of money that may be received by the Authority in the exercise, performance and discharge of its powers, duties and functions under this Act;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "all such sums of money received by the Authority by way of gifts, grants or donations; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "all sums of money accruing to the credit of the Authority.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "There shall be paid out of the Fund all such sums as are required to defray the expenditure incurred by the Authority in the exercise, performance and discharge of its powers, duties and functions under this Act or under any other written law and all such sums as are required to be paid out of the Fund.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "22",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Notwithstanding the provisions of any other written law to the contrary, the Authority may for the purpose of discharging any of its duties, allocate funds to any public corporation or any government department with the approval of the Minister, and it shall be the duty of such corporation, or department, as the case may be, to carry out the said functions, and duly account for the expenditure incurred in discharging such duties.",
                "pre_block_list": [
                  "Power of the Authority to call upon any public corporation or government department to assist in the discharge of duties carry out certain functions."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Authority shall be entitled to require any corporation or government department, to which funds have been allocated under subsection (1), to furnish such information as may be required by the Authority in respect of the expenditure of such funds and it shall be the duty of such corporation or department to comply with such requirement.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "23",
            "text": "The Authority may open and maintain an account or accounts with such bank or banks as it may think appropriate and such account or accounts shall be operated in accordance with prevailing financial regulations of the Government pertaining to financial transactions of public corporations.",
            "pre_block_list": [
              "Authority to maintain accounts."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "24",
            "text": "The Minister with the concurrence of the Minister in charge of the subject of Finance may exempt the Authority from the payment of any customs or any other duty on any goods donated to the Authority or imported or purchased out of its funds by the Authority, if the donation or import or purchase of any such goods is considered to be conducive for the advancement of the objects of the Authority.",
            "pre_block_list": [
              "Exemption of Authority from payment of duties & c."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "25",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The financial year of the Authority shall be the calendar year.",
                "pre_block_list": [
                  "Financial year and audit of accounts."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The provisions of Article 154 of the Constitution relating to the audit of the accounts of public  corporations shall apply to the audit of the accounts of the Authority.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "26",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "For the purpose of discharging its duties under this Act, the Board is hereby authorized to borrow moneys from any local, international or foreign organization approved by the President, subject to terms and conditions, as the Government may determine subject to the provisions of subsection (4) of this section.",
                "pre_block_list": [
                  "Borrowing powers of the Board and Government Guarantees."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The loans authorized to be borrowed under this section may be denominated in foreign currency.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Minister in charge of the subject of Finance shall guarantee the loans raised by the Board under subsection (1), on behalf of the Government. Forthwith upon a guarantee the Minister shall place before Parliament a statement setting out the details of such guarantee.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Any sum required for the fulfillment of a guarantee under subsection (3) may, with the prior approval of the Parliament be paid out of the Consolidated Fund.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "In the case of any loan made to the Authority by any international or foreign organization approved by the President and guaranteed by the Government, the Government shall bear any loss and be entitled to any profit, resulting from any re- valuation of the rupee in relation to the currency or currencies in which that loan is expressed and the amount of very such loss shall be charged to the Consolidated Fund.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "The Minister in charge of the subject of Finance, by instrument under his hand is hereby empowered on behalf of the Government to sign any guarantee agreement between the Government and any local organization.",
                "pre_block_list": [
                  "CHAPTER IV",
                  "S TAFF   OF   THE  A UTHORITY"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "27",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Board shall appoint a Director-General of the Authority who shall be the Chief Executive Officer of the Authority.",
                "pre_block_list": [
                  "Director General."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Director-General shall, subject to the general or special direction and control of the Board, be charged with the direction of the affairs and transactions of the Authority, the exercise, performance and discharge of its powers, functions and duties, and the administration and control of the officers and servants of the Authority.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Director-General may, with the approval of the Authority, whenever he considers it necessary to do so, delegate to any officer or servant any power, duty or function conferred or imposed on, or assigned to him by this Act and such officer or servant shall exercise, perform and discharge such power, function or duty subject to the general or special directions of the Director-General.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "28",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Authority may appoint such officers and servants to the staff of the Authority as it considers necessary for the efficient discharge of its functions.",
                "pre_block_list": [
                  "Staff of the Authority."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The officers and servants appointed under subsection (1) shall be remunerated in such a manner and at such rates and shall be subject to such conditions of service as may be determined by the Authority with the approval of the President.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "At the request of the Authority any officer in the public service may, with the consent of the officer and the Secretary to the Ministry of the Minister in charge of the subject of Public Administration, be temporarily appointed to the Authority for such period as may be determined by the Authority with like consent, or be permanently appointed to such staff.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where any officer in the public service is temporarily appointed to the staff of the Authority, the provisions of subsection (2) of section 14 of the National Transport Commission Act, No. 37 of 1991, shall  mutatis mutandis , apply to and in relation to him.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Where any officer in the public service is permanently appointed to the staff of the Authority, the provisions of subsection (3) of section 14 of the National Transport Commission Act, No. 37 of 1991, shall  mutatis mutandis , apply to and in relation to him.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "Where the Authority employs any person who has agreed to serve the Government for a specified period, any period of service to the Authority by that person, shall be regarded as service to the Government for the purpose of discharging the obligations of such agreement.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "At the request of the Authority any member of the Local Government Service or any other officer or servant of a local authority, may, with the consent of such member, officer or servant and the Local  Government Service Commission, or the local authority, as the case may be , be temporarily appointed to the staff of the Authority for such period as may be determined by the Authority with like consent or be permanently appointed to such staff on such terms and conditions including those relating to pension or provident fund rights as may be agreed upon by the Authority and the Local Government Service Commission or that local authority.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "8",
                "text": "Where any member of the Local Government Service or any officer or servant of any local Authority is appointed temporarily under subsection (7) to the staff of the Authority, he shall be subject to the same disciplinary control as any other member of the staff of the Authority.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "29",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "At the request of the Authority any officer or servant of a public corporation may, with the consent of such officer or servant and the  governing board of such corporation, be temporarily  appointed to the staff of the Authority for such period as may be determined by the Authority  with like consent or with like consent be permanently appointed to the staff of the Authority on such terms and conditions, including those relating to pension or provident fund rights, as may be agreed upon by the Authority and the governing board of such corporation.",
                "pre_block_list": [
                  "Appointment of officers and servants of public Corporations to the staff of the Authority."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where any person is appointed whether temporarily or permanently, under subsection (1) to the staff of the Authority, he shall be  subject to the same disciplinary control as any other member of the staff of the Authority.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "For the purpose of this section governing board in relation to a public corporation means the Board of Directors or other body, in which the administration and management of that public corporation has been vested.",
                "pre_block_list": [
                  "CHAPTER V",
                  "G ENERAL"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "30",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Board may, subject to such conditions as may be specified in writing, delegate to the Chairman or any other member of the Board, any power, duty or function conferred or imposed on, or assigned to, the Authority.",
                "pre_block_list": [
                  "Delegation of powers of the Board."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Notwithstanding any such delegation, the Board may exercise, perform or discharge any such power, duty or function, so delegated.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "31",
            "text": "The Authority shall take all such measures as may be necessary to ensure that any financial assistance rendered by the Authority to any person for carrying out a development project within any designated area is utilized for the purpose for which it is given.",
            "pre_block_list": [
              "Authority to ensure that financial assistance given for carrying out development projects is utilized for the same."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "32",
            "text": "The Authority shall not make any investment in or otherwise transact business with an enterprise of which a member of the Authority is a partner, director or shareholder or in where such partner, director or shareholder directly or indirectly has an interest, unless the transaction is approved by the Minister.",
            "pre_block_list": [
              "Authority not to transact business with enterprises in which a member has interest, unless approved by the Minister."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "33",
            "text": "The Minister may order all or any of the activities of the Authority to be investigated and reported upon by such person or persons as he may specify and upon such order being made, the Authority shall afford all such facilities as may be necessary to carry out such order.",
            "pre_block_list": [
              "Powers of Minister to order investigations upon activities.",
              "Directions of the Minister."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "34",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Minister may, give to the Authority in writing general or special directions as to the performance of the duties and the exercise of the powers  of the Authority. It shall be the duty of the Authority to comply with such directions.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Minister may from time to time, in writing, direct the Authority to furnish to him in such form as he may require, returns, accounts and other information with respect to the property and activities of the Authority. It shall be the duty of the Authority to comply with such direction.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "35",
            "text": "The Authority shall be deemed to be a scheduled institution within the meaning of the Bribery Act, and the provisions of that Act, shall be construed accordingly.",
            "pre_block_list": [
              "Authority deemed to be scheduled institution within the meaning of the Bribery Act."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "36",
            "text": "All members, officers and servants of the Authority shall be deemed to be public servants within the meaning and for the purposes of the Panel Code.",
            "pre_block_list": [
              "Members, officers and servants of the Authority deemed to be public servants.",
              "Protection for action taken under this Act or on the direction of the Authority."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "37",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "No suit or prosecution shall lie-",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "against the Authority for any lawful act which in good faith is done or purported to be done by the Authority under this Act ; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "against any member, officer, servant or agent of the Authority for any lawful act which in good faith is done or is purported to be done by him under this Act or on the direction of the Authority.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any expense incurred by the Authority in any suit or prosecution brought by or against the Authority before any Court, shall be paid out of the Fund of the Authority, and any costs paid to, or recovered by the Authority in any such suit or prosecution shall be credited to the Fund of the Authority.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Any expense incurred by any such person as is referred to in paragraph ( b ) of subsection (1) in any suit or prosecution brought against him before any Court in respect of any act which is done or is purported to be done by him under this act or on the direction of the Authority shall if the Court holds that such act is done in good faith, be paid out of the Fund of the Authority, unless such expenses are recovered by him in such suit or prosecution.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "38",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Minister may, in consultation with the Authority, make regulations in respect of matters required by this Act to be prescribed or in respect of which regulations are authorized to be made.",
                "pre_block_list": [
                  "Regulations."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every regulation made by the Minister shall be published in the  Gazette  and shall come into operation on the date of such publication or on such later date as may be specified in the regulation.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every regulation shall as soon as it is convenient after its publication in the  Gazette  be brought before Parliament for approval. Any regulation which is not so approved shall be deemed to be rescinded from the date of disapproval but without prejudice to anything previously done thereunder.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "39",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Authority may make rules, in respect of all matters for which rules are required or authorized to be made under this Act.",
                "pre_block_list": [
                  "Rules."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every rule made by the Authority shall be approved by the Minister and be published in the  Gazette  and shall come into operation on the date of such publication or on such date as may be specified therein.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "40",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "41",
            "text": "In this Act, unless the context otherwise requires",
            "pre_block_list": [
              "Interpretation.",
              "development project means any activity whether public or private which would generate production, income, employment or which would improve the economic, social, cultural or environmental conditions of any designated area;",
              "environmental impact assessment report shall have the same meaning as is assigned to it by the National Environmental Act, No. 47 of 1980;",
              "local authority means any Municipal Council, Urban Council, Pradeshiya Sabha and includes any Authority created and established by or under any law to exercise, perform and discharge the powers, duties and functions corresponding to or similar to the powers, duties and functions exercised, performed and discharged by any such Council or Sabha.",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT   P UBLICATIONS  B UREAU , N O . 32, T RANSWORKS  H OUSE ,  L OTUS   R OAD ,  C OLOMBO  01  before  15th  December  each  year  in  respect of the year following."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}