{
  "n_pages": 8,
  "title_page": {
    "title": "The Rehabilitation Of Buddhist Temples Foundation (Incorporation) Act",
    "num": "17",
    "year": "2014",
    "date_certified": "2014-04-24",
    "date_published": "2014-04-25",
    "price": 11.0,
    "price_postage": 10.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 24Th April, 2014]",
      "L.D.O.(Inc.) 15/2010.",
      "A N  A Ct   To   Incorporate   The  R Ehabilitation   Of  B Uddhist T Emples  F Oundation",
      "Whereas A Foundation Called And Known As The Rehabilitation Of Buddhist Temples Foundation Has Heretofore Been Formed For The Purpose Of Effectually Carrying Out And Transacting All Objects And Matters Connected With The Said Foundation According To The Rules Agreed To By Its Members:",
      "Preamble.",
      "And Whereas The Said Foundation Has Heretofore Successfully Carried Out And Transacted The Several Objects And Matters For Which It Was Formed And Has Applied To Be Incorporated And It Is Expedient To Grant Such Application:",
      "Be It Therefore Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :-"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Rehabilitation of Buddhist Temples Foundation (Incorporation) Act, No. 17 of 2014.",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "From and after the date of commencement of this Act, such and so many persons as now are members of The Rehabilitation of Buddhist Temples Foundation (hereinafter referred to as the foundation) or shall hereafter be admitted as members of the Corporation hereby constituted shall be a body corporate with perpetual succession under the name and style of The Rehabilitation of Buddhist Temples Foundation (hereinafter referred to as the Corporation) and by that name may sue and be sued with full power and authority to have, and use a common seal and alter the same at its pleasure.",
            "pre_block_list": [
              "Incorporation of The Rehabilitation of Buddhist Temples Foundation.",
              "2PL 0049182,050 (06/2010)",
              "The Rehabilitation of Buddhist Temples Foundation  ( Incorporation) Act, No. 17 of 2014 2"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "The objects for which the Corporation is constituted are hereby declared to be:",
            "pre_block_list": [
              "Objects of the Corporation."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "to provide financial and other assistance to Buddhist Temples faced with financial difficulties to improve the infrastructure of such Buddhist temples and  buildings situated within the premises which are owned by such temples and which require rehabilitation;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "to take necessary measures for the fostering of spiritual values amongst the Buddhists in the area by encouraging involvement in national and religous customs and promotion of the Buddhist way of life; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "to work in collaboration with any other institution having objects similar to those of the Corporation with a view to facilitating the exchange of ideas and experience.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The management and administration of the affairs of the Corporation, shall subject to the provisions of this Act and rules of the Corporation made under section 6, be administered by a Committee of Management (hereinafter referred to as the Committee) consisting of a President, Secretary, Treasurer and such number of other members as are elected or appointed in accordance with the rules made under section 6.",
                "pre_block_list": [
                  "Management of the affairs of the Corporation."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The first Committee of the Corporation shall consist of the members of the Committee of the Foundation holding office on the day immediately preceding the date of commencement of this Act and shall continue to hold office until a new Committee is appointed in accordance with the rules made under section 6.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "No act or proceding of the Committee shall be deemed to be invalid by reason only of the existence of a",
                "pre_block_list": [
                  "vacancy among its members or any defect on the election or nomination of any member thereof."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "Subject to the provisions of this Act or any other written law, the Corporation shall have the following powers:",
            "pre_block_list": [
              "Powers of the Corporation."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "to receive or collect money, gifts, donations, grants or any other assistance from persons or organizations in Sri Lanka or abroad:",
                "pre_block_list": [
                  "Provided that, notwithstanding anything to the contrary in any other provisions of this Act, the Committee shall obtain prior written approval of the Department of External Resources of the Ministry of the Minister to whom the subject of Finance is assigned in respect of all foreign grants, gifts or donations;"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "to open and maintain current, savings or any other account in any bank or banks,as may be determined by the Committee;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "to enter into, perform and execute contracts and agreements either directly or through an officer or agent authorized by the Corporation for such purpose in order to achieve the objects of the Corporation;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "to borrow money or raise funds for the purposes of the Corporation;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "to invest funds of the Corporation in any  institution approved by the Committee; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "to appoint officers and servants for the fulfillment of objects of the Corporation.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "It shall be lawful for the Corporation, from time to time, at any general meeting and by a majority of the",
                "pre_block_list": [
                  "Rules of the Corporation.",
                  "The Rehabilitation of Buddhist Temples Foundation  ( Incorporation) Act, No. 17 of 2014 4",
                  "members present and voting to make rules not inconsistent with the provisions of this Act or any other written law, for all or any of the followign matters:"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the classification of membership and admission, withdrawal or expulsion of members;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the election or appointment of the members of the Committee, their powers, duties, functions and the terms of office;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "the appointment of various officers, agents and servants of the Corporation and their powers, duties, functions and disciplinary control;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "the procedure to be followed at the summoning and holding of meetings of the Committee, the time, place, notice and agenda of such meetings, the quorum therefor and the conduct of business thereat;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "management of properties of the Corporation and custody of its funds and generally for the management of the affairs of the Corporation.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any rule made by the Corporation may be amended, altered, added to, or rescinded at a like meeting, and in like manner, as a rule made under subsection (1).",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The members of the Corporation shall be subject to the rules of the Corporation.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Corporation shall have its own fund and all monies here to for or hereafter received by way of gift, bequest, donation, subscription, contribution, fess or grants or any financial investment shall be credited to the fund of the Corporation (hereinafter referred to tas the Fund) and such fund shall be maintained in one or more banks as may be determined by the Committee.",
                "pre_block_list": [
                  "Fund of the Corporation."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The following sums of money shall be credited to the Fund:",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "all monies received and collected by the Corporation by way of gifts, donations, subscriptions, contributions, fees, or grants and profits from investments;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "all monies received by the Corporation in the exercise of its powers and performance of its functions under this Act;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "all monies received by the Corporation as loans, grants or donations from sources in  Sri Lanka or abroad.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "There shall be paid out of the Fund, all sums of money required to defray any expenditure incurred by the Corporation in the exercise, performance and discharge of its powers, duties and functions.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "Subject to the provisions of this Act the Corporation shall be able and capable in law to acquire and hold any property both movable or immovable which may become vested in it by virtue of any purchase, grant, gift, testamentary disposition,  or otherwise, and all such property shall be held by the Corporation for the purpose of the Corporation and subject to the rules of the Corporation made under section 6 with full power to sell, mortgage, lease, exchange or otherwise dispose of the same.",
            "pre_block_list": [
              "Corporation may hold property movable and immovable.",
              "Application of money and property."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "The moneys and property of the Corporation shall be applied solely towards the promotion of its objects as set forth herein and no portion thereof shall be paid or transferred directly or indirectly by way of dividend, bouns, profit or otherwise howsoever to the members of the Corporation.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "10",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Corporation shall cause proper books of accounts to be kept of the income and expenditure, assets and liabilities, and all other transactions of the Corporation.",
                "pre_block_list": [
                  "Audit of Accounts.",
                  "The Rehabilitation of Buddhist Temples Foundation  ( Incorporation) Act, No. 17 of 2014 6"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The provisions of Aticle 154 of the Constitution shall be applicable in respect of the audit of the account of the Corporation.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The financial year of the Corporation shall be the calendar year.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "11",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The seal of the Corporation shall be in the custody of such person as may be determined by the Committee, and may be altered from time to time, in the manner determined by the Committee.",
                "pre_block_list": [
                  "Seal of the Corporation."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The seal of the Corporation shall not be affixed to any instrument except in the presence of two members of the Committee who shall siging their names in token of their presence, and such signing shall be independent of the signing of any person as a witness.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "12",
            "text": "If upon the dissolution of the Corporation there remains after the satisfaction of all debts and liabilities, any property whatsoever, such property, shall not be distributed among the members of the Corporation but shall be given or transferred to some other association or associations having objects, similar to the objects of the Corporation, and which is, or are by the rules thereof prohibited from distributing any income or profit among its or their members. Such association or associations shall be determined by the members of the Corporation at or immediately before the time of dissolution of the Corporation.",
            "pre_block_list": [
              "Property remaining on the dissolution of the Corporation."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "13",
            "text": "Nothing in this Act contained shall prejudice or affect the rights of the Republic or anybody politic or Corporation.",
            "pre_block_list": [
              "Saving of the rights of the Republic and others."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "14",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency.",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , D EPARTMENT   OF G OVERNMENT  I NFORMATION , N O . 163, K IRULAPONA  M AWATHA , P OLHENGODA , C OLOMBO  05 before 15th December each year in respect of the year following ."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}