{
  "n_pages": 5,
  "title_page": {
    "title": "Strategic  Development  Projects Act",
    "num": "14",
    "year": "2008",
    "date_certified": "2008-02-29",
    "date_published": "2008-02-29",
    "price": 4.0,
    "price_postage": 5.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 29Th February, 2008]",
      "L.D.O. 5/2008.",
      "A N  A Ct   To   Promote  S Trategic  D Evelopment  P Rojects  ;  To",
      "Provide   A   Tax   Free   Period   In   Relation   To    Identified S Trategic   D Evelopment  P Rojects  ;   And   To    Provide   For",
      "Matters   Connected   Therewith   Or   Incidental   Thereto .",
      "Be It Therefore Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Strategic Development Projects Act, No. 14 of 2008.",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "From and after the date of the coming into operation of this Act, there shall be certain projects identified in accordance with the following provisions contained herein, as Strategic Development Projects for the purposes of this Act, to which exemptions from the applicability of the provisions of the enactments specified in the Schedule to this Act, may from time to time be granted :",
            "pre_block_list": [
              "Objective of the Act.",
              "Provided that the period of any exemption granted in terms of this section shall in no event exceed a period of twenty-five years."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Board of Investment of Sri Lanka established by the Board of Investment of Sri Lanka Law, No. 4 of 1978, shall identify in consultation with the relevant line Ministries, any proposed project as a Strategic Development Project.",
                "pre_block_list": [
                  "Identification of Strategic Development Projects."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "On a project being identified in terms of subsection (1) as a Strategic Development Project, the Minister in charge of the subject of Investment shall by Notification published in the  Gazette  publish the relevant information relating to each proposed project and the exemptions to be granted in respect of the same.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "On the expiration of a period of thirty days from the date of the Notification published under subsection (2), the Minister",
                "pre_block_list": [
                  "2PL 0027905,400 (02/2008)",
                  "in charge of the subject of Investment, shall in consultation with the Minister in charge of the subject of Finance take such steps as are necessary to inform the Cabinet of Ministers of"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the rationale for considering such project as a Strategic Development Project ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the period of exemption proposed to be granted,",
                    "pre_block_list": [
                      "and obtain the approval of the Cabinet of Ministers for the identification of the project as a Strategic Development Project and for the granting of exemptions to such Project in terms of section 2."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "If the Cabinet of Ministers grants approval for such Project to be considered as a Strategic Development Project and for the aforesaid exemptions to be granted to such Project in terms of section 2, the Minister in charge of the subject of Investment shall, within six weeks from the date on which the approval of the Cabinet is granted, by Order published in the Gazette , specify the name of the Strategic Development Project, the date of commencement of such Project and the date on which the exemptions from the enactments specified in the Schedule hereto, granted in terms of section 2 will become operative and the date from which the same shall cease to be operative.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Every Order made in terms of subsection (4) shall be placed before the Parliament within three months from the date of publication of the Order in the  Gazette .",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "Every Order made under subsection (4) of section 3 shall,",
            "pre_block_list": [
              "Procedure for operation of order."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "become operative immediately upon approval by Resolution of Parliament ; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "if not approved by Parliament, be deemed to be rescinded with effect from the date of such Resolution, without prejudice to anything previously done thereunder.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "In the event of any inconsistency between the Sinhala and the Tamil  texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "Unless the context otherwise requires, Strategic Development Project means a project which is in  the national interest and which is likely to bring economic and social benefit to the country and which is also likely to change the landscape of the country, primarily through",
            "pre_block_list": [
              "Interpretation."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "the strategic importance attached to the proposed provision of goods and services, which will be of benefit to the public ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "the substantial inflow of foreign exchange to the country ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "the substantial employment which will be generated and the enhancement of the income earning opportunities ; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "the envisaged transformation in terms of technology.",
                "pre_block_list": [
                  "S CHEDULE (Section 2)",
                  "1. The Inland Revenue Act, No. 10 of 2006 2. The Value Added Tax Act, No. 14 of 2002 3. The Finance Act, No. 11 of 2002 4. The Finance Act, No. 5 of 2005 5. The Excise (Special Provision) Act, No. 13 of 1989 6. The Economic Service Charge Act, No. 13 of 2006 7. The Debits Tax Act, No. 16 of 2002 8. Customs Ordinance (Chapter 235)",
                  "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , D EPARTMENT   OF G OVERNMENT  I NFORMATION , N O . 163, K IRULAPONA  M AWATHA , P OLHENGODA , C OLOMBO  05 before 15th December each year in respect of the year following ."
                ],
                "child_level_list": []
              }
            ]
          }
        ]
      }
    ]
  }
}