{
  "n_pages": 4,
  "title_page": {
    "title": "Code Of Criminal Procedure (Amendment) Act",
    "num": "18",
    "year": "2016",
    "date_certified": "2016-10-17",
    "date_published": "2016-10-21",
    "price": 10.0,
    "price_postage": 10.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 17Th October, 2016]",
      "L. D.O. 44/2015.",
      "A N  A Ct   To   Amend   The  C Ode   Of  C Riminal  P Rocedure A Ct , N O . 15  Of  1979",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:"
    ],
    "pre_section_list": [
      {
        "class_name": "ActL1Section",
        "num": "1",
        "text": "This Act may be cited as the Code of Criminal Procedure (Amendment) Act, No. 18 of 2016.",
        "pre_block_list": [
          "Short title.",
          "Amendment of section 431 of Act, No. 15 of 1979."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "2",
        "text": "Section 431 of the Code of Criminal Procedure Act, No. 15 of 1979 (hereinafter referred to as the principal enactment) is hereby amended as follows:",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL3Paragraph",
            "num": "a",
            "text": "in subsection (2) of that section,  by the substitution for the words within six months of the words within two months; and",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "b",
            "text": "in subsection (3) of that section,  by the substitution for the words two thousand five hundred rupees or more. of the words one hundred thousand rupees or more",
            "pre_block_list": [
              "",
              "Amendment of section 432 of the principal enactment."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "3",
        "text": "Section 432 of the principal enactment is hereby amended by the repeal of the marginal note to that section and the substitution therefor of the following:",
        "pre_block_list": [
          "Procedure where no claimant appears within two months",
          "",
          "2PL 0100262,961  (06/2016)",
          "Code of Criminal Procedure (Amendment) Act, No. 18 of 2016 2"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "4",
        "text": "The following new section is hereby inserted immediately after section 432 of the principal enactment and shall have effect as section 432 A  of that enactment:",
        "pre_block_list": [
          "Insertion of new section 432 A  in the principal enactment.",
          "432 A . (1) Where the person entitled to the possession of such property establishes his claim within two months, the Magistrate shall order the property to be delivered to him on such conditions, as the Magistrate may think fit:",
          "Procedure where claimant appears within two months.",
          "Provided however, where the person entitled to the possession of such property does not consent to take the possession of the same, such property may be sold under the order of the Magistrate."
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "The proceeds of such sale shall be deposited in a deposit account opened and operated in that behalf, in a Government owned bank,  until the judgement of the case is pronounced.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "The person entitiled to the possession of the property referred to in subsection (1),  shall make an application, in the prescribed form and manner to obtain the value of such property and the payment shall be made subject to the recorded verdict of the case.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "4",
            "text": "Regulations shall be made prescribing the manner of administration and management of the deposit account referrred to in subsection (2)",
            "pre_block_list": [
              ""
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "5",
        "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
        "pre_block_list": [
          "Sinhala text to prevail in case of inconsistency.",
          "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , D EPARTMENT   OF G OVERNMENT  I NFORMATION , N O . 163, K IRULAPONA  M AWATHA , P OLHENGODA , C OLOMBO  05 before 15th December each year in respect of the year following ."
        ],
        "child_level_list": []
      }
    ],
    "part_list": []
  }
}