{
  "n_pages": 10,
  "title_page": {
    "title": "Surcharge  Tax  Act",
    "num": "14",
    "year": "2022",
    "date_certified": "2022-04-08",
    "date_published": "2022-04-08",
    "price": 15.0,
    "price_postage": 15.0
  },
  "body_pages": {
    "preamble": [
      "Surcharge Tax Act, No. 14 Of 2022 1",
      "[Certified On 08Th Of April, 2022]",
      "L.D.O. 2/2022",
      "A N  A Ct   To   Provide   For   The   Imposition   Of   Surcharge   Tax   And",
      "For   Matters   Connected   Therewith   And   Incidental   Thereto",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows: -"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Surcharge Tax Act, No. 14 of  2022.",
            "pre_block_list": [
              "Short title"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be levied, subject to the succeeding provisions of this Act, a tax to be called Surcharge Tax (hereinafter referred to as the tax) from",
                "pre_block_list": [
                  "Imposition of Surcharge Tax"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "any individual, partnership or company, whose taxable income calculated in accordance with the provisions of the Inland Revenue Act, No. 24 of 2017, exceeds rupees two thousand million, for the year of assessment commenced on April 1, 2020, at the rate of twenty five  per centum  on the taxable income of such individual, partnership or company, for such year of assessment:",
                    "pre_block_list": [
                      "Provided however, the income of a partner derived from a partnership shall not be taken into account when calculating the taxable income of such partner as an individual under this paragraph, if the tax has been paid by the partnership on such taxable income; and"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "each company of a group of companies, of which the aggregate of the taxable income of all subsidiaries and the holding company in that group of companies, calculated in accordance with the provisions of the Inland Revenue Act, No. 24 of 2017, exceeds rupees two thousand million, for the year of assessment commenced on April 1, 2020,     at the rate of twenty five  per centum , on the taxable",
                    "pre_block_list": [
                      "income of each such company after deducting the gains and profits from dividends received from a subsidiary which is part of such taxable income of each such company, for such year of assessment, notwithstanding that the taxable income of any one of such companies does not exceed rupees two thousand million:",
                      "Provided however, if a company is liable to pay the tax in terms of paragraph ( b ), such company shall not be liable to pay the tax in terms of paragraph ( a )."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "In calculating the aggregate of the taxable income under paragraph ( b ) of subsection (1), any  subsidiary or any holding company  of such group of companies which has a nil amount of taxable income, due to losses or unrelieved losses, shall not be taken into account.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where the Commissioner-General has approved an alternative period of twelve months under the provisions of the Inland Revenue Act, No. 24 of 2017,  for the purpose of maintaining accounts of any company liable to pay the tax under this Act, such approved period shall be deemed to be the year of assessment commenced on April 1, 2020, for the purposes of this Act.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Every individual, partnership, company and the subsidiaries and the holding company of every group of company liable to pay the tax under this Act, shall pay the tax in two equal installments on or before, the twentieth day of April and twentieth day of July of 2022, to the Commissioner- General.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "The tax shall be collected by the Commissioner-General and shall be remitted to the Consolidated Fund within fifteen days from the date of collection.",
                "pre_block_list": [
                  "Surcharge Tax Act, No. 14 of 2022 3"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "Notwithstanding any provision to the contrary in any other written law,",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the tax levied under this Act shall be deemed to be an expenditure in the financial statement relating to the year of assessment commenced on April 1, 2020;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "no deduction shall be granted in calculating the taxable income under the Inland Revenue Act, No. 24 of 2017, for any year of assessment, for the payment of the tax under this Act;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "no deduction shall be granted in calculating the Value Added Tax on the supply of financial services under the Value Added Tax Act, No. 14 of 2002, for the payment of the tax under this Act.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "For the purpose of this section taxable income",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "in relation to a company which has entered into an agreement with the Board of Investment of Sri Lanka under section 17 of the Board of Investment of Sri Lanka Law, No. 4 of 1978 and has become liable to income tax determined in accordance with such agreement, after the expiration of its period of tax exemption set out in such agreement means the profit before income tax  of such company as per the audited financial statement;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "in relation to an individual, a partnership, a company and  the subsidiaries and the holding company of a group of companies  other than the companies referred to in paragraph ( a ), shall have the same meaning assigned to such expression under section 3 of the Inland Revenue Act, No. 24 of 2017.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Every individual, partnership, company and  the subsidiaries and the holding company of every group of company  chargeable with the tax under this Act shall on or prior to April 20, 2022, furnish in writing to the Commissioner- General, a tax return in the specified form containing such particulars as may be specified by the Commissioner-General.",
                "pre_block_list": [
                  "Tax return shall be furnished"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Commissioner-General shall specify",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the form for tax returns;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the information to be furnished on the tax return and attachments if any, required to be filed with the tax return; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "the manner of filing.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "For the purpose of this Act, a tax return furnished under subsection (1) shall be treated as a tax return under the provisions of the Inland Revenue Act, No. 24 of 2017 and shall result in a self-assessment.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where any individual, partnership, company or  the subsidiaries and the holding company of any group of companies  is liable to pay the tax under this Act, fails to pay such tax, as provided for in this Act, such individual, partnership, company or  subsidiaries and the holding company of  the group of companies shall be deemed to be a defaulter of the tax under this Act.",
                "pre_block_list": [
                  "Default in payment of the tax"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "It shall be lawful for an assessment to be made in the name of the partnership and the amounts thereon shall be recoverable out of the assets of the partnership, or from any partner, or from any agent of the partnership.",
                "pre_block_list": [
                  "Surcharge Tax Act, No. 14 of 2022 5",
                  "Application of the certain provisions of the Inland Revenue Act, No.24 of 2017"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Subject to the provisions of subsections (2) and (3), the provisions of Chapter IX , Chapter X, Chapter XI, Chapter XII, Chapter XIII, Chapter XIV, Chapter XV, Chapter XVI, Chapter XVII, Chapter XVIII of the Inland Revenue Act, No.24 of 2017 shall,  mutatis mutandis , be applicable to the administration, record keeping and information collection, tax returns, assessments, objections and appeals, liability for and payment of tax, interest, recovery of tax, penalties and criminal proceedings under this Act.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every reference to income tax in any such provisions of the Inland Revenue Act, No.24 of 2017, shall be deemed to be a reference to the tax charged and levied in terms of the provisions of this Act.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Any default assessment, amended assessment or additional assessment shall not be made in respect of an individual, a partnership, a company or  the subsidiaries and the holding company of a group of companies  after the thirty first day of December, 2024:",
                "pre_block_list": [
                  "Provided however, above time limit shall not apply for making any amended assessment based on a decision of objection or appeal."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "In this Act, unless the context otherwise requires",
            "pre_block_list": [
              "Interpretation",
              "Commissioner-General shall have the same meaning assigned to such expression under the Inland Revenue Act, No. 24 of 2017;",
              "Company shall have the same meaning assigned to such expression under the Inland Revenue Act, No. 24 of 2017 but does not include any Employees Trust Fund, Provident Fund, Pension Fund, Pension Trust Fund, Gratuity or Termination Fund including "
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "Employees Provident Fund established under section 2 of the Employees Provident Fund Act, No. 15 of 1958;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "Employees Trust Fund established under section 3 of the Employees Trust Fund Act, No. 46 of 1980;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "Ceylon Electricity Board Provident Fund and Ceylon Electricity Board Pension Fund established under paragraph ( j ) of section 12 of the Ceylon Electricity Board Act, No. 17 of 1969;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "Universities Provident Fund established under section 90 of the Universities Act, No. 16 of 1978;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "Mercantile Service Provident Society established under section 3 of the Chamber of Commerce Ordinance (Chapter 289);",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "Bank of Ceylon Provident Fund established by the Bank of Ceylon established under the Bank of Ceylon Ordinance (Chapter 397);",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "g",
                "text": "Hatton National Bank Employees Provident Fund established by the Hatton National Bank Public Limited Company incorporated under the Companies Act, No. 7 of 2007;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "h",
                "text": "Peoples Bank Pension Trust Fund established under paragraph ( l ) of subsection (1) of section 5 of the Peoples Bank Act, No. 29 of 1961;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "Sri Lanka Central Bank Employees Pension Fund established under paragraph ( b ) of section 10 of the Monetary Law Act (Chapter 422)",
                "pre_block_list": [
                  "Surcharge Tax Act, No. 14 of 2022 7"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "j",
                "text": "Sri Lanka Telecom Provident Fund established by the Sri Lanka Telecom Public Limited Company incorporated under the Companies Act, No. 7 of 2007;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "k",
                "text": "National Insurance Trust Fund established under section 3 of the National Insurance Trust Fund Act, No. 28 of 2006;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "l",
                "text": "Bank of Ceylon Pension Trust Fund 2014 (Post 1996) established under the Trusts Ordinance (Chapter 87); and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "m",
                "text": "any provident fund or contributory pension scheme approved by the Commissioner of Labour in terms of Part IV of the Employees Provident Fund Act, No. 15 of 1958;",
                "pre_block_list": [
                  "group of companies means a holding company and its subsidiaries;",
                  "holding company means a company which as at the Thirty First day of March 2021, owns more than fifty  per centum  of the shares with voting rights of another company, directly or indirectly, other than a holding company incorporated outside Sri Lanka and not registered under Chapter XVIII of the Companies Act, No.7 of 2007;",
                  "partnership shall have the same meaning assigned to such expression under the Inland Revenue Act, No. 24 of 2017;",
                  "tax return shall have the same meaning assigned to such expression under the Inland Revenue Act, No. 24 of 2017;",
                  "subsidiary means a company in which as at the Thirty First day of March 2021, more than fifty  per centum  of its shares with voting rights were owned by another company, directly or indirectly other than a subsidiary incorporated outside Sri Lanka and not registered under Chapter XVIII of the Companies Act, No.7 of 2007 of a holding company incorporated outside Sri Lanka and not registered under Chapter XVIII of the Companies Act;",
                  "year of assessment shall have the same meaning assigned to such expression under section 20 of the Inland Revenue Act, No. 24 of 2017."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency",
              "Surcharge Tax Act, No. 14 of 2022 9",
              "English Acts of the Parliament can be purchased at the P RAKASHANA  P IYASA , D EPARTMENT   OF G OVERNMENT  P RINTING , N O . 118, D R . D ANISTER  D E  S ILVA  M AWATHA , C OLOMBO  8."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}