{
  "n_pages": 7,
  "title_page": {
    "title": "Banking (Amendment) Act",
    "num": "46",
    "year": "2006",
    "date_certified": "2006-11-30",
    "date_published": "2006-12-01",
    "price": 6.75,
    "price_postage": 5.0
  },
  "body_pages": {
    "preamble": [
      "Banking (Amendment) Act, No. 46 Of 2006 1",
      "[Certified On 30Th November, 2006]",
      "L.D.O 47/2006.",
      "A N  A Ct   To   Amend   The  B Anking  A Ct",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :-"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Banking (Amendment) Act, No. 46 of 2006.",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "Section 76 M  of the Banking Act, No. 30 of 1988 is hereby amended as follows :",
            "pre_block_list": [
              "Amendment of section 76 M  of the Banking Act, No. 30 of 1988."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "in subsection (3) of that section by the substitution for sub-paragraph (i) of paragraph ( b ) thereof, of the following :",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "i",
                    "text": "where the bank is incorporated or established within Sri Lanka by or under any written Law,",
                    "pre_block_list": [
                      "(A) proceedings for the compulsory winding up of the Bank shall commence and the provisions of Part VIII shall,  mutatis mutandis  apply to and in relation to, such winding up ; or",
                      "(B) the  Monetary  Board  may, notwithstanding the provisions of any other written law to the contrary, in the interest of the depositors and having regard to the necessity of ensuring the stability of the financial sector, in respect of any bank whose licence has been cancelled at any time prior to the coming into operation of this sub- paragraph, vest the business carried on by such Bank (hereinafter referred to as the defaulting bank) being business which such bank was authorized to carry",
                      "2PL 001323375  (2006/06)",
                      "Banking (Amendment) Act, No. 46 of 2006 2",
                      "on by or under this Act, or such part thereof as the Monetary Board may determine, in  a State Bank (hereinafter referred to as the acquiring bank) as the case may be, which consents to such vesting. The Board shall cause such vesting to be notified to both the defaulting bank as well as the aquiring bank :",
                      "Provided however, it shall be lawful for the Monetary Board, which had within the said period of six months commenced proceedings for the winding up of a defaulting bank, to subsequently vest in the manner aforesaid, the business or part thereof, of such bank in a State Bank :",
                      "Provided further, where the license of a licensed specialized bank has, at any time prior to the coming into operation of this sub-paragraph, been cancelled in terms of section 30 (10) ( b ) (i) of the Monetary Law Act, the provisions of this sub-paragraph shall mutatis mutandis  apply thereto.",
                      "For the purpose of sub-paragraph (B)",
                      "State Bank means any licensed commercial bank or licensed specialised bank within the meaning of the Banking Act, No. 30 of 1988, having a share capital of which the majority is owned by the Government, or of which the majority of the members of the Board of Directors is appointed by the Government. ; and",
                      "Banking (Amendment) Act, No. 46 of 2006 3"
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the insertion immediately after subsection (3) of that section of the following new subsections :",
                "pre_block_list": [
                  "(3 A ) For the purpose of subsection (3), the business carried on by a defaulting bank includes"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "all immovable and movable property owned by the defaulting bank on the day preceding the relevant date (including cash balances, reserve funds, investments and deposits) ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "all rights, powers, privileges, authorities and interests arising in, or out of, any property, movable or immovable, owned by the defaulting bank on the day preceding the relevant date ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "all the liabilities of the defaulting bank subsisting on the day preceding the relevant date ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "all books, accounts and documents relating or appertaining, to such undertaking in Sri Lanka.",
                    "pre_block_list": [
                      "(3 B ) With effect from the date on which the business carried on by the defaulting bank is vested in the acquiring bank in terms of sub-paragraph (i) of paragraph ( b ) of subsection (3) of section 76 M -",
                      "( a ) all contracts, deeds, bonds, agreements, powers of attorney, grants of legal representation and other instruments of whatever nature pertaining or relating to the vested business of the defaulting bank, subsisting or having effect on the day immediately preceding the relevant date,  to which the defaulting bank is a party or which are in favour of the defaulting bank, shall be deemed with effect from the relevant date to be contracts, deeds, bonds, agreements, powers of attorney, grants of legal representation or other instruments entered into or granted, as the case may be, by the acquiring bank ; and",
                      "Banking (Amendment) Act, No. 46 of 2006 4",
                      "( b ) all actions and proceeding of whatever nature instituted by or against the defaulting bank pertaining or relating to the vested business of the defaulting bank, and pending on the day immediately preceding the relevant date, shall be deemed with effect from the relevant date to be actions and proceedings instituted by or against the acquiring bank, and may be continued or prosecuted accordingly.",
                      "(3 C ) ( a ) Notwithstanding anything to the contrary in this Act or any other written law, the liability of the acquiring bank to meet the claims and demands of creditors and depositors on liabilities of the defaulting bank vested in it shall be in accordance with the terms and conditions of a Scheme which shall be formulated by the Monetary Board upon review of the business of the defaulting bank, and only to the extent set out in such Scheme. On the Scheme being formulated, the Monetary Board shall cause the Scheme to be published in a daily newspaper in the Sinhala, Tamil and English languages respectively :",
                      "Provided, however,  it shall be lawful for the Monetary Board to alter, vary or  modify such Scheme from time to time with the written consent of the acquiring bank. Any such alteration, variation or modification as the case may be, shall be published  in a daily newspaper in the Sinhala, Tamil and English languages respectively.",
                      "( b ) The Scheme referred to in paragraph ( a ) may-"
                    ],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "specify the manner of settling the liabilities of the defaulting bank by the acquiring bank, including the amounts payable and the times at which payments are to be made ;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "provide for an order of priority for settlement of the different classes of liabilities of the defaulting bank vested in the acquiring bank ;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "limit the extent of payments to any class or category of depositors or creditors of the defaulting bank ;",
                        "pre_block_list": [
                          "Banking (Amendment) Act, No. 46 of 2006 5"
                        ],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iv",
                        "text": "provide for the re-scheduling of the deposit liabilities ;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "v",
                        "text": "specify that the settlement of liabilities shall be limited to the amount of the assets of the defaulting bank or such other assets as may be specified by the Monetary Board.",
                        "pre_block_list": [
                          "(3 D ) Notwithstanding anything to the contrary in this Act or any other written law, the settlement of liabilities in accordance with the terms and conditions of a Scheme formulated by the Monetary Board in terms of subsection (3 C ) hereof, shall extinguish the liabilities of the defaulting bank vested in the acquiring bank as herein provided.",
                          "(3 E ) The Monetary Board shall, in making an Order under sub-paragraph (i) (B) of paragraph ( b ) of subsection (3), take into consideration the capacity of such acquiring bank to discharge the obligations imposed on it in terms of the Scheme formulated by the Monetary Board and require the acquiring bank to communicate in writing its willingness to comply with such Scheme.",
                          "(3 F ) The Minister may, where it is necessary to do so in the interest of the national economy, by Order published in the  Gazette , determine that any deposit liabilities of a defaulting bank or any part of such liabilities, to any government institution, Provincial Council or other body or authority functioning under the Provincial Council, a public corporation or other public institution or local authority, which have in terms of the aforesaid provisions vested in an acquiring bank, shall be liabilities to the Government.",
                          "(3 G )  For the purposes of subsections (3 A ) and (3 B ) relevant date means the date on which the defaulting bank is vested in the acquiring bank  in terms of sub-paragraph (i) (B) of paragraph ( b ) of subsection (3)."
                        ],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "In the event of any  inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail. Sinhala text to prevail in case of inconsistency.",
            "pre_block_list": [
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT   P UBLICATIONS  B UREAU , N O . 32, T RANSWORKS  H OUSE ,  L OTUS   R OAD ,  C OLOMBO  01  before  15th  December  each  year  in  respect of the year following."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}