{
  "n_pages": 34,
  "title_page": {
    "title": "Mutual  Assistance  In  Criminal Matters  Act",
    "num": "25",
    "year": "2002",
    "date_certified": "2002-10-22",
    "date_published": "2002-10-25",
    "price": 24.25,
    "price_postage": 11.25
  },
  "body_pages": {
    "preamble": [
      "[Certified On 22Nd October, 2002]",
      "L.D.O.43/95.",
      "A N  A Ct   To   Provide   For   The   Rendering   Of   Assistance   In   Criminal",
      "Matters   By  S Ri  L Anka   And   Specified   Countries ;  And   For",
      "Matters   Connected   Therewith   Or   Incidental   Thereto",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Mutual Assistance in Criminal Matters Act, No. 25 of 2002.",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "I",
        "text": "",
        "pre_block_list": [
          "A PPLICATION   OF   THE  A CT   AND  R EQUEST   FOR  A SSISTANCE"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Minister may, by Order published in the Gazette, declare that the provisions of this Act, shall apply in respect of any Commonwealth country specified therein.",
                "pre_block_list": [
                  "Application of the Act."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every Order made under subsection (1) shall come into force on the date of publication of such Order in the Gazette or on such later date as may be specified therein.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where an agreement has been entered into between Sri Lanka and any Non-Commonwealth country, whether before or after the date of commencement of this Act, for mutual assistance in criminal matters, the Minister may, by Order published in the Gazette, declare that the provisions of this Act shall apply in respect of such Non-Commonwealth country, subject to such limitations and conditions as the Minister may, having regard to the terms of such agreement, deem expedient to specify in the Order, for the purpose only of giving effect to the terms of such agreement.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Every Order made under subsection (3) shall recite the terms of the agreement in consequence of which it was made, and shall come into force on the date of publication of the Order in the Gazette or on such later date as may be specified therein, and shall remain in force so long only as the agreement in consequence of which the Order was made remains in force.",
                "pre_block_list": [
                  "2H 0164505,650 (2002/07)"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Every Order made under subsection (1) or subsection (3) shall as soon as convenient after its publication in the Gazette, be brought before Parliament for approval. Any Order which is not so approved shall be deemed to be rescinded with effect from the date of its disapproval, but without prejudice to anything previously done thereunder.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "Notification of the date on which an Order under subsection (1) or subsection (3) is deemed to be rescinded shall be published in the Gazette.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "Every Commonwealth country or Non- Commonwealth country in respect of which an Order is made under subsection (1) or subsection (3) and is for the time being in force is hereinafter referred to as a specified country.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "The object of this Act is to facilitate the provision and obtaining, by Sri Lanka of assistance in criminal matters, including",
            "pre_block_list": [
              "Object of the Act."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "the location and identification of witnesses or suspects ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "the service of documents ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "the examination of witnesses ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "the obtaining of evidence, documents or other articles ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "the execution of requests for search and seizure ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "the effecting of a temporary transfer of a person in custody to appear as a witness ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "g",
                "text": "the facilitation of the personal appearance of witnesses ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "h",
                "text": "the provision of documents and other records ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "the location, of the proceeds of any criminal activity ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "j",
                "text": "the enforcement of orders for the payment of fines or for the forfeiture of freezing of property.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "The Secretary to the Ministry of the Minister in charge of the subject of Justice shall be the Central Authority for the purposes of this Act (hereinafter referred to as the Central Authority).",
            "pre_block_list": [
              "Central Authority."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "An application made to the Central Authority by the appropriate authority of a specified country requesting assistance in relation to a criminal matter falling within a jurisdiction of a criminal court in that country, shall not be entertained by the Central Authority, unless",
            "pre_block_list": [
              "Applications made by a specified country."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "such application is made substantially in the appropriate Form set out in the Schedule to this Act; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "such application is accompanied by such documents as may be specified for that purpose by the Central Authority.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "A request by the appropriate authority of a specified country for assistance under this Act shall be refused, in whole or in part, if, in the opinion of the Central Authority",
                "pre_block_list": [
                  "Refusal of assistance."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the request relates to the prosecution or punishment of a person in respect of an act or omission which, if it had occurred in Sri Lanka would not have constituted an offence under the law of Sri Lanka ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the request relates to the prosecution or punishment of a person for an offence of a political character ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "the request relates to the prosecution or punishment of a person in respect of an act or omission which, if it had occurred in Sri Lanka, would have constituted an offence only under the military law of Sri Lanka ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "the request relates to the prosecution of a person for an offence where, such person has been acquitted or convicted in accordance with the law of Sri Lanka in respect of that offence or another offence constituted by the same act or omission as that constituting the offence ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "compliance with the request would be contrary to the Constitution of Sri Lanka or prejudicial to national security, international relations or public policy ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "based on substantial grounds, compliance with the request would facilitate the prosecution or punishment of, or cause prejudice to, any person on account of his race, religion, language, caste, sex, political opinions or place of birth :",
                    "pre_block_list": [
                      "Provided that it shall be lawful for the Central Authority to entertain a request relating to an act or omission which would not have constituted an offence under the law of Sri Lanka had it occurred in Sri Lanka, if, in the opinion of the Central Authority, such act or omission is of a serious nature, and is a criminal matter within the meaning of this Act."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "For the purposes of subsection (1), an offence shall be deemed not to be an offence of a political character, if it is an offence within the scope of an International Convention to which both Sri Lanka and the specified country making the request are parties and which imposes on the parties thereto an obligation to extradite or prosecute a person accused of the commission of that offence.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "II",
        "text": "",
        "pre_block_list": [
          "A SSISTANCE   IN   RELATION   TO   LOCATING   AND   IDENTIFYING   PERSONS"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where the Central Authority receives a request from the appropriate authority of a specified country, for his assistance in locating a person who",
                "pre_block_list": [
                  "Assistance in relation to locating and identifying persons."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "is suspected to be involved in; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "is able to provide evidence or assistance in,",
                    "pre_block_list": [
                      "any criminal matter falling within the jurisdiction of a criminal court in such specified country and who is believed to be in Sri Lanka, or if the identity of such person is not known, his assistance in identifying and locating such person, the Central Authority may in his discretion, refer such request to the Secretary to the Ministry of the Minister in charge of the subject of Defence and request him to cause such inquiries to be made as may be necessary to comply with the request of the appropriate authority, and upon receipt of a report of the inquiries from such Secretary, shall cause such report to be sent to the appropriate authority of the specified country making the request."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where there are reasonable grounds to belive that a person who",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "is suspected to be involved in ; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "is able to provide evidence or assistance in,",
                    "pre_block_list": [
                      "any criminal matter falling within the jurisdiction of a criminal court in Sri Lanka, is in a specified country, the Central Authority may in his discretion request the appropriate authority in such specified country to assist in locating such person and if his identity is not known, to assist in identifying and locating such person."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "A request under subsection (2), shall specify the purpose for which such assistance is required and shall provide any other information that may facilitate the identification or location of such person.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "III",
        "text": "",
        "pre_block_list": [
          "A SSISTANCE   IN   RELATION   TO   THE   SERVICE   OF   SUMMONS   AND",
          "OTHER   DOCUMENTS"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where the Central Authority receives from the appropriate authority of a specified country",
                "pre_block_list": [
                  "Request by a specified country for service of any process or document in Sri Lanka."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "a summons or other process requiring a person to appear as defendant or attend as a witness in criminal proceedings in that country ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "a document issued by a court exercising criminal jurisdiction in that country and recording a decision of the court made in the exercise of that jurisdiction,",
                    "pre_block_list": [
                      "together with a request that it be served on a person in Sri Lanka, the Central Authority may in his discretion, send such process or document to the Magistrates Court within whose jurisdiction  such person is residing."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where the appropriate authority has, in his request to the Central Authority, specified the mode of service, the Magistrate of the Magistrates Court to which such process or document has been sent under subsection (1), shall cause such process or document to be served, wherever practicable, in accordance with such request unless such mode is inconsistent with the laws of Sri Lanka. Where the mode of service specified in the request is inconsistent with the laws of Sri Lanka, the Magistrate shall cause such process or document to be served in accordance with the laws of Sri Lanka.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where such process or document is served on the person to whom the request relates the Magistrate shall transmit to the Central Authority, a certificate setting out when and how it was served, and shall, where available, attach thereto, an acknowledgement signed by the person on whom it was served.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "If such process or document cannot be duly served on the person to whom the request relates, the Magistrates Court to which such process or document was sent under subsection (1) shall, subject to subsection (5), return such process or document to the Central Authority with a statement giving such information as the Court possesses as to the whereabouts of such person and unless the Central Authority is satisfied that such person is not residing in Sri Lanka, he shall deal with such process or document under subsection (1). Where the Central Authority is satisfied that such person is not residing in Sri Lanka, he shall return such process or document to the appropriate authority in the specified country making the request.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "If the Magistrate of the Magistrates Court to whom the process or document is sent under subsection (1), is satisfied that such person is residing within the jurisdiction of another Magistrates Court in Sri Lanka, he shall send such process or document to the Magistrate of that other court and shall inform the Central Authority that he has done so.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "The Magistrate of the Magistrates Court to which the process or document is sent under subsection (5), shall proceed as if it had been sent to such court under subsection (1). The Magistrate shall after it has been served on the person to whom the request relates, transmit to the Central Authority a certificate setting out when and how it was served and shall, where available, attach thereto, an acknowledgement signed by the person on whom it was served.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "The Central Authority shall on receipt of a certificate under subsection (3) or subsection (6), transmit the same to the appropriate authority of the specified country making the request.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "8",
                "text": "The Service of any such process referred to in paragraph ( a ) of subsection (1), on any person shall not impose any obligation on such person under the law of Sri Lanka to comply with it.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Central Authority may, in the case of",
                "pre_block_list": [
                  "Request by the Central  Authority for service in a specified country."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "a summons requiring a person charged with an offence to appear before a court in Sri Lanka ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "a summons or order requiring a person to attend before a court in Sri Lanka for the purpose of giving evidence in criminal proceedings,",
                    "pre_block_list": [
                      "issued or made by a court in Sri Lanka, request the appropriate authority of a specified country in which such person is resident to have such summons or order served on such person in the specified country, and may in such request, specify the mode of service of such  summons or order."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where the appropriate authority of a specified country to whom a request has been made under subsection (1) informs the Central Authority that the summons or order to which the request relates has been served on a person resident in such specified country and transmits a duly authenticated report of such service, the Central Authority shall cause such report to be sent to the court issuing or making such summons or order, and such report shall be admissible in evidence and the statements made therein shall be deemed to be correct, unless the contrary is proved.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "IV",
        "text": "",
        "pre_block_list": [
          "A SSISTANCE   IN   RELATION   TO   TAKING   OF   EVIDENCE   AND",
          "PRODUCTION   OF   DOCUMENTS   OR   OTHER   ARTICLES"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "10",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where the appropriate authority of a specified country makes a request to the Central Authority that",
                "pre_block_list": [
                  "Request by a specified country for evidence to be taken and documents and to be produced in Sri Lanka."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "evidence be taken in Sri Lanka ; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "documents or other articles in Sri Lanka be produced,",
                    "pre_block_list": [
                      "for the purposes of a proceeding in relation to a criminal matter in the specified country, the Central Authority may in his discretion refer such request to a Magistrate, authorized by a general or special order made by the President of the Court of Appeal to take such evidence or to receive such documents or articles, and shall, upon receipt of such evidence, documents or articles from such Magistrate, transmit the same to the appropriate authority of the specified country."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every request made under subsection (1) by the appropriate authority of a specified country shall, so far as circumstances of the case permit, specify",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the names and addresses or the official designations of the witnesses to be examined ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the questions to be put to the witnesses or the subject matter about which they are to be examined ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "whether it is desired that the witnesses be examined orally or in writing ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "any provision of the law of the specified country as to privileges or exemptions from giving evidence which appear relevant to the request ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "any special requirements of the law of the specified country as to the manner of taking evidence relevant to its admissibility in that country ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "whether it is desired that the original of a document be produced or whether a certified copy of the document would be sufficient.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where the taking of evidence or the production of documents or other articles under subsection (1) has been authorized",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the Magistrate specified in the authorization may take the evidence on oath of each witness appearing",
                    "pre_block_list": [
                      "before such Magistrate to give evidence in relation to such matter, and such Magistrate shall"
                    ],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "cause the evidence to be taken in writing and certify that the evidence was taken by such Magistrate ; and",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "cause the evidence so certified to be sent to the Central Authority ;",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "a Magistrate may, require the production before him, of the documents or other articles and, where the documents or other articles are so produced, the Magistrate shall send the documents, or where it is impracticable to send such documents to the Central Authority or where the request relates only to copies of such documents, copies of such documents certified to be true copies by the Magistrate, or the other articles, as the case may be, to the Central Authority.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The evidence of any witness may be taken in the presence or absence of the person to whom the proceeding in the specified country relates or his legal representative, if any.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "The Magistrate conducting a proceeding under subsection (3) shall permit",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the person to whom the proceeding in the specified country relates ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the appropriate authority of the specified country,",
                    "pre_block_list": [
                      "to have legal representation at the proceeding before the Magistrate."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "The certificate of the Magistrate under subsection (3) shall state whether legal representation was permitted at the proceedings conducted under that subsection and whether any",
                "pre_block_list": [
                  "of the following persons were present at the time the evidence was taken or the documents or other articles were produced :"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the person to whom the proceeding in the specified country relates or his legal representative, if any ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "any other person giving evidence or producing documents or other articles or his legal representative, if any.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "The provisions of the Code of Criminal Procedure Act, No. 15 of 1979 relating to the compelling of attendance of witnesses and the production of documents by witnesses shall apply in relation to a Magistrates Court which is authorized to take such evidence.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "8",
                "text": "The Central Authority shall cause the certificate of the Magistrate sent to him under subsection (3) to be transmitted to the appropriate authority of the specified country.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "9",
                "text": "A person who is required to give evidence, or produce documents or other articles, for the purposes of a proceeding in relation to a criminal matter in a specified country shall not be compelled to answer a question, or produce a document or article, that the person is not compelled to answer or produce, as the case may be, in such proceeding in the specified country.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "10",
                "text": "A duly authenticated foreign law immunity certificate shall be admissible in proceedings under this section as  prima facie  evidence of the matters stated in such certificate but shall not, without the consent of the appropriate authority, be used for any purpose other than for the purposes of the Criminal matter specified in the request.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "11",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Central Authority may, at the request of a court exercising criminal jurisdiction in Sri Lanka, request the appropriate authority of a specified country to arrange for",
                "pre_block_list": [
                  "Request by Central Authority for evidence to be taken in and documents &c. to be produced in a specified country."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "evidence to be taken in the specified country ; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "documents or other articles to be produced in the specified country,",
                    "pre_block_list": [
                      "for the purposes of a proceeding in relation to a criminal matter in that court."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where the Central Authority receives, from the appropriate authority in a specified country, in response to a request made by him under subsection (1)",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "any evidence taken in such specified country ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "any document or other article produced in such specified country,",
                    "pre_block_list": [
                      "such evidence, document or article shall be admissible in any proceeding to which such request relates but shall not, without the consent of such appropriate authority, be used for the purpose other than for the purposes of the criminal matter specified in such request."
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "V",
        "text": "",
        "pre_block_list": [
          "A RRANGEMENTS   FOR   PERSONS   TO   GIVE   EVIDENCE   OR   ASSIST",
          "INVESTIGATIONS"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "12",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where a proceeding or an investigation relating to a criminal matter has commenced in a specified country, and the appropriate authority of that specified country requests the removal of a prisoner who is in Sri Lanka, for the purposes of giving evidence at a hearing in connection with such proceeding or of giving assistance in relation to such investigation, as the case may be, being of the opinion that such prisoner is capable of giving evidence relevant to such proceeding, or of giving assistance in relation to such investigation, as the case may be, the Central Authority may, if he is satisfied that",
                "pre_block_list": [
                  "Request by a specified country for prisoner in Sri Lanka to give evidence or assist investigation."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "such person has consented to giving evidence in such proceeding or to being removed to such specified country for the purposes of giving assistance in relation to such investigation, as the case may be ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the specified country has given any undertakings required by the Central Authority, in respect of such prisoner, including undertakings as to meeting the costs of travel of the prisoner to the specified country and as to the period for which such prisoner shall be held in custody in the specified country,",
                    "pre_block_list": [
                      "direct in writing, the release of such prisoner from prison for the purposes of removal to the specified country and make arrangements for the travel of such prisoner to the specified country."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "A direction by the Central Authority under subsection(1) with respect to a prisoner shall be deemed to authorize",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the release of such prisoner from the prison in which he is held in custody and the delivery of such prisoner, in the custody of a prison officer, in or outside Sri Lanka, into the custody of a person representing the appropriate authority of the specified country requesting the removal of such prisoner ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the bringing of the prisoner back to Sri Lanka and his delivery, in the custody of a prison officer, into the custody of the prison from which he was released for the purposes of removal to the specified country.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where a prisoner who is serving a term of imprisonment in Sri Lanka is released from prison pursuant to a request made by a specified country under subsection (1), any period during which such prisoner is held in custody in such specified country in connection with such request, shall be deemed to be a period spent in serving the term of imprisonment which he was serving prior to his release for removal to the specified country.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "a proceeding or an investigation relating to a criminal matter has commenced in a specified country ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the appropriate authority in the specified country requests the attendance, of a person (not being a prisoner) who is in Sri Lanka, at a hearing in connection with that proceeding or for the purposes of giving assistance in relation to such investigation, as the case may be ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "there are reasonable grounds to believe that the person, is capable of giving evidence relevant to such proceeding, or of giving assistance in relation to such investigation, as the case may be ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "the Central Authority is satisfied that",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "such person has consented to travel to such specified country, to give evidence in such proceeding or to give assistance in relation to such investigation as the case may be ; and",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "the appropriate authority in the specified country has given any undertaking required by the Central Authority with respect to such person, including undertakings as to meeting the costs of travel of such person to the specified country,",
                        "pre_block_list": [
                          "the Central Authority may, in his discretion, make arrangements for the travel of that person to the specified country."
                        ],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "13",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where a proceeding or investigation relating to a criminal matter has commenced in Sri Lanka and the Central Authority is of the opinion that a person who is in a specified country, is",
                "pre_block_list": [
                  "Request by the Central Authority for prisoner or other person in specified country to give evidence or assist an investigation."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "a prisoner in such specified country ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "capable of giving evidence relevant to that proceeding or of giving assistance in relation to such investigation as the case may be ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "has given, or is likely to give, his consent to being removed to Sri Lanka for the purposes of giving evidence in such proceeding or of giving assistance in relation to such investigation, as the case may be,",
                    "pre_block_list": [
                      "the Central Authority may, in his discretion, request the appropriate authority in the specified country to authorise the removal of such person to Sri Lanka, to give evidence at a hearing in connection with that proceeding or to give assistance in relation to such investigation, as the case may be."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "A person removed to Sri Lanka from a specified country, pursuant to a request made by the Central Authority under subsection (1) shall, while such person is in Sri Lanka or travelling to or from Sri Lanka pursuant to such request, be held in such custody as the Central Authority may, in writing direct. A direction given under this subsection shall be deemed to authorize the holding in custody of the person to whom such direction relates.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The provisions of the Prisons Ordinance relating to the conditions of imprisonment of persons imprisoned in a prison in Sri Lanka, their treatment during imprisonment and their transfer from prison to prison shall apply so as far as they are capable of application, in relation to a person held in custody pursuant to a direction by the Central Authority under subsection (2).",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "a person is held in custody pursuant to a direction made by the Central Authority under subsection (2) ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the appropriate authority in the specified country from which such person was removed to Sri Lanka requests the release of such person from custody,",
                    "pre_block_list": [
                      "the Central Authority shall direct that such person be released from custody."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Any person who escapes from lawful custody while held in custody in Sri Lanka pursuant to a request made by the Central Authority under subsection (1) shall be guilty of an offence under this Act and shall on conviction after summary trial before a Magistrate be liable to rigorous imprisonment for a term not exceeding ten years.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "Where a proceeding or an investigation relating to a criminal matter has commenced in Sri Lanka and the Central Authority is of the opinion that a person (not being a prisoner) who is in a specified country",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "is capable of giving evidence relevant to that proceeding or of giving assistance in relation to such investigation, as the case may be; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "has consented to travel to Sri Lanka, to give evidence in such proceeding or to give assistance in relation to such investigation, as the case may be,",
                    "pre_block_list": [
                      "the Central Authority may, in his discretion, request the appropriate authority of the specified country to make arrangements for the travel of that person to Sri Lanka."
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "14",
            "text": "Where",
            "pre_block_list": [
              "Immunity from prosecution &c. of persons brought to Sri Lanka."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "a person is in Sri Lanka pursuant to a request made by the Central Authority to the appropriate authority of a specified country under subsection (6) of section 13 ; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "a person, being a prisoner, has been removed to Sri Lanka pursuant to a request made by the Central Authority to the appropriate authority of a specified country, under subsection (1) of section 13,",
                "pre_block_list": [
                  "to give evidence in a proceeding relating to a criminal matter or to give assistance in an investigation relating to a criminal matter, such person shall not be detained prosecuted or",
                  "punished in Sri Lanka for any offence that is alleged to have been committed or was committed, prior to that person's departure from such specified country pursuant to such request"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "i",
                    "text": "in the case of a person who, not being a prisoner, is in Sri Lanka for the purposes of giving evidence in a proceeding relating to a criminal matter or of assisting in a investigation relating to a criminal matter, unless such person has remained in Sri Lanka for a period of at least fifteen days after he had been notified by the Central Authority that his presence was no longer necessary for such proceeding or investigation and had an opportunity of leaving Sri Lanka ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "in the case of a person who being a prisoner, in Sri Lanka for the purposes of giving evidence in a proceeding relating to criminal matter or of assisting in a investigation relating to a criminal matter, until after he has returned to the specified country from which he was removed to Sri Lanka.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "VI",
        "text": "",
        "pre_block_list": [
          "A SSISTANCE   IN  R ELATION   TO  S EARCH   AND  S EIZURE"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "15",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where",
                "pre_block_list": [
                  "Request by a specified country for search and seizure."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "a proceeding or investigation relating to a criminal matter involving a serious offence has commenced in a specified country ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "there are reasonable grounds to believe that a thing relevant to the proceeding or investigation is located in Sri Lanka ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "the appropriate authority of such specified country requests the Central Authority to arrange for the issue of a search warrant in relation to that thing,",
                    "pre_block_list": [
                      "the Central Authority may, in his discretion, authorise a police officer in writing, to make an application to the Magistrate within whose jurisdiction that thing is believed to be located, for the search warrant requested by the appropriate authority of such specified country."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where a police officer authorised under subsection (1) has reason to believe that the thing to which the request relates is, or shall, at a specified time, be",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "in the clothing that is worn by a person ; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "otherwise in a persons immediate control ;",
                    "pre_block_list": [
                      "the police officer may"
                    ],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "lay before such Magistrate such information on oath setting out the grounds for such belief ; and",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "apply for the issue of a warrant under this section to search the person for that thing.",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where an application is made under subsection (2), the Magistrate may, subject to subsection (6), issue a warrant authorising a police officer (whether or not named in the warrant), with such assistance, and by such force, as is necessary and reasonable",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "to search the person for such thing ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "to seize anything authorised to be seized by the warrant and found in the course of the search that the police officer believes, on reasonable grounds, to be relevant to the proceeding or investigation.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where a police officer authorised under subsection (1) has reason to believe that the thing to which the request relates is, or shall, at a specified time, be, upon any land, or upon or in any premises, the police officer may",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "lay before such Magistrate such information on oath setting out the grounds for such belief ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "apply for the issue of a warrant under this section to search the land or premises for that thing.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Where an application is made under subsection (1), the Magistrate may, subject to subsection (6), issue a warrant authorising a police officer (whether or not named in the warrant), with such assistance, and by such force, as is necessary and reasonable",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "to enter upon the land, or upon or into the premises ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "to search the land or premises for such thing ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "to seize anything authorized to be seized by the warrant and found in the course of the search that the police officer believes, on reasonable grounds, to be relevant to the proceeding or investigation.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "A Magistrate shall not issue a warrant under this section unless",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the informant or some other person has given to the Magistrate either orally or by affidavit, such further information if any, as the Magistrate requires concerning the grounds on which the issue of the warrant is sought ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the Magistrate is satisfied that there are reasonable grounds for issuing the warrant.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "There shall be stated in a warrant issued under this section",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the purpose for which the warrant is issued, including a reference to the nature of the criminal matter in relation to which the search is authorised ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "whether the search is authorised at any time of the day or night or during specified hours of the day or night ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "a description of the kind of things authorised to be seized ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "the date (not being later than one month after the issue of the warrant) on which the warrant ceases to have effect.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "8",
                "text": "If, during a search under a warrant issued under this section, for anything of the kind specified in the warrant, the police officer finds any other thing that such police officer believes on reasonable grounds",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "to be relevant to the proceeding or investigation in the specified country or to afford evidence as to the commission of an offence in Sri Lanka ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "is likely to be concealed, lost or destroyed if it is not seized,",
                    "pre_block_list": [
                      "the warrant shall be deemed to authorise such police officer to seize such other thing."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "9",
                "text": "Where a police officer finds as a result of a search in accordance with a warrant issued under this section, any other thing which such police officer believes on reasonable grounds, to be relevant to the proceeding or investigation in the specified country, such police officer shall deliver such other thing into the custody and control of the Inspector - General of Police in Sri Lanka.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "10",
                "text": "Where a thing is delivered into the custody and control of the Inspector-General of Police under subsection (9), the Inspector-General of police shall arrange for such thing to be kept for a period not exceeding one month from the day on which the thing was seized, pending a direction in writing from the Central Authority as to the manner in which the thing is to be dealt with, which may include a direction that the thing be sent to an authority of a specified country.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "11",
                "text": "The provisions of the Criminal Procedure Code Act, No. 15 of 1979 relating to the execution of search warrants issued under that Act shall, in so far as they are not inconsistent with the preceding provisions of this section, apply to the execution of warrants issued under this section.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "12",
                "text": "The Magistrate issuing a warrant under this section shall, subject to the provisions of subsection (9), cause any thing seized in the course of a search in accordance with such warrant together with a certificate setting out the place and circumstances of the seizure and the custody of such things after its seizure, to be forwarded to the Central Authority for transmission to the appropriate authority of the specified country making the request for such search warrant.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "16",
            "text": "Where a proceeding or investigation relating to a criminal matter is commenced in Sri Lanka, and the Central Authority has reasonable grounds to believe that any thing relevant to such proceeding or investigation is located in a specified country, he may request the appropriate authority of such specified country to apply for, and obtain, a warrant or other authority authorizing the search for, and seizure of, such thing, or any other thing that is, or may be relevant to such proceeding or investigation, and to transmit to him anything seized in the course of any search authorized by such warrant.",
            "pre_block_list": [
              "Request by Sri Lanka for search and seizure."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "VII",
        "text": "",
        "pre_block_list": [
          "T RACING  P ROCEEDS   OF  C RIME   AND  E NFORCEMENT   OF  O RDERS"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "17",
            "text": "Where",
            "pre_block_list": [
              "Request by a specified country for tracing proceeds of crime."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "a person has been charged with, or convicted of, or is suspected on reasonable grounds of having committed, a serious offence in a specified country ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "there are reasonable grounds to believe that any property derived or obtained, directly or indirectly, from the commission of that offence, is in Sri Lanka ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "the appropriate authority in such specified country requests the Central Authority for assistance in identifying, locating or assessing the value of, such property,",
                "pre_block_list": [
                  "the Central Authority may in his discretion, give the assistance requested wherever it is practicable to do so."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "18",
            "text": "Where",
            "pre_block_list": [
              "Request by Sri Lanka for tracing proceeds of crime."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "a person has been charged with, or convicted of, or is suspected on reasonable grounds of having committed, a serious offence in Sri Lanka ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "there are reasonable grounds to believe that any property derived or obtained, directly or indirectly, from the commission of that offence is in a specified country,",
                "pre_block_list": [
                  "the Central Authority may, in his discretion, require the appropriate authority in such specified country for assistance in identifying, locating, or assessing the value, of such property."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "19",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where",
                "pre_block_list": [
                  "Request by a specified country for enforcement of orders of court."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "a court in a specified country has, in a proceeding relating to a criminal matter, made an order",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "forfeiting any property or having the effect of forfeiting or confiscating any property ;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "imposing a fine or other pecuniary penalty on any person or requiring that person to pay compensation to any other person ;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "restraining any person or all persons from dealing with any property ; and",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "there are reasonable grounds to believe that the property with respect to which such order is made is located in Sri Lanka or that any property located in Sri Lanka is available for the satisfaction of that order ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "the appropriate authority of such specified country has requested the Central Authority for assistance in enforcing such order in Sri Lanka ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "the Central Authority is satisfied that such order is in force and not subject to any further appeal in the specified country,",
                    "pre_block_list": [
                      "the Central Authority may, in his discretion, require the Attorney-General to apply for the registration of the order in the High Court established under Article 154P of the Constitution for the Province in which such property is located."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where the Attorney-General applies to the High Court for the registration of an order in pursuance of an authorization under subsection (1), the court shall register such order.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where an order is registered in the High Court in pursuance of an application under subsection (2), a copy of the amendments to the order (whether made before or after the registration) shall be registered in the same manner as the order, and the amendments shall have effect only upon such registration.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "An order or an amendment of an order shall be registered in the High Court, by the registrar in accordance with any rules of court made in that behalf, with a copy of that order or amendment duly authenticated in accordance with the provisions of section 21.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "An order and any amendments thereto registered in the High Court under subsection (4) shall have effect, and may be enforced, in all respects, as if it were an order made by that court.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "Where the High Court is satisfied that any order registered under subsection (2) has ceased to have effect in the specified country in which it was made, it shall cancel such registration.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "Any property forfeited or confiscated, or any fine or pecuniary penalty or compensation recovered, by reason of the enforcement of an order registered under this section shall, notwithstanding anything in any other law, be dealt with in such manner as the Central Authority may specify for the purposes of giving effect to the request.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "20",
            "text": "Where",
            "pre_block_list": [
              "Requests by Sri Lanka for enforcement of orders of court."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "a court in Sri Lanka has, in a proceeding relating to a criminal matter, made an order",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "i",
                    "text": "forfeiting any property or having the effect of forfeiting or confiscating any property ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "imposing a fine or other pecuniary penalty on any person or requiring that person to pay compensation to any other person ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iii",
                    "text": "restraining any person or all persons from dealing with any property ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "the Central Authority has reasonable grounds to believe that the property with respect to which such order is made or the property available to satisfy such order is located in a specified country,",
                "pre_block_list": [
                  "the Central Authority may, in his discretion, request the appropriate authority of such specified country to make arrangements for the enforcement of such order in such specified country."
                ],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "VIII",
        "text": "",
        "pre_block_list": [
          "G ENERAL"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "21",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "In a proceeding under this Act, arising directly or indirectly from a request made under this Act, a document duly authenticated shall be admissible in evidence.",
                "pre_block_list": [
                  "Authentication of documents."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "A document shall be deemed to be duly authenticated for the purposes of subsection (1), if",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "it purports to be signed or certified by a Judge, Magistrate or Officer in, or of, a specified country; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "it purports to be authenticated by the oath of a witness or an officer of the Government of the specified country or to be sealed with the official or public seal of the specified country or of a Minister of State or of a Department or officer of the Government of the specified country.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "22",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Minister may make regulations in respect of all matters, which are required by this Act to be prescribed or in respect of which regulations are authorized or required to be made.",
                "pre_block_list": [
                  "Regulations."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every regulation made by the Minister under subsection (1) shall be published in the Gazette and shall come into operation on the date of such publication or on such later date as may be specified in such regulation.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every regulation made by the Minister shall as soon as convenient after its publication in the Gazette, be brought before Parliament for approval. Every regulation which is not so approved shall be deemed to be rescinded as from the date of such disapproval, but without prejudice to anything previously done thereunder.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Notification of the date on which a regulation is so deemed to be rescinded shall be published in the Gazette.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "23",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "24",
            "text": "In this Act, unless the context otherwise requires",
            "pre_block_list": [
              "Interpretation.",
              "appropriate authority in relation to a specified country which is "
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "a Commonwealth country means the person, howsoever described, designated to receive and transmit requests for assistance in criminal matters, by or under any law of that country ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "a Non-Commonwealth country means the person, howsoever described, designated to receive and transmit requests for assistance in any agreement between Sri Lanka and such non-Commonwealth country for mutual assistance in criminal matters or in any law of such country giving effect to such agreement ;",
                "pre_block_list": [
                  "Commonwealth Country means a country within the Commonwealth, and includes a colony, territory, protectorate or other dependency of such country, or a ship or aircraft registered in such country ;",
                  "criminal matter means violations of any law, whether of Sri Lanka or of a specified country, and includes violations of the law of Sri Lanka or a specified country relating to taxation, exchange control or customs or securities or money laundering ;",
                  "duly authenticated in relation to a document, means a document authenticated as provided for in section 21 ;",
                  "foreign law immunity certificate means a certificate given or a declaration made, by the appropriate authority of a specified country or under the law of a specified country, certifying or declaring that, under the law of that specified country, persons generally or a specified person, could or could not, either generally or in specified proceedings or either generally or in specified circumstances, be required to answer a specified question, or to produce a specified document ;",
                  "Non Commonwealth Country means a country outside the Commonwealth and includes a colony, territory, protectorate or other dependency of such country, or a ship or aircraft registered in such country, and shall be deemed to include the Hong Kong Special Administration Region of the Peoples Republic of China ;",
                  "serious offence means of offence punishable with death or with imprisonment for a term not less than one year.",
                  "SCHEDULE (section 5)",
                  "F ORM  A [section 7(1)]",
                  "TO THE CENTRAL AUTHORITY OF SRI LANKA.",
                  "Whereas (state name of suspect/witness/other person* if known) : is suspected to be involved in/is able to provide evidence/assistance* in (state criminal matter falling within jurisdiction of criminal court in Specified Country):",
                  "And whereas there are reasonable grounds to believe that the aforesaid (State name of suspect witness/other person*  if known) is in Sri Lanka:",
                  "This is to request your assistance in locating the aforesaid  (State name of Suspects/witness/other person* if known).",
                  "Appropriate Authority of Specified Country.",
                  "F ORM  B [Section 7(1)]",
                  "TO THE CENTRAL AUTHORITY OF SRI LANKA.",
                  "Whereas a person whose identity is not known and the available information about whom is specified hereunder, is suspected to be involved in/is able to provide evidence/assistance* in (state criminal matter falling within jurisdiction of criminal court in Specified Country) :",
                  "And whereas there are reasonable grounds to believe that the aforesaid person is in Sri Lanka :",
                  "This is to request your assistance in identifying and locating such person.",
                  "Appropriate Authority of Specified Country.",
                  "F ORM  C [section 8(1)]",
                  "TO THE CENTRAL AUTHORITY OF SRI LANKA",
                  "Whereas proceedings have been instituted in (state name of court in specified country) in respect of  (state criminal matter falling within jurisdiction of criminal court in Specified Country) :",
                  "And whereas summons/process/document* has been issued in such proceedings for service on (state name of defendant/witness/other person)*:",
                  "And Whereas there are reasonable grounds to believe that the aforesaid (state name of defendant/witness/other person*) is in Sri Lanka :",
                  "This is to request your assistance to serve that summons/process/ document* (a copy of which is attached hereto) on the aforesaid  (state name of defendant/witness/other person*). Where mode service is specified in the manner specified hereunder.",
                  "Appropriate Authority of Specified Country.",
                  "F ORM  D [section 10(1)]",
                  "TO THE CENTRAL AUTHORITY OF SRI LANKA",
                  "Whereas proceedings have been instituted in the court of  (state name of court in specified country) in respect of (state criminal matter falling within jurisdiction of criminal court in Specified Country) :",
                  "And Whereas there are reasonable grounds to believe that  (state name of witness) who is capable of giving evidence relevant to such proceedings/producing  (state name of document or other thing) relevant to such proceedings* is in Sri Lanka :",
                  "This is to request you to arrange for :",
                  "( a ) the taking of the evidence of the aforesaid  (state name of witness required to be examined) : or",
                  "( b ) the production of the aforesaid (describe the document or other thing required to be produced),",
                  "in Sri Lanka for the purposes of the aforesaid proceedings and for the transmission of such evidence, document or other thing to me.",
                  "Appropriate Authority of Specified Country.",
                  "F ORM  E [section 12(1)]",
                  "TO THE CENTRAL AUTHORITY OF SRI LANKA",
                  "Whereas proceedings have been instituted in the Court  of(state name of court) in specified country)/investigations have been commenced in (state name of specified country)* in respect of  (state the criminal matter falling within jurisdiction of criminal court in Specified Country) :",
                  "And whereas there are reasonable grounds to believe that  (state name of prisoner) who is currently serving a sentence of imprisonment in  (state place of imprisonment in Sri Lanka) is capable of giving evidence relevant to such proceedings/giving assistance in relation to such investigation* :",
                  "This is to request you to arrange for the removal of the aforesaid (state name of prisoner) to (state name of specified country) for the purposes of giving evidence relevant to such proceedings/giving assistance in relation to such investigation*.",
                  "Appropriate Authority of Specified Country.",
                  "F ORM  F [section 12(4)]",
                  "TO THE CENTRAL AUTHORITY OF SRI LANKA",
                  "Whereas proceedings have been instituted in the court of  (state name of court in specified country)/investigations have been commenced in  (state name of specified country)* in respect of  (state the criminal matter falling within jurisdiction of criminal court in Specified Country) :",
                  "And whereas there are reasonable grounds to believe that  (state name of witness) who is presently in Sri Lanka is capable of giving evidence relevant to such proceedings/giving assistance in relation to such investigation*:",
                  "This is to request you to arrange for the removal of the aforesaid  (state name of witness) to (state name of specified country) for the purposes of giving evidence relevant to such proceedings/ giving assistance in relation to such investigation*.",
                  "Appropriate Authority of Specified country.",
                  "F ORM  G [section 15(1)]",
                  "TO THE CENTRAL AUTHORITY OF SRI LANKA",
                  "Whereas proceedings have been instituted in the court of (state name of court in specified country)/investigations have been commenced in  (state name of specified country)* in respect of (state the nature of the serious offence) :",
                  "And whereas there are reasonable grounds to believe that (state the description of article or thing) which is relevant to such proceedings/ investigation* is located in Sri Lanka :",
                  "This is to request you to arrange for the issue of a search warrant for the search and seizure of (state the description of article or thing) and the transmission of the same to me.",
                  "Appropriate Authority of Specified Country.",
                  "F ORM  H [Section 17]",
                  "TO THE CENTRAL AUTHORITY OF SRI LANKA",
                  "Whereas  (state name of suspect/offender)* has been charged with/convicted of/suspected of having committed* (state nature of serious offence) in  (state name of specified country :",
                  "And whereas there are reasonable grounds to believe that  (describe property, if known) derived or obtained, directly or indirectly, from the commission of that offence, is in Sri Lanka :",
                  "This is to request you for your assistance in locating/identifying/assessing",
                  "the value of*  (describe property if known).",
                  "Appropriate Authority of Specified Country. F ORM  I [Section 19(1)]",
                  "TO THE CENTRAL AUTHORITY OF SRI LANKA.",
                  "Whereas  (state name of court in specified country) has in proceedings instituted in respect of (state criminal matter) made order forfeiting/confiscating  (describe property)/imposing a fine or other pecuniary penalty on any person or requiring that person to pay compensation to any other person/restraining any person from dealing with (describe property):",
                  "And whereas there are reasonable grounds to believe that  (describe property) with respect of which that order is made is located in Sri Lanka/ that property located in Sri Lanka is available for satisfaction of that order* :",
                  "This is to request your assistance in enforcing that order (a copy of which is attached hereto).",
                  "Appropriate Authority of Specified Country.",
                  "*Delete whatever is inapplicable.",
                  "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , N O . 32, T RANSWORKS   H OUSE ,  L OTUS   R OAD ,  C OLOMBO  01  before  15th  December  each  year  in   respect  of the year following."
                ],
                "child_level_list": []
              }
            ]
          }
        ]
      }
    ]
  }
}