{
  "n_pages": 25,
  "title_page": {
    "title": "New  Villages  Development  Authority For  Plantation  Region  Act",
    "num": "32",
    "year": "2018",
    "date_certified": "2018-10-04",
    "date_published": "2018-10-05",
    "price": 28.0,
    "price_postage": 35.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 04Th Of October, 2018]",
      "L.D.O. 52/2016",
      "A N  A Ct   To   Provide   For   The   Establishment   Of   An   Authority   To",
      "Be   Called   And   Known   As   The  N Ew  V Illages  D Evelopment A Uthority   For  P Lantation  R Egion   To   Develop   New   Villages",
      "In   The   Plantation   Region   Of  S Ri  L Anka ;  And   For   Matters",
      "Connected   Therewith   Or   Incidental   Thereto .",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :-",
      "Short Title And The Date Of Operation."
    ],
    "pre_section_list": [],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "I",
        "text": "",
        "pre_block_list": [
          "E STABLISHMENT   OF   THE  N EW  V ILLAGES  D EVELOPMENT A UTHORITY   FOR  P LANTATION  R EGION ."
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be established an Authority which shall be known as the New Villages Development Authority for Plantation Region (hereinafter in this Act referred to as the Authority).",
                "pre_block_list": [
                  "Establishment of the New Villages Development Authority for Plantation Region."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Authority shall, by the name assigned to it by subsection (1), be a body corporate and shall have perpetual succession and a common seal and may sue and be sued in that name.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "The Authority shall be responsible for co- coordinating the planning and implementation of development projects under this Act within the areas in the plantation region as may be declared by the Minister with the",
            "pre_block_list": [
              "Designated areas of the Authority.",
              "concurrence of the relevant Ministers as designated areas by Order published in the  Gazette."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "The objects of the Authority shall be to",
            "pre_block_list": [
              "Objects of the Authority."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "ensure inclusion of the plantation community in the designated areas into the social mainstream by socio, economic, cultural and infrastructure development in the plantation region; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "empower the plantation community in the designated areas socially and economically in order  to enable them to contribute to the national development process.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "The Authority may, for the purpose of discharging its functions, exercise all or any of the following powers, subject to the  provisions of   any other written law:-",
            "pre_block_list": [
              "Powers of the Authority."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "enter into contracts or agreements with any person including a Government Department, Local Authority, public corporation or any other institution, whether private or public, to enable the Authority to exercise, perform and discharge its powers, duties and functions under the Act effectively;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "accept grants, gifts or donations, whether in cash or otherwise, from persons or bodies of persons within or outside Sri Lanka and apply them in the discharge of its functions under the Act:",
                "pre_block_list": [
                  "Provided that, notwithstanding anything to the contrary in any other provisions of this Act, the Authority shall obtain prior written approval of the Department of External Resources, in respect of all foreign grants, gifts or donations;"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "open and maintain current, savings or deposit accounts in any State bank or State financial institution as may be determined by the Authority;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "invest in State banks and State financial institutions any funds not immediately required for the purposes of the Authority in such manner as the Authority may think appropriate;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "purchase and hold any movable or immovable property or give on lease, mortgage, pledge, sell or otherwise dispose of any movable or immovable property purchased or held by the Authority for the purposes of the Authority; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "maintain any office, branch office  or stores outside the designated areas and execute outside such designated areas any such work as may be necessary for the discharge of functions under the Act.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "The functions of the Authority shall be to-",
            "pre_block_list": [
              "Functions of the Authority."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "implement  plans, programmes and projects of the Government for the development of new villages in the designated areas in consultation with the Minister;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "co-ordinate with other national, provincial and district level    implementing agencies in the plantation region in working towards the achievement of the objects of the Authority;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "ensure participation of  community based organizations in the plantation region in the formulation and implementation in the designated areas, of plans, programmes and projects of the Government for the development of new villages;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "facilitate the issuance of title deeds for the legal occupants of the houses in the Estates within the designated areas to grant  them ownership of such houses;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "provide assistance to the youth in the estate sector in the designated areas to  enter  the tertiary and higher educational institutions for their educational development;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "work with Provincial Council Ministries and other regional level offices of the Government Ministries to facilitate the provision of essential services to the communities in the designated areas;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "g",
                "text": "promote alternative livelihood opportunities and provide necessary guidance and inputs in respect thereof to the Estate communities in the designated areas;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "h",
                "text": "empower the different  community groups in the estate sector including  women, children, elders and  differently abled people to uplift their livelihood;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "ensure that descendants of  legal occupants of the houses in Estates are  provided with all facilities that are enjoyed  by  such   legal occupants in Estates in the designated areas;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "j",
                "text": "strengthen conservation measures at all levels, both preventive and remedial, aimed at minimizing physical degradation of land and water resources and eliminating environmental pollution in the designated areas;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "k",
                "text": "identify hazardous sites, in consultation with the National Building Research Organization",
                "pre_block_list": [
                  "and the  National Disaster Management Centre, in the designated areas and convert them  into alternative productive use, thereby protecting them from illegal occupation for residential purposes; and"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "l",
                "text": "promote the provision of  adequate social services  and  adequate  sustainable infrastructure facilities in the designated areas.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "II",
        "text": "",
        "pre_block_list": [
          "M ANAGEMENT   AND  A DMINISTRATION   OF   THE  A UTHORITY"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "The affairs of the Authority shall be managed and administered by a Board of Management (hereinafter referred to as the Board) consisting of the following :-",
            "pre_block_list": [
              "Board of Management  of the Authority.",
              "( a ) seven  ex-officio  members, namely-",
              "(i) an officer of the Ministry of the Minister assigned the subject of Hill Country New Villages, Infrastructure and Community Development  and nominated  by the Secretary to such Ministry;",
              "(ii) an officer of the Ministry of the Minister assigned the subject of Finance and nominated  by the Secretary to such Ministry;",
              "(iii) an officer of the Ministry of the Minister assigned the subject of Plantation Industries and nominated  by the Secretary to such Ministry;",
              "(iv) an officer of the Ministry of the Minister assigned the subject of Public Enterprise Development  and nominated  by the Secretary to such Ministry;",
              "(v) an officer of the Ministry of the Minister assigned the subject of Provincial Councils and Local Government   and nominated  by the Secretary to such Ministry;",
              "(vi) an officer of the Ministry of the Minister assigned the subject of Housing and Construction   and nominated  by the Secretary to such Ministry;",
              "(vii) an officer of the Ministry of the Minister assigned the subject of Land   and nominated by the Secretary to such Ministry;",
              "( b ) six members who shall be appointed by the Minister (hereinafter referred to as Appointed Members) from among persons possessing expertise in the fields of infrastructure development, community development, finance and provincial administration. One of these members shall be appointed from the Planters Association of Ceylon to represent the plantation companies.    8. (1) The Minister shall, from among the appointed members, appoint -",
              "Chairman and Vice-Chairman of the Board.",
              "( a ) one member to be  the Chairman of the Board; and",
              "( b ) one member to be  the Vice-Chairman of the Board."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Chairman and Vice-Chairman shall hold office for a period of three years and shall be eligible for re-appointment subject to the provisions of section 7.   (3) The Chairman and Vice-Chairman shall not engage in any paid employment outside the duties of his office, without the approval of the Minister.",
                "pre_block_list": [
                  "(4) The Chairman or Vice-Chairman may at any time resign from office by letter addressed to the Minister, and such resignation shall be effective from the date on which it is accepted by the Minister.",
                  "(5) The Minister may, for reasons assigned, remove the Chairman or Vice-Chairman from their respective offices.",
                  "(6) Where the Chairman is temporarily unable to perform the duties of his office due to ill health, other infirmity, absence from Sri Lanka or any other cause, the Minister may appoint the Vice Chairman to act as Chairman.",
                  "(7) Where both the Chairman and the Vice-Chairman are temporarily unable to perform the duties of their offices due to ill health, other infirmity, absence from Sri Lanka or any other cause, the Minister may appoint any other appointed member to act as Chairman in addition to such members normal duties as an appointed member.",
                  "(8)  Where the office of Chairman or Vice-Chairman becomes vacant upon the death, removal from office, or resignation by the holder of that office, the Minister may appoint a member of the Board to perform the duties of such office, until an appointment is made under subsection (1).",
                  "9. (1) The Minister shall, prior to appointing a person as a member of the Board, satisfy himself that such person has no financial or other interest in the affairs of the Authority, as is likely to affect prejudicially, the discharging of his functions as a member of the Board.",
                  "Financial interest of the members of the Board.",
                  "(2) The Minister shall also satisfy himself, from time to time, that no member of the Board has since being appointed to the Board acquired any such interest."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "A member of the Board who is in any way, directly or indirectly, interested in any contract made or proposed to be made by the Authority shall disclose the nature of his interest at a meeting of the Board and such disclosure shall be",
                "pre_block_list": [
                  "recorded in the minutes of the Authority and such member shall not participate in any deliberation or decision of the Authority with regard to that contract."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "For the purposes of this section, a member of the Board includes the Chairman, the Vice-Chairman, an ex-officio member and an appointed member of the Board.",
                "pre_block_list": [
                  "10. A person shall be disqualified from being appointed or continuing as a member of the Board, if such person ",
                  "Disqualifications to be a member of the Board."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "is or becomes a Member of Parliament, of any Provincial Council or of any Local Authority;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "is not, or ceases to be, a citizen of Sri Lanka;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "directly or indirectly holds or enjoys any right or benefit under any contract made by or on behalf of the Authority;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "has any financial or other interest as is likely to affect prejudicially the discharge by such person  of the functions as a member of the Board;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "absents himself from three consecutive meetings of the Board, without obtaining prior approval of the Board therefor;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "is under any law in force in Sri Lanka or any other country, found or declared to be of unsound mind;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "g",
                    "text": "is a person who, having been declared as insolvent or bankrupt under any law in force in Sri Lanka or in any other country, is an undischarged insolvent or bankrupt; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "h",
                    "text": "is serving or has served a sentence of imprisonment imposed by any court in Sri Lanka or any other country.",
                    "pre_block_list": [
                      "11. (1) Every appointed member of  the Board shall, unless he vacates office earlier by death, resignation or removal, hold office for a period of three years, and shall be eligible for re-appointment, unless removed on disciplinary grounds.",
                      "Provisions relating to appointed members.",
                      "(2) The Minister may for reasons assigned remove any appointed member from office.",
                      "(3) Any appointed member may resign from office at any time by letter addressed in that behalf to the Minister and such resignation shall take effect upon it being accepted by the Minister.",
                      "(4) ( a ) In the event of the death, resignation or removal from office of any appointed member, the Minister may, having regard to the provisions of this Act in relation to the appointment of that particular appointed member,  appoint another member to act in his place.",
                      "( b ) The Minister shall appoint a member for the purposes of paragraph ( a ) within one month of the occurrence of the vacancy.",
                      "( c ) The member appointed under paragraph ( a ) shall hold office for the unexpired period of the term of office of the member whom he succeeds."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Where any appointed member is temporarily unable to perform the duties of the office due to ill health or absence from Sri Lanka or for any other reason, the Minister may, having regard to the provisions of paragraph ( b ) of section 7, appoint another person to act in his place.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "Subject to the preceding provisions, an appointed member may continue to hold office after the lapse of the period of three years referred to in subsection (1), until he is re-appointed or a new member is appointed in his place by the Minister.",
                "pre_block_list": [
                  "Meetings of the Board. 12.  (1) The Chairman shall, if present, preside at every meeting of the Board.  Where the Chairman is absent, the Vice-Chairman shall preside at such meeting. Where both the Chairman and the Vice-Chairman are absent from any meeting, the members present shall elect a Chairman for that meeting from among themselves.",
                  "(2) All matters for decision by the Board shall be dealt with at a meeting of the Board and shall be determined by the majority of the members present and voting.",
                  "(3) In the event of an equality of votes on any question considered at a meeting, the Chairman of that meeting shall have a casting vote in addition to his original vote.",
                  "(4) All decisions of the Board shall be supported by reasons, in writing and the seal of the Authority shall be affixed thereto.",
                  "(5)  Any member of the Board may, by written notice, request the Chairman to call a meeting and the Chairman shall not, otherwise than for justifiable reasons, refuse to do so.",
                  "(6) The Director-General of the Authority appointed under section 16 shall summon all meetings of the Board."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "No act, decision or proceedings of the Board shall be deemed to be invalidated by reason only of the existence of any vacancy of the Board or any defect in the appointment of any member thereof.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "8",
                "text": "The quorum for any meeting of the Board shall be five members.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "9",
                "text": "Subject to the preceding provisions of this section, the Board may regulate the procedure in regard to the meetings of the Board and the transaction of business at such meetings.",
                "pre_block_list": [
                  "13. (1) The seal of the Authority shall be as determined by the Board. The seal of the Authority.",
                  "(2) The seal of the Authority "
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "may be altered in such manner as may be determined by the Board;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "shall be in the custody of such person or persons as the Board may determine;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "shall not be affixed to any instrument or document without the sanction of the Board and except in the presence of two members of the Board, both of whom shall sign the instrument or document in token of their presence.",
                    "pre_block_list": [
                      "(3) The Board shall maintain a register of documents to which the seal of the Authority has been affixed.",
                      "14. (1) The Board may invite experts on a relevant subject matter to any meeting of the Board for the purpose of obtaining their views on such subject matter for the effective discharge of the functions of the Board.",
                      "Board to invite experts to meetings.",
                      "(2) The Board shall have the absolute discretion of accepting or rejecting the views of the experts.",
                      "(3) The experts shall have no voting rights.",
                      "15. The members of the Board and the experts may be paid such remuneration for attendance at meetings of the Board, as may be determined by the Minister with the concurrence of the Minister assigned the subject of Finance.",
                      "Remuneration for attending meetings of the Board."
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "III",
        "text": "",
        "pre_block_list": [
          "A PPOINTMENT   OF   THE  D IRECTOR -G ENERAL    AND  S TAFF   OF   THE A UTHORITY"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "16",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Minister shall, on the recommendation of the Board, appoint to the staff of the Authority a Director-General (hereinafter referred to as the Director-General), who shall be the Chief Executive Officer of the Authority.",
                "pre_block_list": [
                  "Director- General of the Authority."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Director- General  shall, subject to the general or special directions and supervision of the Board",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "be charged with the administration of the affairs of the Authority including the administration and control of the staff;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "be responsible for the execution of all decisions of the Board;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "carry out all such functions as may be assigned to him by the Board; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "function as the Secretary to the Board and also as the Chief Accounting Officer of the Authority.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Director- General shall be entitled to be present and speak at any meeting of the Board, but shall not be entitled to vote at such meeting.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The DirectorGeneral may, with the written approval of the Board, whenever he considers it necessary to do so, delegate in writing to any officer of the Authority any of his powers, duties or functions and such officer shall exercise, perform  or discharge such power, duty or function  subject to the general or special direction of the DirectorGeneral.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "The Minister may remove the Director-General from office-",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "if he becomes permanently incapable of   performing his duties; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "if he has done any act which, in the opinion of the Minister, is of a fraudulent or illegal character or is prejudicial to the interests of the Authority; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "if he has failed to comply with any directions issued by the Authority.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "The term of office of the Director-General shall be three years from the date of appointment and shall, unless removed from office under subsection (5), be eligible for re- appointment.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "The office of the Director-General shall become vacant upon the death, removal from office under subsection (5) or resignation by letter in that behalf addressed to the Minister by the holder of that office.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "8",
                "text": "If any vacancy occurs in the office of the Director- General, the Minister may appoint a member of the Board to perform the duties of the Director-General until an appointment is made under subsection (1).",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "17",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Authority may appoint as staff of the Authority   such number of   officers and other employees as may be necessary for the efficient discharge of its functions.",
                "pre_block_list": [
                  "Staff of the Authority."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Authority may, in respect of the officers and employees appointed to the Authority under subsection (1)",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "determine the terms and conditions of employment of  such officers and employees;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "fix the rates at which such officers and employees shall be remunerated in keeping with related guidelines of the Government;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "exercise disciplinary control over or dismiss such officers and employees; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "establish staff welfare and social security schemes for the benefit of such officers and employees and make contribution to any such  schemes.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Board may make rules in respect of all or any of the matters referred to in subsection (2).",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The Authority shall not, however, appoint as an officer or other employee of the Authority, any person who has been dismissed from any previous position held by such person in the public or private sector.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "18",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "At the request of the Authority, any officer in the public service may, with the consent of that officer and the Secretary to the Ministry under which that officer is employed and the Secretary to the Ministry of the Minister assigned the subject of Public Administration, be temporarily appointed to the staff of the Authority for such period as may be determined by the Authority or with like consent, be permanently appointed to such staff.",
                "pre_block_list": [
                  "Public officers to be appointed to the Staff of the Authority."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where any officer in the public service is temporarily appointed to the staff of the Authority, the provisions of section 14(2) of the National Transport Commission Act, No. 37 of 1991 shall,  mutatis mutandis , apply to and in relation to such officer.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where any officer in the public service is permanently appointed to the staff of the Authority, the provisions of section 14(3) of the National Transport Commission Act, No. 37 of 1991 shall,  mutatis mutandis , apply to and in relation to such officer.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where the Authority employs any person who has entered into a contract with the Government by which he has agreed to serve the Government for a specified period, any period of service with the Authority by that person shall be regarded as service to the Government for the purpose of discharging the obligations of such contract.",
                "pre_block_list": [
                  "Appointment of officers and other   employees of public corporations to the Staff of the Authority."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "19",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "At the request of the Authority, any officer or other   employee of a public corporation may, with the consent of such officer or employee and the governing board of such corporation, be temporarily appointed to the staff of the Authority for such period as may be determined by the Authority, or with like consent be permanently appointed",
                "pre_block_list": [
                  "to the staff of the Authority on such terms and conditions, including those relating to pension or provident fund rights, as may be agreed upon by the Authority and the governing board of such corporation."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where any person is appointed, whether temporarily or permanently, under subsection (1) to the staff of the Authority, he shall be subject to the same disciplinary control as any other member of the staff of the Authority.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "For the purpose of this section governing board in relation to a public corporation means the Board of Directors or other body in which the administration and management of that public corporation has been vested .",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "IV",
        "text": "",
        "pre_block_list": [
          "F INANCE"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "20",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Authority shall have its own Fund.",
                "pre_block_list": [
                  "Fund of the Authority ."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "There shall be paid into the Fund",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "all such sums of money as may be voted upon from time to time by Parliament for the use of the Authority;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "all such sums of money as may be received by the Authority in the exercise, performance and discharge of its powers and functions under this Act;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "all such sums of money as may be received by the Authority by way of loans, donations, gifts or grants from any source whatsoever;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "all such sums of money received by alienating, leasing or renting of property owned by the Authority.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "There shall be paid out of the Fund of the Authority all such sums of money required to defray the expenditure incurred by the Authority in the exercise, performance and discharge of its powers, duties and functions under this Act.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "21",
            "text": "The Authority may open and maintain any account with any bank as it may think appropriate and such account shall be operated in accordance with prevailing financial regulations of the Government pertaining to financial transactions of public corporations.",
            "pre_block_list": [
              "Authority to maintain accounts."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "22",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The financial year of the Authority shall be the calendar year.",
                "pre_block_list": [
                  "Financial year and audit of accounts."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Authority shall cause proper books of accounts to be kept of the income, expenditure, assets and liabilities and all other financial transactions of the Authority.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "For the purpose of presenting a true and fair view of the financial performance and financial condition of the Authority, the Authority shall prepare the accounts in accordance with the Sri Lanka Accounting Standards adopted by the Institute of Chartered Accountants of Sri Lanka under the Sri Lanka Accounting and Auditing Standards Act, No. 15 of 1995.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The provisions of Article 154 of the Constitution relating to the audit of accounts of public corporations shall apply to the audit of the accounts of the Authority.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "23",
            "text": "Moneys belonging to the Authority may, with the approval of the Minister and with the concurrence of the Minister assigned   the subject of Finance, be invested in Government approved securities.",
            "pre_block_list": [
              "Investment of funds."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "24",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Authority may, with the written consent of the Minister and the Minister assigned the subject of Finance and in accordance with the terms of any general authority given, borrow or obtain on credit such sums as the Authority may require for meeting the obligations of the Authority.",
                "pre_block_list": [
                  "Borrowing powers of the Authority."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The aggregate of the amount outstanding in respect of any loans raised by the Authority under this section shall not at any time exceed such amount as may be determined by the Minister.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "25",
            "text": "The Authority shall, with the concurrence of the Minister assigned    the subject of Finance, be exempt from the payment of any tax on the income or profits of the Authority to such extent as is permitted in terms of the Inland Revenue Act, No.24 of 2017.",
            "pre_block_list": [
              "Exemption of Authority from payments of duties."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "V",
        "text": "",
        "pre_block_list": [
          "G ENERAL"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "26",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Authority shall, within six months of the end of each  financial year, submit to the Minister an annual report of the activities carried out by the Authority during that financial year and cause a copy of each of the following documents relating to that year to be attached to the report",
                "pre_block_list": [
                  "Annual Report."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the audited accounts of the Authority for the year along with the Auditor-Generals report; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "a report of proposed activities for the year immediately following the year to which such report and accounts relate.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Minister shall lay copies of the report and documents submitted under subsection (1) before Parliament, within six months from the date of receipt of such report.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "27",
            "text": "Every member of the Board and every officer and other employee of the Authority shall, before entering upon his duties, sign a declaration pledging to observe strict secrecy in respect of all matters connected with the affairs of the Authority, which has come to his knowledge in the",
            "pre_block_list": [
              "Declaration of secrecy.",
              "performance or exercise of his powers and functions under this Act and shall, by such declaration, pledge himself not to disclose any such matter, except "
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "when required to do so by a court of law; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "when required to do so under any written law.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "28",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Board may, in writing and subject to such conditions as may be specified therein, delegate to the Director-General    or any officer of the Authority any of the powers or functions of the Authority   and the Director-General or such officer shall exercise or perform such power or function in the name and on behalf of the Authority.",
                "pre_block_list": [
                  "Delegation of powers of the Authority."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Board may, notwithstanding any delegation made under subsection (1), by itself exercise or perform any power or function so delegated and may at any time revoke any such delegation.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "29",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Minister may, from time to time, issue to the Authority such general or special directions in writing as to the exercise and performance of its powers and functions so as to give proper effect to the Government policy   relating to the objects of the Authority, and it shall be the duty of the Authority to give effect to such directions.",
                "pre_block_list": [
                  "Directions by the Minister."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Minister may direct the Authority to furnish to him in such form as he may require, returns, accounts and any other information relating to the work of the Authority, and it shall be the duty of the Authority to give effect to such directions.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "30",
            "text": "The Director-General and the officers and other employees of the Authority shall be deemed to be public officers within the meaning of and for the purposes of the Penal Code (Chapter 19).",
            "pre_block_list": [
              "Officers and other employees of the Authority deemed to be public officers."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "31",
            "text": "The Authority shall be deemed to be a Scheduled Institution within the meaning and for the purposes of the Bribery Act (Chapter 26) and the provisions of that Act shall be construed accordingly.",
            "pre_block_list": [
              "Authority deemed to be a Scheduled Institution."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "32",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where any private land or any interest in any private   land within any designated area is required by the Authority for any of its purposes   and the Minister by Order published in the  Gazette , approves the acquisition of such land for such purpose, such land or any interest in such land shall be deemed to be required for a public purpose and   may accordingly be acquired under the Land Acquisition Act (Chapter 460) and be transferred to the Authority.",
                "pre_block_list": [
                  "Compulsory acquisition of land."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any sum payable as compensation for the acquisition of any land or any interest in such land under subsection (1) for the Authority, shall be paid by the Authority .",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "33",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Any expenses incurred by the Authority in any suit or prosecution brought by or against it before any Court, shall be paid out of the Fund of the Authority and any costs paid to or recovered by the Authority in any such suit or prosecution shall be credited to the Fund of the Authority.",
                "pre_block_list": [
                  "Expenses in suit or prosecution to be paid out of the Fund."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Expenses incurred by any member   of the Board, the Director -General    or any officer or other   employee of the Authority in any suit or prosecution brought against such person before any Court or Tribunal in respect of any act which is done or purported to be done by such person under the provisions of this Act or any other written law or on the direction of the Authority shall, if the court holds that such act was done in good faith, be paid out  of the Fund of the Authority, unless such expenses are recoverable by such person in such suit or prosecution.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "34",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Minister may make regulations in respect of all matters required by this Act to be prescribed or in respect of which regulations are authorized by this Act to be made.",
                "pre_block_list": [
                  "Regulations."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every regulation made by the Minister shall be published in the  Gazette  and shall come into operation on the date of such publication or on such later date as may be specified in the regulation.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "Every regulation made by the Minister shall, within three months after its publication in the  Gazette , be brought before Parliament for approval.",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "Any such regulation which is not so approved shall be deemed to be rescinded as from the date of its disapproval, but without prejudice to anything previously done thereunder.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "35",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Subject to the provisions of this Act, the Board may make rules in respect of all or any of the following matters:",
                "pre_block_list": [
                  "Power of the Board to make rules."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the meetings of the Authority and the procedure to be followed at such meetings; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "any other matter connected with the management of the   affairs of the Authority.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every rule made by the Board   shall be published in the  Gazette .",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "36",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Every person who",
                "pre_block_list": [
                  "Offences and penalties."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "obstructs, without any justifiable or lawful basis, any person acting in the exercise of his powers under this Act or any regulation made thereunder;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "being a person acting under the authority of this Act, behaves or conducts himself in a vexatious or provocative manner, while exercising or discharging any power or function under this Act;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "contravenes any of the provisions of this Act or any regulation made thereunder, or fails to comply with any direction given to him under the provisions of this Act; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "fails to furnish any return or information in compliance with any requirement imposed on him under this Act or knowingly makes any false statement in any return or information furnished by him,",
                    "pre_block_list": [
                      "shall commit an offence."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every person who commits an offence under subsection (1) shall, on conviction after summary trial before a Magistrate, be liable to a fine not exceeding fifty thousand rupees or to imprisonment for a period not exceeding one month or to both such fine and imprisonment.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "37",
            "text": "For the purposes of this Act",
            "pre_block_list": [
              "Interpretation.",
              "development project means, any activity whether public or private which generates production, income, employment or improves economic, social or environmental conditions in the designated areas;",
              "Disaster Management Centre means, the Disaster Management Centre established under the Sri Lanka Disaster Management Act, No. 13 of 2005;",
              "Estates means, the areas of land where tea, rubber, coconut or oil palm are cultivated in more   than 20 acres with more than 10 resident labourers;",
              "implementing agencies means, the government Ministries and Departments that are assigned with the task of implementing various programmes of the Government at national, provincial, district and divisional levels;",
              "Minister means, the Minister assigned the subject of   Hill Country New Villages, Infrastructure  and  Community Development;",
              "National Building Research Organization means, the National Building Research Organization functioning under the Ministry of the Minister assigned the subject of Disaster Management;",
              "new villages means, the villages that are set up by replacing the existing line room housing in Estates with single houses and improved basic infrastructure facilities within those Estates;",
              "plantation community means, the legal residents comprising workers and non - workers living in the Estates;",
              "plantation companies means, the plantation companies incorporated by a certificate of incorporation issued under section 15(1) of the Companies Act,  No. 17 of 1982 as repealed and replaced by Act, No. 7 of  2007, in terms of  section 2  of the Conversion of Public Corporations or Government Owned Business Undertakings into Public Companies Act, No. 23 of 1987, and in respect of which long term lease agreements have been entered into with the Janatha Estate Development Board (JEDB) or the Sri",
              "Lanka State Plantation Corporation established by the Sri Lanka State Plantation s  Corporation Act, No. 4 of 1958, as the case may be, for the management of identified tea, rubber and coconut estates for a given period;",
              "Plantation Region means, the areas coming under   the     Divisional Secretarys Divisions in the Districts of the Central, Uva, Sabaragamuwa, Southern, Western, North Central and North Western   Provinces, where the resident labourers live in the Estates in which tea, rubber, coconut or oil palm is cultivated ;",
              "relevant Ministers means, the Minister assigned the subject of Finance, the Minister assigned the subject of Plantation Industries, the Minister assigned the subject of Public Enterprise Development and the Minister assigned the subject of Lands who have been legally mandated to oversee the utilization of estate lands."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "38",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency.",
              "English Acts of the Parliament can be purchased at the P RAKASHANA  P IYASA , D EPARTMENT   OF G OVERNMENT  P RINTING , N O . 118, D R . D ANISTER  D E  S ILVA  M AWATHA , C OLOMBO  8."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}