{
  "n_pages": 13,
  "title_page": {
    "title": "Penal Code (Amendment) Act",
    "num": "16",
    "year": "2006",
    "date_certified": "2006-04-24",
    "date_published": "2006-04-28",
    "price": 10.75,
    "price_postage": 5.0
  },
  "body_pages": {
    "preamble": [
      "[Cartified On 24Th April, 2006]",
      "L. D.O. 14/2003",
      "A N  A Ct   To   Amend   The   Penal   Code  ;  To   Provide   For   Certain   New Offences  ;  And   To   Provide   For   Matters   Connected   Therewith   Or Incidental   Thereto .",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :-"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Penal Code  (Amendment) Act, No. 16  of 2006.",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "Section 2 of the Penal Code (Chapter 19) (hereinafter referred to as the principal enactment) is hereby amended as follows :",
            "pre_block_list": [
              "Amendment of section 2 of Chapter 19."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "in subsection (1) of that section, by the substitution for all the words from for every act or omission to the end of that subsection, of the following :",
                "pre_block_list": [
                  "for every act or omission committed"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "wholly or partly within Sri Lanka ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "within the territorial waters or air space of Sri Lanka ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "on board any ship or aircraft registered in Sri Lanka, wherever it may be at the time of the commission of such act or such ommission ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "within the premises of a Sri Lankan mission or the residence of the Head of such mission, diplomatic agent or any other member of such mission, situated outside Sri Lanka ; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "within any premises occupied on behalf of, or under the control of, the Government of Sri Lanka, or any statutory body established in Sri Lanka and situated outside Sri Lanka,",
                    "pre_block_list": [
                      "contrary to the provisions thereof, of which he shall be guilty.",
                      "2PL 0006085,650 (08/2005)"
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the repeal of subsection (2) of that section, and the substitution therefor  of the following subsection :",
                "pre_block_list": [
                  "(2) A national of Sri Lanka shall be liable to punishment under this Code and not otherwise, for every act or omission contrary to the provisions thereof, committed outside Sri Lanka of which he shall be guilty, whether or not such national enjoys diplomatic immunity in respect of such act or omission, which is granted by a foreign State by reason of his diplomatic status in such State.;"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "by the substitution, for the marginal note to that section, of the following marginal note :",
                "pre_block_list": [
                  "Liability for offences under the Code.;",
                  "Insertion of new sections 286 B  and 286 C  in the principal enactment."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "The following new sections are hereby inserted immediately after section 286 A  of the principal enactment and shall have effect as sections 286 B  and 286c of such enactment :",
            "pre_block_list": [
              "286 B . (1) A person who provides a service by means of a computer shall take all such steps as are necessary to ensure that such computer facility is not used for the commission of an act constituting an offence relating to the sexual abuse of a child.",
              "Duty of person providing service by computer to prevent sexual abuse of a child."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "A person referred to in subsection (1) who has knowledge of any such computer facility referred to in subsection (1) being used for the commission of an act constituting an offence relating to the sexual abuse of a child, shall forthwith inform the officer in charge of the nearest police station of such fact and give such information as may be in his possession with regard to such act and the identity of the alleged offender.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "A person who contravenes the provisions of subsections (1) or (2) shall be guilty of an offence and shall on conviction be liable to imprisonment of either description for a term not exceeding two years or to a fine or to both such imprisonment and fine.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "In this section, child means a person under eighteen years of age.",
                "pre_block_list": [
                  "286 C . (1) Any person who, having the charge, care, control or possession of any premises, has knowledge of such premises being used for the commission of an act constituting the abuse of a child, shall forthwith inform the officer in charge of the nearest police station of such fact.",
                  "Duty to inform of use of premises for child abuse.",
                  "(2) Any person referred to in subsection (1) who fails to inform the officer in charge of the nearest police station of the fact that such premises is being used for the commission of an act constituting the abuse of a child shall be guilty of an offence and shall on conviction be liable to imprisonment of either description for a term not exceeding two years or to a fine or to both such imprisonment and fine.",
                  "(3) In this section, child means a person under eighteen years of age",
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "Section 308 A  of the principal enactment is hereby amended by the addition, immediately after subsection (2) of that section of the following Explanation:",
            "pre_block_list": [
              "Amendment of section 308 A  of the principal enactment.",
              "Explanation  : injuries includes psychological or mental trauma",
              ""
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "Section 345 of the principal enactment is hereby amended as follows :",
            "pre_block_list": [
              "Amendment of section 345 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the substitution for Explanation 2 to that section of the following Explanation :",
                "pre_block_list": [
                  " Explanation  2 : For the purposes of this section an assault may include any act that does not amount to rape under section 363 or grave sexual abuse under section 365 B ."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the addition, immediately after Explanation 2 to that section, of the following Explanation :",
                "pre_block_list": [
                  "Explanation  3 : injuries includes psychological or mental trauma",
                  "",
                  "Replacement of the heading Kidnapping and Abduction."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "The heading appearing immediately before section 350 of the principal enactment is hereby repealed and the following new heading substituted therefor:",
            "pre_block_list": [
              "OF KIDNAPPING, ABDUCTION, SLAVERY, ETC.",
              "Insertion of new section 358 A  in the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "The following new section is hereby inserted immediately after section 358 of the principal enactment and shall have effect as section 358 A  of that enactment :",
            "pre_block_list": [
              "Debt bondage, serfdom, forced or compulsory labour, slavery and recruitment of children for use in armed conflict.",
              "358 A . (1) Any person who",
              "( a ) subjects or causes any person to be subjected to debt bondage or serfdom ;",
              "( b ) subjects or causes any person to be subjected to forced or compulsory labour ;",
              "( c ) subjects or causes any person to be subjected to slavery ; or",
              "( d ) engages or recruits a child  for use in armed conflict,",
              "shall be guilty of an offence."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any person who is guilty of an offence under paragraph ( a ), ( b ) or ( c ) of subsection (1), shall on conviction be liable to imprisonment of either description for a term not exceeding twenty years and to a fine.  Where the offence is committed under paragraphs ( a ), ( b ) or ( c ) of subsection (1) in relation to a child or where the offence is committed under paragraph ( d ) of subsection (1), be liable to imprisonment of either description for a term not exceeding thirty years and to a fine.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "In this section",
                "pre_block_list": [
                  "debt bondage means the status or condition of a debtor arising from a pledge by the debtor of his personal services or of those of a person under his control as security for a debt, if the value of those services as reasonably assessed is not set - off against the debt and the length and nature of those services are undefined;",
                  "forced  or  compulsory  labour  means all  work or service which is exacted from a person under the threat of any penalty and for which such person has not offered himself voluntarily, except"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "any work or service exacted by virtue of  any law for the time being relating to compulsory military service in relation to work or service of a purely military character ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "any work or service which forms part of the normal civic obligations of the citizens of a fully self-governing country;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "any work or service exacted from any person as a punishment imposed by a court of law, provided that the said work or service is carried out under the supervision and control of a public authority and that the said person is not hired to be or placed, at the disposal of private individuals, companies or associations;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "any work or service exacted in cases of emergency, that is to say, in the event of war or of a calamity  or  threatened calamity, such as fire, flood, famine, earthquake, violent epidemic of epizootic diseases, invasion by animal, insect or vegetable pests, and in general any circumstance that would endanger the existence or the well-being of the whole or part of the population;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "minor services of a kind which, being performed by the members of the community in the direct interests of the said community, and thereby considered as normal civic obligations incumbent upon the  members  of  the community, provided that the members of the community or their direct representatives shall have the right to be consulted in regard to the need for such services;",
                    "pre_block_list": [
                      "serfdom means the condition or status of a tenant who is by law, custom or agreement bound to live and labour on land belonging to another person and to render some determinate service to such other person whether for reward or not and is not free to change his status ;",
                      "slavery means the status or condition of a person over whom any or all of the powers attaching to the right of ownership are exercised; and",
                      "child means a person under eighteen years of age",
                      ""
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "Section 360 C  of the principal enactment is hereby repealed and the following section substituted therefor:",
            "pre_block_list": [
              "Replacement of section 360C of the principal enactment.",
              "360 C . (1) Whoever",
              "Trafficking.",
              "( a ) buys, sells or barters or instigates another person to buy, sell or barter any person or does anything to promote, facilitate or induce the buying, selling or bartering of any person  for  money  or  other consideration;",
              "( b ) recruits, transports, transfers, harbours or receives any person or does any other act by the use of threat, force, fraud, deception or inducement or by exploiting the vulnerability of another for the purpose of  securing forced or compulsory labour or services, slavery, servitude, the removal of organs, prostitution or other forms of sexual exploitation or any other act which constitutes an offence under any law ;",
              "( c ) recruits, transports, transfers, harbours or receives a child or does any other act whether with or without the consent of such child for the purpose of securing forced or compulsory labour or services, slavery, servitude or the removal of organs, prostitution or other forms of sexual exploitation, or any other act which constitutes an offence under any law,",
              "shall be guilty of the offence of trafficking."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any person who is guilty of the offence of trafficking shall on conviction be punished with imprisonment of either description for a term not less than two years and not exceeding twenty years and may also be punished with fine and where such offence is committed in respect of a child, be punished with imprisonment of either description for a term not less than three years and not exceeding twenty years and may also be punished with fine.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "In this section,",
                "pre_block_list": [
                  "child means a person under eighteen years of age ;",
                  "forced or compulsory labour has the same meaning as in section 358 A ;",
                  "slavery has the same meaning as in section 358 A ; and",
                  "exploiting the vulnerability of another means impelling a person to submit to any act, taking advantage of such person's economic, cultural or other circumstances",
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "The following new sections are hereby inserted immediately after section 360 C  of the principal enactment and shall have effect as sections 360 D  and 360 E  of that enactment:",
            "pre_block_list": [
              "Insertion of new sections 360 D  and 360 E  in the principal enactment.",
              "Offences related to adoption.",
              "360 D . Whoever, for the purpose of placing any person in adoption",
              "(i) arranges for, or assists, a child to travel to a foreign country without the consent of his parent or lawful guardian;",
              "(ii) obtains the consent, whether written or oral of a pregnant woman, for money or any other consideration, for the adoption of the unborn child of such woman;",
              "(iii) recruits a woman or a couple to bear children;",
              "(iv) being a person concerned with the registration of births, knowingly permits the falsification of any register used for the registration of births or any birth record contained in any such register;",
              "(v) engages in procuring children from hospitals, shelters for women, clinics, nurseries, day care centres or other child care institutions or welfare centres, for money or other consideration or procures a child for adoption from any such institution or centre, by intimidation of the mother or any other person; or",
              "(vi) impersonates the mother or assists in such impersonation,",
              "shall be guilty of an offence and shall on conviction be punished with imprisonment of either description for a term not exceeding twenty years or to a fine or to both such imprisonment and fine",
              ""
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "In this section child means a person under eighteen years of age.",
                "pre_block_list": [
                  "360 E . (1) Whoever, whether within Sri Lanka or from outside Sri Lanka solicits by whatever means",
                  "Soliciting a child."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "a person under eighteen years of age; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "any person believing such person to be under eighteen years of age,",
                    "pre_block_list": [
                      "for the purpose of sexual abuse of a child, commits the offence of soliciting a child and shall on conviction be liable to imprisonment of either description for a term not exceeding ten years or to a fine, or to both such imprisonment and fine",
                      ""
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "10",
            "text": "Section 364 of the principal enactment is hereby amended by the insertion, immediately after Explanation 3 of that section, of the following new explanation :",
            "pre_block_list": [
              "Amendment of section 364 of the principal enactment.",
              " Explanation  4 : injuries includes psychological or mental trauma."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "11",
            "text": "Section 365 of the principal enactment is hereby amended as follows :",
            "pre_block_list": [
              "Amendment of section 365 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the substitution for the word Explanation in that section of the following:",
                "pre_block_list": [
                  " Explanation  (1) ;"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the addition, immediately after Explanation 1 of that  section,  of  the  following  new Explanation :",
                "pre_block_list": [
                  "Explanation  (2) : injuries includes psychological or mental trauma",
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "12",
            "text": "Section 365 A  of the principal enactment is hereby amended by the addition immediately after the end of that section, of the following explanation:",
            "pre_block_list": [
              "Amendment of section 365  A  of the principal enactment.",
              "Explanation  : injuries includes psychological or mental trauma",
              ""
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "13",
            "text": "Section 365 B  of the principal enactment is hereby amended as follows:",
            "pre_block_list": [
              "Amendment of section 365  B  of the principal enactment"
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "in sub section (2) of that section ( a ) by the substitution in paragraph ( a ) of that subsection for the words seven years of the words five years;",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "by the substitution in paragraph ( b ) of that subsection for the words ten years of the words seven years;",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the addition, immediately after the end of subsection (2) of that section, of the following explanation :",
                "pre_block_list": [
                  " Explanation  : injuries includes psychological or mental trauma."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "14",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail. Sinhala text to prevail in case of inconsistency.",
            "pre_block_list": [
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT   P UBLICATIONS  B UREAU , N O . 32, T RANSWORKS  H OUSE ,  L OTUS   R OAD ,  C OLOMBO  01  before  15th  December  each  year  in  respect of the year following."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}