{
  "n_pages": 16,
  "title_page": {
    "title": "National Institute Of Labour Studies Act",
    "num": "12",
    "year": "2010",
    "date_certified": "2010-10-06",
    "date_published": "2010-10-08",
    "price": 10.0,
    "price_postage": 10.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 06Th October, 2010]",
      "L.D.O. 59/2006.",
      "A N  A Ct   To   Establish   A  N Ational  I Nstitute   Of  L Abour  S Tudies ;  To",
      "Establish   A  B Oard   Of  G Overnors   For   The   Administration   Of",
      "The  I Nstitute ;  To   Establish  T Echnical  C Ommittees   And   A D Ivision   Of  S Tudies   For  T Rade  U Nions ;  To   Conduct   Research ,",
      "Carry   Out   Surveys   And   Provide   Training   For   The   Promotion   Of",
      "Labour   Studies   In  S Ri  L Anka ;  And   To   Provide   For   Matters",
      "Connected   Therewith   Or   Incidental   Thereto .",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :-"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the National Institute of Labour Studies Act, No. 12 of 2010.",
            "pre_block_list": [
              "Short title.",
              "E STABLISHMENT   OF   THE  N ATIONAL  I NSTITUTE   OF  L ABOUR  S TUDIES"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be established, in accordance with the provisions of this Act, an Institute which shall be called the National Institute of Labour Studies (hereinafter referred to as the Institute).",
                "pre_block_list": [
                  "Establishment of the National Institute of Labour Studies."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Institute shall, by the name assigned to it by subsection (1), be a body corporate with perpetual succession and a common seal and may sue and be sued in such name.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "The objects of the Institute shall be",
            "pre_block_list": [
              "Objects of the Institute."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "to implement workers education programmes with the collaboration of local or foreign institutes, to take measures to ensure welfare of workers in order to make them active partners in the development process;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "to conduct seminars, workshops, conferences and meetings on labour studies and publish magazines, journals, periodicals and books in relation thereto;",
                "pre_block_list": [
                  "2PL 0051504090 (08/2010)"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "to undertake research, carry out surveys and provide courses of studies relating to labour studies;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "to establish and maintain libraries and information services;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "to work in close collaboration with institutions, organizations, associations and societies both national and foreign, with similar objectives;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "to conduct courses including Diploma Courses on Labour Studies with the assistance of Universities and similar institutions and award certificates and diplomas where so required; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "g",
                "text": "to engage in and promote activities aimed at maintaining industrial harmony.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "The Institute shall have such powers as may be necessary for the discharge of its objects and functions and in particular shall have the power to do all or any of the following:",
            "pre_block_list": [
              "Powers of the Institute."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "to acquire, hold, take or give on lease or hire, mortgage, pledge and sell or otherwise dispose of, any movable or immovable property;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "to open and maintain current, savings or deposit accounts in any bank or banks;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "to accept grants or donations from persons or bodies of persons, whether in or outside Sri Lanka;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "to enter into or perform, all such contracts as may be necessary for the exercise of its powers or the discharge of its functions;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "to invest any money belonging to the Institute including any unapplied income, in any security or to invest any such money in the purchase of immovable property in Sri Lanka or vary such investments, or to place in fixed deposits in any bank; any portion of such money as are not required for immediate expenditure;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "to borrow such sums of money as may be necessary for the purpose of discharging its functions;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "g",
                "text": "to enter into agreements with other institutions, whether in Sri Lanka or abroad, having objects wholly or partly similar to those of the Institute for the exchange and training of personnel, research and advisory services; and generally, for such purposes as may be in furtherance of their common objectives;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "h",
                "text": "to  appoint,  employ,  remunerate  and  exercise disciplinary control over and dismiss such officers and servants as are necessary for the discharge of the functions of the Institute under this Act;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "to charge fees for the services and assistance provided by the Institute; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "j",
                "text": "to do all such other things which in the opinion of the Institute are necessary to facilitate the discharge of its functions.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The administration, management and control of the affairs of the Institute shall be vested in the Board of Governors of the Institute (hereinafter referred to as the Board).",
                "pre_block_list": [
                  "Administration of the Institute to be vested in the Board."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Board shall for the purpose of administering the affairs of the Institute exercise, perform and discharge the powers, duties and functions conferred or imposed on or assigned to the Institute by this Act.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Board shall consist of the following :",
                "pre_block_list": [
                  "Constitution of the Board."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "six  ex-officio  members, namely",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "the Secretary to the Ministry of the Minister in charge of the subject of Labour;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "Commissioner-General of Labour;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "the Secretary to the Ministry of the Minister in charge of the subject of Industrial Development or his representative;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iv",
                        "text": "a representative from the General Treasury;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "v",
                        "text": "The Director-General of the Institute; and",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "vi",
                        "text": "a representative from the Universities nominated by the University Grants Commission established by the Universities Act, No. 16  of 1978;",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "thirteen members appointed by the Minister (hereinafter referred to as the appointed members), namely",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "an officer, not below the rank of a Senior Assistant Secretary, of the Ministry of the Minister in charge of the subject of Public Administration, nominated by that Minister;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "an officer, not below the rank of a Senior Assistant Secretary of the Ministry of the Minister in charge of the subject of Education, nominated by that Minister;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "an officer, not below the rank of a Senior Assistant Secretary of the Ministry of the Minister in charge of the subject of Vocational Training, nominated by that Minister;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iv",
                        "text": "four members representing trade unions;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "v",
                        "text": "four members representing employers; and",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "vi",
                        "text": "two members distinguished in the field of Labour Studies.",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Secretary to the Ministry of the Minister in charge of subject of Labour shall be appointed by the Minister as the Chairman of the Board and the Commissioner-General of Labour shall be as the Vice-Chairman of the Board.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Chairman and Vice-Chairman shall hold office for a term of three years and shall be eligible for reappointment.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "If the Chairman is by reason of illness or absence from Sri Lanka, temporarily unable to perform the duties of his office, the Minister shall appoint Vice-Chairman to act in his place.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "If the Vice-Chairman is by reason of illness or absence from Sri Lanka, temporarily unable to perform the duties of his office, the Minister may appoint another member to act in his place.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "A person shall be disqualified from being appointed or from continuing as a member of the Board, if he",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "i",
                    "text": "is, or becomes a member of Parliament or a member of a Provincial Council or a member of a Local Authority as the case may be; or",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "directly or indirectly, holds or enjoys any right or benefit under any contract made by or on behalf of the Institute; or",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "has any financial or other interest as is likely to affect prejudicially the discharge by him of his functions as a member of the Board.",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "The members of the Board holding office on the day immediately preceding the date of commencement of this Act shall continue to hold office until such time the Board is reconstituted under section 6 of the Act.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "It shall be the duty of the Board to advice the Minister on any or all of the matters related to the objects of the Institute and or any such matter referred to the Board for advice by the Minister.",
            "pre_block_list": [
              "Duties of the Board."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Minister may give special or general directions in writing as to the performance of the duties and the exercise of the powers of the Board, and the Board shall give effect to such directions.",
                "pre_block_list": [
                  "Power of the Minister to give special or general directions to the Board."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Minister may in consultation with the Board exempt any member of trade union from the payment of a fee.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "An appointed member of the Board shall hold office for a period of three years from the date of such appointment.",
                "pre_block_list": [
                  "Term of office."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Minister may if he considers it expedient to do so, by Order published in the  Gazette , remove, with reasons assigned therefor, any appointed member of the Board from office.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "An appointed member of the Board in respect of whom an Order under subsection (2) is made by the Minister shall vacate his office on the date of the publication of such Order in the  Gazette .",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "An appointed member of the Board may at any time resign his office by a letter addressed to the Minister.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "In the event of a vacancy occurring in the membership of the Board as a result of any appointed member vacating office by death, resignation, removal from office or otherwise, another person shall, having regard to the provisions of section 6, be appointed to fill such vacancy.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "Where another person is appointed to fill a vacancy caused by the death, resignation, removal from office or otherwise of an appointed member, the person so appointed shall hold such office for the unexpired period of the term of office of the member of the Board whom he succeeds.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "Where any appointed member is by reason of illness, infirmity or absence from Sri Lanka temporarily unable to perform his duties, for a period of not less than three months, another person may having regard to the provisions of section 6, be appointed to act in his place.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "8",
                "text": "Any appointed member of the Board, who is absent without leave from three consecutive meetings of the Board shall be deemed to have vacated his office.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "10",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Chairman or in absence of the Chairman, the Vice-Chairman shall preside at all meetings of the Board. In the absence of the Chairman or Vice-Chairman from any meeting of the Board, the members present at such meeting shall nominate one member from amongst those present, to preside at such meeting.",
                "pre_block_list": [
                  "Meetings of the Board."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "In the event of an equality of votes at any meeting of the Board, the Chairman, Vice-Chairman or the member presiding at such meeting shall in addition to his vote, have a casting vote.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The meetings of the Board shall be convened by the Chairman and shall be held as frequently as is necessary for the purpose of effectively discharging the functions of the Institute under this Act.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The quorum for meeting of the Board shall be five members.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "The Board may pay any member with the approval of the Minister, such remuneration or allowance, as may be decided by the Board with the concurrence of the Minister in charge of the subject of Finance.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "Subject to the provisions of this Act, regulations may be made by the board regulating the procedure to be followed with regard to the conduct of its meetings and the transaction of business at such.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "The Board shall in the exercise of its powers, the performance of its duties and the discharge of its functions, be subject to and act in accordance with such directions as the Minister may from time to time issue.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "11",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Board may delegate to any member of the Board any of the powers and duties.",
                "pre_block_list": [
                  "Delegation of powers and duties of the Board."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The member to whom such powers and duties have been delegated shall exercise and perform such powers and duties subject to the general or special directions of the Board, which may be issued from time to time.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "12",
            "text": "Subject to the provisions of subsection (4) of section 10 the Board shall have the power to act notwithstanding any vacancy in its membership and no act or proceedings of the Board shall be invalid by reason only of the existence of any such vacancy or any defect in the appointment of a member thereof.",
            "pre_block_list": [
              "Proceedings of the Board not to be invalid by reason of any vacancy or defect in the appointment of member."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "13",
            "text": "The seal of the Board",
            "pre_block_list": [
              "Seal of the Board."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "shall be in the custody of the Chairman of the Board;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "shall be of such design and shall be approved by the Board and may be altered in such manner as may be determined by the Board; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "shall not be affixed to any document except in the presence of two members of the Board, both of whom shall sign the document in token of their presence.",
                "pre_block_list": [
                  "S TAFF   OF   THE  I NSTITUTE"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "14",
            "text": "Subject to the provisions of this Act and any regulations made thereunder, the Board shall have the power to",
            "pre_block_list": [
              "Staff of the Institute"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "appoint, dismiss, and exercise disciplinary control over the officers and servants of the Institute;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "fix the wages or salaries or other remuneration of the staff;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "determine the terms and conditions of service of such staff; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "establish and regulate schemes for the benefit of such staff.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "15",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Board shall appoint a person to be the Director-General of the Institute, who shall be the Chief Executive Officer of the Institute for a period of three years and eligible for reappointment if the Board decides.",
                "pre_block_list": [
                  "Appointment of the Director- General."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Director-General shall execute or perform such powers, functions and duties as may be delegated to him by the Board.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Board may appoint such other Directors as may be necessary for the purposes of the Institute.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "16",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Board may appoint such number of Technical Committees as are necessary for the purpose of carrying out the functions under this Act.",
                "pre_block_list": [
                  "Establishment of Technical Committees."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "A Technical Committee appointed by the Board shall carry out its functions and fulfill its obligations as stipulated in the terms of reference given to such Technical Committee by the Board.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Board shall determine the period of office of each Technical Committee and reconstitute the same wherever necessary.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The Board may where it consider  it necessary so to do, co-opt as a member to a Technical Committee any person who possesses the required knowledge and experience in the relevant field.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "The Technical Committee shall comprise of three members. Namely, a representative each of the employees, the employers and the public sector.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "The Board shall nominate one member to be the Chairman of the Committee.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "The Board may pay to any member or co-opted member of a Technical Committee with the approval of the Minister, such remuneration or allowance, as may be decided by the Board.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "17",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be established a Division of Studies for Trade Unions (hereinafter referred to as the Division of Studies) for the implementation of the objects set out in subsection(4). The Division of Studies shall commence the discharge of its functions from such date as the Minister may by Order published in the  Gazette  appoint .",
                "pre_block_list": [
                  "Establishment of a Division of Studies for Trade Unions."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Board shall appoint a Director  who shall function as the Divisional Head of the Division of Studies.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Board shall appoint officers and servants as may required for the purposes of the Division of Studies.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The objects of the Division of Studies shall be to",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "provide training for members of Trade Unions, employees, employers, representatives of employers and employees and public servants; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "conduct training courses, seminars, workshops on labour laws, trade unions, finance, commerce, trade, supply of goods and services, labour management and such other courses which in the opinion of the Board will facilitate development of trade unions.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "The Divisional Head of the Division of Studies and officers and servants shall act under the general or special directions of the Director-General of the Institute.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "The Board may establish such number of branches of the Division of Studies in the regions as are required in its opinion for the achievement of the objects of the Division of Studies.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "18",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Institute may make rules in respect of all or any matter for which rules are authorized or required by this Act to be made.",
                "pre_block_list": [
                  "Rules."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every rule made by the Institute under subsection (1) shall not have effect until it is approved by the Minister and is published in the  Gazette .",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "19",
            "text": "Where the Institute employs any person who has entered into a contract with the Government by which he has agreed to serve the Government for a specified period, any period of service to the Institute by that person shall be regarded as service to the Government for the purpose of discharging the obligations of such contract.",
            "pre_block_list": [
              "Service to the institute deemed to be a service to the Government for the purposes of certain contracts."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "20",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "At the request of the Board, any officer in the public service serving in the Ministry of the Minister may, with the consent of the Secretary to the Ministry of the Minister given with the concurrence of the Chairman of the Public Service Commission  and of that officer, be temporarily appointed to the staff of the Institute for such period as may be determined by the Board, or with like consent, be permanently appointed to such staff.",
                "pre_block_list": [
                  "Appointment of public officers to the staff of the Institute."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where any officer in the public service is temporarily appointed to the staff of the Institute, the provisions of subsection (2) of section 14 of the National Transport Commission Act, No. 37 of 1991, shall  mutatis mutandis , apply to and in relation to him.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where any officer in the public service is permanently appointed to the staff of the Institute, the provisions of subsection (3) of section 14 of the National Transport Commission Act, No. 37 of 1991, shall  mutatis mutandis , apply to and in relation to him.",
                "pre_block_list": [
                  "F INANCE"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "21",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Institute shall have its own fund.",
                "pre_block_list": [
                  "Fund of the Institute."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "There shall be credited to the fund of the Institute",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "all such sums of money as may be voted from time to time by Parliament for the use of the Institute;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "all such sums of money as may be received by the Institute in the exercise, performance and discharge of its powers, duties and functions; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "all such sums of money as may be received by the Institute by way of loans, donations, gifts or grants from any source whatsoever, whether in or outside Sri Lanka.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "There shall be paid out of the fund of the Institute",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "all such sums of money as are required to defray any expenditure incurred by the Institute in the exercise, performance and discharge of its powers, duties and functions under this Act; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "all such sums of money as are required to be paid out of such fund, by or under this Act.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "22",
            "text": "The financial year of the Institute shall be the calendar year.",
            "pre_block_list": [
              "Financial year of the Institute."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "23",
            "text": "The provisions of Article 154 of the Constitution relating to the audit of accounts of public corporations shall apply to and in relation to, the audit of the accounts of the Institute.",
            "pre_block_list": [
              "Audit of Accounts.",
              "G ENERAL  P ROVISIONS"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "24",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Minister may make regulations in respect of matters for which regulations are required or authorized by this Act to be made or which are required by this Act to be prescribed.",
                "pre_block_list": [
                  "Regulations."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every regulation made under subsection (1) shall be published in the  Gazette  and shall come into operation on the date of such publication or on such date as may be specified in such regulation.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every regulation made under subsection (1) shall as soon as convenient after its publication in the  Gazette  be brought before Parliament for approval and any regulation which is not so approved shall be deemed to be rescinded with effect from the date of  such disapproval, but without prejudice to anything previously done thereunder.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Notification of the date on which any regulation is deemed to be rescinded shall be published in the  Gazette .",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "25",
            "text": "Any expenses incurred by any person brought against him before any court in respect of any act which is done by him under this Act or on the direction of the Board shall, if the Court holds that the act was done in good faith, be paid out of the fund of the Institute.",
            "pre_block_list": [
              "Expenses incurred by any person to be paid by the Institute."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "26",
            "text": "The Institute shall be deemed to be a Scheduled Institution, within the meaning of the Bribery Act and the provisions of that Act shall be construed accordingly.",
            "pre_block_list": [
              "The Institute deemed to be a scheduled Institution within the meaning of the Bribery Act."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "27",
            "text": "All members, officers and servants of the Institute shall be deemed to be public servants within the meaning, and for the purposes of the Penal Code.",
            "pre_block_list": [
              "Officers and servants of the Institute deemed to be public servants."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "28",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency.",
              "Interpretation."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "29",
            "text": "In this Act, unless the context otherwise requires",
            "pre_block_list": [
              "Labour Studies shall include the subjects of industrial relations, national or international labour standards, laws relating to labour, trade unions, employer-employee relations, employer-employee representative or organizations, worker education, human resource management and development administration, business management, productivity, manufacturing, trade marketing, social development and any study, project, programme, research, consultancy, survey, seminar, workshop, conference, training course or similar work related to labour economics or any other subject relevant thereto as shall be prescribed by the Minister.",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , D EPARTMENT   OF G OVERNMENT  I NFORMATION , N O . 163, K IRULAPONA  M AWATHA , P OLHENGODA , C OLOMBO  05 before 15th December each year in respect of the year following ."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}