{
  "n_pages": 24,
  "title_page": {
    "title": "Office On Missing Persons (Establishment, Administration And Discharge  Of Functions) Act",
    "num": "14",
    "year": "2016",
    "date_certified": "2016-08-23",
    "date_published": "2016-08-26",
    "price": 15.0,
    "price_postage": 10.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 23Rd August, 2016]",
      "L.D.O- 32/2016",
      "An   Act   To   Provide   For   The   Establishment   Of   The  O Ffice   On  M Issing P Ersons ;  To   Provide   For   The   Searching   And   Tracing   Of  M Issing P Ersons ;  To   Provide   Assistance   To   Relatives   Of  M Issing P Ersons ;  For   The   Setting   Up   Of   A   Database   Of  M Issing  P Ersons ;",
      "For   Setting   Out   The   Procedures   And   Guidelines   Applicable",
      "To   The   Powers   And   Functions   Assigned   To   The   Said   Office ;  And",
      "To   Provide   For   All   Matters   Which   Are   Connected   With",
      "Or   Incidental   To ,  The   Implementation   Of   The   Provisions   Of",
      "This   Act .",
      "Whereas   There Have Been Incidents Of Missing Persons Including Those Missing As Victims Of Abduction, Persons Missing In Action Or Otherwise Missing In Connection With Armed Conflicts, Political Unrest And Civil Disturbances:",
      "Preamble",
      "And Whereas   Relatives Of Missing Persons Are Entitled To Know The Circumstances In Which Such Persons Went Missing, And The Fate And  Whereabouts Of Such Missing Persons:",
      "And Whereas   It Is Recognised That The Establishment Of An Office On Missing Persons Is Necessary To Take All Necessary Measures To Search And Trace Missing Persons; To Protect The Rights And Interests Of Missing Persons And Their Relatives; And Towards Ensuring Non-Recurrence:",
      "Now Therefore Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:-"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "This Act may be cited as the Office on Missing Persons (Establishment, Administration and Discharge of Functions) Act, No. 14 of 2016.",
                "pre_block_list": [
                  "Short title and date of operation.",
                  "2PL 0100323061  (06/2016)"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The provisions of this Act shall come into operation on such date as the Minister may appoint, by Order published in the  Gazette  (hereinafter referred to as the appointed date).",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "The objectives of the Office on Missing Persons (Establishment, Administration and Discharge of Functions) Act is to ensure that all necessary measures are taken",
            "pre_block_list": [
              "Objectives of the Act."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "to provide appropriate mechanisms for searching and tracing of missing persons, and to clarify the circumstances in which such persons went missing, and their fate ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "to make recommendations to the relevant authorities towards reducing the incidents of missing persons within the meaning of this Act;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "to protect the rights and interests of missing persons and their relatives as provided for in this Act;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "to identify proper avenues of redress to which such missing persons or their relatives may have recourse.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "I",
        "text": "",
        "pre_block_list": [
          "E STABLISHMENT   OF   THE  O FFICE   ON  M ISSING  P ERSONS",
          "Establishment of the Office on Missing Persons (OMP)."
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be established an Office which shall be called and known as the Office on Missing Persons (hereinafter referred to as the OMP)",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The OMP shall be a body corporate having perpetual succession and a common seal and may sue and be sued in its corporate name.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The head office of the OMP shall be situated in Colombo. The OMP may, from time to time, establish such number of regional offices as may be necessary, to achieve its mandate.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "The OMP shall consist of seven members who shall be appointed by the President on the recommendation of the Constitutional Council.",
                    "pre_block_list": [
                      "Constitution and composition of the OMP."
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "One of the members of the OMP shall, on the recommendation of the Constitutional Council, be appointed by the President as the Chairman of the OMP:",
                    "pre_block_list": [
                      "Provided that the Constitutional Council may recommend more than one name for consideration by the President, to be appointed as the Chairman of the OMP."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "In making recommendations for the appointment of members to the OMP, the Constitutional Council shall, have due regard to:-",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "ensuring that the composition of the OMP reflects the pluralistic nature of the Sri Lankan society; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "ensuring that the members of the OMP shall be persons with previous experience in fact finding or investigation, human rights law, international humanitarian law, humanitarian response, or possess other qualifications relevant to the carrying out of the functions of the OMP.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The President shall appoint, within fourteen days of receiving the recommendations of the Constitutional Council for such appointments, the Chairman and the Members of the OMP.",
                "pre_block_list": [
                  "Chairman and members of the OMP."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "In the event the President fails to make the necessary appointments within such period of fourteen days",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the persons recommended to be appointed as members of the OMP, shall be deemed to have been appointed as members of the OMP; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the person whose name appears first in the list of names recommended to be appointed as the Chairman, shall be deemed to have been appointed as the Chairman of the OMP,",
                    "pre_block_list": [
                      "with effect from the date of expiry of such period."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Chairman of the OMP shall be its Chief Executive Officer.",
                "pre_block_list": [
                  "Term of office of members."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "Every member of the OMP shall hold office for a period of three years, unless he vacates office prior to the expiration of such term.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Any member who vacates his office, otherwise than by, removal under subsection (3), shall be eligible to be considered for re-appointment for one further term of three years only:",
                "pre_block_list": [
                  "Removal of members.",
                  "Provided that no person shall be entitled to be appointed as a Member of the OMP for more than two terms of office.",
                  "Provided further, that the period in which a Member is appointed as an acting Member shall not be considered as a term of office within the meaning of this subsection."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The office of a member shall become vacant-",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "upon the death of such member;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "upon such member resigning such office by writing addressed to the President;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "upon such member being removed from office on any ground specified in subsection (3) hereof; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "on the expiration of such members term of office.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "A member of the OMP may be removed from office by the President, if such person",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "is adjudged an insolvent by a court of competent jurisdiction;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "is found to have a conflict of interest, which in the opinion of the President, formed on the recommendation of the Prime Minister, made  in consultation with the Speaker and the Leader of the Opposition, conflicts with his duties as a member of the OMP;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "is unfit to continue in office by reason of infirmity of mind or body;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "is declared to be of unsound mind by a court of competent jurisdiction;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "is convicted of an offence involving moral turpitude; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "absents himself from three consecutive meetings without previously obtaining leave of the OMP.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The Chairman may resign from the office of Chairman by letter addressed to the President.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Subject to the provisions of subsection (3), the term of office of the Chairman shall be the period of membership of the OMP.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "If the Chairman of the OMP becomes temporarily unable to perform the duties of his office, by reason of illness or other infirmity or due to absence from Sri Lanka or any other such reason, the President may appoint any other member of the OMP to act in his place.",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "If a Member of the OMP becomes temporarily unable to perform the duties of his office, by reason of illness or other infirmity or due to absence from Sri Lanka or any other such reason, the President may appoint any other person to act in his place.",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "The provisions of sections 4 (1) and 5 shall apply in respect of any person appointed to act as Chairman or Member.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "No act or proceeding of the OMP shall be deemed to be invalid by reason only of the existence of any vacancy among its members, or defect in the appointment of any member thereof.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Chairman shall preside at all meetings of the OMP. In the event of his absence from any meeting, the members of the OMP present at such meeting shall elect one of their membership to preside at such meeting.",
                "pre_block_list": [
                  "Meetings of OMP."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Chairman of the OMP shall, in addition to his own vote, have a casting vote.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Subject to the other provisions of this Act, the OMP may make rules, to regulate the procedure in regard to the conduct of meetings of the OMP, and the transaction of business at such meetings.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "The quorum for meetings of the OMP shall be four members.",
            "pre_block_list": [
              "Quorum."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "II",
        "text": "",
        "pre_block_list": [
          "P OWERS , D UTIES   AND  M ANDATE   OF   THE  OMP"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "10",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The OMP shall have the mandate-",
                "pre_block_list": [
                  "Mandate of the OMP."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "to search for and trace missing persons and identify appropriate mechanisms for the same and to clarify the circumstances in which such persons went missing;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "to make recommendations to the relevant authorities towards addressing the incidence of missing persons;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "to protect the rights and interests of missing persons and their relatives as provided for in this Act;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "to identify avenues of redress to which missing persons and relatives of missing persons are entitled and to inform the missing person (if found alive) or relative of such missing person of same;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "to collate data related to missing persons obtained by processes presently being carried out, or which were previously carried out, by other institutions, organizations, Government Departments and Commissions of Inquiry and Special Presidential Commission of Inquiry and centralize all available data within the database established under this Act;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "to do all such other necessary things that may become necessary to achieve the objectives under the Act.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The mandate of the OMP shall extend to missing persons notwithstanding the time period in which such person became a missing person.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "11",
            "text": "The  OMP shall have the following general powers-",
            "pre_block_list": [
              "General Powers of the OMP."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "to enter into agreements, as are necessary to achieve the mandate of the OMP, with any person or organization;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "to make rules to ensure the effective functioning of the  OMP;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "to issue from time to time, rules and guidelines, which may include gender-sensitive policies, to be followed by all staff of the OMP relating to the exercise, performance and discharge of its powers, duties and functions;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "to appoint and dismiss staff and consultants and to request secondment of public officers to the OMP;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "to establish from time to time,  and in addition to those Units and Divisions specifically mentioned in this Act, such Committees and / or Divisions and / or Units as are required for the effective administration and functioning of the OMP, and shall also have the power to delegate such powers and functions as are necessary to such Committees, Divisions and Units.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "12",
            "text": "The OMP shall have the following investigative powers:-",
            "pre_block_list": [
              "Powers of Investigation."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "to receive, from any relative of a missing person, or any other person or organization, complaints relating to missing persons, irrespective of when such person may have become a missing person;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "to initiate an inquiry and/or investigation into the whereabouts and/or circumstances of disappearance of a missing person pursuant to a complaint made to the OMP or on the basis of information received from previously established Commissions of Inquiry, Commissions on missing persons or Commissions which have inquired into allegations relating to disappearances or missing persons:",
                "pre_block_list": [
                  "Provided however, that the OMP may grant priority to-"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "i",
                    "text": "incidents of missing persons that have occurred most recently;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "incidents in which there is substantial evidence already available; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iii",
                    "text": "such incidents that are, in the opinion of the OMP, of public importance;",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "to take all necessary steps to investigate cases of missing persons, including but not limited to the following",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "i",
                    "text": "to procure and receive statements, written or oral, and to examine persons as witnesses, including video-conferencing facilities;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "to summon any person present or residing in Sri Lanka to be present before the OMP to provide a statement or produce any document or other thing in his possession;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iii",
                    "text": "to admit, notwithstanding anything contained to the contrary in the Evidence Ordinance, any statement or material, whether written or oral, which might be inadmissible in civil or criminal proceedings;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iv",
                    "text": "to establish a process to accept confidential information or information  in camera , if required, to help ensure personal security for victims and witnesses;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "v",
                    "text": "to establish a process to accept information on the condition of confidentiality.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "to apply to the appropriate Magistrates Court having territorial jurisdiction, for an order of Court to carry out an excavation and/or exhumation of suspected grave sites, and to act as an observer at such excavation or exhumation, and at other proceedings, pursuant to the same;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "to request assistance necessary for the achieving of its mandate, from any State, governmental, provincial, or local authority or agency, or any officer thereof. Notwithstanding anything to the",
                "pre_block_list": [
                  "contrary in any other written law or regulation made thereunder, any such authority, agency or officer to which a request for assistance is made by the OMP shall forthwith render such assistance. Such assistance shall include but not be limited to providing information and producing documents in the possession of such authority, agency or officer;"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "to authorize in writing a specified officer of the OMP, to enter without warrant, at any time any place of detention, police station, prison or any other place in which any person is suspected to be detained, or is suspected to have previously been detained in, whether by judicial order or otherwise and make such examinations therein or make such inquiries from any person found therein, to ascertain the conditions of detention and retain any documents or objects, as may be necessary;",
                "pre_block_list": [
                  "For the purposes of this paragraph, the Minister assigned the subject of Justice shall make guidelines for the conduct of the search and place it before Parliament within a period of three months;",
                  "The OMP shall inform the Inspector General of Police within twenty four hours of conducting the search without a warrant;"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "g",
                "text": "to make an application to the Magistrate having territorial jurisdiction, for the issuance of a search warrant, to enable Police or specified officers of the OMP, to search any premises suspected to contain evidence relevant to an investigation being conducted by the OMP, and to examine, make copies of, extract from, seize and retain, any object that is deemed necessary for the purposes of any investigation being conducted by the OMP;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "h",
                "text": "to refer, after due consultation with the complainant, to the police or any other relevant law enforcement",
                "pre_block_list": [
                  "authority all cases of missing persons that have been brought before the OMP not falling within the definition of the expression missing persons as defined in this Act;"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "where it appears to the OMP that an offence within the meaning of the Penal Code or any other law, has been committed, that warrants investigation, the OMP may, after consultation with such relatives of the missing person as it deems fit, in due consideration of the best interests of the victims, relatives and society, report the same to the relevant law enforcement or prosecuting authority: such report will provide information relating to the missing persons civil status (such as the name, age and gender of the missing person), the place(s) or district(s) in which the missing person was last seen and the date thereof:",
                "pre_block_list": [
                  "Provided that where a witness consents, the OMP may also inform the relevant authority, of the details of such witness, in order to enable such relevant authority to secure a statement from such witness to be used in the process of investigation."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "13",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The OMP shall be charged with the following functions:-",
                "pre_block_list": [
                  "Functions and duties of the OMP."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "Pending an ongoing investigation, where the OMP has sufficient material to conclude that the person to whom a complaint relates is a missing person, it shall issue an interim report to the relative of such missing person, to such effect, in order to enable the Registrar General to issue a Certificate of Absence;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "Upon the conclusion of an investigation, where the OMP concludes that the person to whom a complaint relates is a missing person or is",
                        "pre_block_list": [
                          "deceased it shall issue a report to the relative of such missing person, to such effect, in order to enable the Registrar General to issue a Certificate of Absence or a Certificate of Death as the case may be;"
                        ],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "where further investigations reveal that a conclusion reported in an interim report or report is erroneous, the OMP shall notify the relative of the same, and simultaneously inform the Registrar General of such further development;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iv",
                        "text": "in providing interim reports, reports, or information to a relative of a missing person, the order of priority between relatives shall be the order specified in section 27;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "v",
                        "text": "interim reports and reports shall only be issued to facilitate the issuance of Certificates of Absence during the operation of the Registration of Deaths (Temporary Provisions) Act, No. 19 of 2010 or such other law which permits the issuance of Certificates of Absence by the Registrar General.",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "to provide to any relative of a missing person or any other complainant, wherever the OMP is able to do so, information relating to the  whereabouts of a missing person, if found to be alive, subject to the consent of the person found alive;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "to provide relatives of a missing person, information relating to the status of an ongoing investigation, pertaining to such missing person, unless the OMP is of the view that such would hinder the ongoing investigation or that it is not in the best interests of the missing person:",
                    "pre_block_list": [
                      "Provided that where the relatives of the missing person are deceased or unknown or the OMP is unable to locate such relatives, the OMP may provide updates with regard to such investigation to an appropriate authority or organisation."
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "at the conclusion of an investigation the OMP shall, subject to the provisions of section 15(1)-",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "where the missing person is deceased or his whereabouts are unknown, inform the relatives of the missing person and other complainant as the case may be, of the circumstances in which such person went missing and his fate;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "where the missing persons whereabouts are known, subject to sub-paragraph ( b ) inform the relatives of the missing person of the circumstances in which such person went missing.",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "to provide, or facilitate the provision of, administrative assistance, and welfare services including where required, psycho-social support, to the relatives of the missing person;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "to  recommend that the relevant authority grant reparations to missing persons and / or relatives of missing persons, including but not limited to compensation and / or recommend the provision of other administrative and welfare services including psycho-social services;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "g",
                    "text": "to develop and enforce a system for victim and witness protection:",
                    "pre_block_list": [
                      "Provided that the provisions hereof shall not prejudice the rights of parties or the OMP to seek",
                      "appropriate orders in terms of the Assistance to and Protection of Victims of Crime and Witnesses Act, No. 4 of 2015;"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "h",
                    "text": "to create, manage and maintain a database which will include all particulars concerning missing persons;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "i",
                    "text": "to inform victims, relatives, witnesses and other informants  who provide information to the OMP, of their right to directly refer matters to relevant authorities, including their right to report serious crimes to the relevant law enforcement or prosecuting authority and of the availability of any mechanism through which they may make claims for administrative relief;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "j",
                    "text": "to take appropriate steps towards  creating public awareness of the causes, incidence and effects of missing persons, and towards creating public support for fulfilling the needs of the relatives of missing persons and facilitating their access to economic, psycho-social, legal and administrative support;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "k",
                    "text": "to make recommendations to the relevant authorities, relevant to its mandate, including recommendations relating to-",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "the prevention of future disappearances, based on patterns identified in the course of the work of the OMP;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "the means and methods of commemoration and acknowledgment;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "the handling of unidentifiable remains and identifiable remains;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iv",
                        "text": "the handling of cases in which either circumstances or whereabouts of missing persons cannot be clarified;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "v",
                        "text": "the publishing of information on issues of missing persons for public knowledge with due consideration to all relevant laws pertaining to confidentiality and protection of data;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "vi",
                        "text": "the development of national laws and regulations related to missing persons; and",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "vii",
                        "text": "reparations, psycho-social support and other means to improve social and economic conditions of victims and relatives of missing persons:",
                        "pre_block_list": [
                          "Provided  that  in  making  the  said recommendations under paragraph ( k ) the OMP shall consult as it deems appropriate, relatives of missing persons and / or organisations representing missing persons."
                        ],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The findings of the OMP shall not give rise to any criminal or civil liability.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "14",
            "text": "In exercising its powers under this Act the OMP shall ensure that the rights of missing persons and relatives of missing persons shall be enforced on a basis of equality without regard to status and without discrimination on any grounds whatsoever.",
            "pre_block_list": [
              "OMP to ensure the rights of missing persons and relatives."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "15",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Notwithstanding anything to the contrary in any written law, except in the performance of his duties under this Act, every member, officer, servant and consultant of the OMP shall preserve and aid in preserving confidentiality with regard to matters communicated to them in confidence. The provisions of the Right to Information Act, No. 12 of 2016,  shall not apply with regard to such information.",
                "pre_block_list": [
                  "Confidentiality of information."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "No member, officer, servant or consultant of the OMP shall be required to produce, whether in any court or otherwise, any material communicated to him in confidence in the performance of his duties under this Act, except as may be necessary for the purpose of carrying out or giving effect to, the provisions of this Act.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The OMP shall take all necessary steps including technical safeguards to ensure the security of all its databases and data.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "III",
        "text": "",
        "pre_block_list": [
          "S ECRETARIAT , T RACING  U NIT , V ICTIMS   AND  W ITNESS  P ROTECTION D IVISION   OF   THE  OMP",
          "The Secretariat of the OMP."
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "16",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The OMP shall have a Secretariat which shall be charged with the responsibility for the administration of the affairs of the OMP.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "There may be appointed by the OMP, such officers and staff as may be necessary to assist the OMP in the exercise, performance and discharge of its powers, duties and functions as set out in this Act.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The members of the OMP (for the limited purpose of their functions under this Act) and the officers and staff of the OMP, shall be deemed to be public servants for the purposes of the Penal Code (Chapter 19), the Bribery Act and the Evidence Ordinance (Chapter 14).",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The OMP shall be deemed to be a scheduled institution within the meaning of the Bribery Act, and the provisions of that Act shall be construed accordingly.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "17",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be a Tracing Unit of the OMP, which shall be responsible for tracing and searching for missing persons and for assisting in clarifying the circumstances of such disappearance, and the whereabouts and fate of such missing person.",
                "pre_block_list": [
                  "OMP Tracing Unit."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Tracing Unit shall be headed by an Executive Officer appointed by the OMP and shall include competent, experienced and qualified investigators, including those with relevant technical and forensic expertise.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "18",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be a Victim and Witness Protection Division within the OMP that shall protect the rights and address the needs and concerns of victims, witnesses and relatives of missing persons.",
                "pre_block_list": [
                  "OMP Victim and Witness Protection Division."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Victim and Witness Protection Division shall be headed by an Executive Officer appointed by the OMP.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Division shall take all appropriate measures to ensure the protection of victims and witnesses who engage with the OMP.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The Victim and Witness Protection Division may provide or facilitate the provision of administrative services and welfare services including psycho-social support to victims, witnesses and relatives of missing persons.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "The Victim and Witness Protection Division shall inform victims and witnesses of all the uses or potential uses, of information provided.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "The Victim and Witness Protection Division may co- ordinate with other law enforcement agencies where it deems necessary.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "IV",
        "text": "",
        "pre_block_list": [
          "F INANCE"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "19",
            "text": "The State shall provide the OMP with adequate funds to enable the OMP to discharge the functions assigned to it by this Act. Such funds shall be charged on the Consolidated Fund.",
            "pre_block_list": [
              "Finances."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "20",
            "text": "The salaries of the members of the OMP shall be determined by Parliament and shall be charged on the Consolidated Fund, and shall not be diminished during their terms of office.",
            "pre_block_list": [
              "Salaries of OMP members."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "21",
            "text": "The OMP may raise funds",
            "pre_block_list": [
              "OMP to raise funds."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "by obtaining grants, gifts or endowments from within Sri Lanka; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "to achieve its mandate by obtaining grants, gifts or endowments from outside Sri Lanka:",
                "pre_block_list": [
                  "Provided that the funds under paragraph ( b ) are channeled through the Department of External Resources."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "22",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The financial year of the OMP shall be the calendar year.",
                "pre_block_list": [
                  "Financial year."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The OMP shall cause proper accounts to be kept of its income and expenditure, and assets and liabilities. The accounts of the OMP shall be audited by  the Auditor General in terms of Article 154 of the Constitution.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "23",
            "text": "The OMP shall, subject to the provisions of section 15 (1), submit annual reports to Parliament, and shall also cause such reports to be made public.",
            "pre_block_list": [
              "Reporting."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "V",
        "text": "",
        "pre_block_list": [
          "G ENERAL"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "24",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "If any person-",
                "pre_block_list": [
                  "Offences."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "fails without cause to appear before the OMP pursuant to summons issued by the OMP; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "refuses without cause to answer any question put to him by the OMP; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "refuses or fails without cause to comply with the requirements of a notice or written order or direction issued or made to him, by the OMP; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "upon whom a summons is served, refuses or fails without cause to produce any document or other thing, which is in his possession or control; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "resists or obstructs an officer authorized under this Act in the exercise by that officer of the powers conferred on him; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "knowingly hinders or obstructs the OMP in the fulfillment or execution of its powers, obligations and duties; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "g",
                    "text": "performs any act aimed at improperly influencing or interfering with the work of the OMP; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "h",
                    "text": "threatens, intimidates or improperly influences, or attempts to threaten, intimidate or improperly influence any person who has co-operated, or is intending to co-operate with the OMP; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "i",
                    "text": "discloses any confidential information in contravention of the provisions of this Act; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "j",
                    "text": "without reasonable excuse fails to comply with any other order of the OMP,",
                    "pre_block_list": [
                      "such person shall be guilty of an offence of contempt against the authority of the OMP."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where it appears that a person is guilty of an offence of contempt the OMP shall report such matter to the Court of Appeal. Every offence of contempt committed against the authority of the OMP shall be punishable by the Court of Appeal as though it were an offence of contempt committed against the Court of Appeal.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "25",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "No order, decision, act or omission of the OMP or any member, officer or servant thereof shall be questioned in any proceedings or any court of law, save and except in proceedings under Article 126 or 140 of the Constitution.",
                    "pre_block_list": [
                      "Protection from Action."
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "The writ jurisdiction conferred on the Court of Appeal by Article 140 of the Constitution in relation to any order, decision, act or omission of the OMP or any member, officer or servant thereof, shall be exercised by the Supreme Court and not by the Court of Appeal.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Other than in the circumstances provided for in sub- section (1) of this section -",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "no proceedings civil or criminal, shall be instituted against any member of the OMP or any officer or servant appointed to assist the OMP, other than for contempt against the authority of the OMP, for any act which in good faith is done or omitted to be done, by him, as such member or officer or servant;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "no proceedings civil or criminal, shall be instituted against any member of the OMP in respect of any report made in good faith by the OMP under this Act or against any other person in respect of the publication by such person of a true account of such report;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "no proceedings civil, criminal or administrative, shall be instituted against any person consequent, to such person in good faith providing evidence or documentation to the OMP.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "26",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The OMP may make rules for matters for which rules are required to be made under this Act.",
                "pre_block_list": [
                  "Rules."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every rule made under this Act shall be tabled before Parliament and shall be published in the  Gazette  within a reasonable period not exceeding three months.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "27",
            "text": "Unless the context otherwise requires, in this Act -",
            "pre_block_list": [
              "Interpretation.",
              "missing person means a person whose fate or whereabouts are reasonably believed to be unknown and which person is reasonably believed to be unaccounted for and missing-"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "in the course of, consequent to, or in connection with the conflict which took place in the Nothern and Eastern Provinces or its aftermath, or is a member of the armed forces or police who is identified as missing in action; or",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "in connection with political unrest or civil disturbances; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iii",
                    "text": "as an enforced disappearance as defined in the International Convention on Protection of All Persons from Enforced Disappearances;",
                    "pre_block_list": [
                      "relative of a missing person shall in relation to such missing person include the following persons",
                      "(i) spouse;",
                      "(ii) children including adopted children, non-marital children, or step children;",
                      "(iii) parents (including step-mother, step- father, adopter);"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iv",
                    "text": "full or half brother or sisters or adopted brothers or sisters;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "v",
                    "text": "father / mother- in-law, brother/sister-in- law, sons/daughters-in-law;      (vi) grandchildren and grandparents.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "28",
            "text": "In the event of any inconsistency between the Sinhala and Tamil Texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency.",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , D EPARTMENT   OF G OVERNMENT  I NFORMATION , N O . 163, K IRULAPONA  M AWATHA , P OLHENGODA , C OLOMBO  05 before 15th December each year in respect of the year following ."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}