{
  "n_pages": 5,
  "title_page": {
    "title": "Shop And Office Employees (Regulation Of Employment And Remuneration) (Amendment)  Act",
    "num": "28",
    "year": "2024",
    "date_certified": "2024-05-13",
    "date_published": "2024-05-17",
    "price": 12.0,
    "price_postage": 150.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 13Th Of May, 2024]",
      "L.D.-O. 27/2022",
      "A N   Act   To   Amend   The  S Hop   And  O Ffice   E Mployees  (R Egulation",
      "Of  E Mployment   And  R Emuneration ) A Ct  (C Hapter  129)",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows: -"
    ],
    "pre_section_list": [
      {
        "class_name": "ActL1Section",
        "num": "1",
        "text": "This Act may be cited as the Shop and Office Employees (Regulation of Employment and Remuneration) (Amendment) Act, No.  28  of 2024.",
        "pre_block_list": [
          "Short title"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "2",
        "text": "Section 10 of the Shop and Office Employees (Regulation of Employment and Remuneration) Act (Chapter 129) (in this Act referred to as the principal enactment) is hereby amended as follows: -",
        "pre_block_list": [
          "Amendment of section 10 of Chapter 129"
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "in subparagraph (iii) of paragraph ( b ) of subsection (2) thereof, by the substitution for the words and figures between 6.00 p.m. and 8.00 p.m.; and of the words and figures between 6.00 p.m. and 8.00 p.m.;;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "in subparagraph (iv) of  paragraph ( b ) of subsection (2) thereof, by the substitution for the words and figures between 6.00 p.m. and 10.00 p.m. of the words and figures between 6.00 p.m. and 10.00 p.m.;  and ;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "by the insertion, immediately after subparagraph (iv) of paragraph ( b ) of subsection (2) of the following: -",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "v",
                "text": "any female who has attained the age of eighteen years may be employed in any institution which is engaged in business, based on information technology and",
                "pre_block_list": [
                  "knowledge process outsourcing or business process outsourcing, or engaged in administration and accounts or related work in a back office for an institute situated abroad before 6.00 a.m. or after 6.00 p.m. on any day",
                  ""
                ],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "3",
        "text": "Section 66 of the principal enactment is hereby amended by the insertion immediately after paragraph ( f ) of subsection (2) thereof, of the following: -",
        "pre_block_list": [
          "Amendment of section 66 of the principal enactment",
          "( fa ) in respect of the terms and conditions to be followed by an employer who employs any females, relating to the welfare of such females, including their security, transport facilities and facilities to rest when such females are employed after 10.00 p.m. and before 6.00 a.m.;."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "4",
        "text": "Section 68 of the principal enactment is hereby amended as follows: -",
        "pre_block_list": [
          "Amendment of section 68 of the principal enactment"
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "in paragraph ( a ) thereof, in the definition of the expression office, by the substitution for the words literature), and of the words literature);;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "in paragraph ( b ) thereof, by the substitution for the words for the purposes of this Act; of the words for the purposes of this Act; and;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "by the addition, immediately after paragraph ( b ) thereof, of the following: -",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "any institution engaged in business, based on information technology and knowledge",
                "pre_block_list": [
                  "process outsourcing or business process outsourcing or engaged in administration and accounts or related work in a back office in connection with any institution situated abroad;."
                ],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "5",
        "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
        "pre_block_list": [
          "Sinhala text to prevail in the case of inconsistency",
          "English Acts of the Parliament can be purchased at the P RAKASHANA  P IYASA , D EPARTMENT   OF G OVERNMENT  P RINTING , N O . 118, D R . D ANISTER  D E  S ILVA  M AWATHA , C OLOMBO  8."
        ],
        "child_level_list": []
      }
    ],
    "part_list": []
  }
}