{
  "n_pages": 6,
  "title_page": {
    "title": "Value  Added  Tax   (Amendment) Act",
    "num": "19",
    "year": "2019",
    "date_certified": "2019-10-31",
    "date_published": "2019-11-01",
    "price": 8.0,
    "price_postage": 15.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 31St Of October, 2019]",
      "L.D.O. 5/2019",
      "A N  A Ct   To   Amend   The  V Alue  A Dded  T Ax  A Ct , N O . 14  Of  2002",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:-"
    ],
    "pre_section_list": [
      {
        "class_name": "ActL1Section",
        "num": "1",
        "text": "This Act may be cited as the Value Added Tax (Amendment) Act, No. 19 of 2019.",
        "pre_block_list": [
          "Short title."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "2",
        "text": "Section 6 of the Value Added Tax Act, No.14 of 2002 (hereinafter referred to as the principal enactment) is hereby repealed and the following section is substituted therefor:-",
        "pre_block_list": [
          "Amendment of section 6 of Act, No.14 of 2002.",
          "6. (1) The value of goods imported, other than the goods as prescribed by regulation shall be the aggregate of ",
          "The value of goods imported.",
          "( a ) the value of the goods determined for the purpose of custom duty increased by ten  per centum;  and",
          "( b ) the amount of any custom duty payable in respect of such goods with the addition of any surcharge, cess, any Ports and Airports Development Levy payable under the Finance Act, No. 11 of 2002, and any excise duty payable under the Excise (Special Provisions) Act, No. 13 of 1989 on such goods."
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "The Minister may, from time to time, prescribe by regulation, the manner by which the value of goods specified in the regulation made under subsection (1) is to be determined. Any such regulation made by the Minister shall be approved by the Cabinet of Ministers and",
            "pre_block_list": [
              "published in the  Gazette.  Such regulation shall be placed before the Parliament for approval and shall be effective only upon it being approved by the Parliament",
              ""
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "3",
        "text": "Section 7 of the principal enactment is hereby amended by the repeal of paragraph ( a ) of subsection (1)  of that section and the substitution therefor of the following:-",
        "pre_block_list": [
          "Amendment of section 7 of the principal enactment."
        ],
        "child_level_list": [
          {
            "class_name": "ActL3Paragraph",
            "num": "a",
            "text": "goods shall be zero rated where the supplier of such goods has exported such goods;",
            "pre_block_list": [
              "For the purpose of this paragraph, any goods supplied by any construction contractor to be utilized on a construction project carried out by such contractor outside Sri Lanka, shall be deemed to be goods exported by such contractor; and."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "4",
        "text": "Section 22 of the principal enactment is hereby amended as follows:",
        "pre_block_list": [
          "Amendment of section 22 of the principal enactment."
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "in paragraph ( a ) of the first proviso to subsection (1) thereof, by the repeal of subparagraphs (iii) and (iv) and the substitution therefor of the following:-",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL4SubParagraph",
                "num": "iii",
                "text": "rupees seventy five for any period commencing on or after August 16, 2018 but prior to November 1, 2019 and rupees hundred for any period commencing on or after November 1, 2019, for each such garment other than panties, socks, briefs and boxer shorts identified under the Harmonized Commodity Description and Coding System Numbers for custom purposes;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL4SubParagraph",
                "num": "iv",
                "text": "rupees seventy five for any period commencing on or after August 16, 2018 but prior to November 1, 2019 and rupees hundred for any period commencing on or",
                "pre_block_list": [
                  "after November 1, 2019, for six pieces of panties, socks, briefs and boxer shorts, identified  under  the  Harmonized Commodity Description and Coding System Numbers for custom purposes,."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "in the fourth proviso to subsection (3) thereof, by the substitution for the words goods so manufactured. of the following:",
            "pre_block_list": [
              "goods so manufactured:",
              "Provided further, that any person, who supplies condominium housing units and accounts for the output tax at the rate of six  per centum ,  shall be entitled to deduct as input tax in relation to such supplies as is allowable under this Act only at the rate of five  per centum  even where such person has paid the input tax at a higher rate than the rate of five  per centum  on the value of such supplies received by him",
              ""
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "5",
        "text": "Section 26 of the principal enactment is hereby amended in subsection (1A) thereof by the substitution for the words and figures January 1, 2013 of the words and figures January 1, 2013, but prior to October 1, 2019.",
        "pre_block_list": [
          "Amendment of section 26 of the principal enactment."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "6",
        "text": "First Schedule to the principal enactment is hereby amended in PART II thereof as follows:-",
        "pre_block_list": [
          "Amendment of the First Schedule to the principal enactment."
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "in item (xi) of paragraph ( b ) of that PART",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "by the substitution in sub-item ( b ) for the words and figures on or after November 1, 2016 but prior to the date of commencement of this (Amendment) Act by any person of the words and figures on or after November 1, 2016 but prior to April 1, 2019, by any person;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "by the substitution in sub-item ( c ) for the words rupees fifteen million. of the following:-",
                "pre_block_list": [
                  "rupees twenty five million; or"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iii",
                    "text": "is relating to a sale of any condominium housing unit and where there is an agreement to sell in respect of such supply which is executed in terms of the Notaries Ordinance (Chapter 107) prior to the date of commencement of this (Amendment) Act; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iv",
                    "text": "is a supply of a condominium housing unit of a condominium housing project in respect of which a certificate of conformity has been issued by the relevant Local Authority prior to the date of commencement of this (Amendment) Act in respect of such supply,",
                    "pre_block_list": [
                      "with effect from April 1, 2019.;"
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "by the repeal of item (xxvi) of paragraph ( b ) and the substitution therefor of the follwing:-",
            "pre_block_list": [
              "(xxvi) locally produced dairy products other than powdered milk containing added sugar or other sweetening matter, out of locally produced fresh milk in so far as such milk is produced in Sri Lanka and locally produced rice products containing rice produced in Sri Lanka and, with effect from November 1, 2019 locally produced rice bran oil made out of locally produced rice;."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "7",
        "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
        "pre_block_list": [
          "Sinhala text to prevail in case of inconsistency.",
          "English Acts of the Parliament can be purchased at the P RAKASHANA  P IYASA , D EPARTMENT   OF G OVERNMENT  P RINTING , N O . 118, D R . D ANISTER  D E  S ILVA  M AWATHA , C OLOMBO  8."
        ],
        "child_level_list": []
      }
    ],
    "part_list": []
  }
}