{
  "n_pages": 4,
  "title_page": {
    "title": "Universities   (Amendment) Act",
    "num": "17",
    "year": "2016",
    "date_certified": "2016-10-05",
    "date_published": "2016-10-07",
    "price": 6.0,
    "price_postage": 10.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 05Th October, 2016]",
      "L. D.O. 35/2013.",
      "A N  A Ct   To   Amend   The  U Niversities A Ct , N O . 16  Of  1978",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Universities (Amendment) Act, No. 17 of 2016.",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "Section 75 of the Universities Act,  No. 16 of 1978 (hereinafter referred to as the principal enactment) is hereby repealed and the following new section is substituted therefor:",
            "pre_block_list": [
              "Replacement of section 75 of Act, No. 16 of 1978.",
              "75. (1) The retirement age of a public officer as may be determined by the Government, from time to time, shall apply with effect from the same date as applicable to a public officer in respect of the retirement age of the holder of any post, other than that of a teacher.",
              "Retirement of persons other than teachers."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the Commission or the governing authority of any Higher Educational Institution to which the holder of such post is attached or in the case where such person is attached to a Higher Educational Institute, the governing authority of the Higher Educational Institution to which such institute is affiliated may based on the recommendations of the Institute suspend the holder of such post pending an inquiry by the Commission or such governing authority or the Institute, as the case may be, for misconduct, inefficiency or dereliction of duty; or",
                    "pre_block_list": [
                      "2PL 0100942,961  (07/2016)"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "where such holder of post is found guilty after such inquiry, the Commission,  the  governing authority of the Higher Educational Institution to which such person is attached or in the case where such person is attached to a Higher Educational Institute, the governing authority of the Higher Educational Institution to which such Institute is affiliated, as the case may be, may on resolution adopted by the Commission or the governing authority of the relevant Higher Educational Institution, dismiss or compulsorily retire the holder of such post",
                    "pre_block_list": [
                      ""
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "Section 147 of the principal enactment is hereby amended by the insertion, immediately after the definition, governing authority, the following new definition:",
            "pre_block_list": [
              "Amendment of section 147 of the principal enactment.",
              "Higher Educational Institute  means an institute for higher learning established or deemed to be established under section 24 A  or 24 B  of the Universities Act, No. 16 of 1978."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency.",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , D EPARTMENT   OF G OVERNMENT  I NFORMATION , N O . 163, K IRULAPONA  M AWATHA , P OLHENGODA , C OLOMBO  05 before 15th December each year in respect of the year following ."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}