{
  "n_pages": 5,
  "title_page": {
    "title": "Census   (Amendment) Act",
    "num": "55",
    "year": "2000",
    "date_certified": "2000-08-18",
    "date_published": "2000-08-18",
    "price": 4.5,
    "price_postage": 3.5
  },
  "body_pages": {
    "preamble": [
      "Census (Amendment) Act, No. 55 Of 2000 1",
      "[Certified On 18Th August,  2000]",
      "L.D.O. 54/99.",
      "A N   A Ct   To   Amend   The   C Ensus   O Rdinance",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Census (Amendment) Act, No. 55  of  2000.",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "Sections 2 and 3 of the Census Ordinance (hereinafter referred to as the principal enactment) as last amended by Act, No. 16 of 1981 are hereby repealed and the following sections substituted therefor :",
            "pre_block_list": [
              "Replacement of sections 2 and 3 of Chapter 143.",
              "2. It shall be lawful for the Minister, from time to time, by Order published in the Gazette, to direct that a census be taken of the population, housing, agriculture, livestock, trade, labour, industry, construction or commerce or such other matters as he may deem necessary for ascertaining the demographic, social or economic condition of the inhabitants of  Sri Lanka.",
              "Minister to direct taking of census."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "To superintend the taking of any census, there shall be appointed an officer to be called the Superintendent of Census. If an appointment to the office of the Superintendent of Census is not made, the Director-General of Census and Statistics appointed under the Statistics Ordinance shall exercise, perform and discharge, all such powers, duties and functions as are conferred or imposed on, assigned to, the Superintendent of Census by this Ordinance",
            "pre_block_list": [
              "",
              "Appointment of Superin- tendent of Census.",
              "2H 008087 5,550 (08/2000)",
              "3. Section 5 of the principal enactment as last amended by Act No. 16 of 1981 is hereby further amended by the repeal of subsection (4) of that section and the substitution therefor, of the following subsection :",
              "Amendment of section 5 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Any person committing any breach of any such rule shall, on conviction before a Magistrate, be liable to imprisonment of either description for a term not exceeding six months or to a fine not exceeding ten thousand rupees, or to both such imprisonment and fine.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "Section 6 of the principal enactment as last amended by Act No. 16 of 1981 is hereby repealed and the following section substituted therefor :",
            "pre_block_list": [
              "Replacement of section 6 of the principal enactment.",
              "6. The District Secretary of a District Secretarys Division shall be the Commissioner of Census for his District and the Mayor, Chairman or Special Commissioner, where any local authority is administered by a Special Commissioner, of every Municipal Council and Urban Council shall be Commissioner of Census for the local area, of such Municipal Council or Urban Council :",
              "District Secretary and Mayor, Chairman or Special Commissioner of Municipal Council or Urban Council to be Commissioners.",
              "Provided that any other person may be appointed as Commissioner for such District or such Municipal Council or Urban Council area",
              ""
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "Section 7 of the principal enactment is hereby amended by the substitution",
            "pre_block_list": [
              "Amendment of section 7 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "in the marginal note for the words Assistant Commissioners  of  the  words  Deputy Commissioners and Assistant Commissioners ; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "for the words an Assistant Commissioner of Census to assist of the words a Deputy Commissioner of Census and an Assistant Commissioner of Census to assist.",
                "pre_block_list": [
                  "Census (Amendment) Act, No. 55 of 2000 3"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "Section 9 of the principal enactment as amended by Act No. 16 of 1981 is hereby further amended by the substitution, for the words Commissioner, Assistant Commissioner, of the words Commissioner, Deputy Commissioner, Assistant Commissioner.",
            "pre_block_list": [
              "Amendment of section 9 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "Section 21 of the principal enactment as amended by Act No. 16 of 1981 is hereby further amended as follows :",
            "pre_block_list": [
              "Amendment of section 21 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "in subsection (1) of that section, by the substitution, for the words a term not exceeding three months or to a fine not exceeding five thousand rupees, of the words for a term not exceeding six months or to a fine not exceeding ten thousand rupees ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "in subsection (2) of that section, by the substitution, for the words a term not exceeding three months or to a fine not exceeding five thousand rupees, of the words a term not exceeding six months or to a fine not exceeding ten thousand rupees; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "in subsection (3) of that section, by the substitution, for the words a term not exceeding three months or to a fine not exceeding five thousand rupees, of the words a term not exceeding six months or to a fine not exceeding ten thousand rupees.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "Wherever in any provision of the Statistics Ordinance or other written law or of any notice, communication, form or other document issued, made required or authorised by the Statistics Ordinance or such other written law, the expression Director of Statistics occurs, there shall be substituted for that expression, the expression Director-General of Census and Statistics, and accordingly, wherever in any such provisions there is a reference to Director denoting the Director of Statistics, such reference shall be read and construed as a reference to the Director-General of Census and Statistics.",
            "pre_block_list": [
              "Amendment of Statistics Ordinance and other written law."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency.",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180(Foreign), payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , N O . 32, T RANSWORKS  H OUSE , L OTUS  R OAD , C OLOMBO  01 before 15th December each year in respect of the year following."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}