{
  "n_pages": 4,
  "title_page": {
    "title": "Debits Tax (Amendment) Act",
    "num": "12",
    "year": "2007",
    "date_certified": "2007-04-11",
    "date_published": "2007-04-12",
    "price": 4.25,
    "price_postage": 5.0
  },
  "body_pages": {
    "preamble": [
      "Debits Tax (Amendment) Act, No. 12 Of 2007 1",
      "[Certified On 11Th April, 2007]",
      "L.D.O. 5/2007",
      "A N  A Ct   To   Amend   The  D Ebits  T Ax  A Ct , N O . 16  Of  2002",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Debits Tax (Amendment) Act, No. 12  of 2007.",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "The Debits Tax Act, No. 16 of 2002 (hereinafter referred to as the principal enactment) is hereby amended by the substitution for the words commercial bank or a specialized bank wherever such words appear in that Act, other than in section 5, subsection (2) of section 6, subsection (2) of section 9, subsection (2) of section 10, subsections (1) and (2) of section 14, subsection (1) of section 15 and subsection (2) of section 18 thereof, of the words commercial  bank, specialized bank or a finance company.",
            "pre_block_list": [
              "General amendment to the Debits Tax Act, No. 16 of 2002.",
              "Amendment of sections 2, 3 and 4 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "Section  2, section 3, section 4, subsection(1A) of section 9, paragraphs ( b ), ( c ) and ( e ) of subsection (1)  of section 13 and subsection (4) of section 13 of the principal enactment are hereby amended in paragraph ( a ) of each of those sections, by the substitution for the words commercial bank of the words commercial bank or specialized bank.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "Section 19 of the principal enactment is hereby amended as follows :",
            "pre_block_list": [
              "Amendment of section 19 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "in the definition of the expression current account, by the substitution for the words a resident foreign currency account, an account in a foreign currency banking unit and a share investment external rupee account of the words a Resident Foreign Currency Account, an account in a Foreign Currency Banking Unit, a Share lnvestment External Rupee Account and a  Treasury Bond Investment External Rupee Account; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "in the definition of the expression savings account, by the substitution for the words which is maintained at a licensed commercial bank or a licensed specialized bank of the words which is maintained at a licensed commercial bank, a licensed specialized bank or a finance company.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "In the case of  any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency.",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT   P UBLICATIONS  B UREAU , N O . 32, T RANSWORKS  H OUSE ,  L OTUS   R OAD ,  C OLOMBO  01  before  15th  December  each  year  in  respect of the year following."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}