{
  "n_pages": 3,
  "title_page": {
    "title": "Strategic Development Projects (Amendment) Act",
    "num": "12",
    "year": "2011",
    "date_certified": "2011-03-31",
    "date_published": "2011-04-01",
    "price": 2.0,
    "price_postage": 5.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 31St March, 2011]",
      "L.D.O. 21/2011.",
      "A N  A Ct   To   Amend   The  S Trategic  D Evelopment  P Rojects A Ct , N O . 14  Of  2008",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Strategic Development Projects (Amendment) Act, No. 12 of 2011 and shall be deemed to have come into operation on January 1, 2011.",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "Section 2 of the Strategic Development Projects Act, No. 14 of 2008 is hereby amended by the substitution for all the words from to which exemptions to the words be granted : of the following :",
            "pre_block_list": [
              "Amendment of section 2 of the Strategic Development Projects Act, No. 14 of 2008.",
              "to which may be granted from time to time, exemptions either in full or part, from the applicability of the provisions of one or more of the enactments specified in the Schedule to this Act or such other assistance or facilitation as may be necessary to attract strategic investment, in the national interest",
              ""
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "The Schedule to the Strategic Development Projects Act, No. 14 of 2008 is hereby amended, by the addition immediately after item 8 of the Schedule, of the following new items :",
            "pre_block_list": [
              "Amendment of the Schedule to the Act.",
              "9. The Nation Building Tax Act, No. 9 of 2009.",
              "10. The Ports and Airports Development Levy Act, No.  18 of 2011",
              ""
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency.",
              "2PL 005584 - 4,090 (03/2011)",
              "Strategic Development Projects (Amendment) Act, No. 12 of 2011 2",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , D EPARTMENT   OF G OVERNMENT  I NFORMATION , N O . 163, K IRULAPONA  M AWATHA , P OLHENGODA , C OLOMBO  05 before 15th December each year in respect of the year following ."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}