{
  "n_pages": 3,
  "title_page": {
    "title": "Civil  Aviation  (Amendment) Act",
    "num": "24",
    "year": "2023",
    "date_certified": "2023-10-17",
    "date_published": "2023-10-20",
    "price": 6.0,
    "price_postage": 150.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 17Th Of October, 2023]",
      "L.D.- O. 29/2023",
      "A N  A Ct   To   Amend   The  C Ivil  A Viation  A Ct , N O . 14  Of  2010",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:"
    ],
    "pre_section_list": [
      {
        "class_name": "ActL1Section",
        "num": "1",
        "text": "This Act may be cited as the Civil Aviation (Amendment) Act, No. 24 of  2023.",
        "pre_block_list": [
          "Short title"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "2",
        "text": "Section 6 of the Civil Aviation Act, No. 14 of 2010 is hereby amended in subsection (3) thereof, by the repeal of paragraph  (e)  and the substitution therefor, of the following paragraph:-",
        "pre_block_list": [
          "Amendment of section 6 of Act, No. 14 of 2010"
        ],
        "child_level_list": [
          {
            "class_name": "ActL3Paragraph",
            "num": "e",
            "text": "appoint one or more persons to be Service Providers for providing aeronautical services specified in paragraph  (i), (j), (k), (l)  or  (m)  of section 31 at any Aerodrome specified in paragraphs  (a)  and  (b)  of that section:",
            "pre_block_list": [
              "Provided that where a Service Provider appointed under this paragraph does not consent to provide the aeronautical services referred to therein at any Aerodrome specified in paragraph  (a)  or  (b)  of section 31, the Minister may appoint any other Service Provider to provide the aeronautical services referred to in this paragraph",
              ""
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "3",
        "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
        "pre_block_list": [
          "Sinhala text to prevail in case of an inconsistency",
          "Department of Government Printing English Acts of the Parliament can be purchased at the P RAKASHANA  P IYASA , D EPARTMENT   OF G OVERNMENT  P RINTING , N O . 118, D R . D ANISTER  D E  S ILVA  M AWATHA , C OLOMBO  8."
        ],
        "child_level_list": []
      }
    ],
    "part_list": []
  }
}