{
  "n_pages": 4,
  "title_page": {
    "title": "Secretary To The Treasury (Nomination Of Representative) Act",
    "num": "15",
    "year": "2010",
    "date_certified": "2010-12-07",
    "date_published": "2010-12-10",
    "price": 3.0,
    "price_postage": 5.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 07Th December, 2010]",
      "L.D.O. 34/2010.",
      "A N  A Ct   To   Provide   For   The   Secretary   To   The   Treasury   To   Nominate",
      "A   Person   From   Either   The   Ministry   Of   The   Minister   To   Whom   The",
      "Subject   Of   Finance   Is   Assigned   Or   Any   Department   Of   The   General",
      "Treasury   To   Be   His   Representative   In   Instances   Where   Legislation",
      "Has   Provided   For   The   Secretary   To   The   Treasury   To   Be   A   Member",
      "Of   Any   Committee ,  Authority ,  Board   Or   Institution   Established",
      "By   Such   Legislation  ;  And   To   Provide   For   Matters   Connected",
      "Therewith   Or   Incidental   Thereto .",
      "Whereas It Has Been The Practice For The Secretary To The Treasury To Be Appointed By Legislation, To Be A Member Of Any Committee, Authority, Board Or Institution Created Or Established By Such Legislation :",
      "Preamble.",
      "And Whereas The Constraints Mainly With Regard To Time, Placed On The Secretary To The Treasury Due To The Divergent Powers And Functions Which He Is By Virtue Of His Office Required To Exercise And Discharge, Make It Almost An Impossibility For The Secretary To The Treasury To Attend The Meetings Of Every Such Committee, Authority, Board Or Institution In His Capacity Of A Member Thereof :",
      "And Whereas It Is Therefore Necessary To Make Legal Provision For The Secretary To The Treasury To Be Able To Nominate A Person To Be His Representative In Such Committee, Authority, Board Or Institution :",
      "Be It Therefore Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Secretary to the Treasury (Nomination of Representative) Act, No. 15  of 2010.",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "Where any law for the time being in force has made provision for the appointment or nomination of the Secretary to the Treasury as a member of any Committee, Authority, Board or Institution, as the case may be, the Secretary to the Treasury shall be entitled to nominate a suitable person from either the Ministry of the Minister to whom the subject of Finance is assigned or any Department of the General Treasury, to be his representative in such Committee, Authority, Board or Institution :",
            "pre_block_list": [
              "Secretary to the Treasury to be entitled to nominate a representative in his place.",
              "Provided that the Secretary to the Treasury shall be required to attend meetings of the Monetary Board of the Central Bank of Sri Lanka established under the Monetary Law Act (Chapter 422) and the Finance Commission established under Article 154 R  of the Constitution."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "Where at any time prior to the coming into operation of this Act, the Secretary to the Treasury has nominated any person to be his representative in such Committee, Authority, Board or Institution, as the case may be, such nomination shall be valid and effectual and such nomination shall be deemed to have been made in terms of this Act.",
            "pre_block_list": [
              "Validation of nomination."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the  Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of any inconsistency.",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , D EPARTMENT   OF G OVERNMENT  I NFORMATION , N O . 163, K IRULAPONA  M AWATHA , P OLHENGODA , C OLOMBO  05 before 15th December each year in respect of the year following ."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}