{
  "n_pages": 26,
  "title_page": {
    "title": "National Authority On Tobacco And Alcohol Act",
    "num": "27",
    "year": "2006",
    "date_certified": "2006-08-29",
    "date_published": "2006-09-01",
    "price": 19.0,
    "price_postage": 7.5
  },
  "body_pages": {
    "preamble": [
      "[Certified On 29Th August 2006]",
      "L. D.  O. 2/2005",
      "A N  A Ct   To   Provide   For   The   Establishment   Of   The  N Ational A Uthority   On  T Obacco   And  A Lcohol   For   The   Purpose   Of I Dentifying   The   Policy   On   Protecting   Public   Health  ;  For   The",
      "Elimination   Of   Tobacco   And   Alcohol   Related   Harm   Through   The",
      "Assessment   And   Monitoring   Of   The   Production ,  Marketing   And",
      "Consumption   Of   Tobacco   Products   And   Alcohol   Products  ;  To",
      "Make   Provision   Discouraging   Persons   Especially   Children   From",
      "Smoking   Or   Consuming   Alcohol ,  By   Curtailing   Their   Access   To",
      "Tobacco   Products   And   Alcohol   Products  ;  And   For   Matters",
      "Connected   Therewith   Or   Incidental   Thereto .",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the National Authority on Tobacco and Alcohol Act, No. 27 of 2006 and shall come into operation on such date as the Minister may, appoint by Order published in the  Gazette . Different dates may be appointed in respect of different provisions of this Act.",
            "pre_block_list": [
              "Short title and date of operation."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "I",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be established an Authority which shall be called the National Authority on Tobacco and Alcohol (hereinafter in this Act referred to as the Authority).",
                "pre_block_list": [
                  "Establishment of the National Authority on Tobacco and Alcohol."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Authority shall, by the name assigned to it by subsection (1) be a body corporate and shall have perpetual succession and a common seal and may sue and be sued in such name.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Authority shall consist of the following members appointed by the Minister",
                "pre_block_list": [
                  "Members of the Authority."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "an officer, not below the rank of a Senior Assistant Secretary, of the Ministry of the Minister in charge of the subject of Health, nominated by that Minister ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "an officer, not below the rank of a Senior Assistant Secretary, of the Ministry of the Minister in charge of the subject of Justice, nominated by that Minister ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "an officer, not below the rank of a Senior Assistant Secretary, of the Ministry of the Minister in charge of the subject of Education, nominated by that Minister ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "an officer, not below the rank of a Senior Assistant Secretary, of the Ministry of the Minister in charge of the subject of Media, nominated by that Minister ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "an officer, not below the rank of a Senior Assistant Secretary, of the Ministry of the Minister in charge of the subject of Trade, nominated by that Minister ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "an officer, not below the rank of a Senior Assistant Secretary, of the Ministry of the Minister in charge of the subject of Sports and Youth Affairs,   nominated by that Minister ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "g",
                    "text": "The Chairman of the National Dangerous Drugs Control Board ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "h",
                    "text": "a representative of the Commissioner-General of Excise nominated by the Commissioner-General of Excise ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "i",
                    "text": "a representative of the Inspector-General of Police nominated by the Inspector-General of Police ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "j",
                    "text": "five members appointed by the Minister from among persons who have wide experience and knowledge, in the field of medicine, and other fields related to tobacco products and alcohol products.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The members appointed under paragraph ( j ) of subsection (1) are hereinafter referred to as appointed members.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "A person shall be disqualified from being appointed, or continuing, as a member of the Authority",
            "pre_block_list": [
              "Disqualification for being a member."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "if he is or becomes a member of Parliament or any Provincial Council or any local authority ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "if he is not, or ceases to be a citizen of Sri Lanka ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "if he is under any law in force  in Sri Lanka or in any other country, found or declared to be of unsound mind ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "if he is serving, or has served, a sentence of imprisonment imposed by any Court in Sri Lanka or any other country ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "if he holds or enjoys any right or benefit under any contract made by, or on behalf of the Authority ; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "if he has any  financial or other interest as is likely to affect prejudicially the discharge by him of his functions as a member of the Authority.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "An appointed member of the Authority may resign his office by letter addressed to the Minister and such resignation shall be effective from the date on which it is accepted by the Minister.",
                "pre_block_list": [
                  "Removal and resignation of members."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Minister may for reasons assigned remove an appointed member of the Authority from office.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where an appointed member of the Authority dies, resigns or is removed from office, the Minister shall, having regard to the provisions of section 3, appoint another member in his place.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "A member appointed under subsection (3) shall hold office for the unexpired part of the term of office of the member whom he succeeds.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "Subject to the provisions of subsections (1) and (2) of section 5 the term of office of an appointed member of the Authority shall be three years and such member shall be eligible for re-appointment.",
            "pre_block_list": [
              "Term of office of members."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "The members of the Authority shall be paid such remuneration or allowances at such rates as may be determined by the Minister with the concurrence of the Minister in charge of the subject of Finance.",
            "pre_block_list": [
              "Remuneration or allowance of members."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Minister may appoint one of the appointed members of the Authority to be the Chairman of the Authority, and such Chairman shall be the Chief Executive Officer of the Authority.",
                "pre_block_list": [
                  "Chairman of the Authority."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The terms of office of the Chairman shall be three years and he shall be eligible for re-appointment.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "If the Chairman is by reason of illness or absence from Sri Lanka, temporarily unable to perform the duties of his office, the Minister may appoint another member of the Authority to act in his place.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The Chairman shall not engage in any paid employment outside the duties of his office, without the approval of the Minister.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "The Chairman may resign from the office of Chairman by letter addressed to the Minister and such resignation shall be effective from the date on which it is accepted by the Minister.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "The Minister may for reasons assigned remove the Chairman from the office of Chairman.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "Subject to the provisions of subsections (4) and (5), the term of office of the Chairman shall be the period of his membership of the Authority.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Chairman shall, if present, preside at every meeting of the Authority. In the absence of the Chairman from any such meeting, a member elected by the members present, shall preside at such meeting.",
                "pre_block_list": [
                  "Meetings of the Authority."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The quorum for any meeting of the Authority shall be seven members.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Chairman or other member presiding at any meeting of the Authority, shall in addition to his own vote, have a casting vote.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Subject to the preceding provisions of this section, the Authority may regulate the procedure in regard to the meetings of the Authority and the transaction of business at such meetings.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "10",
            "text": "No act, decision or proceeding of the Authority, shall be deemed to be invalid by reason only of the existence of any vacancy of the Authority or any defect in the appointment of any member thereof.",
            "pre_block_list": [
              "Acts not invalidated by reason of a vacancy."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "11",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The seal of the Authority may be determined and devised by the Authority, and may be altered in such manner as may be determined by the Authority.",
                "pre_block_list": [
                  "Seal of the Authority."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The seal of the Authority shall be in the custody of such person as the Authority may decide from time to time.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The seal of the Authority shall not be affixed to any instrument or document except with the sanction of the Authority and in the presence of the Chairman and one member who shall sign the instrument or document in token of their presence.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The Authority shall maintain a register of the instruments and documents to which the seal of the Authority has been affixed.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "12",
            "text": "In the exercise of its powers and the discharge of its functions, the Authority shall comply with such general or special directions as may from time to time be issued to it by the Minister :",
            "pre_block_list": [
              "Authority to exercise its powers under the direction of the Minister.",
              "Provided that compliance by the Authority with any general or special direction so issued shall be subject to the provisions of any other law for the time being inforce."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "13",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Authority may delegate any of the powers and functions of the Authority to the Chairman.",
                "pre_block_list": [
                  "Delegation of powers and functions of the Authority."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Chairman to whom any of the powers and functions of the Authority have been delegated under subsection (1) shall exercise and discharge the powers and functions so delegated, subject to the general or special directions of the Authority.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "14",
            "text": "The functions of the Authority shall be to",
            "pre_block_list": [
              "Functions of the Authority."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "advise the Government on the implementation of the National Policy on Tobacco  and  Alcohol ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "encourage and assist health promotion through the media sponsorships and community based projects ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "recommend measures to minimize the harm arising from the consumption of tobacco products and alcohol products ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "recommend measures in consultation with the National Dangerous Drugs Control Board, for the elimination or minimization of illicit drug use;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "recommend legal, taxation, administrative and other measures necessary for the implementation of the National Policy on Tobacco  and  Alcohol ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "monitor and evaluate the implementation of such policy ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "g",
                "text": "evaluate the impact of policy measures and advise the government on such modifications to the Policy as may be necessary ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "h",
                "text": "encourage and assist research on issues relating to tobacco  and  alcohol ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "monitor economic, health and other issues relating to the production, consumption and marketing of tobacco products  and  alcohol products  ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "j",
                "text": "to conduct, promote and co-ordinate research in relation to the use of tobacco  and  alcohol ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "k",
                "text": "secure participation of all necessary governmental, or non-governmental agencies and private sector organisations in the implementation of the National Policy on Tobacco  and  Alcohol ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "l",
                "text": "encourage active community participation in the implementation and monitoring of the National Policy on Tobacco  and  Alcohol ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "m",
                "text": "receive communications from the public on issues relating to tobacco and alcohol and to recommend necessary action in relation thereto the implementing agencies ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "n",
                "text": "act as the co-ordinating agency for all activities carried out by the government and non- governmental agencies and organisations relating to minimizing the harm arising from the production and  consumption  of  tobacco products  and alcohol products ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "o",
                "text": "monitor the progress of all investigations relating to tobacco and alcohol ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "p",
                "text": "to liase with local, regional and international organisations on issues relating to tobacco and alcohol.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "15",
            "text": "The Authority shall have the power",
            "pre_block_list": [
              "Powers of the Authority."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "to acquire, hold, take or give on lease or hire, mortgage, pledge, sell or otherwise dispose of, any movable or immovable property ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "to borrow, with or without security, moneys, on such terms and conditions as may be approved by the Minister in charge of the subject of Finance for the purpose of discharging its functions ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "to accept gifts, grants or donations, whether in cash or otherwise, and to apply them for discharging its functions ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "to appoint such officers and servants as may be necessary for discharging the functions of the Authority ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "to appoint sub-committees or to co-ordinate with units at provincial level, for the effective discharge of its functions ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "to determine the remuneration payable to the officers and servants so appointed ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "g",
                "text": "to establish a social security scheme, and provide welfare and recreational facilities for its officers and servants ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "h",
                "text": "to enter into and perform all such contracts whether in or outside Sri Lanka as may be necessary for the exercise of the powers and discharge of the functions of the Authority ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "to inquire and investigate into any matter in discharging of the functions of the Authority ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "j",
                "text": "to recommend adherence to such International Treaties and Conventions dealing with Tobacco and Alcohol as the Government may ratify and accede to ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "k",
                "text": "generally, to do all such other things as are necessary to facilitate the proper discharge of the functions of the Authority.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "16",
            "text": "For the purposes of this Act",
            "pre_block_list": [
              "Authorized Officers."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "any Food and Drugs Inspector or Public Health Inspector as appointed by the Minister ; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "any Polic Officer, or an Excise Officer,",
                "pre_block_list": [
                  "shall be an Authorized Officer of the Authority for the purposes of this Act."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "17",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where any Authorized Officer has reasonable grounds to believe that there has been a violation of any provision of this Act or of any regulation made thereunder, he may",
                "pre_block_list": [
                  "Powers of Authorized Officer."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "at any reasonable time enter any place where he believes any tobacco product or alcohol product  is manufactured, prepared, preserved, packaged, exposed for sale or stored and examine any such tobacco product or alcohol product  and take samples thereof and also examine anything that he believes is used for the manufacture, preparation, preservation, packaging or storing of that tobacco product or alcohol product  ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "for the purpose of carrying out effective search operation, stop or detain any vehicle in which he believes that any tobacco product or alcohol product is being conveyed, search that vehicle and examine any tobacco product or alcohol product which is being so conveyed and take samples thereof ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "open and examine any receptacle or package that he believes  contains any tobacco product or alcohol product  ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "seize and detain for such time as may be necessary any tobacco product or alcohol product  by means of, or in relation to which he believes any provision of this Act or regulation made thereunder has been contravened,",
                    "pre_block_list": [
                      "in furtherance of the powers, duties or functions conferred on or assigned to him under the Act."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "An Authorized Officer acting under this section may, if so required, produce his authority.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The owner or person in charge of a place which by an Authorized Officer enters in pursuance of subsection (1) and every person found therein shall give the Authorized Officer all reasonable assistance in his power and furnish him with such information and such samples as he may require.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Information obtained by an Authorized Officer under subsection (3) shall not be disclosed except to a Government Department or to a Court unless other is required for the purposes of administration or enforcement of this Act.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "No person shall obstruct any Authorized Officer acting in the exercise of his powers under this Act or any regulations made thereunder.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "No person shall knowingly make any false or misleading statements either orally or in writing to any Authorized Officer, engaged in the exercise of his powers under this Act or any regulations made thereunder.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "Every vendor of a tobacco product or alcohol product shall if so required by an Authorized Officer, disclose to the Authorized Officer the name, address and other particulars as may be required of the person from whom that vendor purchased that tobacco product or alcohol product.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "8",
                "text": "Any tobacco product or alcohol product seized under this Act may, at the option of an Authorized Officer, be kept or stored in the building or place where it was seized or may at his discretion be removed to any other place.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "9",
                "text": "It shall be the duty of every Authorized Officer to forthwith inform the Authority of any seizure made under this Act.",
                "pre_block_list": [
                  "Produce in respect of articles seized."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "18",
            "text": "Where a tobacco product or alcohol product in respect of which an offence has been committed is seized under this Act by an Authorized Officer, such tobacco product or alcohol product may, where the Authority is satisfied that there has been a contravention of any of the provisions of this Act or any regulation made thereunder and upon obtaining an Order of a Magisrate   be destroyed or otherwise disposed of as the Magistrate may direct.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "19",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "An Authorized officer shall submit any tobacco product or alcohol product seized by him or any portion thereof or any sample taken by him, unless destroyed as provided for in section 18, to the Government Analyst for analysis or examination.",
                "pre_block_list": [
                  "Analysis."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "After the Government Analyst has made the analysis or examination of any tobacco product or alcohol product submitted to him under subsection (1), he shall issue a certificate or report thareon to the Authority or to the Court, setting out the results of his analysis or examination as the case may be.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "20",
            "text": "The Minister may on the advice of the Authority issue general or special directions not inconsistent with the provisions of any written law for the time being in force to any Government Department or statutory institution, requiring any such Department or Institution to carry out such acts as are specified in such direction relating to the use of tobacco products and alcohol product.",
            "pre_block_list": [
              "Minister may issue directions."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "21",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Authority may appoint such officers and servants as it considers necessary for the efficient discharge of its functions.",
                "pre_block_list": [
                  "Staff of the Authority."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The officers and servants appointed under subsection (1) shall be remunerated in such manner and at such rates and shall be subject to such conditions of service as may be determined by the Authority with the approval of the Minister.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "At the request of the Authority an officer in the public service may, with the consent of the officer and the Secretary to the Ministry of the Minister in charge of the subject of Public Administration, be temporarily appointed to the staff of the Authority or with like consent, be permanently appointed to such staff.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where any officer in the public service is temporarily appointed to the staff of the Authority, the provisions of subsection (2) of section 14 of the National Transport Commission Act, No. 37 of 1991, shall  mutatis mutandis, apply to and in relation to him.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Where any officer in the public service is permanently appointed to the staff of the Authority, the provisions of subsection (3) of section 14 of the National Transport Commission Act, No. 37 of 1991, shall,  mutatis mutandis, apply to and in relation to him.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "Where the Authority employs any person who has agreed to serve the Government for a specified period, any period of service to the Authority by that person shall be regarded as service to the Government for the purpose of discharging the obligations of such agreement.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "22",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Authority shall have its own fund (hereinafter referred to as the Fund).",
                "pre_block_list": [
                  "Fund of the Authority."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "There shall be paid into the Fund",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "all such sums as may be made available to the Authority out of the Consolidated Fund ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "all such sums of money received by the Authority by way of gifts, grants or donations whether from whithin Sri Lanka or abroad.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "There shall be paid out of the Fund all such sums as are required to defray any expenditure incurred by the Authority in the exercise, and discharge of its powers and functions under this Act or under any other written law and all such sums as are required to be paid out of the Fund.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "23",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The financial year of the Authority shall be the calendar year.",
                "pre_block_list": [
                  "Financial year and audit of accounts."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The provisions of Article 154 of the Constitution relating to the audit of the accounts of public corporations shall apply to the audit of the accounts of the Authority.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "24",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "For the purpose of enabling the Authority to exercise, and discharge any of the powers, and functions under section 14 and section 15 of this Act, the Authority, or any person authorized in that behalf by the Authority may by notice in writing require any manufacturer or trader  to furnish to the Authority or to the person authorized, within such period as shall be specified in the notice, all such returns or information relating to any tobacco product  or  alcohol product,  as are known to be, or are, in the possession of such person.",
                "pre_block_list": [
                  "Returns and information."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "It shall be the duty of the manufacturer or trader who is required to furnish any return or information by a notice under subsection (1) to comply with such requirement within the time specified in such notice, except where such person is precluded from divulging such information under the provisions of any law.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Authority or any member thereof or any officer or servant of the Authority, shall not disclose to any person any information in the possession of the Authority or use any returns or information furnished under subsection (1), unless required to do so by a court of law or for the purposes of discharging the functions of the Authority as the case may be.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "25",
            "text": "The Authority shall be deemed to be a scheduled institution within the meaning of the Commission to Investigate Allegations of Bribery or Corruption Act, No. 19 of 1994 and the provisions of that Act, shall be construed accordingly.",
            "pre_block_list": [
              "Authority to be a scheduled institution within the meaning of the Commission to Investigate Allegations of Bribery or Corruption Act, No. 19 of 1994."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "26",
            "text": "All members, officers and servants of the Authority shall be deemed to be public servants within the meaning and for the purposes of the Penal Code (Chapter 19).",
            "pre_block_list": [
              "Officers and servants of the Authority deemed to be public servants."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "27",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where any immovable property is required to be acquired for any specific purpose of the Authority and the Minister by Order published in the  Gazette  approves of the proposed acquisition for that purpose, that property shall be deemed to be required for a public purpose and may accordingly be acquired under the Land Acquisition Act (Chapter 420).",
                "pre_block_list": [
                  "Acquisition of immovable property under the Land Acquisition Act."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any sum payable, for the acquisition of any immovable property under the Land Acquisition Act for the Authority shall be paid out of the Fund of the Authority.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "28",
            "text": "Any expenses incurred by any such person in any action or prosecution instituted against him in respect of any act which is done by him under this Act or on the direction of the Authority shall be paid by the Authority, if the Court holds that such act was done in good faith.",
            "pre_block_list": [
              "Expenses incurred by any person to be paid by the Authority.",
              "Furnishing of information  to the Minister."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "29",
            "text": "The Minister may, from time to time, direct the Authority to furnish to the Minister in such form as he may require returns, accounts and other information with respect to the work of the Authority and the Authority shall carry out every such direction.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "30",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Minister may make regulations in respect of any matter required by this Act to be prescribed or in   respect of which regulations are authorized or required by this Act to be made.",
                "pre_block_list": [
                  "Regulations."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Without prejudice to the generality of the powers conferred by subsection (1), the Minister may make regulations",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "identifying the tobacco products that are harmful or injurious to human health ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "specifying the types or categories of tobacco products which do not generate smoke.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every regulation made by the Minister shall be published in the  Gazette  and shall come into operation on the date of such publication or on such later date as may be specified in such regulation.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Every regulation made by the Minister shall after thirty days of its publication in the Gazette, be brought before Parliament for approval. Any regulation which is not so approved shall be deemed to be rescinded as from the date of such disapproval but without prejudice to anything previously done thereunder.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "II",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "31",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "A person shall not sell, offer for sale, or permit or promote the sale of any  tobacco product or alcohol product to any person under twenty-one years of age.",
                "pre_block_list": [
                  "Prohibition of the sale of any tobacco product or alcohol product to persons under twenty one years of age."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any person who contravenes the provisions of subsection (1) shall be guilty of an offence under this Act and shall on conviction after summary trial before a Magistrate be liable to a fine not exceeding four thousand rupees or to imprisonment for a period not exceeding one year or to both such fine and imprisonment.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "It shall be a defence to any person found guilty of an offence under this section to prove that he took all reasonable steps to ascertain that the person to whom he sold the tobacco product or alcohol product was above twenty-one years of age.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "32",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "A person shall not install, or permit the installation and operation of, any automatic vending machine that dispenses, or is capable of dispensing, any tobacco product or alcohol product in any place to which the public have access.",
                "pre_block_list": [
                  "Prohibition on installation of vending machines for dispensing tobacco product or alcohol product."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "In this section, automatic vending machine that dispenses or is capable of dispensing any tobacco product or alcohol product means any self service machine that",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "on the insertion of a coin or token or any other means dispenses by way of sale, any tobacco product or alcohol product whether automatically or with the assistance of the purchaser ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "does not require replenishment between each such sale.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Any person who contravenes the provisions of sub- section (1) shall be guilty of an offence under this Act and shall on conviction after summary trial before a Magistrate be liable to a fine not exceeding two thousand rupees or to imprisonment for a period not exceeding one year or to both such fine and imprisonment.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "33",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "A person shall not manufacture, import, sell or offer for sale, any tobacco product as may be prescribed by regulations.",
                "pre_block_list": [
                  "Prohibition of the manufacture or sale of tobacco products which are prescribed."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any person who contravenes the provisions of subsection (1) shall be guilty of an offence under this Act and shall on conviction after summary trial before a Magistrate be liable to a fine not exceeding two thousand rupees or to imprisonment for a period not exceeding one year or to both such fine and imprisonment.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "34",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "A manufacturer of a tobacco product shall cause to be displayed, conspicuously and in easily legible print, on every packet containing tobacco products manufactured by such manufacturer, a label of such dimensions as may be prescribed containing a statement of the tar and nicotine content in each tobacco product in such packet and such health warnings as may be prescribed. Different dimensions may be prescribed in respect of packets of different sizes.",
                "pre_block_list": [
                  "Prohibition on the sale of tobacco products without health warning and the tar, nicotine content in each tobacco product."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "A person shall not sell or offer for sale, a packet containing tobacco products unless there is displayed on such packet, a label of the prescribed dimensions containing a statement of the tar and nicotine content in each tobacco product in such packet and the prescribed health warning.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Any person who contravenes the provisions of subsection (1) or subsection (2) shall be guilty of an offence under this Act, and shall on conviction after summary trial before a Magistrate be liable to a fine not exceeding two thousand  rupees  or  to  imprisonment  for a period not exceeding one year or to both such fine and imprisonment.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "35",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "A person shall not publish or cause to be published, or authorize the publication of, a tobacco advertisement or an alcohol advertisement.",
                "pre_block_list": [
                  "Prohibition of tobacco or alcohol advertisements."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "It shall not be a contravention of subsection (1)",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "to display a trade mark or a brand name of a tobacco product or alcohol on such tobacco product or alcohol product or on any package containing such tobacco product or alcohol product ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "for any manufacturer or importer of a tobacco product or alcohol product to send a notice to a distributor of such product, describing the tobacco products or alcohol product manufactured or imported, as the case may be, by such manufacturer or importer, as the case may be,  and indicating their respective prices ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "to display, inside a place where tobacco products or alcohol product are available for sale to the public, a notice of the prescribed dimensions, identifying the tobacco products or alcohol product that are available for sale in that place and indicating their respective prices ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "to insert in a book, magazine or newspaper, available in Sri Lanka but printed outside Sri Lanka, a tobacco advertisement or alcohol advertisement, unless such book, magazine or newspaper is intended for sale or distribution only or mainly in Sri Lanka ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "to transmit or broadcast, to Sri Lanka from outside Sri Lanka a tobacco advertisement or alcohol advertisement or any television programme or radio programme containing a tobacco advertisement or alcohol advertisement, unless such transmission or broadcast, as the case may be, is intended to be seen or heard, as the case may be, only or mainly by viewers or listeners, as the case may be, in Sri Lanka ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "to publish, transmit or broadcast any scientific, educational, social, medical technical or other material or information beneficial to the public pertaining to tobacco products or alcohol products.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "A person who contravenes the provisions of subsection (1) shall be guilty of an offence under this Act and shall on conviction after summary trial before a Magistrate be liable to a fine not exceeding two million rupees.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "In this section",
                "pre_block_list": [
                  "alcohol advertisement means any distinctive writing, still or moving picture, sign, symbol or colours or other visual image or any audible message or any combination of the aforesaid that promotes or is intended to promote"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the drinking of liquor ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the purchase or use of an alcohol product ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "a trade mark registered in respect of any alcohol product or articles that include alcohol products ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "a brand name associated with an alcohol products ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "the name of the manufacturer of an alcohol products.",
                    "pre_block_list": [
                      "publish in relation to a tobacco advertisement or alcohol advertisement includes the following:",
                      "( a ) the displaying, screening or playing, of the advertisement or anything containing the advertisement so that it can be seen or heard in or from any place or vehicle to which the public have access ;",
                      "( b ) the insertion of the advertisement in a newspaper, magazine, programme, leaflet, handbill, or other document that is available, or distributed, to the public or a section of the public ;",
                      "( c ) the inclusion of the advertisement in a film, video, radio programme or television programme or through the internet that is seen or heard, or intended to be seen or heard by the public or a section of the public ;",
                      "( d ) the sale, hire or supply or the offer for sale, hire or supply, of the advertisement or anything containing the advertisement to the public or a section of the public.",
                      "tobacco advertisement means any writing, still or moving picture, sign, symbol or distinctive colours or other visual image or any audible message or any combination of the aforesaid that promotes or is intended to promote",
                      "( a ) smoking ;",
                      "( b ) the purchase or use of a tobacco product;",
                      "( c ) a  trade mark registered in respect of a tobacco product or articles that include tobacco products ;",
                      "( d ) a brand name associated with a tobacco product ;",
                      "( e )  the name of the manufacturer of a tobacco product."
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "36",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "A person shall not  use a brand name or trade mark of, or any symbol associated with, a tobacco product or alcohol product  or the name of a manufacturer of a tobacco product or alcohol product in association, whether directly or indirectly, with such tobacco product or alcohol product",
                "pre_block_list": [
                  "Prohibition of sponsorships &c."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "in connection with the promotion of any educational, cultural, social or sporting organization, activity or event ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "in such a manner as indicates, or acknowledges,    that any financial or other assistance has been given by, or on behalf of, the manufacturer, importer or distributor of such tobacco product or alcohol product towards such organization, activity or  event.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any person who contravenes the provisions of subsection (1) shall be guilty of an offence under this Act and shall on conviction after summary trial before a Magistrate be liable to a fine not exceeding fifty thousand rupees or to imprisonment for a period not exceeding two years or to both such fine and imprisonment.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "37",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "A manufacturer, importer or distributor of any tobacco product or alcohol product shall not",
                "pre_block_list": [
                  "Free distribution &c. of tobacco products or alcohol product prohibited."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "distribute any tobacco product or  alcohol product ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "supply any tobacco product or alcohol product to any other person for subsequent  distribution,",
                    "pre_block_list": [
                      "free of charge."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "A person shall not offer any prize, gift, cash rebate, discount or the right to participate in any contest, lottery or game to the purchaser of a  tobacco product or alcohol product in consideration  of the purchase of that product or to any person in consideration of the furnishing of evidence of such  purchase.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "It shall not be a contravention of subsection (2) for a manufacturer, importer, or distributor of a tobacco product or alcohol product to offer trade discount at the rates prevalent in the relevant trade.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "A manufacturer, importer or distributor of a tobacco product or alcohol product who contravenes the provisions of subsection (1) or any person who contravenes the provisions of subsection  (2) shall be guilty of an offence under this Act and shall  on conviction after summary trial before a Magistrate be  liable to a fine not exceeding fifty thousand rupees or to imprisonment for a period not exceeding two years or to both such fine and imprisonment.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "38",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "A person shall not distribute, sell or offer for sale, any article which is not a tobacco product or an alcohol product, bearing the trade mark, characteristic symbols, distinctive  logo, or brand name of a tobacco product or any alcohol product.",
                "pre_block_list": [
                  "Offences relating to trade marks of tobacco products and alcohol products."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "A person shall not manufacture or import for sale, or distribute free of charge, any article which is not a tobacco product having the appearance of a tobacco product.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Any manufacturer or importer who contravenes the provisions of subsection (1) or any person who contravenes the provisions of subsection (2) or subsection (3) shall be guilty of an offence under this Act and  shall be liable on conviction after summary trial before a Magistrate to a fine not exceeding fifty thousand rupees or to imprisonment for a period not exceeding two years or to both such fine and imprisonment.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "39",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "No person shall smoke or allow any person to smoke any tobacco product within any enclosed public place.",
                "pre_block_list": [
                  "Smoking in an area to which the public have access to be an offence."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any person who being the owner, occupier, proprietor, manager, trustee or person in charge of any enclosed public place shall ensure that no person smokes any tobacco product within any such enclosed public place :",
                "pre_block_list": [
                  "Provided however,"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "any hotel, guest house or lodge having thirty rooms or more ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "any restaurant or club having the seating capacity of a minimum of thirty persons ; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "an airport,",
                    "pre_block_list": [
                      "may, notwithstanding the provisions of subsection (1), have within its premises an enclosed space or enclosed area as the case may be, set aside exclusively for smoking. Such area shall be provided with adequate ventilation and shall conform to the prescribed air quality standards."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Minister may, in consultation with the Director- General of Health Services, from time to time, issue general or special directions not inconsistent with any written law, as may be required for the enforcement and monitoring of the provisions of this section.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Any person who contravenes the provisions of subsections (1) and (2) shall be guilty of an offence under this Act, and shall on conviction after summary trial before a Magistrate be liable to a fine not exceeding two thousand rupees or to imprisonment for a period not exceeding one year or to both such fine and imprisonment.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "For the purposes of this section,",
                "pre_block_list": [
                  "public place means any place to which the public have access, whether as of right or otherwise,",
                  "enclosed public place includes any government department, statutory authority or board or public institution, office premises, bank, court house, auditorium, sports complex, hospital, clinic, dispensary, laboratory, school, university or other educational institution, library, museums, places of worship, hotel, guest house, lodge, hostel, restaurant, club, internet cafe, cinema, theatre, supermarket, airport, a waiting room in a railway station or bus terminal, any public conveyance, building, any built a in area and lift."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "40",
            "text": "Every manufacturer and every importer of a tobacco product shall, at such intervals and in accordance with such requirements, as may be prescribed, in consultation with the necessary Government  Analyst conduct  tests for the purpose of identifying  the constituents of each brand of tobacco product manufactured or imported, as for the case may be, by such manufacturer or  importer and for the respective quantities of those constituents, and shall cause the results of such tests to be sent to the Authority.",
            "pre_block_list": [
              "Tests for constituents of tobacco products."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "41",
            "text": "Where any person appears, or is produced, before a Court accused or suspected of committing an offence under subsection (1) of section 151, or subsection (1 A ) of section 151, or subsection (2) of section 151 of the Motor Traffic Act, the  court may, notwithstanding anything to the contrary in such law, suspend the driving licence issued to such person under the aforesaid  Act until the conclusion  of the trial of such offence; and if after trial such person is convicted of such offence may suspend  such driving licence for such further period as may be  determined by the Court having regard to all the circumstances of the case.",
            "pre_block_list": [
              "Provision relating to the Motor Traffic Act."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "42",
            "text": "Where in any prosecution instituted under this Act, any question arises as to whether any article is a tobacco product or is an alcohol product or as to the constituents of a tobacco product or an alcohol product, a Certificate purporting to be under the hand of the Government Analyst, to the effect that the article referred to in the Certificate is a tobacco product or any alcohol product or as to the constituents of the tobacco product or any alcohol product referred to in the Certificate,  shall be admissible in evidence without proof of signature and shall be  prima facie  evidence of the facts stated  therein.",
            "pre_block_list": [
              "Evidence."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "43",
            "text": "Every person who",
            "pre_block_list": [
              "Miscellaneous offences.",
              "( a ) fails to furnish any return or information in compliance with any requirement imposed on him under this Act;",
              "( b ) knowingly makes any false statement in any return or information furnished by him;",
              "( c ) being a member, officer or servant of the Authority discloses any information  obtained by him in or in connection with  the exercise of his powers or the discharge of his functions under this  Act, to any person for any purpose other than a purpose for which he is  authorized to disclose such information by this Act; or",
              "( d ) contravenes the provisions of this Act or any regulation made thereunder, or fails to comply with any direction given to him by the Authority,",
              "shall be guilty of an offence  under this Act."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every person who commits an offence under this Act for which no punishment is expressly provided for shall on conviction  after trial before a Magistrate, be liable to a fine not exceeding two thousand rupees or to imprisonment for a period not exceeding six months or to both such  fine and imprisonment.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where an offence under this Act is committed by a body of persons, then",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "if that body of persons is a body corporate, every director or officer of that body corporate; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "if that body of persons is a firm, every partner of that firm,",
                    "pre_block_list": [
                      "shall be deemed to be guilty of that offence :",
                      "Provided however, that a director or an officer of such body corporate or partner of such firm shall not be deemed to be guilty of such offence if he proves that such offence was committed without his knowledge or that he used all due diligence to prevent the commission of such offence."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "An officer or servant authorized in writing by the Authority shall be deemed to be a public officer within the meaning of section 136 of the Code of Criminal Procedure Act, No. 15 of 1979, for the purpose of instituting proceedings in respect of  offences under this Act.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "44",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "45",
            "text": "In this Act unless the context otherwise requires",
            "pre_block_list": [
              "Interpretation.",
              " alcohol product  means a beverage containing a volume of one  per centum  (1%)  or more of alcohol;",
              "Chairman means the Chairman of the Authority appointed under section 8  ;",
              " local authority means any Municipal Council, Urban Council or Pradeshiya Sabha and includes any authority created or established by or under any law to exercise perform and discharge, powers, duties and functions corresponding to or similar to the powers duties and functions exercised, performed and discharged by any such Council or Sabha ;",
              " National Dangerous Drugs Control Board  means the National Dangerous Drugs Control Board established by the National Dangerous Drugs Control Board Act, No. 11 of 1984;",
              " Provincial Council means a Provincial Council established under Chapter XVIIA of the Constitution ;",
              " tar  means the raw anhydrous nicotine free condensate of smoke ;",
              " tobacco product means any product manufactured wholly or partly from tobacco and which is intended to be smoked,  sniffed, sucked or chewed.",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT   P UBLICATIONS  B UREAU , N O . 32, T RANSWORKS  H OUSE ,  L OTUS   R OAD ,  C OLOMBO  01  before  15th  December  each  year  in  respect of the year following."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}