{
  "n_pages": 11,
  "title_page": {
    "title": "Articles  And  Services  (Regulation  And Maintenance)  (Temporary  Provisions) Act",
    "num": "14",
    "year": "2003",
    "date_certified": "2003-03-23",
    "date_published": "2003-03-28",
    "price": 9.5,
    "price_postage": 6.75
  },
  "body_pages": {
    "preamble": [
      "Articles And Services (Regulation And Maintenance) (Temporary Provisions) Act, No. 14 Of 2003 1",
      "[Certified On 23Rd March, 2003]",
      "L.D.O. 20/2003.",
      "A N  A Ct   To   Provide   A   Strategy   To   Deal   With   Shortages   Which",
      "Are   Likely   To   Arise   Due   To   The   Outbreak   Of   Hostilities",
      "Outside   The   Territory   Of  S Ri  L Anka  ;  To   Ensure   The",
      "Availability   Of   Supplies   Of   Articles   Essential   To   The   Life",
      "Of   The   Community  ;  To   Provide   For   The   Equal   Distribution",
      "Of   Such   Articles   At   Fair   Prices  ;  To   Ensure   The   Maintenance",
      "Of   Utility   Services   Essential   To   Public   Life   And   To   Regulate",
      "The   Prices   Of   Such   Services  ;  And   To   Provide   For   Matters",
      "Connected   Therewith   Or   Incidental   Thereto .",
      "Whereas There Exists The Probability Of An Outbreak Of Armed Hostilities Between Certain Nations In The Near Future :",
      "Preamble.",
      "And Whereas, The Outbreak Of Armed Hostilities Is Likely To Result In A Shortage In The Supplies Of Any Article Essential To The Life Of The Community In Sri Lanka, Or Is Likely To Disrupt The Distribution Of Supplies Of Such Articles And To Thereby Result In A Shortage Of Such Article, Or To Interrupt The Maintenance Of Utility Services Essential To Public Life :",
      "And Whereas It Appears To Be Necessary For The Government To Vest Itself With Such Powers As Are Necessary To Ensure The Availability Of A Regular Supply Of Articles Essential To The Life Of The Community And Also To Ensure The Equitable Distribution Of Such Articles At A Fair Price To The Consumers And The Uninterrupted Maintenance Of Utility Services Essential To Public Life And To Regulate The Prices Of Such Services :",
      "Now Therefore Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "This Act may be cited as the Articles and Services (Regulation and Maintenance) (Temporary Provisions) Act, No. 14  of 2003. The provisions of the Act shall be brought into operation by the Minister, by Order published in the",
                "pre_block_list": [
                  "Short title and date of operation.",
                  "2H 180185,600 (03/2003)",
                  "Articles and Services (Regulation and Maintenance) (Temporary Provisions) Act, No. 14 of 2003 2",
                  "Gazette, in consultation with the Cabinet of Ministers, from time to time, for such periods of time which shall not exceed one month at a time, so however that the total period of operation of the Act, shall not in the aggregate exceed three months."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "In making an Order under subsection (1), the Minister shall take into consideration -",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the likelihood of the continuation of armed hostilities outside Sri Lanka ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the likelihood of there being a disruption in the distribution of supplies of any article essential to the life of the community resulting in a shortage of such article ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "the likelihood of there being any interruption in the maintenance of any utility service essential to public life ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "the need to ensure the availability of a regular supply of such articles and the uninterrupted maintenance of such utility services.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Any Order made under subsection (1) shall be placed before Parliament for approval immediately on the making thereof. However if Parliament is not sitting during such time, the Order shall be so placed for approval at the next date of sitting of Parliament.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where prior to the expiry of the period of three months set out above, Parliament is of opinion that it is necessary to extend the operation of the Act for a further period, it may by Resolution, extend the period of operation of the Act for periods not exceeding one month at a time.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Minister shall appoint, by name or by office, a person to be the Competent Authority for the purposes of this Act.",
                "pre_block_list": [
                  "Appointment of a Competent Authority and his functions &c.",
                  "Articles and Services (Regulation and Maintenance) (Temporary Provisions) Act, No. 14 of 2003 3"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Competent Authority may appoint such other officers and servants as may be necessary to assist him in the implementation of the provisions of this Act.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Competent Authority shall exercise and discharge the following powers and functions :",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "enter and inspect any premises in which any article, in respect of which an Order under section 5 has been made, is stored ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "securing the enforcement of all Orders made in terms of section 5 ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "administer and implement a regulatory system as provided for in terms of an Order made under section 5 ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "setting out the procedures relating to collection and distribution to be followed in respect of any article which is purchased.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The Competent Authority shall, prior to exercising the powers conferred on him by paragraph ( a ) of subsection (3), obtain a warrant for such purpose from the Magistrate within whose jurisdiction the said premises are situated.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "The Minister shall in consultation with the Minister in charge of the subject of Finance, determine by Order the remuneration payable to the Competent Authority and the officers and servants appointed under subsection (2). Such remuneration shall be charged to the Consolidated Fund.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "The Competent Authority and the officers and servants appointed in terms of this section shall be deemed to be public officers for the purposes and within the meaning, of the Penal Code.",
                "pre_block_list": [
                  "Articles and Services (Regulation and Maintenance) (Temporary Provisions) Act, No. 14 of 2003 4"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "The Minister may from time to time issue to the Competent Authority such general or special directions as may appear to him to be necessary for the discharge by the Competent Authority, of the functions conferred on him by the Act. It shall be the duty of the Competent Authority to comply with such directions.",
            "pre_block_list": [
              "Minister may issue directions."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be an Advisory Committee (hereinafter referred to as the Committee) appointed by the Minister, whose function it shall be to advise the Minister on the exercise of his powers in terms of the Act.",
                "pre_block_list": [
                  "Advisory Committee."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Committee shall consist of,",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the Secretary to the Ministry of the Minister in charge of the subject of Finance, who shall be the Chairman ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the Secretary to the Ministry of the Minister in charge of the subject of Commerce ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "the Secretary to the Ministry of the Minister in charge of the subject of Co-operatives ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "the Competent Authority ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "a representative of the Ministry of the Minister in charge of the subject of Policy Development ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "a representative of the Trade Chambers  nominated by the Chamber.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Committee shall discharge the following functions :",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "to advise the Minister on the likelihood of there being a shortage in the supplies of any article essential to the life of the community in Sri Lanka, or on the likelihood of any disruption in the distribution of supplies of such articles, or on the likelihood of any interruption in the maintenance of utility services essential to public life, as a result of the outbreak of armed hostilities outside Sri Lanka ;",
                    "pre_block_list": [
                      "Articles and Services (Regulation and Maintenance) (Temporary Provisions) Act, No. 14 of 2003 5"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "to advise the Minister, in relation to the sale of articles, on",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "the maximum, wholesale and retail price, above which an article should not be sold ;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "the price structure according to which such wholesale or retail prices shall be fixed ;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "the system of rationing to be adopted ;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iv",
                        "text": "the system of purchasing to be adopted;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "v",
                        "text": "the steps that need to be taken to ensure that the normal market forces and distribution systems come into operation as soon as possible ;",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "to advise the Minister, in relation to the provision of utility services, on",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "the maximum price to be fixed for the supply of any public utility services ;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "the formula to be used in setting the price structure according to which the maximum price shall be fixed.",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where it appears to the Minister that there is or there is likely to be in Sri Lanka, a shortage of any article or of any service, as a result of an outbreak of armed hostilities between certain nations outside Sri Lanka, the Minister on the advise of the Committee, may  in order to ensure that there is no disruption in the distribution or availability of any article or in the provision of any public utility service, with the approval of the Cabinet of Ministers, by an Order published in the Gazette, called the Exigent Service Order  (hereinafter referred to as  the Order)",
                "pre_block_list": [
                  "Exigent Services Orders."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "fix the maximum wholesale and retail prices above which an article in respect of which an Order is made, should not be sold; or",
                    "pre_block_list": [
                      "Articles and Services (Regulation and Maintenance) (Temporary Provisions) Act, No. 14 of 2003 6"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "specify a price structure according to which the maximum price of an article in respect of which an Order is made, is to be fixed; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "specify the conditions subject to which an article in respect of which an Order is made, may be sold, the time and place of sale of such article and the quantity of such article  which may be sold; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "provide for the allocation of supplies of any article in respect of which an Order is made, to the distributors or traders thereof; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "provide for the organization and administration of system of rationing subject to which an article in respect of which an Order is made, is made available to the public ; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "provide for the transport and conveyance of an article in respect of which an Order is made ; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "g",
                    "text": "specify the conditions (with specific reference to the different services) under which a service in respect of which an Order is made, is to be provided.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every Order made under subsection (1) may be amended, altered or varied by the Minister with the approval of the Cabinet of Ministers.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every Order made under subsection (1) shall come into operation on the date of its publication in the Gazette or on such later date as may be specified therein.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Every Order made under subsection (1) shall be placed before Parliament along with a motion that such Order be approved, within two weeks from the date of its publication in the Gazette. If Parliament is not sitting during such period, it shall be so placed on the next date of sitting of Parliament.",
                "pre_block_list": [
                  "Articles and Services (Regulation and Maintenance) (Temporary Provisions) Act, No. 14 of 2003 7"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Any Order not approved by Parliament shall be deemed to be rescinded with effect from the date of such disapproval, but without prejudice to anything previously done thereunder.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "Notification of the date on which any such Order is so rescinded shall be published in the Gazette.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Competent Authority may, if it appears to him to be expedient or necessary so to do, in order to ensure the equitable distribution of any article in respect of which an Order under section 5 has been made, make order for the purchase of any quantity of such article as is available or is necessary for such purpose. The Minister may issue such directions as are necessary for the purchase of any such article and for payment to be made in respect of such purchase in terms of the wholesale price fixed for the same under section 5.",
                "pre_block_list": [
                  "Purchasing of articles."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every order made under subsection (1) shall  specify",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the name and address of the person in whose possession the stocks of such article are and the exact quantity to be purchased ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the time at which and the place at which the stocks of the article purchased shall be delivered by the person required to do so in terms of the order.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "In the event of any person refusing to sell to the Competent Authority any article in respect of which the Competent Authority has made an order of purchase in terms of subsection (1), the Competent Authority may, obtain an Order from the Magistrate within whose jurisdiction the article is stored, compelling such person to sell the required quantity of such article to the Competent Authority.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Any person who",
                "pre_block_list": [
                  "Offences."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "resists or obstructs the Competent Authority or his officers or servants, in the exercise of his powers or the discharge of his functions in terms of this Act; or",
                    "pre_block_list": [
                      "Articles and Services (Regulation and Maintenance) (Temporary Provisions) Act, No. 14 of 2003 8"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "sells any article which is the subject of an Order under section 5 at a price which is above the price fixed for the sale of such article in terms of paragraph ( a ) of scction 5 ; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "knowingly furnishes a statement which is false in any particulars stated therein,",
                    "pre_block_list": [
                      "shall be guilty of an offence and shall on conviction after summary trial before a Magistrate, be liable to imprisonment of either description for a term not exceeding five years or to a fine not exceeding rupees five hundred thousand, or to both such fine and imprisonment."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Court may in convicting a person of an offence under this Act, order that the articles in respect of which the offence is committed be forfeited to the State.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Any article forfeited to the State under subsection (1) shall",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "if no appeal is preferred against the order of forfeiture, vest absolutely in the Competent Authority free of any mortgage, pledge, lien or other encumbrance, charge or claim whatsoever upon the expiration of the period within which such appeal may be preferred  ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "if an appeal has been preferred against the order of forfeiture, vest absolutely in the Competent Authority upon the final determination of such appeal :",
                    "pre_block_list": [
                      "Provided that no person shall be deemed to be guilty of an offence if he proves that such offence was committed without his knowledge and that he exercised due diligence to prevent the commission of such offence."
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "When an offence under this Act is committed by a body of persons  Offences by body of persons.",
            "pre_block_list": [
              "Articles and Services (Regulation and Maintenance) (Temporary Provisions) Act, No. 14 of 2003 9"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "where the body of persons is a body corporate, every person who at the time of the commission of the offence was a director, manager, secretary or other similar officer of that body corporate;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "where the body of persons is a firm, every partner of that firm,",
                "pre_block_list": [
                  "shall be deemed to be guilty of that offence unless he proves that the offence was committed without his consent or connivance and that he exercised all such diligence to prevent the commission of that offence as he ought to have exercised having regard to the nature of his functions and in all the circumstances."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Minister may make regulations for the purposes of carrying out or giving effect to the principles and provisions of this Act, or in respect of matters that are by this Act required to be prescribed.",
                "pre_block_list": [
                  "Regulations."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every such regulation shall be published in the Gazette and shall come into operation on the date of such publication or on such later date as may be specified in the regulation.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every such regulation shall, as soon as convenient after its publication in the Gazette, be brought before Parliament for approval. Any such regulation that is not so approved shall be deemed to be rescinded as from the date of disapproval, but without prejudice to anything previously done thereunder.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Notification of the date on which a regulation is deemed to be rescinded shall be published in the Gazette.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "10",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency.",
              "Articles and Services (Regulation and Maintenance) (Temporary Provisions) Act, No. 14 of 2003 10",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180(Foreign), payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , N O . 32, T RANSWORKS  H OUSE , L OTUS  R OAD , C OLOMBO  01 before 15th December each year in respect of the year following."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}