{
  "n_pages": 13,
  "title_page": {
    "title": "Shaili Educational Foundation (Incorporation)  Act",
    "num": "40",
    "year": "2024",
    "date_certified": "2024-07-19",
    "date_published": "2024-07-26",
    "price": 24.0,
    "price_postage": 150.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 19Th Of July, 2024]",
      "L.D.O. (Inc) 17 /2021",
      "A N   A Ct    To    Incorporate    The   S Haili  E Ducational  F Oundation",
      "Whereas A Foundation Called And Known As The Shaili Educational Foundation Has Heretofore Been Established In Sri Lanka For The Purpose Of Effectually Carrying Out Its Objects And Transacting All Matters Connected With The Said Foundation According To The Rules Agreed To By Its Members:",
      "Preamble",
      "And Whereas The Said Foundation Has Heretofore Successfully Carried Out And Transacted The Several Objects And Matters Specified In This Act For Which It Was Established:",
      "And Whereas The Said Foundation Has Now Applied To Be Incorporated And It Will Be For The Public Advantage To Grant The Said Application:",
      "Be It Therefore Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:"
    ],
    "pre_section_list": [
      {
        "class_name": "ActL1Section",
        "num": "1",
        "text": "This Act may be cited as the Shaili Educational Foundation (Incorporation) Act, No. 40 of 2024.",
        "pre_block_list": [
          "Short title"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "2",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "From and after the date of commencement of this Act, such and so many persons as now are members of the Shaili Educational Foundation (hereinafter referred to as the Foundation, and shall hereafter be admitted as members of the body corporate hereby constituted shall have perpetual succession under the name and style of the Shaili Educational Foundation (hereinafter referred to as the body corporate), and by that name may sue and be sued with full power and authority to have, and use a common seal and to alter the same at its pleasure.",
            "pre_block_list": [
              "Incorporation of the Shaili Educational Foundation"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "The body corporate shall be deemed to be a Voluntary Social Service Organization within the meaning and for the purpose of the Voluntary Social Service Organization (Registration and Supervision)   Act, No. 31 of 1980 and the provisions of that Act shall apply to and in relation to the management of the affairs of the body corporate.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "3",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "Subject to the provisions of any other written law, the general objects for which the body corporate is constituted are hereby declared to be to",
            "pre_block_list": [
              "General objects of the body corporate"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "assist   through   commencement   and   promotion of educational and creative   activities the children, elders and differently   abled persons in Sri Lanka in developing   their educational skills and personalities making them suitable for self- employment;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "identify requirements of children, youth, elders and differently abled persons in Sri Lanka and to provide social mobilization programmes and educational and training programmes for their physical and mental well being;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "help children,  youth   and elders of the   community to become balanced persons   who are contended and conversant with their own cultural heritage and identity;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "commence and conduct programmes to   preserve traditional heritage of Sri Lanka relating to culture, literature and arts; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "provide relief services to differently abled children, youth and elders and the helpless in the community.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "In the implementation of the objects specified in subsection (1), the body corporate shall ensure that such implementation shall be carried out without any distinction based on race, religion, language, caste, gender, political opinion, place of birth or such other grounds.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "4",
        "text": "The objects of the body corporate shall be carried out subject to necessary approvals under applicable written laws and in such manner so as not to create any conflict between the work of the body corporate and any work being carried out simultaneously by any Ministry or Department of the Government or of any Provincial Council.",
        "pre_block_list": [
          "Body corporate to ensure no conflict with work of Ministry or Department of the Government or Provincial Council"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "5",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "Subject to the provisions of this Act and the rules made under section 7, the management and administration of the affairs of the body corporate shall be carried out by a Management Council (hereinafter referred to as the Council) consisting of such number of office bearers as may be specified by the rules made under section 7.",
            "pre_block_list": [
              "Management of the affairs of the body corporate"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "The members of the Council of the Foundation holding office on the day immediately preceding the date of commencement of this Act, shall subject to the rules made under paragraph ( b ), function as an Interim Council of the body corporate until the first Council is appointed or elected within the period specified in paragraph ( d ) and in the manner  provided for by rules made under section 7.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "Subject to the provisions of subsections (2), (3) and (4 ) of   section 7, the Interim Council of the body corporate shall have the power   to make rules for the interim administration of the body corporate not inconsistent with the provisions of this Act or any other written law.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "Any decision of the Interim Council shall be taken by the majority of its members present at any meeting.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "The first Council of the body corporate shall be appointed or elected within one year of the date of commencement of this Act.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "Every office bearer of the Council appointed under paragraph ( d ), including the patrons and advisers, shall be appointed or elected for a period of three years and any such office bearer, patron or adviser shall be eligible for re-appointment or re-election after lapse of the  said period of three years.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "In the event of a vacancy occurring due to the death, resignation, incapacity or removal from office of an office bearer, the Council shall having regard to the rules of the body corporate, elect or appoint a person to fill such vacancy.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "The person elected or appointed under paragraph ( b ) shall hold office only for the unexpired portion of the term of office of the member whom he succeeds.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "6",
        "text": "Subject to the provisions of this Act and any other written law, the body corporate shall have the power to do, perform and execute all such acts and things as are necessary or desirable for the achievement of the objects of the body corporate or any one of them, including the power",
        "pre_block_list": [
          "Powers of the body corporate"
        ],
        "child_level_list": [
          {
            "class_name": "ActL3Paragraph",
            "num": "a",
            "text": "to purchase, rent, construct, renovate and otherwise obtain   lands or buildings which may be required for the purposes   of the body corporate and to deal with or dispose of the   same as may be determined by the Council with a view to promoting the objects of the body corporate;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "b",
            "text": "to enter into and perform or carry out, whether directly or   through any officer or agent authorized in that behalf by   the body corporate, all such contracts or agreements as may   be necessary for the attainment of the objects or the exercise of the powers of the body corporate;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "c",
            "text": "to borrow or raise funds with or without securities and to   receive grants, gifts or donations from local or foreign   sources in cash or kind for the attainment of the objects of the body corporate:",
            "pre_block_list": [
              "Provided that, the Council shall obtain the prior written approval of the Department of External Resources in respect of all foreign funds, grants, gifts or donations received by or made to the body corporate;"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "d",
            "text": "to make, draw, accept, discount, endorse, negotiate, buy,   sell and issue bills of exchange, cheques, promissory notes and other negotiable instruments and to open, operate, maintain and close accounts in any bank;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "e",
            "text": "to invest any funds that are not immediately required for   the purposes of the body corporate, in such manner as the Council may determine;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "f",
            "text": "to undertake, accept, execute, perform and administer any   lawful trust having objects similar to those of the body corporate or any real or personal property with a view to promoting the objects of the body corporate;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "g",
            "text": "to appoint, employ, dismiss or terminate the services of   officers and other employees of the body corporate and   exercise disciplinary control over them and to pay them   such salaries, allowances and gratuities as may be   determined by the body corporate in terms of rules made under section 7 of the Act;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "h",
            "text": "to organize lectures, seminars and conferences with a view to promoting  the objects of the body corporate;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "i",
            "text": "to liaise and co-ordinate with other local and foreign   institutions having similar objects to those of the body corporate; and",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "j",
            "text": "to train officers and other employees in Sri Lanka or abroad for the purposes of the body corporate.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "7",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "It shall be lawful for the body corporate, from time to time, at any general meeting of the body corporate and by a majority of not less  than two-thirds of the members present and voting, to make rules, not inconsistent with the provisions of this Act or any other written law, for the following matters: -",
            "pre_block_list": [
              "Rules of the body corporate"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "the   classification   of     membership,   admission, withdrawal, expulsion or resignation of members and fees payable by the members;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "the election of office bearers of the Council or vacation   of or removal from office of office bearers and the powers, duties and functions of the office bearers;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "the terms and conditions of appointment, powers, functions and duties of various officers and other employees of the body corporate;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "the procedure to be followed for the summoning and holding of meetings of the body corporate and of the Council, notices and agenda of such meetings, the quorum and the conduct of business thereat;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "the qualifications and disqualifications to be a member of the Council and the body corporate;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "the administration and management of the property of the body corporate;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "g",
                "text": "the procedure and manner of liaising and coordinating with other local and foreign institutions having objects similar to that of the body corporate; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "h",
                "text": "generally, the management of the affairs of the body corporate and the dissolution of the body corporate.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "Any rule made by the body corporate may be amended, altered, added to or rescinded at a like meeting and in like manner, as a rule made under subsection (1) of this section.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "The rules made under subsection (1), shall be published in the  Gazette  within three months upon making such rules and shall come into effect on the date thereof.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "4",
            "text": "Every rule made by the body corporate within three months after its publication in the  Gazette , be brought before Parliament for approval. Any rule which is not so approved shall be deemed to be rescinded as from the date of such disapproval, but without prejudice to anything previously done thereunder.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "5",
            "text": "Notification of the date on which any such rule is deemed to be so rescinded under subsection (4) shall be published in the  Gazette .",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "6",
            "text": "The members of the body corporate shall at all times be subject to the rules of the body corporate.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "8",
        "text": "The Council shall maintain a register of members in which name, address and other essential details of the members shall be inscribed.",
        "pre_block_list": [
          "Register of members"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "9",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "The body corporate shall have its own Fund.",
            "pre_block_list": [
              "Fund of the body corporate"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "All moneys received by way of gifts, bequests, donations, subscriptions, contributions, fees or grants for and on account of the body corporate shall be deposited in one or more banks approved by the Council to the credit of the body corporate  subject to the provisions of  section 6 ( c ).",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "There shall be paid out of the Fund, all such sums of money as are required to defray any expenditure incurred by the body corporate in the exercise, performance and discharge of its powers, duties and functions under this Act.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "10",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "The financial year of the body corporate shall be the calendar year.",
            "pre_block_list": [
              "Accounts and auditing"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "The body corporate shall cause proper accounts to be kept of   its income and expenditure, assets and liabilities and all other transactions of the body corporate.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "The accounts of the body corporate shall be audited annually by the Auditor-General or a qualified auditor in terms of the provisions of Article 154 of the Constitution and be certified by the Auditor-General or such qualified auditor.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "4",
            "text": "For the purposes of this section qualified auditor means -",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "an individual who, being a member of the Institute of   Chartered Accountants of Sri Lanka or of any other   Institute established by law, possesses a certificate to   practice as an Accountant, issued by the Council of such Institute; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "a firm of Accountants, each of the resident partners of   which, being a member of the Institute of Chartered   Accountants of Sri Lanka or of any other Institute   established by law, possesses a certificate to practice as an Accountant, issued by the Council of such Institute.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "11",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "The Council shall prepare a report of the activities of the body corporate for each financial year and submit such report together with the audited statement of accounts and a list of all assets and liabilities of the body corporate certified by the Auditor-General or a qualified auditor, to the Secretary of the Ministry of the Minister assigned the subject of Education and to the Registrar of Voluntary Social Service Organizations appointed under the Voluntary Social Service",
            "pre_block_list": [
              "Annual Report",
              "Organization (Registration and Supervision) Act, No. 31 of 1980 before the expiration of six months of the year succeeding the year to which   such report relates."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "A separate statement of accounts relating to the foreign and local moneys received by the body corporate and details of all contracts and agreements entered into by the body corporate and the rules of the body corporate made under section 7 during the financial year shall be attached to the report referred to in subsection (1).",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "12",
        "text": "All debts and liabilities of the Foundation existing on the day immediately preceding the date of commencement of this Act, shall be paid by the body corporate hereby constituted and all debts due to and subscriptions and contributions payable to the Foundation on that day shall be paid to the body corporate for the purposes of   this Act.",
        "pre_block_list": [
          "Debts due by and payable to the Foundation"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "13",
        "text": "Subject to the provisions of this Act and any other written law, the body corporate shall be able and capable in law to take and hold any property, movable or immovable, which may become vested in it by virtue of any purchase, grant, gift, testamentary disposition or otherwise, and all such property shall be held by the body corporate for the purpose of this Act and subject to the rules of the body corporate made under section 7, with power to sell, mortgage lease, exchange or otherwise dispose of the same.",
        "pre_block_list": [
          "Body corporate may hold property movable and immovable"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "14",
        "text": "The moneys and property of the body corporate however derived shall be applied solely towards the promotion of the objects of the body corporate and no portion thereof shall be paid or transferred directly or indirectly by way of dividend, bonus, profit or otherwise howsoever to the members of the body corporate.",
        "pre_block_list": [
          "Application of moneys and property"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "15",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "The seal of the body corporate shall not be affixed to any instrument whatsoever,  except in the presence of two members of the Council who shall sign their names to the instrument in token of their presence and such signing shall be independent of the signing of any person as a witness.",
            "pre_block_list": [
              "Seal of the body corporate"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "The seal of the body corporate shall be in the custody of an office bearer of the Council as may be decided by the Council.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "16",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "If upon the dissolution of the body corporate there remains after the satisfaction of all its debts and liabilities, any property whatsoever, such property shall not be distributed among the members of the body corporate, but shall be given or transferred to any other institution having objects similar to those of the body corporate, and which is by the rules thereof, prohibited from distributing any income or property among its members.",
            "pre_block_list": [
              "Property remaining on dissolution"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "For the purposes of subsection (1), the appropriate institution shall be determined by the members of the body corporate immediately before the dissolution at a general meeting by the majority of votes of the members present.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "17",
        "text": "Nothing in this Act contained shall prejudice or affect the rights of the Republic or of any body politic or corporate.",
        "pre_block_list": [
          "Saving of the rights of the Republic"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "18",
        "text": "In this Act, unless the context otherwise requires:-",
        "pre_block_list": [
          "Interpretation",
          "bank means a bank licensed under the provisions of the Banking Act, No.30 of 1988; and",
          "written law shall have the same meaning assigned to such expression in the Constitution."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "19",
        "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
        "pre_block_list": [
          "Sinhala text to prevail in case of inconsistency",
          "English Acts of the Parliament can be purchased at the P RAKASHANA  P IYASA , D EPARTMENT   OF G OVERNMENT  P RINTING , N O . 118, D R . D ANISTER  D E  S ILVA  M AWATHA , C OLOMBO  8."
        ],
        "child_level_list": []
      }
    ],
    "part_list": []
  }
}