{
  "n_pages": 5,
  "title_page": {
    "title": "Registration Of Documents (Amendment) Act",
    "num": "21",
    "year": "2013",
    "date_certified": "2013-04-24",
    "date_published": "2013-04-26",
    "price": 5.0,
    "price_postage": 5.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 24Th April, 2013]",
      "L.D.O. 18/2013",
      "A N  A Ct   To   Amend   The  R Egistration   Of  D Ocuments  O Rdinance (C Hapter  117)",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Registration of Documents (Amendment)  Act, No. 21 of 2013 and shall be deemed to have come into operation on January 1, 2013.",
            "pre_block_list": [
              "Short title and date of operation."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "Section 13 of the Registration of Documents Ordinance (Chapter 117) (hereinafter referred to as the principal enactment)  is hereby amended in subsection (6) of that section by the substitution for the words a fee of ten rupees shall be of the words a fee of ten rupees or such other amount as may be prescribed by the Minister, shall be.",
            "pre_block_list": [
              "Amendment of section 13 of the Registration of Documents Ordinance (Chapter 117)."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "Section 22 of the principal enactment is hereby amended in subsection (2) of that section by the substitution for the words  a fee of five rupees shall be payable for the registration of the words  a fee of five rupees or such other amount as may be prescribed by the Minister, shall be payable for the registration.",
            "pre_block_list": [
              "Amendment of section 22 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "Section 48 of the principal enactment is hereby amended by the repeal of that section and the substitution therefor of the following:",
            "pre_block_list": [
              "Amendment of section 48 of the principal enactment.",
              "48. The fees specified in the First Schedule as may be prescribed by the Minister, from time to time, shall be payable for the matters to which they relate",
              "",
              "Fees",
              "2PL0070954,090 (03/2013)"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "The First Schedule of the principal enactment is hereby amended as follows:",
            "pre_block_list": [
              "Amendment of the First Schedule of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "In Part I of that Schedule",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "i",
                    "text": "by the substitution for item 6 thereof, of the following item:",
                    "pre_block_list": [
                      "(6) For each land described in the Caveat, for  each Land Registry in which each caveat in respect of each such land is registered and for each period of two years, a fee of",
                      "2500.00;"
                    ],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "by the substitution for item (9) thereof, of the following item:",
                        "pre_block_list": [
                          "(9) Every instrument of any kind  whatsoever  not expressly exempted, a fee of",
                          "100.00;"
                        ],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "by the substitution for item (10) thereof, of the following item:",
                        "pre_block_list": [
                          "(10) An instrument presented to the Registrar-General under section 29 , in addition to any other fee payable, a fee of",
                          "1000.00;"
                        ],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "By the substitution for Part III of that Schedule of the following:",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "III",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "An application to, inspect the duplicates  of  deeds, instruments or documents, or the attested or certified copies thereof  transmitted  or",
            "pre_block_list": [
              "delivered, inspect any book or index under Chapter II, III, IV,V or VI for each transaction or matter in respect of which the search is made, a fee of",
              "500.00;"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "An application for",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "copies of or extracts from any deed relating to any land a fee of",
                "pre_block_list": [
                  "500.00"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "Copies of or extracts from any folio or folios relating to any land a fee of",
                "pre_block_list": [
                  "100.00"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "For supplying an endorsement of registration of  lis pendens, priority notice, seizure priority notice other than a caveat under section 43(2), the same fee  as  was  paid  on registration",
            "pre_block_list": [
              "",
              "6. Any  fees charged or collected by or on behalf of the Registrar- General or any person authorised under this Act, for any purpose authorized by this Act to charge or collect, during the period commencing on January 1, 2013 and ending on the date on which the certificate of the Speaker is endorsed in respect of this Act, shall be deemed to have been validly charged or collected by the Registrar- General or by any such person authorised under this Act:",
              "Validation.",
              "Provided that the aforesaid provisions shall not affect any decision or Order made by any Court or any proceedings pending in any Court in respect of any fee charged or collected during the aforesaid period.",
              "7. In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
              "Sinhala text to prevail in case of any inconsis- tency.",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , D EPARTMENT   OF G OVERNMENT  I NFORMATION , N O . 163, K IRULAPONA  M AWATHA , P OLHENGODA , C OLOMBO  05 before 15th December each year in respect of the year following ."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}