{
  "n_pages": 4,
  "title_page": {
    "title": "Widows  And  Orphans  Pension  Scheme (Armed Forces) (Amendment) Act",
    "num": "55",
    "year": "1999",
    "date_certified": "1999-12-31",
    "date_published": "1999-12-31",
    "price": 3.0,
    "price_postage": 3.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 31St December, 1999]",
      "L.D. O. 48/98.",
      "A N  A Ct   To   Amend   The  W Idows   And  O Rphans   P Ension S Cheme  (A Rmed  F Orces ) A Ct , N O . 18  Of  1970",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :-"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Widows and Orphans Pension Scheme (Armed Forces) (Amendment) Act, No.55 of 1999.",
            "pre_block_list": [
              "Short Title."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "The following new section is hereby inserted immediately  after section 3 A  and shall have effect as section 3 B  of the Widows and Orphans Pension Scheme (Armed Forces) Act, No. 18 of 1970 :-",
            "pre_block_list": [
              "Insertion of new section 3 B in Act,  No.18 of 1970.",
              "3 B . (1) Any Person who became a member of the Armed Forces on or before September 30th 1968 and who -",
              "Extension of time limit to become a contributor to the Pension Scheme",
              "(a)  continued, or continues, to be such member after that date ; and",
              "(b)  has not elected, under section 3 or section 3 A , to be a contributor to the Pension Scheme,",
              "may, before such date as the Minister may appoint by Order published in the Gazette, elect to be a contributor to the Pension Scheme :",
              "Provided however, that where a member of the armed forces referred to in this subsection has died prior to the coming into force of this section or dies before the date appointed under this subsection without making an election",
              "H-22545",
              "under this subsection , such person shall, if he leaves a wife or child or a wife and child or a wife and children, be deemed to have elected to be a contributor to the Pension Scheme."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every person who elects under subsection (1) to become a contributor to the Pension Scheme or in the case of a person who is deemed under that subsection to have elected to have become a contributor to the Pension Scheme, the person administering the affairs of such deceased person, shall pay to the Pension Scheme, all arrears of contributions for the period commencing on October 1, 1968 and ending on the date of retirement or death, as the case may be, with interest thereon at the rate of four  per centum  per annum.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "An election made under the provisions of subsection (1) shall be final.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The provisions of this section shall have effect notwithstanding anything to the contrary in section 3 or 3 A .",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency.",
              "Annual subscription of English Bills and Acts of the Parliament Rs.885 (Local). Rs.1,180 (Foreign), Payable to the S UPERINTENDENT . G OVERNMENT  P UBLICATIONS  B UREAU , No. 32, T RANSWORKS  H OUSE , L OTUS  R OAD , C OLOMBO  01 before 15th December each year in respect of the year following."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}