{
  "n_pages": 30,
  "title_page": {
    "title": "Tsunami (Special Provisions)  Act",
    "num": "16",
    "year": "2005",
    "date_certified": "2005-06-13",
    "date_published": "2005-06-17",
    "price": 21.5,
    "price_postage": 10.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 13Th June, 2005]",
      "L.D.O. 3/2005.",
      "A N  A Ct   To   Enable   Special   Legal   Provisions   To   Be   Made   In   Respect   Of",
      "Persons   And   Property   Affected   By   The   Tsunami   That   Occured   On",
      "December  26, 2004,  And   For   Matters   Connected   Therewith   Or",
      "Incidental   Thereto .",
      "Whereas It Is The National Policy Of The State To Ensure And Grant Adequate Protection To Those Adversely Affected As A Result Of The Tsunami That Took Place On December 26, 2004, Which Resulted In Great Loss To Life And Property Of A Large Number Of Persons In Sri Lanka :",
      "Preamble.",
      "And Whereas Those Persons Affected By The Tsunami Are Unable To Exercise Certain Rights And Enjoy Certain Benefits Afforded Under Existing Laws, And Are Also Subjected To Certain Impediments And Disadvantages As A Result Of Their Inability To Comply With Certain Existing Legal Requirements :",
      "And Whereas There Are Many Children And Young Persons Who Have Been Left Without Adequate Parental Care Due To The Tsunami And It Is Necessary To Ensure That They Receive Alternate Care And Protection :",
      "And Whereas There Now Exists An Immediate Need To Make Special Legal Provisions To Enable Those Persons Affected By The Tsunami To Overcome Prevailing Legal Obstacles And Existing Legal Barriers And To Ensure The Protection And Safeguarding Of  Their Rights And Privileges :",
      "Be It Therefore Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Tsunami (Special Provisions) Act, No. 16  of 2005. Short title.",
            "pre_block_list": [
              "2PL 0002295,650 (04/2005)"
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "I",
        "text": "",
        "pre_block_list": [
          "I SSUE   OF  D EATH  C ERTIFICATES",
          "Where persons resident in certain area as at December 26, 2004, are found missing."
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "Notwithstanding the provisions of section 108 of the Evidence Ordinance, where any person, who had been resident in an area referred to in the First Schedule to this Act as at December 26, 2004 or was known to have been in or travelling through such area on that date, cannot be found and has not been heard of for six months since that date by those who would normally have heard of such person has such person been alive, and the disappearance is attributable to the Tsunami that occurred on that date, the burden of proving that such person is alive is on the person who affirms it.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The next of kin of any person referred to in section 2, or where there is no next of kin living, any other person having knowledge of such person, may apply in the manner hereinafter provided, to have a certificate of death issued in respect of such person.",
                "pre_block_list": [
                  "Procedure for obtaining a certificate of death in respect of a person referred to in section 2."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "An application referred to in subsection (1) may at any time after expiry of six months from December 26, 2004, be made in the Form set out in the Second Schedule to this Act and shall be submitted along with an affidavit to the Grama Niladhari of the area within which such missing person was resident. The Grama Niladhari shall, immediately upon the receipt of such application, display a notice in his office calling for objections, if any, to the issue of a death certificate as applied for, within two weeks of the date of such notice. The Grama Niladhari shall, upon the expiry of the period for filing of objections, and after such inquiry as he deems fit and having obtained a report from the Officer in Charge of the Police Station of the area, authenticate the same and forward it along with his report as to the accuracy of the facts stated therein, to the Divisional Secretary of the division within which his area is situated. The Divisional Secretary shall endorse every such application and forward the same to the Registrar-General.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Upon receipt of an application, duly authenticated and endorsed in terms of subsection (2), the Registrar-General shall, upon being satisfied on the documents presented, make order directing the appropriate Registrar to register in the Register of Deaths maintained by such Registrar under the Births and Deaths Registration Act (Chapter 110), the particulars specified in such application and issue in respect of such person a certificate of death, and such appropriate Registrar shall forthwith enter such particulars in such register and sign the register in the appropriate place.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "There shall be attached to the duplicate of the relevant registration entry, the order of the Registrar-General made under subsection (3), and such duplicate and order shall be sent together by the Registrar to the appropriate District Registrar for transmission to the Registrar-General for custody in his office.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where any death has been registered pursuant to an application made under section 3 of this Act, and where any person at any time thereafter becomes aware that the person whose death has been so registered is alive, such person shall forthwith furnish such information to the Registrar-General.",
                "pre_block_list": [
                  "Where information is received of a person being alive in respect of whom a certificate of death was issued under section 3."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Registrar-General shall on receipt of such information convey the information to the Officer-in-Charge of the relevant police station, who shall investigate the truth of such information and make a report to the Registrar-General, within four weeks of the date on which such information is conveyed to such officer.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Upon receipt of a report under subsection (2) and after such inquiry as he may deem necessary the Registrar-General, if satisfied that the person whose death has been registered is alive, shall take such action, or make such order or give such direction under section 52 of the Births and Deaths Registration Act (Chapter 110), as is appropriate in the circumstances of the case, to rectify the records.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Any inquiry held by the Registrar-General under subsection (3) shall be concluded within one month of its commencement and the Registrar-General may, for the purposes of such inquiry, exercise all the powers exercisable by him under the Births and Deaths Registration Act (Chapter 110), in relation to an inquiry held by him under that Act.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "Any person who",
            "pre_block_list": [
              "Offences."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "knowingly makes a false statement in an application made by him under section 3, or furnishes false information ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "being aware that a person whose death has been registered in pursuance of an application made under section 3, is alive, fails to furnish such information to the Registrar-General ; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "dishonestly or fraudulently uses a certificate of death issued under the Births and Deaths Registration Act knowing, or having reason to believe that the person referred to in such certificate is alive,",
                "pre_block_list": [
                  "shall be guilty of an offence under this Act, and shall upon conviction after trial by the High Court be sentenced to a term of imprisonment of not less than three years and not exceeding five years."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "In this Part of this Act, unless the context otherwise requires",
            "pre_block_list": [
              "Interpretation.",
              "appropriate District Registrar, appropriate registrar and district shall have the respective meanings assigned to them by the Births and Deaths Registration Act (Chapter 110) ;",
              "District Registrar means a District Registrar of Births and Deaths appointed under section 4 of the Births and Deaths Registration Act (Chapter 110) and",
              "Registrar-General means the Registrar-General of Births and Deaths appointed under section 2 of the Births and Deaths Registration Act (Chapter 110) and includes a Deputy Registrar-General."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "II",
        "text": "",
        "pre_block_list": [
          "C USTODY   OF  C HILDREN   AND  Y OUNG  P ERSONS"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "The provisions of this Part of this Act shall apply in respect of",
            "pre_block_list": [
              "Application of the provisions of the Act."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "every child and young person who is left an orphan ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "every child left with a single parent who is unable to take care of such child ; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "every young person left with a single parent who is in need of care and protection, which such parent is unable to provide,",
                "pre_block_list": [
                  "as a result of the Tsunami which occurred on December 26, 2004."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The National Child Protection Authority established by the National Child Protection Authority Act, No. 50 of 1998 (hereinafter referred to as the Authority) shall maintain a Register containing all available information relating to every child who is left an orphan and of every child and young person in respect of whom foster care is desired for under section 11 of this Act.",
                "pre_block_list": [
                  "Authority to maintain a register."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Authority shall be required for the purpose of ensuring that the register maintained under subsection (1) contains accurate information, to make any inquiry as it may consider necessary about the children and young persons whose information is recorded in such register.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Every person, who on the date of the coming into operation of this Part of this Act has the custody of a child as is referred to in paragraphs ( a ) or ( b ) of section 7 of this Act, shall, unless such person",
                "pre_block_list": [
                  "Registration as current custodian."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "is the parent of the child ; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "has been granted custody of the child or has been committed with the care of the child under any law, after December 26, 2004,",
                    "pre_block_list": [
                      "forthwith and in any event not later than one month of the date of the coming into operation of this Part of this Act, make an application in the form specified in the Third Schedule to this Act to the Commissioner of Probation and Child Care Services (hereinafter referred to as the Commissioner) for the purpose of being registered as the current custodian of such child. The Commissioner may where necessary, delegate to the Divisional Secretary of the area where such child is presently resident, the power to accept an application and forward the same to the Commissioner."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every person having custody of a child referred to in subsection (1) and who fails without just cause to register within the period specified in that subsection, shall be guilty of an offence and shall upon conviction be liable to a term of imprisonment of either description not exceeding two years.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "A child found in the custody of a person who fails to register as required under subsection (1), shall immediately be removed by the Commissioner from the custody of such person, upon an order of a Magistrate, issued in the best interest of the child.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The Commissioner shall maintain a register containing all available information relating to every current custodian registered under this section and forward a copy of the information to the Authority.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "The provisions of this section shall apply also in respect of every institution or organization where any children affected by the Tsunami are being taken care of.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "10",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "It shall be the duty of every current custodian to provide all such care and protection, including adequate education, to the child under his or her care, so long as he or she remains the current custodian of such child.",
                "pre_block_list": [
                  "Duty of a current custodian."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where a current custodian who is an individual wishes to be the foster parent to the child under his or her care, an application for the same is required to be made under section 13 of this Act within one month of such person being registered as the current custodian of such child.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "11",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "It shall be the duty of the parent of a child referred to in paragraph ( b ) of section 7 who desires to place such child under foster care, to inform the Authority of that fact within six months of the coming into operation of this Act.",
                "pre_block_list": [
                  "Informing Authority of desire for foster care."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "A young person who is referred to in paragraph ( a ) or ( c ) of section 7 may, if he or she is desirous of being placed under foster care, inform the Authority of that fact within six months of the coming into operation of this Act.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "12",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Subject to the upper guardianship of Court, the Authority shall be the Guardian of every child placed under foster care by a parent  and of every child who is left an orphan, whether or not such child is in the custody of any person, on the date of the coming into operation of this Act.",
                "pre_block_list": [
                  "Authority to be the Guardian."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "It shall be the duty of the Authority to ensure that every child who is not under foster care or who has ceased to be in foster care for any reason whatsoever, is provided with adequate care, custody and protection inculding education and any special care that may be needed in view of the emotional trauma suffered by such child, and the Authority shall make every endavour to find a suitable foster parent for such child.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "13",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Any person, including an individual who is a current custodian of a child, who desires to become a foster parent of a child or young person referred to in section 7 of this Act, shall make an application for the issue of a Foster Care Order in the Form as specified in the Fourth Schedule to this Act, to the Magistrates Court within whose jurisdiction such person is resident. A copy of the application along with the information specified in the Fifth Schedule shall be sent to the Authority.",
                "pre_block_list": [
                  "Application to be a foster parent."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Magistrates Court shall not make an order on any application received under subsection (1), until it receives the recommendation of the Panel forwarded by the Authority under section 15 of this Act.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "14",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "On receipt of the copy of an application under section 13, the Chairman of the Authority shall forthwith refer the same to the Foster Care Evaluation Panel (hereinafter referred to as the Panel) constituted for the Province within which the person who made such application for a Foster Care Order is resident, for the purpose of evaluating the suitability of the applicant to be a foster parent.",
                "pre_block_list": [
                  "Authority to refer application to a Foster Care Evaluation Panel."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Panel referred to in subsection (1) shall consist of",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the Chairman of the Authority or his nominee ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "a nominee of the Sri Lanka College of Paediatricians ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "the Commissioner of Probation and Child Care Services, of the relevant Province or his nominee ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "a Psychologist nominated by the Authority ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "a Psychiatrist nominated by the Authority ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "the Provincial Director of Education of the relevant province or his nominee ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "g",
                    "text": "the Provincial Director of Health Services, of the relevant Province or his nominee.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Panel shall function for so long as it may be necessary for the purpose of discharging the functions entrusted to it under this Part of this Act.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The members of the Panel shall elect from among themselves one of the members to be its Chairman and also determine the procedure to be followed in conducting its meetings. The quorum for a meeting of the Panel shall be three members.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "In evaluating the suitability of an applicant to be a foster parent, the paramount consideration shall be the best interest of the child and for that purpose the Panel shall be guided by the criteria specified in the Sixth Schedule to this Act. The Panel shall also obtain a home study report from a person holding a designation specified in the Seventh Schedule to this Act.",
                "pre_block_list": [
                  "For the purpose of this subsection, a home study report means a report on the mental health of the applicants on their social, religious and financial background and on their suitability to be a foster parent."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "15",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Panel shall consequent to its evalution of an application, forward its recommendation on the same to the Chairman of the Authority within two weeks of receiving the application from the Authority, and the Chairman of the Authority shall forthwith forward the same to the Magistrates Court to which the application pertaining to the child or young person, as the case may be, was made under section 13 of this Act.",
                "pre_block_list": [
                  "Panel to forward its recommenda- tions."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Authority shall when forwarding the recommendations under subsection (1), also identify by designation and name the person who shall be required to perform the functions specified in section 18 of this Act, as the Monitoring Officer, in the event a Foster Care Order is made in favour of the applicant. A person to be identified as the Monitoring Officer by the Authority, shall be selected from among persons holding such designations as specified in the Seventh Schedule to this Act.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "16",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "On receipt of the recommendations of the Panel forwarded by the Chairman of the Authority, and where the Panel recommends the suitability of the applicant to be a foster parent, the Magistrates Court may, with the consent of the child where such child is over ten years of age or the young person, as the case may be, issue a Foster Care Order appointing the person or persons named in the application as the Foster Parent or Foster Parents (hereinafter referred to as Foster Parent) as the case may be, of the child or young person concerned. The Foster Care Order issued shall be in such Form and be subject to such conditions as specified in the Eighth Schedule to this Act.",
                "pre_block_list": [
                  "Foster Care Order."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "When issuing the Foster Care Order, the Court shall also appoint as the Monitoring Officer the person identified by the Authority under subsection (2) of section 15, and such Officer shall be required to perform the functions referred to in section 18 of this Act in respect of the child or young person regarding whom the Foster Care Order is being made.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "A Foster Care Order issued under subsection (1) shall",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "in the case of a child, be valid for a period of one year from the date of its issue, even if the child reaches the age of eighteen years prior to the expiration of that period ; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "in the case of a young person, be valid until such young person reaches the age of twenty-one years or such other age as may be specified in the Foster Care Order.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "A Foster Care Order issued in respect of a child may, upon application made in that behalf before the expiration of the period of one year to the Magistrates Court which made such Order, be renewed for a further periods of one year at a time until the child reaches the age of twenty-one years, subject to the provisions of section 20.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Notwithstanding the issue of a Foster Care Order under subsection (1), the Authority shall at all times continue to remain as the Guardian of a foster child, until such child reaches the age of eighteen years.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "17",
            "text": "It shall be the duty of every Foster Parent,  to provide in respect of the foster child or young person, all such care and protection, exercise all such control and discharge all other obligations, including the provision of adequate education and any special care that may be needed in view of the emotional trauma suffered by such child or young person, as if such Foster Parent is the natural parent of the foster child or young person.",
            "pre_block_list": [
              "Duty of a Foster Parent."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "18",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where a Foster Care Order is made under section 16 of this Act, it shall be the duty of the person appointed as the Monitoring Officer under subsection (2) of that section, to monitor the performance and the discharge of the duties and obligations imposed upon the Foster Parent, and submit a report once in every three months, in the Form specified in the Nineth Schedule to this Act, to the Authority.",
                "pre_block_list": [
                  "Duties of the Monitoring Officer in regard to the child or young person in respect of whom a Foster Care Order is made."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Chairman of the Authority shall submit a copy of the report sent to the Authority under subsection (1) to the Panel for its evaluation and consideration and the Panel shall be required to submit to the Authority its comments on the evaluation of the report within one week of its receipt.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "19",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "A Monitoring Officer shall have the power in the performance of his duties under subsection (1) of section 18, to enter and inspect at any time the premises in which the child or young person, as the case may be, is for the time being resident and to question any person or persons as he may consider necessary.",
                "pre_block_list": [
                  "Monitoring Officer to have right to enter any premises etc."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any person obstructing a Monitoring Officer in the performance of his duties, shall be guilty of an offence under this Part of this Act, and shall on conviction after summary trial before a Magistrate, be liable to imprisonment of either description for a term not exceeding two years.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where the person found guilty of obstructing a Monitoring Officer under subsection (2) is the Foster Parent of the child or young person, in addition to the penalty imposed by that subsection, the Magistrates Court shall have the power to revoke the Foster Care Order issued in respect of such Foster Parent.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "20",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where on receipt of the comments of the Panel, the Authority is of the view that the care and protection given, and the exercise of the control and discharge of the duties and obligations imposed upon the Foster Parent is not being carried out in the best interest of the child or young person",
                "pre_block_list": [
                  "Revocation of Foster Care Order.",
                  "concerned, the Court may on application made for the revocation of the Foster Care Order by the Authority, revoke such Order and direct the relevant Monitoring Officer to remove the child or young person concerned from the custody of the foster parent and provide  alternate care as shall be specified by the Court. A revocation of a  Foster Care Order shall be in such form as specified in the Tenth Schedule to this Act."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where a Foster Care Order is revoked, the Magistrates Court which revoked the same may on receipt of an application for foster care from any other person, issue a fresh Foster Care Order, and the provisions of section 13 to section 19 shall apply in respect to such application.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "21",
            "text": "No Court shall entertain an application for adoption of a child referred to in paragraph ( a ) and paragraph ( b ) of section 7 of this Act under the Adoption of Children Ordinance (Chapter 61), unless and until such child shall have first been placed in foster care under a Foster Care Order issued under section 16 of this Act.",
            "pre_block_list": [
              "No adoption under Adoption of Children Ordinance unless child is under foster care."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "22",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Any person, including a Foster Parent may, where such person is desirous of adopting a child, make an application for the same under the Adoption of children Ordinance, to the District Court within whose jurisdiction such child is currently resident, and the Court may subject to the provisions of this Act, make an order authorizing such adoption. No adoption order shall take effect until the expiration of a period of one year from the date of the making of the Foster Care Order.",
                "pre_block_list": [
                  "Application for adoption of a child under foster care."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "An application for adoption under subsection (1) may be made at anytime after the expiration of a period of nine months since a child has been placed under foster care.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "In the event of there being more than one application under subsection (1) in respect of any child, the Court shall make such order as it seems fit, taking into consideration the best interest of the child.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where an application made for adoption is granted by a District Court, an order of renewal of the Foster Care Order made in respect of that child shall forthwith be deemed to have abated.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "23",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The provisions of sections 3 and 4 of the Adoption of Children Ordinance shall apply in respect of an adoption under this Part of this Act, provided that in the case of a child under ten years of age, no adoption order shall be made without the consent of the Authority.",
                "pre_block_list": [
                  "Provisions of sections 3 and 4 of the Adoption of Children Ordinance to apply."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "In satisfying itself as regards the matters set out in paragraph ( b ) of section 4 of the Adoption of Children Ordinance, the Court shall, where the adoption application is made by the foster parent of the child concerned, take into consideration the reports submitted by the Monitoring Officer relating to such child during the period of foster care.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "24",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where the child in respect of whom an adoption order is made under section 22 is not in possession of a birth certificate, the Court shall specify in the order made the date of birth of such child where such date is known, or where the date is not known, the Court shall specify as the date of birth of such child, such date as is stated in a certificate issued by a Medical Practitioner to be the probable date of birth of such child.",
                "pre_block_list": [
                  "Issue of brith certificate."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Court once it makes its order on the adoption application, shall also direct the Registrar General of Births and Deaths to issue forthwith a certificate of birth to the child, where the child concerned is not in possession of a birth certificate.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "25",
            "text": "An adoption order made under this Act shall, notwithstanding anything to the contrary contained in the Adoption of Children Ordinance, be deemed for all purposes to be an adoption order made under that Ordinance, and the provisions of that Ordinance shall,  mutatis mutandis  apply to and in respect of such order.",
            "pre_block_list": [
              "Authority to act notwithstanding the National Child Protection Authority Act, No. 50 of 1998."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "26",
            "text": "The Authority shall have the power to perform and discharge the duties and functions assigned to such Authority under this Part of this Act, notwithstanding the provisions of the National Child Protection Authority Act, No. 50 of 1998.",
            "pre_block_list": [
              "Interpretation."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "27",
            "text": "Unless the context otherwise requires, for the purposes of this Part of this Act",
            "pre_block_list": [
              "child means a person under eighteen years of age ;",
              "Medical Practitioner means a Medical Practitioner registered under the Medical Ordinance (Chapter 105) ; and",
              "young person means a person who has attained eighteen years but under twenty-one years of age."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "III",
        "text": "",
        "pre_block_list": [
          "P RESCRIPTION"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "28",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Adverse possession of immovable property which had commenced prior to December 26, 2004 by a person affected by the Tsunami shall not be considered to have been interrupted for a period of one year from December 26, 2004, if that person was prevented from  continuing in his possession as a result of the Tsunami.",
                "pre_block_list": [
                  "Adverse possession not considered to be interrupted."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Possession of immovable property by a person referred to in subsection (1), shall not be considered to have been interrupted by reason only of the fact that such property was in the possession of any other person or persons during the period December 26, 2004 to December 26, 2005.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "29",
            "text": "In calculating the prescribed time within which any action, appeal or application is required to be instituted or filed or any act is required to be done in any Court or tribunal by any written law or where any act is required to be done within a prescribed time by any written law, the period commencing from December 26, 2004 and ending on December 26, 2005 shall be excluded, if the person who was required to institute or file such action or do the particular act within the prescribed time is a person who was affected by theTsunami and such person was unable to take such step as a result of the Tsunami.",
            "pre_block_list": [
              "Exclusion of certain period from the calculation of time prescribed for the filing of certain actions etc."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "IV",
        "text": "",
        "pre_block_list": [
          "A CTIONS   UNDER   SECTION  66  OF   THE  P RIMARY  C OURTS  P ROCEDURE  A CT"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "30",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where information relating to a land situated within the area affected by the Tsunami is filed under section 66 of the Primary Courts Procedure Act, No. 44 of 1979 at any time during the period December 26, 2004 to December 26, 2005 and an inquiry is held by such Court to determine as to who is entitled to possession of the land, notwithstanding anything to the contrary in section 68 of such Act, the person who was in possession of such land on December 26, 2004 or where such person has died or is missing, any person or persons who were in possession of the land with that person, shall be deemed to be the person or persons who are in possession of such land and the Judge shall make order declaring such person or persons to be entitled to possess the land.",
                "pre_block_list": [
                  "Possession of land affected by the Tsunami."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where the person or persons who had been in possession of any land referred to in subsection (1) had been forcibly dispossessed of such land at any time within two months prior to December 26, 2004 by the person or persons deemed to be in possession of such land under that subsection, the Judge shall direct that the person or persons so dispossessed be restored back in possession and prohibit any disturbance of such possession otherwise than under the authority of an order or decree of competent court.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "V",
        "text": "",
        "pre_block_list": [
          "T ENANTS   OF  P REMISES"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "31",
            "text": "Where any person was, on December 26, 2004, a tenant or a lessee of any premises or any land affected by the Tsunami, his tenancy or leasehold rights shall not stand terminated, by reason only of the fact that the subject matter of the tenancy or the lease was destroyed or made unsuitable for occupation or possession as a result of the Tsunami.",
            "pre_block_list": [
              "Tenant or lessees rights not to be terminated."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "VI",
        "text": "",
        "pre_block_list": [
          "O FFENCES   IN  R ESPECT   OF  T SUNAMI  R ELIEF  P ROPERTY"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "32",
            "text": "Where any person is found guilty of having committed the offence of criminal misappropriation, criminal breach of trust, theft, extortion, robbery, cheating or retention of stolen property within the meaning of the Penal Code, in relation to any property including money intended for the purpose of affording relief to those affected by the Tsunami, such person shall on conviction be liable to a penal sanction equal to twice the penal sanction imposed for that offence under the Penal Code.",
            "pre_block_list": [
              "Penalty for certain offences under the Penal Code committed in relation to Tsunami relief property."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "33",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency.",
              "FIRST SCHEDULE [Section 2]",
              "Divisional Secretaries Divisions of",
              "1. Colombo, Thimbirigasyaya, Dehiwala, Moratuwa and Ratmalana in the Administrative District of Colombo.",
              "2. Negombo and Wattala in the Administrative District of Gampaha",
              "3. Panadura, Kalutara and Beruwala in the Administrative District of Kalutara.",
              "4. Bentota, Balapitiya, Ambalangoda, Hikkaduwa, Galle Four Gravets and Habaraduwa in the Administrative District of Galle.",
              "5. Weligama, Matara Four Gravets, Devinuwara and Dikwella in the Administrative District of Matara.",
              "6. Tissamaharama, Hambantota, Ambalantota and Tangalle in the Administrative District of Hambantota.",
              "7. Island  North  (Kayts),  Karaveddi,  Point  Pedro, Chavakachcheri, Karainagar, Maruthenkemy, Thellippalai, and Delft in the Administrative District of Jaffna.",
              "8. Puthukudiyiruppu and Marithempattu in the Administrative District of Mulativu.",
              "9. Kandavalai and Poonakkarai in the Administrative District of Kilinochchi.",
              "10. Koralai  Pattu  Centre,  Chenkaladi,  Valachchenai, Kalavanchikudy, Eravur Town, Manmunai North, Vaharan, Katankudy, Ariyampati, Kiran, Vellaveli, Paddipalai, Vavnativu and Oddamavady in the Administrative District of Batticaloa.",
              "11. Kalmunai,  Sainthamarathu,  Karatevu,  Ninthavur, Addalachchenai, Akkaraipattu, Alayadiwembu, Thirukkovil, Pothuvil and Lahugala in the Administrative District of Ampara.",
              "12. Kuchchaveli,  Trincomalee  Town  and  Gravets, Thambalagamuwa, Kinniya, Muttur, Seruvila and Verugal/ Echchilampattai in the Administrative District of Trincomalee.",
              "13. Wennappuwa in the Administrative District of Puttalam.",
              "SECOND SCHEDULE [Section 3 (2)]",
              "To  : The Grama Niladhari of . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .",
              "A PPLICATION   FOR   ISSUE   OF   A   CERTIFICATE   OF  D EATH   OF   A  M ISSING  P ERSON",
              "1. Full Name of missing person :",
              "2. Sex :",
              "3. Race :",
              "4. Age :",
              "5. Date of Death :",
              "6. Address of last known residence :",
              "7. Address of permanent residence :",
              "8. Rank or profession :",
              "9. Applicants full name :",
              "10. Applicants place of residence and telephone No. :",
              "11. Applicants profession/occupation :",
              "12. Applicants place of employment and telephone No. :",
              "13. Applicants relationship to missing person :",
              "I. . . . . . . . . . . . . . . . . . . . . .. . . . .  of . . . . . . . . . . . . . . . . . . . . . . . .  do hereby state that the said . . . . . . . . . . . . . . . . .  . . (name of person missing) . . . . . . . . . . . . . . . . . . . . . . .  has been missing for a period of over six months and I verily believe that the said . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .. . . . . . . .   is dead and that his death is attributable to the Tsunami.",
              "I therefore request that the death be registered under the Births and Deaths Registration Act (Chapter 110) and a Certificate of Death in respect of such person be issued to me.",
              "Date . . . . . . . . . . . .  . . . . . . . . . . . . . . . . . . . .  . . Signature of Applicant",
              "THIRD SCHEDULE [Section 9(1)]",
              "To  : The Commissioner of Probation and Child Care Services",
              "A PPLICATION   FOR  R EGISTRATION   AS   THE  C URRENT  C USTODIAN   OF   A  C HILD",
              "Details of Applicant",
              "1. Name : 2. Address : 3. Date of birth : 4. Sex : 5. Identity Card No. : 6. Religion : 7. Marital status : 8. If married name of spouse : 9. Profession/Occupation : 10. Applications Relationship to child, if any : 11. Date of taking child into applicants custody : 12. Where and how applicant found child : 13. Are you aware whether parent/parents are alive ? : 14. Have you made any attempt to find the childs parent/ guardian ? : 15. If married, does your spouse agree to your retention of the child as current custodian ? If so please furnish letter of consent",
              "Details of Child",
              "1. Name : 2. Sex : 3. Date of birth, if known : 4. Address, if known : 5. Name of parents if known : 6. Are you aware whether childs parent/parents are surviving ? :",
              "I hereby certify that the above particulars are true to the best of my knowledge.",
              "Date . . . . . . . . . . . .  . . . . . . . . . . . . . . . . . . . .  . . Applicants Signature",
              "FOURTH SCHEDULE [Section 13(1)]",
              "A PPLICATION   FOR   THE   ISSUE   OF   A  F OSTER  C ARE  O RDER",
              "To  : The Magistrates Court of . . . . . . . . . . . . . .",
              "I/we, the undersigned . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  resident at . . . . . . . . . . . . . . . . . . . . . . . . . . . hereby state",
              "1. I/we am/are desirous of being appointed as foster parent/s of a child/young person [Name of child/young person] under section 16 of the Tsunami (Special Provisions) Act, No. 16 of 2005 ; or",
              "2. I/we have not made any other application under the said Act to be appointed as a foster parent ;",
              "and/or",
              "I/we have made an application under the said Act to be appointed as a foster parent and such application is pending before the Magistrates Court of . . . . . . . . . . . . . . . . ;",
              "and/or",
              "I/we have been appointed a foster parent of . . . . . [Name of child/young person] . . . . by the Foster Care Order made on . . . . . . . . . by the Magistrates Court of . . . . . . . . . . . . .",
              "and/or",
              "An adoption order has been made/is pending, by/before the District Court of . . . . . . . . . . . . . . . under the above Act.",
              "3. I/We hereby agree that, if granted foster care of a child/ young person, I/we agree to the following :",
              "( a ) to provide care and protection, exercise, control and discharge the obligations including the provision of education, in respect of the child/young person as if I/ we am/are his/her parent/s ;",
              "( b ) to permit the Monitoring Officer to visit our home or other place at which the child/young person is resident for purposes of discharging his duties under the Act ;",
              "( c ) to undergo such training as may be provided on caring for a child/young person who has been emotionally traumatized ;",
              "( d ) to surrender the custody of the child/young person to a Monitoring Officer, in the event that the Foster Care Order is revoked.",
              "In witness whereof I/we have signed this  application on . . . . . . . . day of . . . . . . . 2005.",
              ". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . Name of Applicant Signature of Applicant",
              ". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . Name of Spouse Signature of Spouse",
              "Date. . . . . . . . . . . . . . . . . Date. . . . . . . . . . . . . . . .",
              "FIFTH SCHEDULE [Section 13 (1)]",
              "I NFORMATION   UNDER   SECTION  13",
              "To : The National Child Protection Authority :",
              "The following information is hereby furnished in terms of section 13 of the Tsunami (Special Provisions) Act, No. ....of 2005 for the purpose of evaluating the suitability of the applicant to be a foster parent.",
              "1. Name : Mr/Mrs/Ms. :",
              "2. Address :",
              "3. Date of Birth d/m/y :",
              "4. Age as at the date of application :",
              "5. Gender: M/F 6. Religion :",
              "7. NIC No. :",
              "8. Marital status : Married/Single/Divorced",
              "9. ( a ) Current employment and monthly salary :",
              "( b ) How long have you been in this employment ? :",
              "( c ) Previous employment, if any :",
              "10. Name of spouse :",
              "11. Date of marriage d/m/y :",
              "12. Date of birth of spouse d/m/y :",
              "13. Current employment and monthly salary :",
              "14. Names of children, if any and their ages :",
              "15. Does your spouse consent to this application being made ? Yes/ No Please attach letter of consent",
              "16. Do you currently have custody of a child affected by the Tsunami ? Yes/No",
              "17. If yes, have you registered yourself as the current custodian? Yes/No",
              "18. If Yes , date and Province of registration and Registration Number :",
              "19. If you are a current custodian, do you wish to apply to be the foster parent of the child who is presently in your custody ? Yes/ No",
              "20. Have you identified the child/young person you wish to foster ? Yes/No",
              "21. (i) If Yes ",
              "( a ) Name of child/young person :",
              "( b ) Present address :",
              "( c ) Age, if known :",
              "( d ) Gender :",
              "( e ) As far as you are aware, does the child/young person have siblings ? :",
              "( f ) If so, are you willing to take the siblings also to your care as a foster parent ? :",
              "( g ) To the best of your knowledge, does the child/young person have a living parent ? :",
              "( h ) If yes, please state address of such parent :",
              "( i ) Does the parent consent to this application ? :",
              "( j ) How long have you known the child/young person ? :",
              "( k ) How did you come to know the child/young person? :",
              "( l ) Are you related to the child/young person ? :",
              "( m ) Did you know the child/ young person before the Tsunami occurred ? :",
              "( n ) Did you know the parents of the child/young person, before the Tsunami occurred ? :",
              "( o ) Do you know whether the parent/s of the child are alive ? :",
              "( p ) If so, please state their known place of residence :",
              "(ii) If No, state",
              "( a ) Do you wish to foster a child or a young person ? child/ young person",
              "( b ) What is the preferred age ? :",
              "( c) What is the preferred gender ? Female/Male",
              "22. If you wish to foster a young person, for how long would you want the Foster Care Order to operate ? One year/Until the young person reaches.........years.",
              "23. Do you or your spouse propose to go overseas for employment during the next one year ? Yes/No",
              "24. Have you been convicted by a court of law ? Yes/No",
              "If yes, please state offence and punishment received :",
              "25. Have you been charged before a court of law ? Yes/No",
              "If yes, state offence :",
              "26. Have you gone before the Mediation Board to settle a dispute ? Yes/No",
              "If yes, please state nature of dispute :",
              "Date : . . . . . . . . . . . . ........................................... Signature  of Applicant",
              "SIXTH SCHEDULE [Section 14(5)]",
              "C RITERIA   FOR   EVALUATING   THE   SUITABILITY   OF   AN   APPLICANT   TO   BE   A   FOSTER   PARENT",
              "1. As far as possible the child should be ",
              "(a) with extended family or known person in preference to persons unknown to the child ;",
              "( b ) within the accustomed environment or community of the child, with minimum relocation ;",
              "( c ) with foster parents who are of the same ethnic and religious group in keeping with the hereditary rights of the child ;",
              "( d ) with foster parents who are of the same cultural and linguistic background as the child ;",
              "( e ) with siblings.",
              "2. A couple shall be preferable. However, a single parent may be considered if it is in the best interests of the child after giving due consideration to all the other criteria set out herein.",
              "3. Difference in age between the foster parent and child should be between 25 to 45 years.",
              "4. Couples should be legally married for a  period of not less than 3 years.",
              "5. The following persons should not be considered as foster parents",
              "( a ) Persons with a history of Alcoholism, substance abuse, physical, mental or emotional impediment that would interfere with the proper upbringing of the child ;",
              "( b ) Persons with a history of maltreatment or who had been a recipient of child protection services during chilhood ;",
              "( c ) Persons who have been convicted of any offence or who have a police record ;",
              "( d ) Persons who plan to  proceed overseas for employment or other reason for a long period of time.",
              "6. The foster family should be a stable family where the applicant-parents demonstrate effective parenting capabilities and marital accord and the absence of domestic violence.",
              "7. A family where there has recently been a death of a child should not be considered unless placement in such a family would be in the best interests of the child after giving due consideration to all the other criteria set out herein.",
              "8. Foster parents should be",
              "( a ) willing to undergo training in caring for a child or young person who has been emotionally traumatized ;",
              "( b ) willing and capable to undergo training in the provision of health and safety responsibilities ;",
              "( c ) agreeable to being interviewed or visited as part of the assessment and monitoring process.",
              "9. The home should",
              "( a ) have adequate space for all family members residing therein ;",
              "( b ) be maintained to a good standard of cleanliness, hygiene and safety, comparable with the age of the child.",
              "10. The foster parents should be able to provide the following",
              "( a ) adequate primary and preventive health care ;",
              "( b ) health care needs that meet the physical, mental, emotional and social development of the child or young person;",
              "( c ) necessary nutrition to achieve the full growth potential of the child or young person.",
              "11. The foster parents should be able to ensure that child is provided adequate education.",
              "12. The foster parents should be willing to provide opportunities for the child or young person to maintain and develop contact with extended family and friends unless such contact is not reasonably practicable or consistent with the childs welfare.",
              "13. The wishes of the child should be given adequate consideration.",
              "14. Consideration shall be given to the desire of the applicant to adopt the child after the  Foster Care period.",
              "The Panel may, in applying the above guidelines, make such inquiries and investigations as may be considered necessary therefor.",
              "SEVENTH SCHEDULE [Section 15 (2)]",
              "D ESIGNATIONS   OF   PERSONS   FROM   AMONG   WHOM   A   MONITORING   OFFICER   SHALL   BE",
              "SELECTED",
              "Probation Officers",
              "Child Rights Promotion Officers",
              "Principals of Schools",
              "Co-ordinators of District Child Protection Committees of the National Child Protection Authority",
              "EIGHTH SCHEDULE [Section 16(1)]",
              "In The Magistrates Court of........................",
              "Case No..................................",
              "F OSTER  C ARE  O RDER   AND  C ONDITIONS",
              "To  : [Name of Foster Parent/Parents] [Address]",
              "1. You are hereby appointed as the Foster Parent/s of [name of child/young person], for a period of one year from the date of this order*/until.................on which date the said [name of young person] will reach...............years.*",
              "or",
              "The Foster Care Order made on..............appointing you as the Foster Parent/s of [name of child/young person], for a period of one year is hereby renewed for a further period of one year from.................",
              "2. This appointment is subject to the following conditions",
              "( a ) that you provide the foster child/young person with all such care and protection, exercise all such control and discharge all such obligations including the provision of education and any special care that may be needed in view of the emotional trauma suffered by the child/young person, as if you are the natural parent of such child/ young person; and",
              "( b ) that you render all such assistance and co-operation as is required to enable the Monitoring Officer named hereunder, to report on the foster care provided by you and for this purpose to grant him entry into the premises in which the foster child/young person is resident, at any time and to examine any person or inspect any place as may be necessar therefor.",
              "3. In the event that you violate any of the conditions above, the Foster Care Order is liable to be revoked.",
              "4. You are required to hand over the custody of the child/young person to an officer nominated by the National Child Protection Authority-",
              "( a ) if this Order is revoked ;",
              "( b ) upon the expiration of this Order ;",
              "( c ) upon the abatement of this Order.",
              "5. .....................is hereby named as the Monitoring Officer.",
              ". . . . . . . . . . . . . . . . . . . . . . Signature of Magistrate and Seal Date...........................",
              "NINETH SCHEDULE [Section 18(1)]",
              "F OSTER  C ARE  R EPORT",
              "Province :.....................Report for the Period :.....................",
              "Foster Care Order",
              "Date of Order Date of expiration of Order",
              "Names of Parties :",
              "Name of Foster Parent/s .......................",
              "Name of Foster child/young person.....................",
              "Address ........................ ........................ ........................"
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Comment on the following",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "Characteristics of suitability of parent/s and the family :",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "Characteristics of the home environment :",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "Health care :",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "Protection from abuse and neglect :",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "Educational facilities :",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "Skills development :",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "g",
                    "text": "Safeguarding the rights of the child :",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "h",
                    "text": "Maintaining contact with extended family and friends :",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "i",
                    "text": "Special Comments/Observations of the foster child/young",
                    "pre_block_list": [
                      "person :"
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Are the best interests of the child being met ?",
                "pre_block_list": [
                  ". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . Name of Monitoring Officer Signature of Monitoring Officer",
                  "Date . . . . . . . . . . . .",
                  "TENTH SCHEDULE [Section 20(1)]",
                  "R EVOCATION   OF  F OSTER  C ARE  O RDER",
                  "Province...........................",
                  "[Name of Foster Parent/Parents] [Address]",
                  "The Foster Care Order made on [state date of order] appointing you as the foster parent/s of [name of foster child/young person] is hereby revoked with immediate effect.",
                  "You are required to hand over the custody of the said child/young person forthwith to [name of authorized Monitoring Officer]  who is authorized to remove him/her from your custody.",
                  ". . . . . . . . . . . . . . . . . . . . . . . Signature of Magistrate and Seal Date...............................",
                  "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT   P UBLICATIONS  B UREAU , N O . 32, T RANSWORKS  H OUSE ,  L OTUS   R OAD ,  C OLOMBO  01  before  15th  December  each  year  in  respect of the year following."
                ],
                "child_level_list": []
              }
            ]
          }
        ]
      }
    ]
  }
}