{
  "n_pages": 3,
  "title_page": {
    "title": "Excise (Special Provisions) (Amendment) Act",
    "num": "14",
    "year": "2009",
    "date_certified": "2009-03-31",
    "date_published": "2009-04-03",
    "price": 6.0,
    "price_postage": 5.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 31St March, 2009]",
      "L.D.O. 57/2008.",
      "A N  A Ct   To   Amend   The   E Xcise  (S Pecial  P Rovisions ) A Ct , N O . 13  Of  1989",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Excise (Special Provisions) (Amendment) Act, No. 14 of 2009.",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "Section 5 of the Excise (Special Provisions) Act, No. 13 of 1989 is hereby amended in sub-paragraph (iii) of paragraph ( b ) of subsection (2) thereof, by the substitution for the words an amount equal to the total of all taxes, cesses and levies payable in respect of the import of such article, under any written law, of the words, an amount equal to the total of customs duty, surcharge, cesses, port and airport development levy and value added tax",
            "pre_block_list": [
              "",
              "Amendment of section 5 of  the Excise (Special Provisions) Act, No.13 of 1989."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency.",
              "2PL 003766 -4,250 (03/2009)",
              "Excise (Special Provisions)  (Amendment) Act, No. 14 of 2009 2",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , D EPARTMENT   OF G OVERNMENT  I NFORMATION , N O . 163, K IRULAPONA  M AWATHA , P OLHENGODA , C OLOMBO  05 before 15th December each year in respect of the year following ."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}