{
  "n_pages": 21,
  "title_page": {
    "title": "Goods  And  Services  Tax  (Amendment) Act",
    "num": "26",
    "year": "2000",
    "date_certified": "2000-07-13",
    "date_published": "2000-07-14",
    "price": 13.5,
    "price_postage": 5.25
  },
  "body_pages": {
    "preamble": [
      "Goods And Services Tax (Amendment) Act, No. 26 Of 2000 1",
      "[Certified On 13Th July, 2000]",
      "L.D.O. 7/2000.",
      "A N  A Ct   To   Amend   The  G Oods   And  S Ervices  T Ax A Ct , N O . 34  Of  1996",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Goods and Services Tax (Amendment) Act, No. 26 of 2000.",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "Section 2 of the Goods and Services Tax, Act, No. 34 of 1996 amended by Act, No. 11 of 1998 (hereinafter referred to as the principal enactment) is hereby further amended, in the proviso to subsection (3) of that section, by the substitution, for the words goods imported by a registered person who imports goods to be used for the purpose of manufacture and exports the goods so manufactured, of the following words :",
            "pre_block_list": [
              "Amendment of section 2 of Act No. 34 of 1996.",
              "goods imported by a registered person who imports such goods to be used by such person for the purpose of manufacture and exports the goods so manufactured;"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "Section 3 of the principal enactment is hereby repealed and the following section substituted therefor :",
            "pre_block_list": [
              "Replacement of section 3 of the principal enactment.",
              "3. Notwithstanding the provisions of section 2, the tax shall not be charged on the whole sale or retail supply of goods, other than on the whole sale or retail supply of goods, by a",
              "Tax not be charged on whole sale or retail supply of goods."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "manufacturer of such goods ; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "importer of such goods ; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "person who is unable to satisfy the Commissioner-General as to the source from which the goods supplied by him were acquired",
                "pre_block_list": [
                  "",
                  "2H 0065277,075 (00/04)",
                  "Goods and Services Tax (Amendment) Act, No. 26 of 2000 2"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "Section 5 of the principal enactment amended by Act No. 11 of 1998 is hereby further amended as follows :",
            "pre_block_list": [
              "Amendment of section 5 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "in subsection (8) of that section, by the substitution, for the words shall not be less than the open market value, of the following :",
                "pre_block_list": [
                  "shall not be less than the open market value :",
                  "Provided however in the case of a hire purchase agreement"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "where the cash price includes the tax charged on the seller of such goods by the supplier on which the seller cannot claim input credit, the cash price and the market value shall be adjusted by deducting the tax so charged on the seller ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "under which second hand goods, which have been in circulation for a period over one year, are supplied, the cash price and the market value of such goods shall be the value specified in the hire purchase agreement less any charge made for such hire purchase facility included in such agreement.;",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the repeal of subsection (9) of that section, and the substitution therefor, of the following subsection :",
                "pre_block_list": [
                  "(9) The value of supply of land and improvements thereon, shall be the value of such supply less the value of the land at the time of supply and the value of any improvements on the land as at March 31, 1998 which shall not be less than the open market value of  such supply excluding the value of such land at the time of supply and the value of any improvements on such land as at March 31, 1998.;",
                  "Goods and Services Tax (Amendment) Act, No. 26 of 2000 3"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "by the repeal of subsection (11) of that section, and the substitution therefor of the following subsection :",
                "pre_block_list": [
                  "(11) The value of a supply, under any non- reviewable agreement not being a hire purchase agreement entered into prior to the appointed date, shall be the total amount payable or paid under such agreement for any taxable period and shall be considered as a tax inclusive consideration",
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "Section 7 of the principal enactment amended by Act No. 11 of 1998 is hereby further amended in subsection (1) of that section as follows :",
            "pre_block_list": [
              "Amendment of section 7 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "by the repeal of paragraph ( a ) of that subsection and the substitution therefor of the following :",
                "pre_block_list": [
                  "( a ) goods shall be zero rated where the person supplying the goods has exported such goods ;;"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "in paragraph ( b ) of that subsection",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "i",
                    "text": "by the substitution in subparagraph (ii) of that paragraph for the words for the purpose of re-export, of the words for the purpose of re-export  and;;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "by the substitution in paragraph (iii) of that paragraph for the words for use outside Sri Lanka ; and of the words for use out side Sri Lanka; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iii",
                    "text": "by the repeal of subparagraph (iv) of that paragraph ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "by the addition at the end of paragraph ( b ) of that subsection of the following paragraph :",
                "pre_block_list": [
                  "( c ) such services relating to international transportation (including trans-shipment) of goods or passengers as are specified by the Commissioner-General by Notification published in the Gazette, shall be zero rated",
                  "",
                  "Goods and Services Tax (Amendment) Act, No. 26 of 2000 4"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "Section 10 of the principal enactment amended by Act, No. 11 of 1998 is hereby further amended in subsection (2) of that section, by the substitution, for all the words from date on which he becomes so liable.",
            "pre_block_list": [
              "Amendment of section 10 of the principal enactment.",
              "For the purpose to the end of that section of the following :",
              "date on which he becomes so liable.",
              "For the purposes of this section the total value of taxable supplies shall not include the supplies of any whole sale or retail trading activity excluded from the payment of tax under section 3",
              ""
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "Section 12 of the principal enactment is hereby amended by the substitution for the words specified form for registration under this Act of the words specified form for registration under this Act :",
            "pre_block_list": [
              "Amendment of section 12 of the principal enactment.",
              "Provided, however, the Commissioner-General may, after affording the applicant an opportunity of being heard, and having regard to the nature of the business carried on or carried out by such applicant,  the value of the taxable supplies made by such applicant in the two preceding taxable periods and the probability that the value of his taxable supplies will not exceed the value referred to in section 10, refuse to register such applicant",
              ""
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "Section 13 of the principal enactment as amended by Act, No. 11 of 1998 is hereby repealed and the following section substituted therefor :",
            "pre_block_list": [
              "Replacement of section 13 of the principal enactment.",
              "13. Where any person",
              "Registered person."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "makes an application for registration under section 10 or is deemed to be registered under section 75; or",
                "pre_block_list": [
                  "Goods and Services Tax (Amendment) Act, No. 26 of 2000 5"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "makes an application for registration under section 12 and such application has not been refused by the Commissioner-General; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "has not made an application for registration, but the Commissioner- General is of opinion having regard to the nature of the activities carried on or carried out by him that such person is liable to be registered under this Act, and after affording such person an opportunity of being heard,",
                "pre_block_list": [
                  "the Commissioner-General shall register such person with effect from such date as may be determined by him",
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "The following new section is hereby inserted immediately after section 15 of the principal enactment and shall have effect as section 15 A  of that enactment :",
            "pre_block_list": [
              "Insertion of new section 15 A  in the principal enactment.",
              "15 A . (1) Every person who is registered under section 13 and to whom a tax registration number has been issued under subsection (1) of section 15 shall display such tax registration number in legible writing on every name board displaying the name, address and the taxable activity carried on or carried out by such person.",
              "Registered person to display tax registration number."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where any person fails to comply with the requirement of subsection (1) the Commissioner-General may",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "impose on such person a penalty of a sum not exceeding fifty thousand rupees and give notice in writing to such person of the imposition of such penalty ;",
                    "pre_block_list": [
                      "Goods and Services Tax (Amendment) Act, No. 26 of 2000 6"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "by notice in writing require such person to",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "pay such penalty; and",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "comply with the requirements of subsection (1) within such period as may be specified in such notice.",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Commissioner-General may, reduce or annul any penalty imposed by him on any person under paragraph ( a ) of subsection (2), if such person proves to the satisfaction of the Commissioner-General that his failure to comply with the requirements of subsection (1) was due to circumstances beyond his control and that he has subsequently complied with such requirements",
                "pre_block_list": [
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "10",
            "text": "Section 16 of the principal enactment amended by Act No. 11 of 1998 is hereby further amended as follows :",
            "pre_block_list": [
              "Amendment of section 16 of the principal enactment.",
              "( a ) in subsection (1) of that section, by the substitution, for the words a period of twenty four months, of the words a period of twelve months;",
              "( b ) by  the repeal of subsection (2) of that section, and the substitution therefor of the following :"
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Commissioner-General",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "shall on receipt of an application made under subsection (1);",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "may at any time,",
                    "pre_block_list": [
                      "and upon being satisfied that the applicant or any registered person as the case may be, has ceased to carry on or carry out a taxable activity or that the total value of his taxable supplies does not exceed",
                      "Goods and Services Tax (Amendment) Act, No. 26 of 2000 7",
                      "the value referred to in section 10, or that facilities under the Customs Ordinance in respect of him have been suspended by the Director-General of Customs or that the continuation of such registration may impede the protection of revenue cancel his registration",
                      ""
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "11",
            "text": "Section 17 of the principal enactment is hereby amended in paragraph ( b ) of subsection (1) of that section by the substitution for the words the certificate of registration or a copy thereof; and of the words the certificate of registration or a copy thereof or indicate the tax registration number in the manner provided for in section  15 A .",
            "pre_block_list": [
              "Amendment of section 17 of  the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "12",
            "text": "Section 20 of the principal enactment as amended by Act No. 11 of 1998 is hereby further amended in subsection (6) of that section by the substitution for all the words from Notwithstanding the provision of section 2 to tax invoice setting out the following of the following :",
            "pre_block_list": [
              "Amendment of section 20 of  the principal enactment.",
              "Notwithstanding the provisions of subsection (2), where a registered person makes a taxable supply and the value of such supply does not exceed two thousand rupees or makes a whole sale or retail supply of taxable goods or services he may, where the person to whom such taxable supply is made or such whole sale or retail supply is made, as the case may be, does not demand a tax invoice as provided in subsection (2) issue a tax invoice setting out the following",
              ""
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "13",
            "text": "Section 22 of the principal enactment as amended by Act, No. 11 of 1998 is hereby further amended as follows :",
            "pre_block_list": [
              "Amendment of section 22 of  the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the repeal of subsection (3) of that section and by the substitution, therefor of the following :",
                "pre_block_list": [
                  "(3) Where goods or services supplied to a registered person, or goods imported by him, are used or to be used partly for the purposes of a taxable",
                  "Goods and Services Tax (Amendment) Act, No. 26 of 2000 8",
                  "activity carried on or carried out by him on which tax can be levied and partly for other purposes, the tax on such supplies and importations shall be apportioned so however that only so much of the tax on such supplies or importation as is referrable to his taxable activity on which tax can be levied shall be counted as his input tax.;"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "in subsection (4) of that section :",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "i",
                    "text": "by the substitution for the words be refunded and where it is not so refunded of the words be refunded upon application made therefor to the CommissionerGeneral and where it is not so refunded.;",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "by the repeal of the proviso to that subsection and by the subsitution therefor of the following proviso :",
                        "pre_block_list": [
                          "Provided however, that where in a taxable period",
                          "( a ) there is an excess of input tax including the tax deferred under section 2, in the case of  a registered person the value of whose zero rated supplies for that taxable period was more than fifty  per centum , of his total taxable supplies for that taxable period, the excess of the input tax (inclusive of an excess input tax brought forward from a preceding taxable period) ; or",
                          "( b ) any registered person who has obtained a deferment of the tax under section 2 in any taxable period and not made any zero rated supplies or made zero rated supplies of fifty  per centum  or less of his total taxable supplies for such taxable period, the excess of input tax not exceeding the amount of such deferred tax under section 2; or",
                          "Goods and Services Tax (Amendment) Act, No. 26 of 2000 9",
                          "( c ) there is an excess of input tax, in the case of a registered person who has entered into an agreement with the Board of Investment of Sri Lanka, and that taxable period, falls within the period referred to in item (xxvii) or (xxviii) of the Schedule  upto the taxable period, in which the commencement of commercial activities takes place which ever is earlier ; or",
                          "( d ) there is an excess of input tax and that any taxable period falls immediately before the taxable period, in which the making of taxable supplies, commences as undertaken by such person in the case of a person referred to in subsection (6),",
                          "such part of the excess or such excess as the case may be, shall be refunded subject to the provisions of section 58, not later than one month, after the end of the taxable period or from the date of receipt of  the return for such taxable period in which the excess arose, which ever is later :",
                          "Provided further, in case of a registered person who imports goods for re-sale without processing the excess input tax representing the tax paid under subsection (3) of section 2 shall not be refunded.",
                          "In the event of a failure to pay such refund within such period, interest on such refund shall be payable from the date on which the refund becomes due to the date of payment thereof at such rate as may be prescribed under section 59 subject to the provisions of the proviso to that section",
                          "",
                          "Goods and Services Tax (Amendment) Act, No. 26 of 2000 10"
                        ],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "in paragraph (iii) of subsection (5) of that section by the substitution for the words if the supply is not supported by a tax invoice or, of the words if the supply is not supported by a tax invoice received within twelve months from the end of the taxable period in respect of which the tax invoice relates or ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "by the insertion immediately after subsection (7) thereof of the following :",
                "pre_block_list": [
                  "For the purposes of this subsection, any input tax claimed by any person"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "who has not commenced any commercial operation within or on completion of the project implementation period  referred to in item (xxvii) or item (xxviii) as the case may be ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "who has obtained approval under subsection (6) and has not commenced business in making taxable supplies as stated in the undertaking given, by such person prior to the obtaining of such approval,",
                    "pre_block_list": [
                      "shall be deemed to be an excess amount of input tax claimed by such person",
                      ""
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "14",
            "text": "Section 24 of the principal enactment is hereby amended in the proviso to that section by the substitution for the words shall be liable to tax. , of the words",
            "pre_block_list": [
              "Amendment of section 24 of  the principal enactment.",
              "shall be liable to tax :",
              "Provided further that where any amount of tax corresponding to a bad debt has been deducted by any person, the amount so deducted shall be an output tax for the corresponding period of the person in respect of whom the bad debt was incurred if he is a registered person",
              "",
              "Goods and Services Tax (Amendment) Act, No. 26 of 2000 11"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "15",
            "text": "Section 28 of the principal enactment is hereby amended in subsection (1) of that section by the addition at the end of that subsection of the following :",
            "pre_block_list": [
              "Amendment of section 28 of  the principal enactment.",
              "For the purposes of this section the notice given under this section may refer to one or more taxable periods",
              ""
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "16",
            "text": "Section 30 of the principal enactment is hereby repealed and the following section substituted therefor :",
            "pre_block_list": [
              "Replacement of section 30 of  the principal enactment.",
              "30. Where the Assessor is of opinion that a registered person has made a taxable supply ",
              "Power of Assessor to determine the open market value."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "for a value less than the open market value of such supply or for no value ; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "the transaction in respect of which taxable  supply has been made, is between two associated persons,",
                "pre_block_list": [
                  "in order to avoid payment of tax, he shall determine the open market value of such supply on which tax shall be charged, having regard to the circumstance of the transaction and the time of supply",
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "17",
            "text": "Section 33 of the principal enactment is hereby amended in subsection (1) of that section by the substitution from the words tax in respect of that period to make an additional assessment of the words tax in respect of any period, it shall not be lawful for the Assessor where an assessment",
            "pre_block_list": [
              "Amendment of section 33 of  the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "has not been made to make an assessment ; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "has been made, to make an additional assessment.",
                "pre_block_list": [
                  "Goods and Services Tax (Amendment) Act, No. 26 of 2000 12"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "18",
            "text": "Section 34 of the principal enactment is hereby amended in subsection (5) of that section by the substitution for the words and figures provisions of subsections (1), (2), (3) and (4), of the words and figures provisions of subsections (2), (3) and (4).",
            "pre_block_list": [
              "Amendment of section 34 of  the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "19",
            "text": "Section 75 of the principal enactment as amended by Act, No. 11 of 1998 is hereby further amended by the addition immediately after subsection (4) of that section of the following subsection :",
            "pre_block_list": [
              "Amendment of section 75 of  the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Where the Commissioner-General is satisfied that a registered person or any other person, as the case may be, on or after the appointed date, has paid tax on the acquisition of goods for the purpose of making an exempt supply, the tax so paid by such person shall be deemed to be input tax where such supply has subsequently become a taxable supply and the goods so acquired are being used in making such taxable supply :",
                "pre_block_list": [
                  "Provided however the CommissionerGeneral shall determine the allowable portion of such input tax where the goods so acquired are being used only partly for the purpose of making a taxable supply",
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "20",
            "text": "Section 76 of the principal enactment amended by Act, No 11 of 1998 is hereby further amended as follows :",
            "pre_block_list": [
              "Amendment of section 76 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "in the definition of associated person by the addition immediately after paragraph ( g ) of that definition of the following :",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "h",
                    "text": "any two or more persons carrying on any activity separately or jointly which has resulted in the supply of identical goods or services which cannot be produced by any other person or persons ;.",
                    "pre_block_list": [
                      "Goods and Services Tax (Amendment) Act, No. 26 of 2000 13"
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "in the definition of body of persons by the substitution for the words any undertaking of the Government of Sri Lanka of the words any undertaking of the Government of Sri Lanka or any co-ownership of immovable property ;;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "by the insertion immediately after the definition of company of the following definition :",
                "pre_block_list": [
                  "customs bonded area means "
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "a bonded warehouse approved under section 69 of Customs Ordinance ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "a bonded warehouse approved under section 84 A of Customs Ordinance ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "a warehouse of the Republic as defined in section 167 of Customs Ordinance ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "a Free Trade Zone declared by the Board of Investment of Sri Lanka which is subject to monitoring by the Department of Customs ;;",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "by the insertion immediately after the definition of Deputy Commissioner of the following definitions :",
                "pre_block_list": [
                  "educational establishment means "
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "a higher educational institution established under the Universities Act, No. 16 of 1978 or the Buddhist and Pali University ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "any recognized Institution providing vocational training or re-training for persons engaged in any trade, profession or employment and includes an incorporated examination body;;",
                    "pre_block_list": [
                      "Goods and Services Tax (Amendment) Act, No. 26 of 2000 14",
                      "educational services means the  provision of services by any educational establishment in relation to education vocational, training or retraining ;;"
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "in the definition of importation, by the substitution for the words customs bonded warehouse of the words customs bonded area;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "in the definition of input tax by the substitution for the words tax paid on the supply of the words tax paid by him on the supply;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "by the repeal of the definition of supply of goods and the substitution of the following definition therefor :",
                "pre_block_list": [
                  "supply of goods means the passing of exclusive ownership of goods to another as the owner of such goods or under the authority of any written law and includes the sale of goods by public auction, the transfer of goods under a hire purchase agreement, the sale of goods in satisfaction of a debt and the transfer of goods from a taxable activity to a non- taxable activity;;"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "8",
                "text": "in the definition of supply of services by the substitution for the words not a supply of goods of the words not a supply of goods but includes any loss incurred in a taxable activity for which an indemnity is due;.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "9",
                "text": "in paragraph ( d ) of the definition of taxable activity by the substitution for the words of any immovable property of the words of any immovable property or the administration of any property ;;.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "21",
            "text": "The Schedule to the principal enactment as amended by Act No. 11 of 1998 is hereby further amended as  follows :",
            "pre_block_list": [
              "Amendment of the Schedule to the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "in item (i) of that Schedule by the substitution for the words unprocessed produce of any agricultural, horticultural, animal husbandry, poultry or fishing",
                "pre_block_list": [
                  "Goods and Services Tax (Amendment) Act, No. 26 of 2000 15",
                  "undertaking; of the words unprocessed produce of any agricultural, horticultural, animal husbandry, poultry (not being meat of any kind) or fishing undertaking;;"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the repeal of item (v) of that Schedule and the substitution therefor of the following item :",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "v",
                    "text": "The supply or import of milk including powdered or condensedmilk other than any other article manufactured or produced from such milk ;;",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "in item (vii) of that Schedule by the substitution for the words ayurvedic, siddha, unani or homeopathic preparations of the words ayurvedic, siddha, unani or homeopathic preparations not being cosmetic preparations ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "by the repeal of item (viii) of that Schedule, and the substitution therefor of the following item :",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "viii",
                    "text": "The supply of educational services by an educational establishment  or Government Schools or Schools funded by the Government ;;",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "in item (xii) of that Schedule by the substitution for the words liquid petroleum, gas, of the words liquid petroleum gas in a cylinder which has a capacity not exceeding 15 kg,;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "by the repeal of item (xiii) of that Schedule and the substitution therefor of the following item :",
                "pre_block_list": [
                  "(xiii) The supply of public library services by the Government, a Provincial Council or a local authority ;;"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "in item (xvi) of that Schedule by the repeal of paragraph ( i ) of that item and the substitution therefor of the following paragraph :",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "i",
                    "text": "life insurance, Agrahara Insurance and crop and livestock insurance ;;",
                    "pre_block_list": [
                      "Goods and Services Tax (Amendment) Act, No. 26 of 2000 16"
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "8",
                "text": "in item (xxi) of that Schedule by the substitution for the words for the relief of distress caused by natural or other disaster, of the words  or supply of goods directly funded by foreign organisations, for the relief of distress caused by natural or other disasters or similar cause or for religious or charitable purposes ;;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "9",
                "text": "by the repeal of item (xxiii) of that Schedule and the substitution therefor of the following item :",
                "pre_block_list": [
                  "(xxiii) The supply of public passenger transport services (other than air or water transport or transport of tourists by way of excursion tours or taxi services) or import or supply of a motor coach with seating capacity not less than thirty passenger seats or a chassis or body of such motor coach to be used in such public passenger transport service including the provision of leasing facilities for such motor coaches ;;"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "10",
                "text": "in item (xxiv) of that Schedule by the substitution for the words exclusively for agricultural work; of the words exclusively for agricultural work including accessories and parts for such tractors;.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "11",
                "text": "by the repeal of item (xxx) of that Schedule and the substitution therefor of the following :",
                "pre_block_list": [
                  "(xxx) The supply of goods at a restaurant situated beyond the immigration counter at the Bandaranaike International Airport ;"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "12",
                "text": "by the repeal of item (xxxiii) of that Schedule ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "13",
                "text": "in item (xxxv) of that Schedule by the substitution for the words hotel accommodation to tourists of the words hotel accommodation to foreign tourists who are domiciled outside Sri Lanka;",
                "pre_block_list": [
                  "Goods and Services Tax (Amendment) Act, No. 26 of 2000 17"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "14",
                "text": "in item (xxxviii) of that Schedule by the substitution for the words for the provision of Health Services. of the words for the provision Health Services ;;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "15",
                "text": "by the addition immediately after item (xxxviii) of that Schedule of the following items :",
                "pre_block_list": [
                  "(xxxix) The supply or import of artificial limbs, crutches, hearing aids, accessories for such aids or other appliances which are worn or carried or implanted in the human body to compensate for a defect or disability with effect from such respective dates as are determined by the Director-General of Customs ;",
                  "(x L ) The supply or import of wheel chairs, prepared culture media for development of micro organisms, diagnostic or laboratory reagents, surgical gloves, contact lenses, X- ray tubes, white canes for the blind and Braille Typewriters and parts with effect from such respective dates as are determind by the Director-General of Customs;",
                  "(x L i) The supply of services in relation to the fees collected by the Sri Lanka Bureau of Foreign Employment from prospective migrants as provided for in the Gazette dated September 01, 1995 ;",
                  "(x L ii) The supply of services in relation to burials and cremations"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "by the Government, a Provincial Counil or a local Authority ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "by any person,",
                    "pre_block_list": [
                      "(x L iii) The supply of free or subsidised meals by an employer to his employees at their places of work ;",
                      "Goods and Services Tax (Amendment) Act, No. 26 of 2000 18",
                      "(x L iv) The supply of transport free or at a subsidised rate by an employer to his employees using a vehicle on which the input tax has been disallowed or a motor coach provided by an employer to transport employees to and from their homes and their places of work",
                      ""
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "22",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The amendments made to sections 2, 5, 7, 20 subsections (3) and (7) of section 22, section 30 and section 33, section 34 and section 76 of the principal enactment by section 2, 4 (3), 5, 12, section 13 (1), section 13 (3) section 16, section 17, section 18, section 20 (6) and section 20 (7) of this Act shall be deemed for all purposes to have come into force on April 1, 1998.",
                "pre_block_list": [
                  "Retrospective effect."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The amendments made to subsection (4) of section 22 and section 28 of the principal enactment by section 13(2) and section 15 of this Act, shall be deemed for all purposes to have come into force on April 1, 2000.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "The amendments made to items (vii) (xvi), (xxi), (xxxv) of the Schedule by section 21(4), section 21(7), section 21(8) and section 21(13) shall be deemed for all purposes to have come into force on April 1, 1998 ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the addition of items (x L ii) ( a ) and (x L iv) in the Schedule by section 21(15) shall be deemed for all purposes to have come into force on April 1, 1998 ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "the addition of item (x L iv) in the Schedule by section 21(15) of this Act shall be deemed for all purposes to have come into force on April 1, 1998 ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "the addition of item (x L i) in the Schedule by section 21(15) of this Act shall be deemed to have come into force on September 15, 1998 ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "the addition of item (x L iii) in the Schedule by section 21(15) of this Act shall be deemed for all purposes to have come into force on April 1, 1999 ;",
                    "pre_block_list": [
                      "Goods and Services Tax (Amendment) Act, No. 26 of 2000 19"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "the amendments made to items (i), (xiii), (xxxiii) in the Schedule by sections 21(1), 21(6), 21(12) of this Act shall be deemed for all purposes to have come into force on February 15, 2000 ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "g",
                    "text": "the addition of item (x L ii) ( b ) in the Schedule by section 21(15) shall be deemed for all purposes to have come into force on February 15, 2000.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Notwithstanding the preceding provisions of this section, on prosecution shall be instituted under the principal enactment for any contravention or non-compliance with the provisions of sectons 2, 5, 7, 20, 22(3), 22(4), 22(7), 28, 30, 33, 34 and 76 and items (i), (vii), (xiii), (xvi), (xxi), (xxxiii), (xxxv), (x L i) (x L ii) ( a ), (x L iii), (x L iv) of the Schedule, of the principal enactment as amended by this Act, in so far as such contravention or non-compliance relates to a period prior to the date on which this Act is certified as an Act of Parliament.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "23",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail. text shall in case of stency.",
            "pre_block_list": [
              "Goods and Services Tax (Amendment) Act, No. 26 of 2000 20",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180(Foreign), payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , N O . 32, T RANSWORKS  H OUSE , L OTUS  R OAD , C OLOMBO  01 before 15th December each year in respect of the year following."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}