{
  "n_pages": 3,
  "title_page": {
    "title": "Penal Code (Amendment)  Act",
    "num": "25",
    "year": "2021",
    "date_certified": "2021-10-26",
    "date_published": "2021-10-29",
    "price": 5.0,
    "price_postage": 15.0
  },
  "body_pages": {
    "preamble": [
      "(Certified On 26Th Of October, 2021)",
      "L.D.O. 12/2021",
      "A N  A Ct   To   Amend   The  P Enal  C Ode  (C Hapter  19)",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :"
    ],
    "pre_section_list": [
      {
        "class_name": "ActL1Section",
        "num": "1",
        "text": "This Act may be cited as the Penal Code (Amendment) Act, No. 25 of 2021.",
        "pre_block_list": [
          "Short title"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "2",
        "text": "Section 53 of the Penal Code (Chapter 19) is hereby repealed and the following section is substituted therefor:",
        "pre_block_list": [
          "Replacement of section 53 of Chapter 19",
          "53. (1) Sentence of death shall not be pronounced on or recorded against any person who, is under the age of eighteen years, at the time of the commission of an offence by such person.",
          "Punishment of detention in lieu of death for persons under eighteen years of age"
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "The court shall, in lieu of sentencing such person to death, sentence him to be detained in an institution established under any written law for the detention of persons under the age of eighteen years, for a period specified in the sentence and subject to the provisions of such written law",
            "pre_block_list": [
              ""
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "3",
        "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
        "pre_block_list": [
          "Sinhala text to prevail in case of inconsistency",
          "Penal Code (Amendment) Act, No. 25 of 2021 2",
          "English Acts of the Parliament can be purchased at the P RAKASHANA  P IYASA , D EPARTMENT   OF G OVERNMENT  P RINTING , N O . 118, D R . D ANISTER  D E  S ILVA  M AWATHA , C OLOMBO  8."
        ],
        "child_level_list": []
      }
    ],
    "part_list": []
  }
}