{
  "n_pages": 5,
  "title_page": {
    "title": "Petroleum  Products  (Special  Provisions)   Act",
    "num": "33",
    "year": "2002",
    "date_certified": "2002-12-17",
    "date_published": "2002-12-20",
    "price": 5.5,
    "price_postage": 4.5
  },
  "body_pages": {
    "preamble": [
      "[Certified On 17Th December, 2002]",
      "L.D.O. 51/2002.",
      "A N  A Ct   To   Provide   For   An   Alternate   Procedure   For   The   Import ,",
      "Export ,  Sale ,  Supply   And   Distribution   Of   Petroleum  ;  To",
      "Vest   Certain   Powers   In   The   Energy   Supply   Committee  ;  And",
      "To   Provide   For   Matters   Connected   Therewith   Or   Incidental",
      "Thereto",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Petroleum Products (Special Provisions) Act, No. 33  of 2002 and shall come into operation on such date as the Minister may by Order published in the Gazette appoint, (hereinafter referred to as the appointed date).",
            "pre_block_list": [
              "Short title and date of operation."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "The provisions of this Act shall operate in addition to and not in derogation of the powers vested in the Ceylon Petroleum Corporation.",
            "pre_block_list": [
              "Powers of the Ceylon Petroleum Corporation not derogated from."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "The Energy Supply Committee shall in relation to this Act, exercise, perform and discharge  the powers, duties and functions hereinafter set out.",
            "pre_block_list": [
              "Energy Supply Committee to be vested with powers under this Act."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "Notwithstanding anything contained in the provisions of section 5K of the Ceylon Petroleum Corporation Act, the provisions of sections 5B, 5C, 5E, 5F, 5G, 5I and 5J of that Act, shall not apply in respect of the powers conferred on or assigned to the Energy Supply Committee by the succeeding provisions of this Act.",
            "pre_block_list": [
              "Certain provisions of the Ceylon Petroleum Corporation Act, not to apply to the Energy Supply of Committee."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Minister may, taking into consideration the requirements of the petroleum sector and the interests of the national economy, on the recommendation of the Energy Supply Committee, grant a licence to any person or body of persons, to import, export, sell, supply or distribute petroleum.",
                "pre_block_list": [
                  "Grant of licence to import, export, &c,. petroleum.",
                  "2H 168095,650 (2002/08)"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The grant of a licence in terms of subsection (1) shall be subject to such conditions as may be prescribed by the Minister on the advice of the Energy Supply Committee for the purpose of ensuring that the import, export, sale, supply or distribution of petroleum would be properly regulated.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The total number of licences issued in terms of this section shall not in the first instance exceed three :",
                "pre_block_list": [
                  "Provided however, that where it appears to the Energy Supply Committee that it is in the interest of the national economy and the needs of the consumers to increase the number of licences granted under this section, it may recommend to the Minister that additional licences be granted to such number of persons as may be necessary taking into consideration the interest of that sector. The Minister may taking into consideration all the related circumstances, increase the number of licences to be granted."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The Ceylon Petroleum Corporation shall be deemed to be a licensee for the purposes of this Act and the provisions of this Act shall accordingly be read and construed as being applicable to such Corporation.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "In granting a licence for the distribution of petroleum in terms of section 5, the Minister in charge of the subject of Power and Energy shall consult the Minister in charge of the subject of Economic Reforms in order to ascertain the viability of engaging, on the premises used for such distribution, in any prescribed activity.",
                "pre_block_list": [
                  "Granting of a licence for distribution of petroleum."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Prescribed activity shall be such activities as may from time to time, be prescribed by regulation. The special conditions, which will govern the prescribed activities, shall also be prescribed.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The licence granted for the distribution of petroleum in terms of this Act, shall contain in addition to the other conditions applicable to a licence for distribution, special conditions which will govern the activities connected with the distribution and such other prescribed activity.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The prescribed activity shall be carried out in accordance with the requirements specified in any written law for the time being in force in relation to construction, planning and safety.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Minister may make regulations for the purpose of carrying out and giving effect to the principles and provisions of this Act.",
                "pre_block_list": [
                  "Regulations."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every regulation made by the Minister under subsection (1) shall be published in the Gazette and shall come into operation on the date of such publication or on such later date as may be specified in the regulation.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every regulation made by the Minister  under subsection (1) shall as soon as convenient after its publication in the Gazette be brought before Parliament for approval. Any regulation which is not so approved shall be deemed to be rescinded as from the date of such disapproval but without prejudice to anything previously done thereunder.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Notification of the date of which a regulation is deemed to be rescinded shall be published in the Gazette.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "In this Act, unless the context otherwise requires",
            "pre_block_list": [
              "Interpretation.",
              "Ceylon Petroleum Corporation means the Ceylon Petroleum Corporation established in terms of the provisions of section 2 of the Ceylon Petroleum Corporation Act, No. 28 of 1961 ;",
              "Energy Supply Committee means the Energy Supply Committee established in terms of the provisions of section 2 of the Energy Supply (Special Provisions) Act, No. 2 of 2002 ;",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180(Foreign), payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , N O . 32, T RANSWORKS  H OUSE , L OTUS  R OAD , C OLOMBO  01 before 15th December each year in respect of the year following."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}