{
  "n_pages": 8,
  "title_page": {
    "title": "Institute Of Fundamental Studies, Sri Lanka (Amendment) Act",
    "num": "25",
    "year": "2014",
    "date_certified": "2014-08-08",
    "date_published": "2014-08-08",
    "price": 11.0,
    "price_postage": 20.0
  },
  "body_pages": {
    "preamble": [
      "Institute Of Fundamental Studies, Sri Lanka (Amendment) Act, No. 25 Of 2014 1",
      "[Certified On 08Th August, 2014]",
      "L.D.O. 50/2011.",
      "A N  A Ct   To   Amend   The  I Nstitute   Of  F Undamental S Tudies , S Ri  L Anka  A Ct , N O . 55  Of  1981",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:"
    ],
    "pre_section_list": [
      {
        "class_name": "ActL1Section",
        "num": "1",
        "text": "This Act may be cited as the Institute of Fundamental Studies, Sri Lanka (Amendment) Act, No. 25 of 2014.",
        "pre_block_list": [
          "Short title."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "2",
        "text": "The Long Title to the Institute of Fundamental Studies, Sri Lanka Act, No. 55 of 1981, (hereinafter referred to as the principal enactment) is hereby amended by the substitution, for the words AN INSTITUTE OF FUNDAMENTAL STUDIES of the words A NATIONAL INSTITUTE OF FUNDAMENTAL STUDIES.",
        "pre_block_list": [
          "Amendment of Long Title to Act, No.55 of 1981."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "3",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "In the principal enactment and in any other written law there shall be substituted for the words Institute of Fundamental Studies, Sri Lanka and Institute of Fundamental Studies of the words National Institute of Fundamental Studies, Sri Lanka.",
            "pre_block_list": [
              "Amendment to the principal enactment and written law."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "Every reference to the Institute of Fundamental Studies, Sri Lanka or Institute of Fundamental Studies denoting the Institute of Fundamental Studies, Sri Lanka in any notice, contract, communication or other document shall be read and construed as a reference to the National Institute of Fundamental Studies, Sri Lanka.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "4",
        "text": "Section 3 of the principal enactment is hereby amended as follows:",
        "pre_block_list": [
          "Amendment of section 3 of the principal enactment."
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "by the insertion immediately after paragraph ( a ) of that section, of the following paragraph:",
            "pre_block_list": [
              "( aa ) to collabrate with public and private institutions as may be necessary to further",
              "Institute of Fundamental Studies, Sri Lanka (Amendment) Act, No. 25 of 2014 2",
              "develop applications relevant to the studies conducted in relation to paragraph ( a );"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "by the insertion, immediately after paragraph ( d ) of that section of the following:",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "provide training, guidance and assistance for research leading to the award of post graduate degrees by institutions recognized by the University Grants Commission established by the Universities Act, No.16 of 1978.;",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "by re-lettering of paragraph ( e ) as paragraph ( f ) of that section.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "5",
        "text": "The section 6 of the principal enactment is hereby repealed and the following new section is substituted therefor:",
        "pre_block_list": [
          "Replacement of section 6 of the principal enactment."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "6",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "The administration, management and control of the affairs of the Institute shall be vested in the Board of Governors (hereinafter referred to as the Board)  which shall consist of:",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "the following  ex-officio  members, namely:",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "i",
                    "text": "the Advisor to the President on Scientific Affairs;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "the Chairman of the University Grants Commission; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iii",
                    "text": "the Director of the Institutie;",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "the following appointed members:",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "i",
                    "text": "four perosns appointed by the President for a period of three years, from among persons who are specially qualified in relation to the",
                    "pre_block_list": [
                      "Institute of Fundamental Studies, Sri Lanka (Amendment) Act, No. 25 of 2014 3",
                      "work of the Institute and one of whom shall be appointed by the President as the Chairman of the Board; and"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "two persons appointed by the Minister for a period of three years from among persons, who are specially qualified in relation to the work of the Institute; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "two persons elected from among its members by the Research Council, for a period of three years or until he ceases to be a member of the Research Council, whichever date is earlier (hereinafter referred to as the Council members).",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "An appointed member or a Council member vacating office after a period of three years from his date of appointment shall be eligible for re-appointment, unless removed on disciplinary grounds.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "A member appointed by the President may, at any time resign his office by a letter addressed to the President and such resignation shall take effect on the date on which it is accepted by the President.",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "A member appointed by the Minister or a Council member may, at any time resign his office by a letter addressed to the Minister and such resignation shall take effect on the date on which it is accepted by the Minister.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "4",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "The President may, for reasons assigned remove a member appointed by him.",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "A member appointed by the Minister or a Council member may be removed by the Minister for reasons assigned.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "5",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "A vacancy occurring as a result of a member appointed by the President vacating office by death, resignation or removal shall be filled by the President having regard to the provisions of subsection (1).",
                "pre_block_list": [
                  "Institute of Fundamental Studies, Sri Lanka (Amendment) Act, No. 25 of 2014 4"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "A vacancy occurring as a result of a member appointed by the Minister vacating office by death, resignation or removal shall be filled by the Minister having regard to the provisions of subsection (1).",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iii",
                    "text": "Any person appointed to fill a vacancy shall hold office for the unexpired period of the term of office whom he succeeds.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "6",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "Where a member appointed by the President is, by reason of illness, infirmity or absence from Sri Lanka, for a period of not less than three months, termporarily unable to perform the duties of his office, he shall inform the President in writing such inability and the President may appoint another person to act in his place during the period of his absence.",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "Where a member appointed by the Minister is, by reason of illness, infirmity or absence from Sri Lanka, for a period of not less than three months, termporarily unable to perform the duties of his office, he shall inform the Minister in writing such inability and the Minister may appoint another person to act in his place during the period of his absence.",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iii",
                    "text": "Where a Council member is, by reason of illness, infirmity or absence from Sri Lanka, for a period of not less than three months, termporarily unable to perform the duties of his office, he shall inform the Minister in writing such inability and the Minister may upon the recommendation of the Research Council appoint another person to act in his place during the period of his absence",
                    "pre_block_list": [
                      "",
                      "6. Section 7 of the principal enactment is hereby amended by the repeal of subsection (1) thereof and substitution therefor of the following:",
                      "Amendment of section 7 of the principal enactment.",
                      "(1) The Chairman shall preside at every meeting of the Board. Where the Chairman is absent from any meeting the",
                      "Institute of Fundamental Studies, Sri Lanka (Amendment) Act, No. 25 of 2014 5",
                      "members present shall elect a Chairman for that meeting from among themselves",
                      ""
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "7",
        "text": "Section 11 of the principal enactment is hereby amended by the repeal of  paragraph ( b ) thereof and substitution therefor of the following:",
        "pre_block_list": [
          "Amendment of section 11 of the principal enactment."
        ],
        "child_level_list": [
          {
            "class_name": "ActL3Paragraph",
            "num": "b",
            "text": "elect two members for appointment by the Minister to the Board and recommend the removal of any such member to the Minister ;.",
            "pre_block_list": [
              "Amendment of section 44 of the principal enactment."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "8",
        "text": "Section 44 of the principal enactment is hereby amended by the repeal of the definitions of the expressions of Leader of the Opposition and Prime Minister respectively.",
        "pre_block_list": [],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "9",
        "text": "For the avoidnace of doubts it is hereby declared that the National Institute of Fundamental Studies, Sri Lanka established by this Act, shall for all purposes be deemed to be the successor to the Institute of Fundamental Studies, Sri Lanka established under section 2 of the principal enactment, and accordingly",
        "pre_block_list": [
          "Savings."
        ],
        "child_level_list": [
          {
            "class_name": "ActL3Paragraph",
            "num": "a",
            "text": "all contracts and agreements entered into, by the Institute of Fundamental Studies, Sri Lanka;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "b",
            "text": "all suits, actions, appeals and other legal proceedings instituted by or against the Institute of Fundamental Studies, Sri Lanka;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "c",
            "text": "all judgments and orders made in favour or against the Institute of Fundamental Studies, Sri Lanka;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "d",
            "text": "all other rights, liabilities and obligations of the Institute of Fundamental Studies, Sri Lanka in existence as at the date of coming into operation of this Act; and",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "e",
            "text": "all properties movable or immovable, owned by the Institute of Fundamental Studies, Sri Lanka and",
            "pre_block_list": [
              "Institute of Fundamental Studies, Sri Lanka (Amendment) Act, No. 25 of 2014 6",
              "used for the purposes of the same on the day immediately preceding the relevant date,",
              "shall be continued, enforced and carried out by the National Institute of Fundamental Studies, Sri Lanka."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "10",
        "text": "In the event of any  inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
        "pre_block_list": [
          "Sinhala text to prevail in case of inconsistency.",
          "Institute of Fundamental Studies, Sri Lanka (Amendment) Act, No. 25 of 2014 7",
          "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , D EPARTMENT   OF G OVERNMENT  I NFORMATION , N O . 163, K IRULAPONA  M AWATHA , P OLHENGODA , C OLOMBO  05 before 15th December each year in respect of the year following ."
        ],
        "child_level_list": []
      }
    ],
    "part_list": []
  }
}