{
  "n_pages": 4,
  "title_page": {
    "title": "Act",
    "num": "12",
    "year": "2018",
    "date_certified": "2018-05-21",
    "date_published": "2018-05-25",
    "price": 4.0,
    "price_postage": 10.0
  },
  "body_pages": {
    "preamble": [
      "Civil Aviation (Amendment) Act, No. 12 Of 2018 1",
      "[Certified On 21St Of May, 2018]",
      "L.D.O. 7/2017",
      "A N  A Ct   To   Amend   The  C Ivil  A Viation  A Ct , N O . 14  Of  2010",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka  As Follows:"
    ],
    "pre_section_list": [
      {
        "class_name": "ActL1Section",
        "num": "1",
        "text": "This Act may be cited as the Civil Aviation (Amendment) Act, No. 12 of 2018.",
        "pre_block_list": [
          "Short title."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "2",
        "text": "The following new section is hereby inserted immediately after section 18, of the Civil Aviation Act, No. 14 of 2010 and shall have effect as section 18 A  of that enactment:",
        "pre_block_list": [
          "Insertion of new section 18 A  in the Civil Aviation Act, No. 14 of 2010.",
          "18 A . (1) Every person who is found by an employee providing Aviation Security Services of the Service Provider appointed under subsection (3) of section 6 or a police officer on duty, to be within the premises of the aerodrome without being duly authorized to do so and touting for any incoming or outgoing passenger, shall be guilty of an offence and may be arrested by the police officer or apprehended and handed over by the employee providing Aviation Security Services of the Service Provider to the police officer, as the case may be:",
          "Offence of touting within an aerodrome.",
          "Provided however, rendering any service such as arranging transport, accommodation, loading or unloading any baggage or other articles into or from any vehicle for any incoming or outgoing passenger by any member of the family or friend of such passenger or being authorized in that behalf by the Service Provider, a concierge or a representative or agent of the hospitality trade, shall not constitute an offence.",
          "2PL 010705  2,977 (04//2018)",
          "Civil Aviation (Amendment) Act, No. 12 of 2018 2"
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "Every person arrested by or apprehended and handed over to the police officer in pursuance of subsection (1), shall be brought by the police officer, as soon as practicable, before the Magistrate having jurisdiction over the area in which the offence was alleged to have been committed.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "Notwithstanding the provisions of subsections (2) and (3) of section 107, prosecution against any person for any offence under this section may be commenced and on conviction, he shall be liable to a fine not exceeding twenty five thousand rupees or imprisonment not exceeding six months or  both such fine and imprisonment.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "4",
            "text": "For the purpose of this section,-",
            "pre_block_list": [
              "hospitality trade  means, any business activity or service related or incidental to the tourism industry; and",
              "touting means, canvassing with a view to arranging transport or accommodation for an incoming or outgoing passenger or loading or unloading his baggage or other articles into or from vehicles or offering any similar service, for a valuable consideration or otherwise, without being duly authorized to do so",
              ""
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "3",
        "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail. Sinhala text to prevail in case of inconsistency.",
        "pre_block_list": [
          "Civil Aviation (Amendment) Act, No. 12 of 2018 3",
          "English Acts of the Parliament can be purchased at the P RAKASHANA  P IYASA , D EPARTMENT   OF G OVERNMENT  P RINTING , N O . 118, D R . D ANISTER  D E  S ILVA  M AWATHA , C OLOMBO  8."
        ],
        "child_level_list": []
      }
    ],
    "part_list": []
  }
}