{
  "n_pages": 3,
  "title_page": {
    "title": "National Insurance Trust Fund (Amendment) Act",
    "num": "28",
    "year": "2007",
    "date_certified": "2007-07-18",
    "date_published": "2007-07-20",
    "price": 6.0,
    "price_postage": 5.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 18Th July, 2007]",
      "L.D.O. 13/2007",
      "A N  A Ct   To   Amend   The  N Ational  I Nsurance  T Rust  F Und A Ct , N O . 28  Of  2006.",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :-"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the National Insurance Trust Fund (Amendment) Act, No. 28  of 2007.",
            "pre_block_list": [
              "Short title .",
              "Amendment of section 6 of Act, No. 28 of 2006."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "Section 6 of the National Insurance Trust Fund Act, No. 28 of 2006 (hereinafter referred to as the principal enactment) is hereby amended in subsection (1) of that section, by the insertion immediately after paragraph ( d ) of that subsection, of the following new paragraph :",
            "pre_block_list": [
              "( dd ) the Director-General of the Insurance Board of Sri Lanka, established by the Regulation of Insurance Industry Act, No. 43 of 2000;."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "Section 11 of the principal enactment is hereby amended in subsection (2) of that section, by the substitution for the words three members, of the words five members",
            "pre_block_list": [
              "",
              "Amendment of section 11 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "Section 13 of the principal enactment is hereby amended by the insertion immediately after paragraph ( d ) of that section, of the following new paragraphs :",
            "pre_block_list": [
              "Amendment of section 13 of the principal enactment.",
              "( dd ) shall accept reinsurance of any liability arising out of any contract or policy of insurance effected or issued by any person carrying on insurance business ;",
              "( ddd ) may reinsure with any insurer in or outside Sri Lanka any liability arising out of any contract or policy of insurance effected or issued by the Board ;."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in the event  of any inconsistency.",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS   B UREAU , D EPARTMENT   OF G OVERNMENT   I NFORMATION ,  N O . 163,  K IRULAPONA  M AWATHA , P OLHENGODA , C OLOMBO  05  before  15th December each year in respect of the year following."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}