{
  "n_pages": 4,
  "title_page": {
    "title": "Act",
    "num": "17",
    "year": "2018",
    "date_certified": "2018-06-28",
    "date_published": "2018-06-29",
    "price": 8.0,
    "price_postage": 10.0
  },
  "body_pages": {
    "preamble": [
      "General Sir John Kotelawala Defence University  (Special Provisions) Act, No. 17 Of 2018 1",
      "[Certified On 28Th Of June, 2018]",
      "L.D.O. 27/2018",
      "A N  A Ct   To   Make   Provisions   For   The   Absorption   Of   Students",
      "Registered   With   The  S Outh  A Sian  I Nstitute   Of  T Echnology   And M Edicine   To   The  G Eneral  S Ir  J Ohn  K Otelawala  D Efence U Niversity   Established   Under   The  S Ir  J Ohn  K Otelawala D Efence  U Niversity  A Ct , N O . 68  Of  1981  As   A    Matter   Of",
      "National   Interest   And   To   Provide   For   Matters   Connected",
      "Therewith   Or   Incidental   Thereto .",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:-"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the General Sir John Kotelawala Defence University (Special Provisions) Act, No. 17 of 2018 and shall come into operation on such date as the Minister may appoint by Order published in the  Gazette (hereinafter referred to as the appointed date).",
            "pre_block_list": [
              "Short  title and date of operation."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "The General Sir John Kotelawala Defence University (hereinafter referred to as the University) shall have the power -",
            "pre_block_list": [
              "Absorption of students of South Asian Institute of Technology and Medicine to the University."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "to absorb those students who have obtained basic qualifications from among the students who have registered with the South Asian Institute of Technology and Medicine (hereinafter referred to as the SAITM) between the period commencing from the fifteenth day of September Two Thousand Nine and ending in the fifteenth day of May Two Thousand Seventeen, to the University to follow the study programme leading to the award of the MBBS Degree (KDU);",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "to award the MBBS Degree (KDU) to students absorbed to the University under paragraph ( a ), who would successfully complete the study programme leading to the award of the MBBS Degree (KDU);",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "to award to those students having basic qualifications and have completed the study programme leading to the award of the MBBS Degree at the SAITM on or before the appointed date, the MBBS Degree (KDU) on such terms as may be determined by the Board of Management of the University in respect thereof; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "to decide on the criteria to be employed by the Board of Management of the University to determine the conditions subject to which the students specified in paragraphs ( a ) and ( c ) shall be awarded the MBBS Degree (KDU).",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "Notwithstanding the provisions of any other written law, immediately upon the completion of the absorption of students specified in section 2, the Medical Faculty of SAITM shall cease to be eligible to award the MBBS Degree and shall cease to be in operation.",
            "pre_block_list": [
              "Medical Faculty of SAITM cease to be in operation."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "In this Act",
            "pre_block_list": [
              "Interpretation.",
              "basic qualifications mean, minimum of S grade (simple) pass in Chemistry, Physics and Biology at the G.C.E. (Advanced Level) Examination conducted by the Examinations Department of the Ministry of Education of Sri Lanka or an equivalent foreign qualification including equivalent qualifications of students who have offered the subjects Chemistry, Mathematics and Biology;",
              "MBBS Degree means the Degree of Bachelor of Medicine and Bachelor of Surgery.",
              "Sinhala text to prevail in case of any inconsistency."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "General Sir John Kotelawala Defence University  (Special Provisions) Act, No. 17 of 2018 3",
              "English Acts of the Parliament can be purchased at the P RAKASHANA  P IYASA , D EPARTMENT   OF G OVERNMENT  P RINTING , N O . 118, D R . D ANISTER  D E  S ILVA  M AWATHA , C OLOMBO  8."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}