{
  "n_pages": 48,
  "title_page": {
    "title": "Inland Revenue (Amendment) Act",
    "num": "22",
    "year": "2011",
    "date_certified": "2011-03-31",
    "date_published": "2011-04-01",
    "price": 37.0,
    "price_postage": 20.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 31St March, 2011]",
      "L.D.O. 12/2011.",
      "A N  A Ct   To   Amend   The  I Nland  R Evenue  A Ct , N O . 10  Of  2006",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Sri Lanka As Follows:"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This  Act may be cited as the Inland Revenue (Amendment) Act, No. 22 of  2011.",
            "pre_block_list": [
              "Short title"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "Section 4 of the Inland Revenue Act, No. 10 of 2006 (hereinafter referred to as the  \"Principal enactment\") as amended by Act, No. 10 of 2007, is hereby further amended in paragraph ( c ) of subsection (1) as follows:",
            "pre_block_list": [
              "Amendment of section 4 of the Inland Revenue Act, No. 10 of 2006."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the  substitution in sub-paragraph (ii), for the words \"his contributions to that fund;\", of the words and figures \"his contributions to that fund, where such retirement took place prior to April 1, 2011;\"; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the substitution in sub-paragraph (iii) ( b ), for the words \"such contribution and interest;\", of the following words and figures:",
                "pre_block_list": [
                  "\"such contribution and interest,",
                  "where such employee retires from the employment prior to April 1, 2011; \"."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "Section 7 of the principal enactment as last amended by Act, No. 19 of 2009, is hereby further amended as follows:",
            "pre_block_list": [
              "Amendment of section 7 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "in paragraph ( b ) of that section, by the addition immediately after sub-paragraph (lx), of the following new sub-paragraph:",
                "pre_block_list": [
                  "(lxi) the profits and income of the Insurance Board of Sri Lanka, established by the",
                  "Regulation of the Insurance Industry Act, No. 43 of 2000.\" ;"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the substitution in paragraph ( e ) of that section for the words \" the profits and income of a charitable institution, of the words and figures\" the profits and income accruing prior to April 1, 2011, of a charitable institution;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "by the repeal of  paragraph ( h ) of that section, and substitution therefor, of the following paragraph:",
                "pre_block_list": [
                  "\"( h ) the profits and income of any registered society within the meaning of the Co-operative Societies Law, No. 5 of 1972 or under the respective Statute enacted by a Provincial Council providing for such registration and the profits and income of Lak Sathoosa Limited registered under the Companies Act, No. 7 of 2007.\";"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "by the  substitution in paragraph (i) of that section, for the words and figures \"Apiwenuwen Api Fund Act, No. 6 of 2008.\", of the words and figures Apiwenuwen Api Fund Act, No. 6 of  2008;\";",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "by the addition immediately after paragraph ( i ) of that section, of the following new paragraphs:-",
                "pre_block_list": [
                  "\"( j ) the profits and income for every year of assessment within the period of ten years commencing on April 1, 2011, of-"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "i",
                    "text": "Sri Lankan Airlines Limited;",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "Mihin Lanka (Pvt.) Limited;",
                        "pre_block_list": [
                          "( k ) the profits and income for every year of assessment within the period of five years commencing on April 1, 2011, of -",
                          "(i) Ceylon Electricity Board;",
                          "(ii) National Water Supply and Drainage Board;"
                        ],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "Ceylon Petroleum Corporation;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iv",
                        "text": "Sri Lanka Ports Authority,",
                        "pre_block_list": [
                          "if, twenty five  per centum  of the gross profits of such Board, Corporation or Authority, as the case may be, for such year of assessment is paid as dividend to the Government.\"."
                        ],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "Section 8 of the principal enactment as last amended by Act, No. 19 of 2009, is hereby  further amended in subsection (1) as follows:",
            "pre_block_list": [
              "Amendment of section 8 of the principal enactment"
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the  substitution in paragraph ( p ), of that sub section  for the words \"value of any benefits accruing to, of the words  and figures\" value of any benefits accruing before April 1, 2011, to\";",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "in paragraph ( q ) of that subsection, by the substitution in sub-paragraph (ii), for the words and figures \" the Merchant Shipping Act, No. 52 of 1971.\", of the words and figures \"the Merchant Shipping Act, No. 52 of 1971; \" and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "by the addition, immediately after paragraph ( q ) of that subsection, of  the following new paragraphs:-",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "r",
                    "text": "rental value of one place of residence provided to any individual referred to in paragraph ( b ) of subsection ( 1 ), rent free or at a rent less than the rental value of  such  place;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "s",
                    "text": "either the value of benefit from private use of one motor vehicle provided by the employer or any allowance paid in lieu of the provision of such vehicle, subject to a maximum of fifty thousand rupees for a calendar month;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "t",
                    "text": "where the profits from employment of any individual who is a citizen of Sri Lanka or resident in Sri Lanka other than profits referred to in paragraph ( c ) of subsection (1) of section 4, exceeds five hundred thousand rupees, then-",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "such part of such profits in excess of five hundred thousand rupees; or",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "one hundred thousand rupees,",
                        "pre_block_list": [
                          "whichever is lower;"
                        ],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "u",
                    "text": "any special payment made to any individual or holder of office, referred to in paragraph ( b ) of subsection ( 1 ) for emergency or priority services or for any special task rendered or carried out by such individual;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "v",
                    "text": "official emoluments arising in Sri Lanka to any non-citizen individual from the participation in any international event conducted in Sri Lanka;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "w",
                    "text": "such part of official emoluments as does not exceed one hundred thousand rupees, arising in Sri Lanka to any individual who is not a citizen of Sri Lanka and not resident in Sri Lanka",
                    "pre_block_list": [
                      ""
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "Section 9 of the principal enactment as last amended by Act, No. 19 of 2009, is hereby further amended in paragraph (h) of that section, by the substitution for the words \"such part of any interest as does not exceed two hundred thousand rupees accruing or arising in any year of assessment",
            "pre_block_list": [
              "Amendment of section 9 of the principal enactment.",
              "to any individual\", of the words and figures \"such part of any interest as does not exceed-"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "two hundred thousand rupees accruing for, or arising in, any year of assessment ending prior to April 1, 2011; and",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "five hundred thousand rupees accruing for, or arising in, any year of assessment commencing on or after April 1, 2011,",
                    "pre_block_list": [
                      "to any individual\"."
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "Section 13 of the principal enactment as last amended by Act, No. 19 of 2009, is hereby further amended as follows:-",
            "pre_block_list": [
              "Amendment of section 13 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the substitution in sub-paragraph (i) of paragraph ( b ) of that section, for the words \"services relating to any construction project; and\", of the words \"services relating to any construction project;\";",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the substitution in sub-paragraph (ii) of paragraph ( b ) of that section, for the words \"any goods imported into Sri Lanka,'', of the following words and figures:-",
                "pre_block_list": [
                  "\"any goods imported into Sri Lanka; and"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iii",
                    "text": "in respect of any business of exporting any goods, being goods which were brought to Sri Lanka on a consignment basis, and re-exported without subjecting such goods to any process or manufacture, other than the repacking or labeling of such goods in the preparation to the market,'';",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "by the insertion immediately after paragraph ( b ) of that section, of the following new paragraph:-",
                "pre_block_list": [
                  "( bb ) the profits and income earned in foreign currency by any manufacturer of textile, leather products, footwear or bags, from supplies made to any foreign buyer who has established his headquarters in Sri Lanka for management, finance, supply chain and billing;'';"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "by the substitution in paragraph ( ddd ) of that section, for all the words commencing from \"from services rendered in or outside Sri Lanka,\" to \"the national economy of Sri Lanka, \", of  the words \"from any service rendered in or outside Sri Lanka to any person or partnership outside Sri Lanka, other than any commission, discount or similar receipt for any such service rendered in Sri Lanka,'';",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "by the insertion immediately after paragraph ( xxxxx)  of that section, of the following new paragraph:-",
                "pre_block_list": [
                  "\"( xxxxxx ) (i) an amount equal to the interest payable to any bank or other financial institution in Sri Lanka, in respect of any loan granted out of the moneys lying into the credit of the Investment Fund account of such bank or institution, maintained and operated in accordance with the guidelines set by the Central Bank; or"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "an amount equal to the interest payable to any bank or other financial",
                    "pre_block_list": [
                      "institution in Sri Lanka, in respect of any loan granted-",
                      "(A) to any company for investing in full in an undertaking referred to in section 17 C ;",
                      "(B) to any person or partnership for investing in full for the operation of re-opened abandoned factory.",
                      "In this paragraph \"re-opened abandoned factory'' means a factory which was engaged in the production or manufacture of any commodity or article but which had not been so engaged for an unbroken period of not less than three years, preceding November 22, 2010, and which commences the production or manufacture of such commodity or article or any other commodity or article in commercial quantities before April 1, 2012.'';"
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "by the insertion, immediately after paragraph ( yyy ) of that section, of the following new paragraphs:-",
                "pre_block_list": [
                  "\"( yyyy ) the profits and income arising or accruing to any person from any undertaking for the operation of any port terminal in Sri Lanka;",
                  "( yyyyy ) the profits and income from any service rendered by any person or partnership in any port in Sri Lanka in the course of any business carried on within such port;''; and"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "by the insertion, immediately after paragraph ( zzzz ) of that section, of the following new paragraph:-",
                "pre_block_list": [
                  "\"( zzzzz ) the profits and income arising or accruing to any person from any undertaking for the construction of any Port in Sri Lanka.''.",
                  "Insertion of new sections 16 A , 16 B and 16 C  in the principal enactment."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "The following new sections are inserted immediately after section 16 of the principal enactment and shall have effect as section 16 A , section 16 B  and section 16 C  respectively, of that enactment:",
            "pre_block_list": [
              "16 A  . (1) The profits and income within the meaning of paragraph ( a ) of section 3, other than any profits and income from the disposal of any capital asset, of any person or partnership from any undertaking for fishing carried on in Sri Lanka, shall be exempted from income tax for each year of assessment within the period of five years commencing on April 1, 2011.",
              "\"Exemption from income tax of the profits and income of any undertaking for fishing."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "In this section \"undertaking for fishing'' includes any undertaking for the cleaning, sizing, sorting, grading, chilling, dehydrating, packaging, cutting or canning of fish in preparation of such produce for the market.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "In relation to an undertaking which consists of fishing and utilizing such fish for manufacturing of any product, such fish shall be deemed to have been sold for the manufacture of such product at the open market price prevailing at the time of such deemed sale, and the exemption granted under subsection (1) shall be applicable to that undertaking, on the profits and income computed on the basis of such deemed sale.",
                "pre_block_list": [
                  "16 B . (1) The profits and income within the meaning of paragraph ( a ) of section 3, other than any profits and income from the disposal of any capital asset, of any person or partnership from any undertaking for producing of agricultural seeds or planting materials, or primary processing of such seeds or materials, shall be exempted from income tax for each year of assessment within the period of five years, commencing on April 1, 2011.",
                  "Exemption from income tax of the profits and income of any under- taking for producing agricultural seeds or planting materials.",
                  "(2)  In this section \"primary processing'' means cleaning, sizing, sorting, grading, chilling, dehydrating, cutting, canning or packaging for the purpose of preparation of such produce for the market.",
                  "(3)   In relation to an undertaking which consists of producing of agricultural seeds or planting materials and utilizing such seeds or materials in the agriculture or horticulture, such produce shall be deemed to have been sold for such purpose at the open market price prevailing at the time of such deemed sale, and the exemption granted under subsection (1) shall be applicable to that undertaking, on the profits and income computed on the basis of such deemed sale.",
                  "Exemption from income tax of the profits and income of any new undertaking investing not less than fifty million rupees.",
                  "16 C . (1)  The profits and income within the meaning of paragraph ( a ) of section 3 (other than any profits and income from the sale of any capital asset) of any new undertaking referred to in subsection (2), and carried on by any person or partnership on or after April 1, 2011, shall be exempted from income tax for a period of three years reckoned from the commencement of the year of assessment in which such undertaking commences to make profits from transactions entered into in that year of assessment, or from the commencement of the year of assessment immediately succeeding the year of assessment in which the undertaking completes a period  of two years reckoned from the date on which the undertaking commences to carry on commercial operations, whichever occurs earlier.",
                  "(2) For the purpose of subsection (1), \"new undertaking'' means an undertaking-"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "which is engaged in the manufacture of any article other than any liquor or tobacco product;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "in which the sum invested in the acquisition of fixed assets after November 22, 2010 but before March 31, 2012 is not less than fifty million rupees; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "which commences commercial operations on or after April 1, 2011.''.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "Section 17 of the principal enactment as last amended by Act, No. 19 of 2009, is hereby further amended in subsection (2) of that section, by the substitution in sub- paragraph (ii) of paragraph ( a ), for the words and figures \"incorporated on or after  April 1, 2002,, of the words and figures \"incorporated on or after April 1, 2002, but prior to April 1, 2011,''.",
            "pre_block_list": [
              "Amendment of section 17 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "The following new section is hereby inserted immediately after section 17 of the principal enactment and shall have effect as section 17 A  of that enactment:-",
            "pre_block_list": [
              "Insertion of new section 17A in the principal enactment.",
              "17 A . (1) The profits and income within the meaning of paragraph ( a ) of section 3 (other than any profits and income from the sale of any capital asset) of any company from any new undertaking referred to in subsection (2), and carried on by such company on or after April 1, 2011, shall be exempted from income tax for a period of five years reckoned from the commencement of the year of assessment in which such undertaking commences to make profits from transactions entered into in that year of assessment or from the commencement of the year of assessment immediately succeeding the year of assessment in which such undertaking completes a period of two years reckoned from the date on which such undertaking commences to carry on commercial operations, whichever occurs earlier:",
              "\"Exemption from income tax of the profits and income from any new undertaking engaged in any pre- scribed activities.",
              "Provided that where the quantum of investment made in such undertaking is more than United State Dollars three million or its",
              "equivalent, the Minister may, having regard to the economic development of the country, grant tax exemption on the same basis, for a period not exceeding seven years."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "For the purpose of subsection (1), \"new undertaking'' means an undertaking engaged in any activity prescribed by the Minister having regard to the development of the national economy, as needed for the economic development of the country and which shall be with an investment of not less than United State Dollars three million or equivalent in other currencies invested in fixed assets.''.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "10",
            "text": "Section 20 of the principal enactment as amended by the Act, No. 9 of 2008, is hereby further amended in subsection (2) of that section as follows:-",
            "pre_block_list": [
              "Amendment of section 20 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the substitution in paragraph ( c ) of that subsection, for the words and figures \"April 1, 2009-'', of the words and figures \"April 1, 2010-''; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the  substitution in paragraph ( e ) of that  subsection, for the words and figures \"prior to April 1, 2009\", of the words and figures \"prior  to April 1,  2010\".",
                "pre_block_list": [
                  "Amendment of section 21 of the principal enactment."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "11",
            "text": "Section 21 of the principal enactment as amended by Act, No. 9 of 2008, is hereby further amended in paragraph ( b ) of subsection (2) of that section, by the substitution for the words and figures \"not later that March 31, 2009,\", of the words and figures \"not later than March 31, 2010,\".",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "12",
            "text": "Section 21 A  of the principal enactment is hereby amended in paragraph ( b ) of subsection (2) of that section, by the substitution for the words and figures \"not later than March 31, 2009, of the words and figures \"not later than March 31, 2010\".",
            "pre_block_list": [
              "Amendment of section 21 A  of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "13",
            "text": "Section 23 of the principal encatment as last amended by Act, No. 9 of 2008, is hereby further amended in subsection (1) of that section by the substitution in the further proviso",
            "pre_block_list": [
              "Amendment of section 23 of the principal enactment.",
              "to that subsection, for the words \"be three years.\", of the following :-",
              "be three years.",
              "Provided further that where any venture capital company had not made any investment prior to April 1, 2011 for the purchase of ordinary shares in any project referred to in paragraph ( a ), ( b ) or ( c ) of this subsection, such company shall not be entitled to any tax exemption under this section.\"."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "14",
            "text": "Section 25 of the principal enactment as last amended by Act No. 19 of 2009, is hereby further amended in subsection (1) of that section as follows:-",
            "pre_block_list": [
              "Amendment of section 25 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "in paragraph ( a ) of that subsection-",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "by the substitution in sub-paragraph (iii), for the words \"sub-paragraph (v), acquired or assembled by such person, at the rate of twelve and one half  per centum  on the cost of acqusition or assembly;\", of the following words and figures:-",
                    "pre_block_list": [
                      "\"sub-paragraph (iv)-",
                      "(A) acquired or assembled prior to  April 1, 2011 by such person, at the rate of twelve and one  half   per centum per annum ; or",
                      "on the cost of acquistition or assembly;\";"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "in sub-paragraph (v) of that  paragraph by the substitution for the words \"any qualified building\" of the words and figures \"any qualified building constructed prior to April 1, 2011,\";",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "by the insertion immediately after sub- paragraph (v) of that paragraph, of the following new sub-paragraph:-",
                    "pre_block_list": [
                      "\"(vi) any qualified building constructed on or after April  1, 2011, at the rate of  ten per centum , on the cost of construction;\";"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "in paragraph ( b ) of  the proviso to that paragraph-",
                    "pre_block_list": [
                      "\"(i) in sub-paragraph (i), by the substitution for the words \"machinery acquired is used in any business\", of the words and figures \"machinery acquired prior to April 1, 2011, is used in any business\"; and"
                    ],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "in sub-paragraph (ii), by the substitution for the words and figures \"acquired on or after  April 1, 2007, being a ship\", of the words and figures \"acquired on or after April 1, 2007, but prior to April 1, 2011, being a ship\";",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the subsitution in paragraph ( i ) of that subsection, for  the words \" the expenditure, including capital expenditure incurred by such person\", of the following words and figures:-",
                "pre_block_list": [
                  "\"for any year of assessment-"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "i",
                    "text": "commencing prior to April 1, 2011, the expenditure including capital expenditure; or",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "commencing on or after April 1, 2011, an amount equal to two hundred  per centum  of the  expenditure,  including  capital expenditure,",
                        "pre_block_list": [
                          "incurred by such person\";"
                        ],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "in paragraph ( r ) of that subsection, by the substitution for the words \"carrying on any profession,\", of the words \"carrying on any profession;\"; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "by the addition, immediately after paragraph ( r ) of that subsection, of the following new paragraph:-",
                "pre_block_list": [
                  "\"( s ) any expenditure incurred in any year of assessement in quoting any shares of a company in any  official list of any stock exchange licensed by the Securities and Exchange Commission of Sri Lanka, provided that the aggregate of such expenditure incurred in that year if assessment and in any previous year of assessment shall not exceed one  per centum  of the value of the Initial Public Offering of Such company.\","
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "15",
            "text": "Section 26 of the principal enactment as last amended by Act, No. 9 of 2008, is hereby further amended in subsection (1) as follows:-",
            "pre_block_list": [
              "Amendment of section 26 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the substitution in sub-paragraph (ii) of paragraph ( c ) of that subsection, for the words \"in foreign currency;\", of the following words and figures :-",
                "pre_block_list": [
                  "in foreign currency:",
                  "Provided that for any year of assessment commencing on or after April 1, 2011 -",
                  "(A) such part of expenditure incurred in travelling outside Sri Lanka in the production of profits or income from any trade or business carried on or exercised in Sri Lanka by any person, other than-"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "i",
                    "text": "such expenses incurred solely in connection with the promotion of export trade of any article or goods or the provision of any services for payment in foreign currency ; or",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "such expenditure incurred in carrying out an approved programme as referred to in paragraph ( d ); or",
                        "pre_block_list": [
                          "(B) an amount equal to two  per centum  of the profits and income of such trade or business in the immediately preceding year of assessment;;",
                          "whichever is lower, shall be deductible in ascertaining the profits and income from such trade or business for that year of assessment;;"
                        ],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the substitution in sub-paragraph (i) of paragraph ( r ) of that subsection for the words one million rupees or, of the words two million rupees or;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "by the substitution in paragraph (v) of that subsection, for the words one half of such persons cost of advertisement, of the following words and figures:-",
                "pre_block_list": [
                  "for any year of assessment-"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "i",
                    "text": "commencing prior the April 1, 2011, one half; and",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "commencing on or after April 1, 2011, one fourth,",
                        "pre_block_list": [
                          "of such persons cost of advertisement;"
                        ],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "by the substitution in paragraph ( y ) of that subsection, for the words debt instrument., of the words debt instruments;; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "by the addition immediately after paragraph ( y ) of that subsection, of the following new paragraph:-",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "z",
                    "text": "the income tax paid by any employer in respect of the employment income of any individual employed by such employer",
                    "pre_block_list": [
                      ""
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "16",
            "text": "Section 32 of the principal enactment as last amended by Act, No. 9 of 2008, is hereby further amended as follows:-",
            "pre_block_list": [
              "Amendment of section 32 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "in subsection (3) of that section-",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "by the substitution in paragraph ( g ), for the words Sri Lanka currency for such purchase; and, of the words Sri Lanka currency for such purchase;;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "by the substitution in paragraph ( h ), for the words and figures section 161 A  of this Act., of the words and figures section 161 A  of this Act; and;and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "by the addition immediately after paragraph ( h ) of that subsection, of the following new paragraph:-",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "profits from any employment, other than profits referred to in paragraph ( c ) of subsection (1) section 4, from which income tax is deducted by the employer under section 114 and such person being an individual has no other income other than any income referred to in this section as not forming part of assessable income of such individual",
                        "pre_block_list": [
                          ""
                        ],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "in subsection (5) of that section, by the addition immediately after sub-paragraph (iv) of the proviso to paragraph ( a ) of that subsection, of the folowing new sub-paragraph:",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "v",
                    "text": "no deduction under this section shall be made from any employment income included in the total statutory income;\".",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "17",
            "text": "Section 33 of the principal enactment is hereby amended in subsection (1) of that section, as follows:-",
            "pre_block_list": [
              "Amendment of section 33 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the substitution in paragraph ( a ) of that subsection for the words an allowance of three hundred",
                "pre_block_list": [
                  "thousand rupees; and, of the following words and figures:-",
                  "an allowance of-"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "i",
                    "text": "three hundred thousand rupees in respect of any year of assessment commencing prior to April 1, 2011; and",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "five hundred thousand rupees in respect of any year of assessment commencing on or after April 1, 2011, and;",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the substitution in the proviso to that subsection, for the words as such trustee, receiver, executor or liquidator., of the following words and figures :-",
                "pre_block_list": [
                  "as such trustee, receiver, executor or liquidator:",
                  "Provided further, that for any year of assessment commencing on or after April 1, 2011"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "i",
                    "text": "any individual being a citizen of Sri Lanka irrespective of whether such individual is resident in Sri Lanka or not, shall be entitled to deduct the allowance referred to in paragraph ( a ); and",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "an individual shall not be entitled to deduct any part of any allowance under section 34 from any employment income which is included in such assessable income",
                        "pre_block_list": [
                          ""
                        ],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "18",
            "text": "Section 34 of the principal enactment as last amended by Act, No. 19 of 2009, is hereby further amended as follows:",
            "pre_block_list": [
              "Amendment of section 34 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "in subsection (2) of that section-",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "by the substitution in paragraph ( a ), for the words made by any person in money to an approved charity;, of the words made by any person in money to an approved charity being a charity which is established for the provision of institutionalized care for the sick or the needy;;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "by the substitution in paragraph ( d ), for the words amount paid by an individual as a contribution, of the words and figures amount paid prior to April 1, 2011, by an individual as a contribution;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "by the substitution in paragraph ( e ), for the words contribution made by an individual, of the words and figures contribution made prior to April 1, 2011, by an individual;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "by the substitution in paragraph ( f ), for the words donation made by any person, of the words and figures donation made prior to April 1, 2011, by any person;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "by the substitution in sub-paragraph (ii) of paragraph  (g ), for the words \"policy of medical insurance,\", of the following words and figures:-",
                    "pre_block_list": [
                      "policy of medical insurance other than any policy referred to in paragraph ( gg ),;"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "by the insertion immediately after paragraph ( g ) of that subsection, of the following new paragraph:-",
                    "pre_block_list": [
                      "( gg ) any premia in any year of assessment commencing on or after April 1, 2011, being pemia which have accrued due for payment on a policy of special health insurance which covers any incurable disease;"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "g",
                    "text": "by the substitution in paragraph (i), for the words any expenditure incurred, of the word and figures any expenditure incurred prior to April 1, 2011; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "h",
                    "text": "by the substitution in paragraph ( j ), for the words any expenditure incurred, of the words and figures any expenditure incurred prior to April 1, 2011; and",
                    "pre_block_list": [
                      "( 2 ) in subsection (4) of that section, by the substitution in sub-paragraph (i) of paragraph ( a ), for the words paragraphs ( a ), ( b ), ( c ), ( e ), ( g ), ( h ), of the words Paragraphs ( a ), ( b ), ( c ), ( e ), ( g ), ( gg ), ( h )."
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "19",
            "text": "Section 42 of the principal enactment as amended by  Act, No. 10 of 2007 is hereby further amended in subsection (2) of that section by the substitution for the words arising in Sri Lanka, of the words and figures but prior to April 1,  2011 arising in Sri Lanka.",
            "pre_block_list": [
              "Amendment of section 42 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "20",
            "text": "Section 45 of the principal enactment as amended by Act, No. 10 of 2007 is hereby further amended in subsection (1) thereof, by the insertion immediately after paragraph ( a ), of the following new paragraph:-",
            "pre_block_list": [
              "Amendment of section 45 of the principal enactment.",
              "( aa ) undertaking for the manufacture of animal feed;.",
              "Amendment of section 46 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "21",
            "text": "Section 46 of the principal enactment as amended by Act, No. 9 of 2008 is hereby further amended in subsection (1) thereof, by the insertion immediately after paragraph ( a ), of the following new paragraph:-",
            "pre_block_list": [
              "( aa ) undertaking for the manufacture of animal feed;."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "22",
            "text": "Section 47 of the principal enactment is hereby amended in subsection (1) of that section, by the substitution for the words any year of assessment includes, of the words and figures any year of assessment commencing prior to April 1, 2011 includes.",
            "pre_block_list": [
              "Amendment of section 47 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "23",
            "text": "The following new section is hereby inserted immediately after section 48 of the principal enactment and shall have effect as section 48 A  of that enactment:-",
            "pre_block_list": [
              "Insertion of new section 48 A  in the principal enactment.",
              "48 A . Such part of the profits and income from any agricultural undertaking referred to in section 16, included in the taxable income of any person for any year of assessment commencing on or after April 1, 2011 shall, notwithstanding anything to the contrary in any other provisions of this Act, be taxable at the appropriate rate specified in the Fifth Schedule to this Act",
              "",
              "Rate of income tax after the expiry of tax exemption under section 16."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "24",
            "text": "The following new sections are hereby inserted immediately after section 59 of the principal enactment and shall have effect as sections 59 A  and 59 B  respectively, of that enactment:-",
            "pre_block_list": [
              "Insertion of new sections 59 A  and 59 B  in the principal enactment.",
              "59 A . Such part of the profits and income of any person for any year of assessment commencing on or after April 1, 2011 from an undertaking for the manufacture of any product for export, or for supply to an exporter for export, being a product having domestic value addition in excess of sixty five  per centum  and Sri Lankan brand name with patent rights reserved in Sri Lanka, shall notwithstanding anything to the contrary in any other provisions of this Act, be chargeable with income tax at the appropriate rate specified in the Fifth Schedule to this  Act.",
              "59 B . (1) The profits and income of any person for any year of assessment commencing on or after April 1, 2011, from any undertaking referred to in subsection (2) shall, notwithstanding anything to the contrary in any other provisions of this Act, be chargeable with income tax at the appropriate rate specified in the Fifth Schedule to this Act-",
              "Rate of income tax applicable to any undertaking with annual turnover not exceeding three hundred million rupees."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "For the purpose of this section undertaking in relation to any year of assessment means any undertaking-",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "engaged in the manufacture of any article or in the provision of any service; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the turnover of such undertaking (other than from the sale of any capital asset) for that year of assessment does not exceed three hundred million rupees",
                    "pre_block_list": [
                      ""
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "25",
            "text": "Section 61 of the principal enactment as last amended by Act, No. 9 of 2008, is hereby further amended in subsection (1) of that section as follows :-",
            "pre_block_list": [
              "Amendment of section 61 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the substitution in paragraph ( a ) of that subsection, for the words Second Schedule to this Act;, of the words Second Schedule or Fifth Schedule to this Act, as the case may be;;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "in paragraph ( b ) of that subsection-",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "by the substitution in sub-paragraph (ii) of that paragraph for the words where such company has within such period distributed dividends less in amount than twenty five per centum  of the distributable profits for that preceding year:, of the following words and figures:-",
                    "pre_block_list": [
                      "(A) where such year of assessment is any year of assessment commencing prior to April 1, 2011 and the company has within such period distributed dividends less in amount than twenty five  per centum ; or",
                      "of the distributable profits for that preceding year:; and"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "by the substitution in the proviso to sub- paragraph (ii), for the words company has distributed twenty five  per centum  of its distributable profits, of the following words and figures :-",
                    "pre_block_list": [
                      "company has distributed-",
                      "(A) twenty five  per centum , where such year of assessment is any year of assessment commencing prior to April 1, 2011; or",
                      "(B) ten  per centum , where such year of assessment is any year of assessment commencing on or after April 1, 2011,",
                      "of its distributable profits."
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "26",
            "text": "Section 78 of the principal enactment as last amended by Act, No. 19 of 2009, is hereby further amended in subsection (3) of that section by the substitution for the words, using the profit sharing ratio of the partnership, of the words using the ratio of shares of profits inclusive of any salary from such partnership.",
            "pre_block_list": [
              "Amendment of section 78 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "27",
            "text": "Section 95 of the principal enactment as amended by Act, No. 9 of 2008, is hereby further amended in subsection (1) of that section as follows :-",
            "pre_block_list": [
              "Amendment of section 95 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the substitution in paragraph ( aa ) of the proviso to that subsection, for the words rate of ten  per centum ; and, of the words rate of ten  per centum;  and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the insertion immediately after paragraph ( aa ) of that proviso, of the following new paragraph:-",
                "pre_block_list": [
                  "( aaa ) no deduction shall be made under this section from any interest which is exempt from income tax under any provision of this Act; and."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "28",
            "text": "The following new sub-heading and new section are hereby inserted immediately after section 105 in Chapter XI of the principal enactment and the section shall have effect as section 105 A  of that enactment:-",
            "pre_block_list": [
              "Insertion of new sub heading and new section 105 A  in Chapter XI of the principal enactment.",
              "M - I SLAMIC  F INANCIAL  T RANSACTIONS .",
              "105 A . (1) The profits and income arising from any Islamic financial transaction relating to any Islamic financial instrument shall be treated for tax purposes under the provisions of the Act, as hereinafter provided in this section.",
              "Profits and income arising from Islamic financial transactions are taxed."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Profits and income arising to any person or partnership out of any Islamic financial transaction shall, where such transaction is similar or equivalent in substance, to any conventional financial transaction under the provisions of the Act, be subject to tax in similar manner as such conventional financial transaction is taxed under the Act.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Commissioner-General of Inland Revenue shall in order to determine the extent of liability to tax of any particular Islamic financial transaction, issue from time to time, such rules and guidelines as may be required for the purpose of",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "identifying the circumstances which would amount to an Islamic financial transaction; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "ascertaining the profit and income arising out of any Islamic financial transaction",
                    "pre_block_list": [
                      ""
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "29",
            "text": "Section 106 of the principal enactment as last amended by Act, No. 19 of 2009, is hereby further amended as follows:-",
            "pre_block_list": [
              "Amendment of section 106 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "in subsection (1) of that section, by the substitution in sub-paragraph ( c ) of the proviso, for the words and figures deducted under section 133, section 134 or section 135, as the case may be., of the words and figures deducted under section 133, section 134 or section 135, as the case may be:",
                "pre_block_list": [
                  "Provided further, that for any year of assessment commencing on or after April 1, 2011, the preceding provisions shall not apply to an individual being an employee who has no any other income chargeable with income tax other than any income referred to in sub-paragraph (b) or sub-paragraph ( c ).;"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the repeal of subsection (11) of that section and substitution therefor, of the following subsection:-",
                "pre_block_list": [
                  "(11) Where any person or partnership carries on or exercises any trade, business, profession or vocation  in several units or undertakings as one trade, business, profession or vacation, as the case may be, or where such person or partnership carries on or exercises more than one trade, business, profession or vocation and the profits and income from any such unit or undertaking or from such trade, business, profession or vocation is exempted from or chargeable with income tax at different rates, such person or partnership shall maintain and prepare statements of account in a manner that the profits and income from each such unit or undertaking or such trade, business, profession or vocation as the case may be, may be separately identified.; and"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "by the addition at the end of subsection (18) of that section, of the following new subsection:-",
                "pre_block_list": [
                  "(19) The Commissioner-General may close any record maintained by him of any individual subsisting on or after April 1, 2011 if he is satisfied on application made by such individual, that all profits and income of such individual are derived only from sources from which whose taxes are paid at sources and such taxes are treated as final",
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "30",
            "text": "Section 117 of the principal enactment is hereby amended in subsection (1) of that section by the substitution for the words deduct tax at the rate of ten  per centum  on such amounts or value of such benefits, in terms of the provisions of this Chapter., of the following words:-",
            "pre_block_list": [
              "Amendment of section 117 of the principal enactment.",
              "deduct tax on such amounts or value of such benefits at the rate of "
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "ten  per centum , where the aggregate of such amounts or value of such benefits does not",
                "pre_block_list": [
                  "exceed twenty five thousand rupees per month; or"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "sixteen  per centum , where the aggregate of such amounts or value of such benefits exceeds twenty five thousand rupees per month,",
                "pre_block_list": [
                  "in terms of the provisions of this Chapter",
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "31",
            "text": "The following new section is hereby inserted immediately after section 117 of the principal enactment and shall have effect as section 117 A  of that Act :-",
            "pre_block_list": [
              "Insertion of new section 117 A  in the principal enactment.",
              "117 A .(1) Where an employer pays any remuneration or provides any benefit to any employee who is also an employee of another employer and such other employer deducts income tax on the remuneration under section 114 as such employees main employer, then such first mentioned employer shall deduct tax at the rate of ",
              "\"Deduction of tax at special rates where an individual has more than one employment.",
              "( a ) ten  per centum , where the aggregate of such payments or value of such benefits does not exceed twenty five thousand rupees per month; or",
              "( b ) sixteen  per centum , where the aggregate of such payments or value of such benefits exceeds twenty five thousand rupees per month,",
              "on such payments or the value of such benefits in terms of the provisions of  this Chapter. No direction shall be issued or entertained under section 118 in relation to such payments or value of such benefits."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "No refund shall be made under this Act in relation to the income tax deducted in terms of subsection (1) notwithstanding anything to",
                "pre_block_list": [
                  "the contrary in this Act, but such income tax may be set off against the income tax liability of such person in respect of the same year of assessment, if such payments or the value of such benefits has been included in his total statutory income for that year."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where any employer who is required to deduct tax  on any remuneration using tax tables as referred to in section 116 omits to do so, and deducts tax  at the rate of ten  per centum on such remuneration, such employer shall be liable to pay such tax in default calculated on the basis of the difference between tax payable on this basis of tax tables as provided for in section 116 and tax deducted by the employer under this section",
                "pre_block_list": [
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "32",
            "text": "Section 118 of the principal enactment is hereby amended in subsection (1) of that section by the substitution for the words if the amount of income tax payable by him for any year of assessment to in excess of the amount that should have been deducted , of the words and figures if such remuneration, in full or part, is exempted from income  tax for any year of assessment under any provisions of this Act,.",
            "pre_block_list": [
              "Amendment of section 118 of the principal enactment"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "33",
            "text": "Section 131 of the principal enactment as last amended by Act No. 9 of 2008, is hereby further amended in the definition of the term employer, by the substitution for the words  body of persons or any organization, other than any Government Institution referred to in Chapter XV :-, of the words body of persons or any organization -.",
            "pre_block_list": [
              "Amendment of section 131 of the principal enactment"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "34",
            "text": "Section 132 A  of the principal enactment is hereby amended in subsection (1) of that section, by the substitution for the words and figures year of assessment commencing on or after April 1, 2008, by any employee, of the words and figures   year of assessment commencing on or after April 1, 2008, but prior to April 1, 2011, by any employee.",
            "pre_block_list": [
              "Amendment of section 132 A  of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "35",
            "text": "Section 133 of the principal enactment as last amended by Act, No. 19 of 2009, is hereby further amended in subsection (4) of that section as follows :-",
            "pre_block_list": [
              "Amendment of section 133 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the substitution for paragraph ( a ) of that subsection, of the following new paragraph:",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "any company other than any charitable institution, the deduction shall be made at the rate of ten  per centum  of such interest; and",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "any partnership or body of persons other than any charitable institution, the deduction shall be made at the rate of eight per centum  of such interest;;",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "in paragraph ( b ) of that subsection -",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "in sub-paragraph (i) thereof, by the substitution for the words and figures not exceed 300,000 rupees, of the words and figures not exceed 500,000 rupees; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "by the substitution for sub-paragraph (ii) thereof, of the following sub-paragraph:-",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "exceeds 500,000 rupees, deduction shall be made from the interest payable to charitable institutions at the rate of eight  per centum  of such interest for that year of assessment;;",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "in paragraph ( c ) of that subsection -",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "in sub-paragraph (i) thereof, by the substitution for the words and figures not exceed 300,000 rupees, of the words and figures not exceed 500,000 rupees;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "in sub-paragraph (ii) thereof, by the substitution for the words and figures exceeds 300,000 rupees but does not exceed 1,000,000 rupees, , of the words and figures exceeds 500,000 rupees but does not exceed 1,500,000 rupees,; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "in sub-paragraph (iii) thereof, by the substitution for the words and figures exceeds 1,000,000 rupees and at the rate of ten  per centum , respectively, of the words and figures exceeds 1,500,000 rupees and at the rate of eight  per centum , respectively; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "in paragraph ( d ) of that section, by the substitution for the words ten  per centum  of such interest:, of the words eight  per centum  of such interest:.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "36",
            "text": "Section 135 of the principal enactment as amended by Act, No. 10 of 2007, is hereby further amended in subsection (1) of that section, by the substitution for the words  at the time such interest is paid or credited or such discounts is allowed. of the words at the time of the issue of such corporate debt security",
            "pre_block_list": [
              "",
              "Amendment of section 135 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "37",
            "text": "Section 151 of the principal enactment is hereby repealed.",
            "pre_block_list": [
              "Repeal of section 151  of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "38",
            "text": "Section 153 of the principal enactment as last amended by Act, No. 19 of 2009 , is hereby further amended in subsection (1) of that section, for the words  any  specified fee payable to any person, of the words and figures  any specified fee payable and paid prior to April 1, 2011, to any person.",
            "pre_block_list": [
              "Amendment of section 153 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "39",
            "text": "Section 155 of the principal enactment as last amended by Act, No. 9 of 2008 , is hereby further amended by the substitution for the words  person or partnership paying any rent, lease rent or such other payment,, of the words and figures person or partnership paying on or before April 1, 2011, any rent lease rent or such other payment,.",
            "pre_block_list": [
              "Amendment of section 155 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "40",
            "text": "Section 160 of the principal enactment as amended by Act, No. 9 of 2008 , is hereby further as follows:-",
            "pre_block_list": [
              "Amendment of section 160 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the substitution in paragraph (b), for the words management fee or other similar payment,, of the words management fee,;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the substitution for the words royalty, management fee or such other similar payment,, of the words royalty or management fee,; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "by the substitution in item (ii) for the words management fee paid or any  other similar payment made:, of the words management fee paid:.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "41",
            "text": "Section 163 of the principal enactment as last amended by Act, No. 19 of 2009 , is hereby further amended in subsection (5) as follows:-",
            "pre_block_list": [
              "Amendment of section 163 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the substitution in paragraph ( a ), for the words from the end of that year of assessment:, of the words from the thirtieth day of November of the immediately succeeding year of assessment:; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the substitution in paragraph ( b ) for the words from the end of that year of assessment,  of  the words from the thirtieth day of November of the immediately succeeding year of assessment:.",
                "pre_block_list": [
                  "Amendment of section 166 of the principal enactment."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "42",
            "text": "Section 166 of the principal enactment as amended by Act, No. 10 of 2007 , is hereby further amended  in subsection (1) of that section, by the substitution for the words  For the purpose of hearing appeals in the manner hereinafter provided, there shall be a Board of Review, of the words and figures For the purpose of hearing appeals made before April 1, 2011, in the manner hereinafter provided, there shall be a to the Board of Review.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "43",
            "text": "Section 167 of the principal enactment is hereby amended  in subsection (3) of that section, by the substitution for the words  within one month of the transmission by the Commissioner-General under subsection (2), of his reason for determination, by petition in writing, of the words and figures within one month of the transmission by the Commissioner-General under subsection (2), of his reason for determination, but not later than April 1, 2011, by petition in writing.",
            "pre_block_list": [
              "Amendement of section 167 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "44",
            "text": "Section 168 of the principal enactment is hereby amended by the substitution for the words to the Board of Review,, of the words and figures to the Board of Review before April 1, 2011,.",
            "pre_block_list": [
              "Amendment of section 168 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "45",
            "text": "Section 170 of the principal enactment is hereby amended as follows:-",
            "pre_block_list": [
              "Amendment of Section 170 of the Principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the substitution in subsection (1), (2), (3), (5), (6), (7) and (9) of that section for the words the Board wherever it occurs in those subsections, of the words the Board or the Tax Appeal Commission, as the case may be,, and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the insertion, immediately after subsection (7) of that section, of the following new subsection :-",
                "pre_block_list": [
                  "(7A) Where the Court of Appeal makes an interim determination under subsection (7), the Court may make Order that the full tax in dispute or part thereof, be paid in a manner as the Court considers reasonable, pending the final determination of the appeal.",
                  "Any excess payment of tax arising as a result of the final determination by the Court on the appeal shall be refunded to the appellant",
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "46",
            "text": "The following new section is hereby inserted immediately after section 177 of the principal enactment and shall have the effect as section 177 A  of that enactment :-",
            "pre_block_list": [
              "Insertion of new section 177 A  in the principal enactment. \"Recovery of tax from principal officers and others.",
              "177 A . (1) Where a body corporate has not paid any tax on or before the due date, as required under section 113, it shall be lawful for the Commissioner-General to proceed under all or any of the provisions of this Act against the manager, secretary, any director or any other principal officer of such body corporate, as if such manager, secretary, director of",
              "principal officer, as the case may be, is responsible for such default, unless such manager, secretary, director or principal officer, as the case may be, proves the contrary to the satisfaction of the Commissioner - General, notwithstanding anything in any other written law relating to such body corporate."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where an unincorporated body of persons has not paid any tax on or before the due date, as required under section 113, it shall be lawful for the Commissioner - General to proceed under all or any of the provisions of this Act against any partner or office - bearer of such unincorporated body of persons as if he is responsible for such default, unless such partner of office bearer, as the case may be, proves the contrary to the satisfaction of the Commissioner General, notwithstanding anything in any other written law",
                "pre_block_list": [
                  "",
                  "Amendment of section 200 of the principal enactment."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "47",
            "text": "Section 200 of the principal enactment as last amended by Act, No. 19 of 2009 is hereby further amended by the addition, immediately after subsection (8) of that section, of the following new subsection :-",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "9",
                "text": "Any refund arising to any person, as provided for in this section, shall be credited directly to a bank account of such person",
                "pre_block_list": [
                  "",
                  "Insertion of new section 204 A  in the principal enactment."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "48",
            "text": "The following new section is inserted immediately after section 204 of the principal enactment and shall have effect as section 204 A  of that enactment :-",
            "pre_block_list": [
              "204 A .  Any auditor or tax practitioner who in the discharge of his professional duty, deliberately misinterprets any provision of this Act or regulation, rule or order made there under shall be guilty of an offence under this Act and on conviction after summary trial before a Magistrate, be liable to a fine not",
              "\"Penal provision relating to mis- interpretation of provisions of the Act by auditors and tax practitioners.",
              "exceeding rupees fifty thousand or to imprisonment of either description for a term not exceeding six months or to both such fine and imprisonment",
              ""
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "49",
            "text": "Section 217 of the principal enactment as last amended by Act, No. 19 of 2009 is hereby further amended as follows :-",
            "pre_block_list": [
              "Amendment of section 217 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "in the definition of the expression charitable purpose:-",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "by the substitution in paragraph (b) for the words education or knowledge;, of the words education or knowledge other than by any institution established for business purposes or by any institution established under the Companies Act:;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "by the addition immediately after paragraph ( b ), of the following paragraph :-",
                    "pre_block_list": [
                      "( bb ) activities for the protection of the environment or eco-friendly activities;"
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the insertion, immediately after the definition of the expression taxable income, of the following new definition :-",
                "pre_block_list": [
                  "Tax Appeals Commission means the Tax appeals Commission established by the Tax Appeals Commission Act, No. 23 of 2011;.",
                  "Amendment of the First Schedule to the principal enactment."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "50",
            "text": "The First Schedule to the principal enactment as last amended by Act, No. 19 of 2009, is hereby further amended as follows :-",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the substitution in Part IA of that Schedule, for the words any individual other than an individual referred to in Part II or Part III, of the words and",
                "pre_block_list": [
                  "figures, but ending on or before March 31, 2011, any individual other than an individual referred to in Part II or Part III,;and"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the insertion immediately after Part IA of that Schedule, of the following new Part :-",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "I",
        "text": "",
        "pre_block_list": [
          "For any year of assessment commencing on or after April 1, 2011, any individual other than an individual referred to in Part II or Part III -"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "51",
            "text": "The Second Schedule to the principal enactment as last amended by the Act. No. 19 of 2009, is hereby further amended as follows :-",
            "pre_block_list": [
              "Amendment of the Second Schedule to the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "in PART - A of that Schedule by the substitution for item 1 of that Part, of the following item :-",
                "pre_block_list": [
                  "1. Any venture capital company -"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "For any year of assessment commencing on or after April 1, 2006, but prior to April 1, 2011 on the taxable income",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "For any year of assessment commencing on or after April 1, 2011 - on the taxable income",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the substitution for PART - B of that Schedule of the following new PART :-",
                "pre_block_list": [
                  "PART - B",
                  "1.( a ) For the year of assessment commencing on April 1, 2006 ",
                  "Any company other than a company referred to in PART - A and of which the taxable income does not exceed Rs. 5,000,000"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "For any year of assessment commencing on or after April 1,2007, but prior to April 1, 2011 -",
                    "pre_block_list": [
                      "Any company ",
                      "(A)(i) of which the taxable income does not exceed Rs. 5,000,000/-;"
                    ],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "which is not a company referred to in PART-A; and",
                        "pre_block_list": [
                          "(B) Which is not the holding company, a subsidiary company, or an associate company of a group of companies on the taxable income"
                        ],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "For any year of assessment  commencing on or after April 1, 2011 -",
                    "pre_block_list": [
                      "Any company ",
                      "(A)(i) of which the taxable income does not exceed Rs. 5,000,000/-;"
                    ],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "which is not a company referred to in PART-A; and",
                        "pre_block_list": [
                          "(B) Which is not the holding company, a subsidiary company, or an associate company of a group of companies",
                          "on the taxable income",
                          "For the purpose of item (B) of paragraph ( b ) and paragraph ( c ), the expressions holding company, subsidiary company, and, group of companies shall have the same respective meanings which they have in the Companies Act, No. 7 of 2007.",
                          "2. Any company for the year of assessment being any year of assessment commencing prior to April 1, 2011 in which its shares are first quoted in any official list published by a stock exchange licensed by the Securities and Exchange Commission of Sri Lanka (hereinafter referred to as the first year of assessment) and for each year of assessment within the period of four years immediately succeeding that first year of assessment,",
                          "( a ) for which the taxable income exceeds Rs. 5,000,000/-; or",
                          "( b ) if such company is a holding company, a subsidiary company or an associated company of a group of companies",
                          "on the taxable income for that year of assessment",
                          "Provided that where such first year of assessment is any year of assessment which commences prior to April 1, 2006, the rate of 33 1/3 per centum shall apply in relation to any year of assessment which falls within such period of four years, but which commences on or after April 1, 2006.",
                          "3. Any company other than any company hereinbefore referred to in this Schedule, on the taxable income-",
                          "( a ) for any year of assessment commencing prior to April 1, 2011",
                          "( b ) for any year of assessment commencing after April 1, 2011",
                          "4. Where the taxable income of any company for any year of assessment exceeds five million rupees, then such part of the tax computed in accordance with this Act, as being payable by such company for such year of assessment as is attributable to such excess, shall not be more than such excess",
                          ""
                        ],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "52",
            "text": "The Third Schedule to the principal enactment as last amended by the Act No. 9 of 2008, is hereby further amended as follows:-",
            "pre_block_list": [
              "Amendment of the Third Schedule to the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the substitution in item 7 of that schedule, for the words and figures on or before March 31, 2008 or commencing on or after April 1, 2013 5  per centum , of the words and figures",
                "pre_block_list": [
                  "on or before March 31, 2008                 5  per centum ;"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the substitution for item 8 of that Schedule, of the following item:-",
                "pre_block_list": [
                  "8. Any club or association referred to in section 101, on the taxable income for -"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "any year of assessment commencing prior to April 1, 2011",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "any year of assessment commencing prior to April 1, 2011",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "53",
            "text": "The Fifth Schedule of the principal enactment as amended by the Act No. 9 of 2008, is hereby further amended as follows:-",
            "pre_block_list": [
              "Amendment of the Fifth Schedule to the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the substitution for item 5 of that Schedule, of the following item:-",
                "pre_block_list": [
                  "5. The rate of income tax on profits and income from off-shore foreign currency transaction of any foreign currency banking unit, for "
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "any year of assessment commencing prior to April 1,2011",
                    "pre_block_list": [
                      "Appropriate rate under  Second Schedule;"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "any year of assessment commencing on or after April 1, 2011",
                    "pre_block_list": [
                      "(Section 41)"
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the substitution in item 6 of that Schedule for the words profits and income arising to, of the words and figures profits and income arising before April 1, 2011, to;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "by the substitution in item 8 of that Schedule, for the words profits or gains on the disposal, of the words and figures profits or gains on the disposal on or before March 31, 2007;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "by the substitution for item 9 of that Schedule, of the following item:-",
                "pre_block_list": [
                  "9. The rate of income tax on profits from and undertaking carried on by a person other than a company,"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "engaged in agriculture, promotion of tourism or construction work as defined in section 45 or section 217, being profits for any year of assessment commencing prior to April 1, 2011;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "engaged in agriculture, manufacture of animal feed, promotion of tourism, or construction work as defined in section 45 or section 217, being profits for any year of assessment commencing on or after April 1, 2011.",
                    "pre_block_list": [
                      "(Section 45)"
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "by the substitution for item 10 of that Schedule, of the following item:-",
                "pre_block_list": [
                  "10. The rate of income tax on profits from and undertaking carried on by a company,"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "engaged in agriculture, promotion of tourism or construction work as defined in section 46 or",
                    "pre_block_list": [
                      "section 217, being profits for any year of assessment commencing prior to April 1, 2011;"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "engaged in agriculture, manufacture of animal feed, promotion of tourism, or construction work as defined in section 46 or section 217, being profits for any year of assessment commencing on or after April 1, 2011.",
                    "pre_block_list": [
                      "(Section 46)"
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "by the substitution for item 11 of that Schedule, of the following item:-",
                "pre_block_list": [
                  "11. The rate of income tax applicable to specialized housing banks, for-"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "any year of assessment commencing prior to April 1, 2011",
                    "pre_block_list": [
                      "Appropriate rate under  Second Schedule.;"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "any year of assessment commencing on or after April 1, 2011",
                    "pre_block_list": [
                      "(Section 47)"
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "by the substitution for item 14 of that Schedule, of the following new item:-",
                "pre_block_list": [
                  "14 A . The profits and income of any agricultural undertaking referrd to in section 16 of the Act, for any year of assessment commencing prior to April 1, 2011;",
                  "As per the First Schedule, but subject to a maximum of 10 per centum   for an individual, and 10   per centum for a company.;",
                  "(Section 48A)"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "8",
                "text": "by the substitution for item 16 of that Schedule, of the following item:-",
                "pre_block_list": [
                  "16. The rate of income tax on qualified export profits and income of a person not being a company, who commenced to carry on any specified undetaking prior to April 1, 2014, for-"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "any year of assessment commencing prior to April 1, 2011",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "any year of assessment commencing on or after April 1, 2011",
                    "pre_block_list": [
                      "(Section 50)"
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "9",
                "text": "by the substitution for item 17 of that Schedule, of the following item:-",
                "pre_block_list": [
                  "17. The rate of income tax on qualified export profits and income of a  company, which commenced to carry on any specified undetaking prior to April 1, 2014, for-"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "any year of assessment commencing prior to April 1, 2011;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "any year of assessment commencing on or after April 1, 2011",
                    "pre_block_list": [
                      "(Section 51)"
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "10",
                "text": "by the substitution for item 18 of that Schedule, of the following item:-",
                "pre_block_list": [
                  "18. The rate of income tax on qualified export profits and income of a  company, which commenced to carry on any specified undetaking prior to April 1, 2015, for-"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "any year of assessment commencing prior to April 1, 2011",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "any year of assessment commencing on or after April 1, 2011",
                    "pre_block_list": [
                      "(Section 52)"
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "11",
                "text": "by the substitution for item 20 of that Schedule, of the following item:-",
                "pre_block_list": [
                  "20. The rate of income tax on profits and income from deemed exports of any person or partnership, for-"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "any year of assessment commencing prior to April 1, 2011",
                    "pre_block_list": [
                      "As per the First Schedule, but subject to a maximum of 15 per centum  for an individual, and 15 per centum   for a company."
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "any year of assessment commencing on or after April 1, 2011",
                    "pre_block_list": [
                      "As per the First Schedule, but subject to a maximum of 12  per centum for an individual, and 12   per centum for a company.;",
                      "(Section 56)"
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "12",
                "text": "by the substitution for item 24 of that Schedule, of the following item:-",
                "pre_block_list": [
                  "24. The rate of income tax applicable to any partnership on divisible profits and other income, other than on any assessment made, for-"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "any year of assessment commencing prior to April 1, 2011",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "any year of assessment commencing on or after April 1, 2011",
                    "pre_block_list": [
                      "8   per centum. ;",
                      "(Section 78)"
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "13",
                "text": "by the substitution for item 25 of that Schedule, of the following item:-",
                "pre_block_list": [
                  "25. The rate of income tax applicable to any person who is not a citizen of Sri Lanka carrying on the profession or vocation of an entertainer or artiste, for-"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "any year of assessment commencing prior to April 1, 2011",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "any year of assessment commencing on or after April 1, 2011",
                    "pre_block_list": [
                      "12   per centum. ;",
                      "(Section 96)"
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "14",
                "text": "by the substitution for item 26 of that Schedule, of the following item:-",
                "pre_block_list": [
                  "26. The rate of income tax applicable to any profits and income from petroleum exploration of any person, or in the case of a partner of a partnership, as referred to in section 105, for-"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "any year of assessment commencing prior to April 1, 2011",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "any year of assessment commencing on or after April 1, 2011",
                    "pre_block_list": [
                      "12   per centum .;",
                      "(Section 105)",
                      "15. by the substitution for item 27 of that Schedule, of the following item :-",
                      "27.  The rate of income tax applicable to the profits on the receipt of any fund set up or funds received by a Non Governmental Organization, for-",
                      "( a ) any year of assessment  commencing prior to April 1, 2011",
                      "( b ) any year of assessment commencing on or after April 1, 2011",
                      "28   per centum. ;",
                      "(Section 102)",
                      "16. by the addition, immediately after item 28 of that Schedule, of the following new items:-",
                      "29. The rate of income tax applicable to such part of  the taxable income of any person or  partnership,  as consists of profits or income from the manufacture and sale or import and sale of any liquor or tobacco product, for any year of assessment commencing on or after April 1, 2011",
                      "As per the First Schedule, but subject to a maximum of 10 per centum  for an individual, and 10 per centum   for a company.",
                      "30. Rate of income tax applicable to such part of the  profits of any person engaged in an undertaking referred to in section 59A;",
                      "31. The rate of income tax applicable to any undertaking carried on in Sri Lanka for operation and maintenance of facilities  for  storage, development of software, or supply of labour",
                      "As per the First Schedule, but subject to a maximum of 10  per centum  for an individual, and 10 per centum  for a company.",
                      "32. The rate of income tax applicable to profits and income from educational services.",
                      "As per the First Schedule, but subject to a maximum of 10 per centum  for an individual, and 10 per centum  for a company.",
                      "33. Rate of income tax applicable to any undertaking with an annual  turnover  not exceeding rupees three hundred million other than buying and selling activities."
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "54",
            "text": "The following new section is hereby inserted immediately after section 208 of the principal enactment and shall have effect as section 208A of that enactment:-",
            "pre_block_list": [
              "Insertion of new section 208A in the principal enactment.",
              "208A. The Commissioner-General shall appoint a Committee comprising senior officers of the Department of Inland Revenue who shall be mandated to interpret the provisions of all Acts administered by him, notwithstanding anything to the contrary in any such Act. Such Committee shall in terms of such mandate issue all necessary guidelines and instructions as are required in order to ensure uniformity with regard to such interpretation",
              "",
              "Committee to interpret provisions of Act and issue rulings."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "55",
            "text": "Any person or partnership carrying on an enterprise, having an annual turnover of a sum not exceeding rupees one hundred million who is liable to pay income tax under the Inland Revenue Act, No. 10 of 2006, who has defaulted in the payment of such tax as is payable by him under such Act in respect of any year of assessment ending on or before March 31, 2010, due to the existence generally of any conflict environment or due to any financial constraints of such persons or partnership, shall be exempted from the payment of such tax as is in default under such Act:",
            "pre_block_list": [
              "Exemption of income tax payable by certain small and medium enterprises.",
              "Provided that, the Commissioner-General of Inland Revenue shall on a request made in that behalf, issue to such person or partnership a Certificate of Exemption in respect of the tax in default:",
              "Provided further, the person or parternship to whom the Certificate of Exemption is issued, shall simultaneously",
              "forward to the Commissioner-General of Inland Revenue a written assurance to the effect that such person or partnership will be responsible for the payment of all sums which may become payable by him under scuh Act, in respect of any year of assessment commencing on or after April 1, 2010."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "56",
            "text": "The amendments made to the principal enactment by the provisions of this Act, shall be deemed for all purposes to have come into force on April 1, 2011:",
            "pre_block_list": [
              "Retrospective effect.",
              "Provided that:-"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "the amendments made to section 7 of the principal enactment by subsection (2) of section 3 of this Act, shall be deemed for all purposes to have come into force on April 1, 2008;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "the amendments made to sections 20, 21 and 21 A  of the principal enactment by section 10, section 11 and section 12 respectively of this Act, shall be deemed for all purposes to have come into force on April 1, 2009.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "57",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of an inconsistency",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , D EPARTMENT   OF G OVERNMENT  I NFORMATION , N O . 163, K IRULAPONA  M AWATHA , P OLHENGODA , C OLOMBO  05 before 15th December each year in respect of the year following ."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}