{
  "n_pages": 12,
  "title_page": {
    "title": "Department Of Coast Guard Act",
    "num": "41",
    "year": "2009",
    "date_certified": "2009-08-06",
    "date_published": "2009-08-07",
    "price": 6.5,
    "price_postage": 5.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 06Th August, 2009]",
      "L.D.O. 29/2007.",
      "A N  A Ct   To   Provide   For   The   Establishment   Of   A  D Epartment   Of C Oast  G Uard ;  To   Specify   The   Functions   Of   The  D Epartment   Of C Oast  G Uard ;  And   To   Provide   For   Matters   Connected   Therewith",
      "Or   Incidental   Thereto .",
      "Whereas It Is Expedient To Provide For The Establishment Of A Multi-Mission Service To Be Called The Coast Guard Service For The Purpose Of Ensuring The Security Of The Coastal Areas, The Maritime Zones, The Territorial Waters Of Sri Lanka And The High Seas:",
      "Preamble.",
      "And Whereas The Department Of Coast Guard Shall, Assist In Preventing, The Entry And Exit Of Illegal Immigrants And Emigrants, The Trafficking Of Narcotic Drugs And Psychotropic Substances, The Detection And Seizure Of Contraband And Weapons; Be Entrusted With Providing Assistance To Ships  Which Meet With Distress At Sea And To Persons Found Aboard Such Ships, To Provide Assistance In Ensuring Maritime Traffic Safety, Protect The Marine Environment, Prevent And Combat Maritime Disasters, Co- Operate With Domestic And Foreign Organizations For The Purpose Of Protecting National Interests In All Such Areas And Thereby Ensuring National Security And Protecting The National Economy And The National Integrity Of Sri Lanka:",
      "Be It Therefore Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Department of Coast Guard Act, No. 41 of 2009.",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "I",
        "text": "",
        "pre_block_list": [
          "E STABLISHMENT   OF   THE  D EPARTMENT   OF  C OAST  G UARD",
          "Department of Coast Guard."
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be a Department of Coast Guard which shall be under the control of a Director-General of Coast Guard.",
                "pre_block_list": [
                  "2PL 0041134,200  (06/2009)",
                  "Department of Coast Guard Act, No. 41 of 2009 2"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Department of Coast Guard shall be charged with the implementation of the powers, duties and functions specified in this Act and be responsible for the proper and efficient functioning of the Coast Guard Service.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "There shall be established in accordance with the provisions of this Act, a service to be called the Coast Guard Service, which shall be charged with the function of law enforcement in the coastal areas, the maritime zones of Sri Lanka and the high seas.",
            "pre_block_list": [
              "Establishment of the Department of Coast Guard."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "II",
        "text": "",
        "pre_block_list": [
          "D UTIES   AND   FUNCTIONS   OF   THE  D EPARTMENT   OF   C OAST  G UARD"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "The functions of the Department of Coast Guard shall be",
            "pre_block_list": [
              "Duties and functions of the Department of Coast Guard."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "to prevent illegal fishing in the coastal areas of  Sri Lanka and the protection of fishermen including rendering assistance at sea;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "to assist the Customs and other relevant authorities in combating anti-smuggling and anti-immigration operations;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "to initiate action to prevent and manage piracy at sea;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "to co-operate with the law enforcement agencies and the armed forces by taking necessary measures for the suppression of destructive terrorist activities occuring in the maritime zones and the territorial waters of Sri Lanka;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "to prevent transboundary movement of narcotics, by sea;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "to assist the relevant authorities in ensuring safety of life and property at sea;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "g",
                "text": "to participate in search and rescue operations for human beings in times of natural catastrophes and to assist in salvage operations in relation to vessels and other goods after such catastrophes and other accidents at sea;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "h",
                "text": "to assist in the preservation and protection of maritime and marine environment;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "to assist the relevant authorities in the implementation and monitoring of measures required for the prevention and control of marine pollution and other disasters which occur at sea;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "j",
                "text": "to assist in the conservation of marine species;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "k",
                "text": "to disseminate information including warnings by radio or any other means in times of natural catastrophes; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "l",
                "text": "the performance of such other functions as may from time to time be conferred on it or assigned to it, by the Government.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Department of Coast Guard shall have the power to",
                "pre_block_list": [
                  "Powers of the Department of Coast Guard."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "stop, enter, board, inspect and search any place, structure, vessel or aircraft and to arrest and detain any vessel or aircraft;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "demand the production of any licence, permit, record, certificate or any other document and to inspect such licence, permit, record, certificate or other document or make copies of or take extracts from such licence, permit, record, certificate or other document;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "investigate any offence which it has reason to believe is being committed or is about to be committed or has been committed;",
                    "pre_block_list": [
                      "Department of Coast Guard Act, No. 41 of 2009 4"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "exercise the right of hot pursuit;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "examine and seize or dispose of any fish or any article, device, goods, vessel, air craft or any other item relating to any offence which has been committed or it has reasonable grounds to believe that such offence has been committed; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "arrest any person whom it has reason to believe has committed an offence under any written law of Sri Lanka for the time being in force.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Notwithstanding the provisions of subsection (1), no vessel shall be arrested or detained within the territorial waters if the passage of that vessel within the territorial waters, is an innocent passage.",
                "pre_block_list": [
                  "For the purpose of this section, the passage of a vessel is an innocent passage if the passage is not prejudicial to the peace, good order or security of Sri Lanka."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "Every Coast Guard officer of the Department of Coast Guard shall be deemed to be a peace officer within the meaning and for the purposes, of the Code of Criminal Procedure Act, No. 15 of 1979.",
            "pre_block_list": [
              "Members of the Department of Coast Guard deemed to be peace officers."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "Coast Guard officers may carry arms in so far as the same is necessary for the performance of their duties. The categories of arms Coast Guard officers may carry shall be as prescribed.",
            "pre_block_list": [
              "Carrying of Arms."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "A Coast Guard officer may, when necessary for the performance of his duties",
            "pre_block_list": [
              "Coast Guard officers Right to visit and inspect a vessel."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "direct the shipmaster or other person commanding a vessel to produce the ships official papers which are required to be kept aboard;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "stop, visit and inspect the vessel for the purpose of ascertaining her identity, port of registry, name of the ship master, last port or place of departure, port or place of destination or nature of the cargo ; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "question the crew and passengers on matters necessary for the performance of his duties.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "Every Coast Guard officer shall when acting under this Act, be in uniform and on demand declare his office and produce to the person against whom he is acting or from whom he seeks any information, the official identity card or other identification documents issued by the Department of Coast Guard.",
            "pre_block_list": [
              "Identification."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "10",
            "text": "Nothing contained in this Act shall be construed to permit the Department of Coast Guard or its personnel to be trained or organised as a military establishment or to function as such.",
            "pre_block_list": [
              "Department of Coast Guard or its personnel not to be trained as a military establishment."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "III",
        "text": "",
        "pre_block_list": [
          "A DVISORY  C OUNCIL"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "11",
            "text": "The Minister shall appoint an Advisory Council, which shall consist of the following:",
            "pre_block_list": [
              "Advisory Council."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "the following  ex-officio  members :",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "i",
                    "text": "the Secretary to the Ministry of the Minister in charge of the subject of Defence or his representative;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "the Secretary to the Ministry of the Minister in charge of the subject of Fisheries or his representative;",
                    "pre_block_list": [
                      "Department of Coast Guard Act, No. 41 of 2009 6"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iii",
                    "text": "the Secretary to the Ministry of the Minister in charge of the subject of Finance or his representative;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iv",
                    "text": "Secretary to the Ministry of the Minister in charge of the subject of Ports and Shipping or his representative;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "v",
                    "text": "Secretary to the Ministry of the Minister in charge of the subject of Environment and Natural Resources or his representative;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "vi",
                    "text": "Secretary to the Ministry of the Minister in charge of the subject of Coast Guard or his representative;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "vii",
                    "text": "the Commander of the Navy ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "viii",
                    "text": "the Inspector-General of Police ; and",
                    "pre_block_list": [
                      "(ix) Director-General of the Department of Coast Guard ;"
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "the Minister may whenever it appears to him to be necessary, co-opt for service in the Advisory Council any official whose services are required by the Council in connection with any specific matter under consideration by the Council.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "12",
            "text": "The Advisory Council shall conduct an annual review of the activities of the Department of Coast Guard and submit a comprehensive report to the Minister. The Council shall also recommend to the Minister, the policies which in the opinion of the Council ought to be implemented by the Department of Coast Guard. The Council shall also whenever required to do so, advice the Minister in respect of any matter on which their advice is sought.",
            "pre_block_list": [
              "Functions of the Advisory Council."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "13",
            "text": "The Advisory Council may for the purpose of carrying out the purposes of this Act, make rules specifying the procedure to be followed at its meetings, the quorum and agenda for its meetings and the manner of submission of reports.",
            "pre_block_list": [
              "Rules."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "14",
            "text": "Notwithstanding anything contained in any other written law, where a person is arrested under this Act, no prosecution shall be instituted against that person except by or with the written consent of the Attorney-General.",
            "pre_block_list": [
              "Prosecution."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "IV",
        "text": "",
        "pre_block_list": [
          "G ENERAL"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "15",
            "text": "The officers of the Depertment of Coast Guard shall be paid such remuneration as may be determined by the Minister in consultation with the Minister in charge of the subject of Finance and such remuneration shall be charged to the Consolidated Fund.",
            "pre_block_list": [
              "Remuneration of officers &c,"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "16",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "At the request of the Department of Coast Guard, any officer in the public service may, with the consent of that officer and the Chairman of the Public Service Commission, be temporarily  appointed to the staff of the Department of Coast Guard for such period as may be determined by the Department or be permanently appointed to such staff.",
                "pre_block_list": [
                  "Appointment of public officers to the Department of Coast Guard."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where any officer of the public service is appointed to the staff of the Department as specified in subsection (1), such appointment shall be on terms and conditions which are not less favourable to those which such officer was enjoying on the day immediately prior to the date of such appointment and from and after the date of such appointment all matters relating to such officer shall be governed by the prevailing government regulations as may be applicable from time to time.",
                "pre_block_list": [
                  "Department of Coast Guard Act, No. 41 of 2009 8"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where the Department of Coast Guard employs any person who has agreed to serve the government for a specified period, such period of service to the Department by that person, shall be regarded as service to the Government for the purpose of discharging the obligation for such agreement.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "17",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "At the request of the Department of Coast Guard, any officer or servant of any public corporation may, with the consent of such officer or servant and the governing board of such officer or servant be temporarily appointed to the staff of the Department for such period as may be derermined by the Department, on such terms and conditions as may be agreed upon by the Department and the governing board of such corporation.",
                "pre_block_list": [
                  "Appointment of officers and servants of public corporations to the staff of the Department of Coast Guard."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where any person is appointed under subsection (1) to the staff of the Department such person shall be subject to the same disciplinary control as any other member of the staff.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "18",
            "text": "Any Coast Guard officer who acts in contravention of the provision of this Act or any other written law, in the carrying out of his duties shall be guilty of an offence and shall be, liable to be tried by a Magistrate and punished with such punishment as is specified for such offence.",
            "pre_block_list": [
              "Offences."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "19",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Minister may on the recommendation of the Advisory Council make regulations for giving effect to the principles and provisions of the Act and in respect of matters required by this Act to be prescribed or in respect of which regulations are authorized or required to be made.",
                "pre_block_list": [
                  "Regulations."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Without prejudice to the generality of the powers conferred by subsection (1), regulations may be made in respect of any or all of the following matters :",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the constitution, governance, qualifications, command and discipline of the Department of Coast Guard ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the recruitment of persons to the Department of Coast Guard ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "the conditions of service of members of the Department of Coast Guard ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "the rank, powers and authority of officers, subordinate officers and other persons ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "the dismissal, retirement, release promotion or discharge from the Department of Coast Guard of officers, subordinate officers and other enrolled persons ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "any other matter which is to be or may be prescribed or in respect of which this Act makes no provision or makes insufficient provision which in the opinion of the Minister, is necessary for the proper implementation of this Act.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every regulation made by the Minister shall be published in the  Gazette  and shall come into operation on the date of such publication or on such later date as may be specified in the regulation.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Every regulation made by the Minister shall, as soon as convenient after its publication in the  Gazette , be brought before Parliament for approval. Any regulation which is not so approved shall be deemed to be rescinded as from the date of such disapproval, but without prejudice to anything previously done thereunder.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Notification of the date on which any regulation is deemed to be rescinded shall be published in the  Gazette .",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "20",
            "text": "The Coast Guard Unit established pursuant to a decision of the Cabinet of Ministers and presently attached to the Ministry of Fisheries and Aquatic Resources, shall, with effect from the date of the coming into operation of this Act, stand transferred to the Ministry of Defence, Public Security, Law and Order, along with all personnel, property and other assets.",
            "pre_block_list": [
              "Transfer of the Coast Guard Unit attached to the Ministry of Fisheries and Aquatic Resources.",
              "Department of Coast Guard Act, No. 41 of 2009 10"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "21",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "22",
            "text": "In this Act, unless the context otherwise requires",
            "pre_block_list": [
              "Interpretation.",
              "Coast Guard officer means any person attached to the regular service of the Department of Coast Guard;",
              "maritime zones shall have the same meaning as in the Maritime Zones Law, No. 22 of 1977 ;",
              "territorial waters shall have the same meaning as in the Constitution.",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , D EPARTMENT   OF G OVERNMENT  I NFORMATION , N O . 163, K IRULAPONA  M AWATHA , P OLHENGODA , C OLOMBO  05 before 15th December each year in respect of the year following ."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}