{
  "n_pages": 4,
  "title_page": {
    "title": "Local Authorities Filling Of Vacancies (Special Provisions) Act",
    "num": "30",
    "year": "2013",
    "date_certified": "2013-07-12",
    "date_published": "2013-07-12",
    "price": 2.0,
    "price_postage": 5.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 12Th July, 2013]",
      "L.D.O. 31/2013.",
      "A N  A Ct   To   Provide   For   The   Filling   Of   Vacancies   In   The   Office   Of M Ayor , D Eputy  M Ayor   Or   A  M Ember   Of  L Ocal  A Uthorities",
      "Elected   Under   The  L Ocal  A Uthorities  E Lections  O Rdinance (C Hapter  262);  And   For   Matters   Connected   Therewith   Or",
      "Incidental   Thereto .",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the  Local Authorities Filling of Vacancies (Special Provisions)  Act, No. 30 of 2013.",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "For the purpose of filling of a vacancy in the office of Mayor, Deputy Mayor or a Member, elected to any local authority under the provisions of the Local Authorities Elections Ordinance (Chapter 262), which were in operation on the date immediately preceding the date of coming into operation of the Local Authorities Elections (Amendment) Act, No. 22 of 2012, the provisions of the said Ordinance, shall apply to and in relation to the filling of such vacancies, notwithstanding the repealing or amendment of  the relevant provisions by the Act, No. 22 of 2012:",
            "pre_block_list": [
              "Filling of vacancies of Mayor etc. elected under the Local Authorities Elections Ordinance (Chapter 262).",
              "Provided however that, where a vacancy occurs in the office of Mayor in the circumstances specified in subsection (4) of section 66 B , inserted in the said Ordinance by the Act, No. 22 of 2012, then the provisions of that subsection shall apply in relation thereto."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "The provisions of this Act shall be in operation for a period of four years commencing from the date of commencement of this Act.",
            "pre_block_list": [
              "Duration of the Act."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "Any vacancy in the office of Mayor, Deputy Mayor or Member, filled during the period commencing from January 1, 2013 and ending on the date of commencement of this Act in terms of the provisions of the Local Authorities",
            "pre_block_list": [
              "Validation.",
              "2PL 007411   4090 (07/2013)",
              "Elections Ordinance (Chapter 262) which were in operation on the date immediately preceding the date of coming into opreation of the Local Authorities Elections (Amendment) Act, No. 22 of 2012 shall be deemed to have been validly filled."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "In this Act",
            "pre_block_list": [
              "Interpretation.",
              "Deputy Mayor means the Deputy Mayor of a Municipal Council or the Vice-Chairman of an Urban Council or a Pradeshiya Sabha; and",
              "Mayor means the Mayor of a Municipal Council or the Chairman of an Urban Council or a Pradeshiya Sabha."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency.",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , D EPARTMENT   OF G OVERNMENT  I NFORMATION , N O . 163, K IRULAPONA  M AWATHA , P OLHENGODA , C OLOMBO  05 before 15th December each year in respect of the year following ."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}