{
  "n_pages": 53,
  "title_page": {
    "title": "Social  Security  Contribution  Levy Act",
    "num": "25",
    "year": "2022",
    "date_certified": "2022-09-20",
    "date_published": "2022-09-23",
    "price": 85.0,
    "price_postage": 35.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 20Th Of September, 2022]",
      "L.D.-O. 81/2021",
      "A N  A Ct   To   Provide   For   The   Imposition   And   Collection   Of   A   Levy",
      "Known   As   The  S Ocial  S Ecurity  C Ontribution  L Evy   On   The    Liable",
      "Turnover   Of   Every   Person   To   Whom   This  A Ct   Applies ;  And   To",
      "Provide   For   Matters   Connected   Therewith   Or   Incidental   Thereto .",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:-"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Social Security Contribution Levy Act, No. 25 of 2022 and shall come into operation on the First day of October 2022.",
            "pre_block_list": [
              "Short title and date of operation"
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "I",
        "text": "",
        "pre_block_list": [
          "I MPOSITION   OF  S OCIAL  S ECURITY C ONTRIBUTION  L EVY"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "The provisions of this Act shall apply to every person (in this Act referred to as a taxable person) who -",
            "pre_block_list": [
              "Persons to whom this Act applies"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "imports any article;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "carries on the business of manufacture of any article;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "carries on the business of providing a service of any description; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "carries on the business of wholesale or retail sale of any article including importation and sale of such article other than a sale by the manufacturer of that article being a manufacturer to whom the provisions of paragraph ( b ) applies.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "A levy known as the Social Security Contribution Levy  (in this Act referred to as the levy) shall, subject to the provisions of this Act, be charged from every taxable person for every quarter (in this Act referred to as the relevant",
                "pre_block_list": [
                  "Imposition of the Social Security Contribution Levy",
                  "quarter) on or after October, 1, 2022 in respect of the liable turnover, specified in the Second Schedule hereto, at the rate of 2.5  per centum , in the following manner:-"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "In case of a taxable person referred to in paragraph ( a ) of section 2, the levy shall be charged in respect of the liable turnover of such person arising from the importation of such article; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "In case of a taxable person referred to in paragraph ( b ), ( c ) or ( d ) of section 2, the levy shall be charged in respect of the liable turnover of such person.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "For the purposes of this Act, turnover-",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "with reference to a taxable person referred to in paragraph ( a ) of section 2, arising from the importation from any article means, the value of that article ascertained for the purpose of the Value Added Tax under section 6 of the Value Added Tax Act, No. 14 of 2002, but does not include the value of any exempted article referred to in Part IA of the First Schedule;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "with reference to any taxable person referred to in paragraph ( b ) of section 2, and to any relevant quarter means, the sum receivable whether received or not, in that quarter, of any article manufactured and sold in Sri Lanka by such person other than any exempted article referred to in Part IA of the First Schedule;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "with reference to any taxable person referred to in paragraph ( c ) of section 2 and to any relevant quarter means",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "the sum receivable whether received or not, from the supply in Sri Lanka of any financial services by any person carrying on the business of supplying any financial services in Sri Lanka but does not include the exempted services referred to in Part II of the First Schedule;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "the value of any service arising from the business of real estate and improvement ascertained under subsection (7) of section 5 of the Value Added Tax Act, No. 14 of 2002 for the purpose of the said Act but does not include the exempted services referred to in Part II of the First Schedule; and",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "the sum receivable, whether received or not, from the provision of any service in Sri Lanka other than the services referred to in subparagraphs (i) and (ii) and any exempted service referred to in Part II of the First Schedule; and",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "with reference to any taxable person referred to in paragraph ( d ) of section 2 and to any relevant quarter means the sum receivable, whether received or not, from the wholesale or retail sale of any article in Sri Lanka other than any exempted article referred to in Part IB of the First Schedule.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The turnover specified in subsection (2) for the relevant quarter of any taxable person shall not include",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "any bad debt incurred by such person in that quarter:",
                    "pre_block_list": [
                      "Provided however, any bad debt recovered in any relevant quarter, shall be included in the turnover of that relevant quarter; or"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "any Value Added Tax under the Value Added Tax Act, No. 14 of 2002 paid for that relevant quarter; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "any rebate paid under the Export Development Rebate in relation to any international event as approved by the Minister.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "II",
        "text": "",
        "pre_block_list": [
          "R EGISTRATION  U NDER  T HE  A CT"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Every taxable person, other than a taxable person referred to in paragraph ( a ) of section 2, who, carries on or carries out any activity referred to in section 2 (in this Act referred to as a taxable activity) shall be required to be registered under this Act by making an application for such purpose to the Commissioner-General of Inland Revenue (in this Act referred to as the Commissioner-General) in the specified form-",
                "pre_block_list": [
                  "Taxable persons to be registered"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "not later than fifteen days from the date of operation of this Act, in the case of a taxable person whose aggregate of the turnover, within the twelve months period immediately prior to the date of operation of this Act, exceeded one hundred and twenty million rupees;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "not later than fifteen days from the date on which the aggregate of the turnover for a quarter exceeds or is likely to exceed thirty million rupees, in the case of a taxable person to whom paragraph ( a ) does not apply.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where the Commissioner-General is of the opinion that the turnover of any person referred to in subsection (1) relates to a single isolated transaction, such turnover may be excluded in calculating the total turnover of such person for the purpose of registration under this section.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Commissioner-General shall-",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "upon receipt of an application by any person under subsection (1); or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "where an application has not been received under subsection (1), but the Commissioner-General is of the opinion, having regard to the nature of the activities carried on or carried out by such person, that such person is required to be registered under this Act,",
                    "pre_block_list": [
                      "register such person with effect from such date as the Commissioner-General may determine (in this Act referred to as a registered person)."
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Any registered person may make an application in the specified form to the Commissioner-General to have his registration cancelled, at any time after the lapse of a period of twelve months following the date of registration, where-",
                "pre_block_list": [
                  "Cancellation of registration"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "such registered person has ceased to carry on or carry out a taxable activity referred to in section 2; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the aggregate turnover of such registered person during each immediately preceding four quarters of the relevant quarter does not exceed hundred and twenty million rupees.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Commissioner-General-",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "shall, on receipt of an application under subsection (1); or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "may at any time,",
                    "pre_block_list": [
                      "and upon being satisfied with the provisions of paragraphs ( a ) and ( b ) of subsection (1) cancel such registration."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Commissioner-General may refuse to cancel the registration of any person, where the Commissioner-General is not satisfied that the conditions specified in paragraph ( a ) or ( b ) of subsection (1) exist.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where the Commissioner-General cancels the registration of a taxable person, he shall inform such person of the date of cancellation of the registration by registered post or by electronic means.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "Notwithstanding the cancellation of registration under section 5, a taxable person shall be liable for any act done or omitted to be done under this Act while he remained a registered person under this Act.",
            "pre_block_list": [
              "Liability not affected by cancellation of registration"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "Every registered person shall notify the Commissioner- General in writing or by electronic means of any change",
            "pre_block_list": [
              "Registered taxable person to notify certain changes"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "of the name, address and place at which any taxable activity is carried on or carried out by such person;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "of the nature of the taxable activity carried on or carried out by such person;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "of the person authorized to sign returns and other documents in respect of any activity carried on or carried out by such person; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "of ownership of the taxable activity carried on or carried out by such person,",
                "pre_block_list": [
                  "not later than fourteen days after the occurrence of such change."
                ],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "III",
        "text": "",
        "pre_block_list": [
          "R ETURNS  A ND  I NFORMATION"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Every registered person shall furnish to the Commissioner-General a return either in writing or by electronic means for every quarter on or before the twentieth day of the month after the end of each relevant quarter. Every such return shall be in the form specified by the Commissioner-General.",
                "pre_block_list": [
                  "Returns and information to be furnished"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every registered person who furnishes such return under subsection (1) which is not in such form shall be deemed for the purposes of this Act, not to have furnished a return as required by subsection (1).",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Assistant Commissioner shall issue a notice to a person referred to in subsection (2) requiring such person to furnish within fourteen days of receipt of such notice, a return as specified in subsection (1).",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The Assistant Commissioner shall acknowledge receipt of the return only upon receipt of a proper return as specified in subsection (1) which shall be considered a valid return for the purposes of this Act.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "For the purposes of obtaining full information in respect of the turnover of any registered person, the Assistant Commissioner may give notice in writing or by electronic means to such person requiring him",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "to produce for examination or transmit to the Assistant Commissioner, within the period specified in such notice any books of accounts whether contained in a manual, mechanical or electronic format or combination thereof, trade lists, stock lists, registers, invoices, cheques, bank statements, paying-in-slips, accounts, auditors reports or other documents in his possession as may be specified in order to verify the entries in such books, documents and accounts; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "to attend in person or by an authorized representative at such place and on such date and at such time as may be specified in the notice for the purpose of being examined regarding the taxable activity carried on or carried out by that person.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "An Assistant Commissioner may retain in his custody as long as such retention is necessary for the purpose of this Act any books of accounts whether contained in a manual, mechanical or electronic format or combination thereof, trade lists, stock lists, registers, invoices, cheques, bank statements, paying-in-slips, accounts, auditors reports or other documents in his possession as may be specified in order to verify the entries in such books, documents or accounts.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "A return, statement or form purporting to be furnished under this Act by or on behalf of any registered person shall for all purposes be deemed to have been furnished by that person or by his authority, as the case may be, unless the contrary is proved, and any registered person signing such return, statement or form shall be deemed to be cognizant of all matters contained therein.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "8",
                "text": "Where any registered person fails to comply with the provisions of this section or fails to comply with the requirements of a notice given to such person, the Commissioner-General may",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "impose on such person a penalty of a sum not exceeding fifty thousand rupees; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "give notice in writing or by electronic means  to such person of the imposition of such penalty and require such person",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "to pay such penalty; and",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "to comply with the requirements of this section within such period as may be specified in such notice.",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "9",
                "text": "The Commissioner-General may reduce or annul any penalty imposed on any registered person under paragraph ( a ) of subsection (8) if such person proves to the satisfaction of the Commissioner-General that his failure to comply with the provisions of this section was due to circumstances beyond his control and that he has subsequently complied with the provisions.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "IV",
        "text": "",
        "pre_block_list": [
          "A SSESSMENT   OF  L EVY"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where-",
                "pre_block_list": [
                  "Power of Assistant Commissioner to make assessment"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "any registered person who, in the opinion of the Assistant Commissioner is chargeable with the levy, fails to furnish a return for the  relevant quarter; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "any registered person, who is chargeable with the levy, furnishes a return in respect of any relevant quarter but fails to pay the levy fully or partly for that relevant quarter; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "any registered person requests the Commissioner- General in writing or by electronic means to make any alteration or addition to any return furnished by such person for the relevant quarter,",
                    "pre_block_list": [
                      "the Assistant Commissioner may   assess the amount of the levy, which such person, in the opinion of the Assistant Commissioner, ought to have paid for that relevant quarter and shall, by notice in writing or by electronic means, require such person to pay such amount forthwith. The amount so assessed in respect of such person for the relevant quarter shall, be deemed to be the amount of the levy payable by him for that relevant quarter."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The notice issued under subsection (1) may refer any penalty imposed under section 18.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where an assessment is made under subsection (1) the difference between the amount so assessed and the amount paid by such person as the levy for the relevant quarter shall be the levy in default for that relevant quarter.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "10",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where it appears to the Assistant Commissioner that a registered person chargeable with the levy has, for the relevant quarter, paid as levy an amount less than the due amount of the levy payable by him or chargeable from him for that quarter, the Assistant Commissioner may, assess such person at the additional amount at which, according to the opinion of the Assistant Commissioner, the levy ought to have been paid by such person. The Assistant Commissioner shall give such person a notice of such assessment accordingly.",
                "pre_block_list": [
                  "Additional assessments"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where an assessment is made under subsection (1), the amount so assessed shall be deemed to be the levy in default in respect of such person for that relevant quarter and accordingly such person shall, from the date on which such person ought to have paid the levy for that relevant quarter, be liable to the penalty in respect to such amount as specified in section 18.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "11",
            "text": "Where the Assistant Commissioner does not accept a return furnished by any registered person and makes an additional assessment on such person for the relevant quarter under section 10, the Assistant Commissioner shall communicate to such person in writing or by electronic means the reasons therefor.",
            "pre_block_list": [
              "Assistant Commissioner to state reasons"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "12",
            "text": "Where the Assistant Commissioner is of the opinion that a registered person has -",
            "pre_block_list": [
              "Power of the Assistant Commissioner to determine the open market value"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "sold any article or provided any service  for a value less than the open market value of such article or service or for no value; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "entered into a transaction, between two associated persons, in respect of which the sale of any article or the provision of any service has been made,",
                "pre_block_list": [
                  "in order to avoid the payment of the levy, the Assistant Commissioner shall, having regard to the circumstances of such transaction and the time period of the sale of such article or the provision of such service determine the open market value of such article or service on which the levy shall be charged."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "13",
            "text": "Where the Assistant Commissioner is of the opinion that any transaction which reduces or would have the effect of reducing the amount of levy payable by any person is artificial or fictitious or that any disposition is not in fact given effect to, he may disregard any such transaction or disposition and the parties to the transaction or disposition shall be assessable accordingly.",
            "pre_block_list": [
              "Certain transactions and dispositions to be disregarded"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "14",
            "text": "The production of any document in writing or by electronic means, under the hand of the Commissioner- General purporting to be a copy of or extract from any return or assessment made under this Act shall be admissible in all courts and shall be sufficient evidence of the original.",
            "pre_block_list": [
              "Evidence of returns and assessments"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "15",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where any registered person has furnished a return under section 8 in respect of the relevant quarter for levy in respect of any period, it shall not be lawful for the Assistant Commissioner, to make an additional assessment after the expiration of three years from the end of the relevant quarter in respect of which the return is furnished.",
                "pre_block_list": [
                  "Limitation of time for additional assessment"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Notwithstanding the provisions of subsection (1) where the Assistant Commissioner is of the opinion that a person has willfully or fraudulently failed to make a full and true disclosure of all the material facts necessary to determine the amount of levy payable by him for any relevant quarter, it shall be lawful for the Assistant Commissioner to make an additional assessment at any time.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "V",
        "text": "",
        "pre_block_list": [
          "P AYMENT  A ND  C OLLECTION   OF  T HE  L EVY"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "16",
            "text": "Every registered person shall account for levy on an accrual basis.",
            "pre_block_list": [
              "Accounting basis"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "17",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Every registered person shall, notwithstanding that no assessment has been made on such person for the relevant quarter, pay",
                "pre_block_list": [
                  "Payment of the levy"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the levy payable for the first month of that quarter on or before the twentieth day of the second month of that quarter;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the levy payable for the second month of that quarter on or before the twentieth day of the third month of that quarter;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "the levy payable for the third month of that quarter on or before the twentieth day of the month immediately succeeding the end of the relevant quarter,",
                    "pre_block_list": [
                      "to the Commissioner-General, in such manner as may be specified by him."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any levy not paid as set out in subsection (1) shall be in default and the registered person by whom such levy is payable or where any levy is payable by more than one person, each such person shall be deemed to be a defaulter for the purposes of this Act.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "18",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where the payment of any levy is in default,  the defaulter shall, in addition to such levy in default pay as penalty",
                "pre_block_list": [
                  "Penalty for default"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "a sum equivalent to ten  per centum  of the amount in default; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "where the amount in default is not paid before the last day of the month succeeding the month in which such levy has begun to be in default, a further sum, equivalent to two  per centum  of the amount in default in respect of each period ending on the last day of each succeeding month or part of such period during which it is in default:",
                    "pre_block_list": [
                      "Provided however, that the total amount payable as penalty under this subsection shall in no case exceed one hundred  per centum  of the levy in default and any such amount may be waived or reduced if the Commissioner- General is satisfied that by reason of any special circumstances in which the default occurred waiver or reduction of such amount would be just and equitable."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where upon the final determination of an appeal under Part VII, any levy in default to which any sum or sums under subsection (1) has or have been added is reduced, then such sum or sums shall be calculated on the levy so reduced.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "19",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Director General of Customs shall collect from every taxable person, the levy chargeable from such person in respect of every article imported by such person, at the time such article is imported, and shall make an endorsement on the import invoice relating to such article specifying the amount so collected.",
                "pre_block_list": [
                  "Collection of the levy by the Director-General of Customs"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any amount collected under subsection (1) shall be deemed to be the levy chargeable in respect of the turnover arising from the importation of such article and shall be deemed to have been paid by such person to the Commissioner-General on the day on which such amount was so collected.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Any amount collectible under subsection (1) shall, for the purpose of collection and recovery of such amount and notwithstanding anything to the contrary in this Act, be deemed to be customs duty chargeable under the Customs Ordinance (Chapter 235) and accordingly, the provisions of the Customs Ordinance (Chapter 235) shall apply to the collection and recovery of such amount.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where any article imported into Sri Lanka is sold",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "by the Commissioner-General;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "by the Director General of Customs for the recovery of any duty, levy or any charge collectible under the Customs Ordinance (Chapter 235); or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "by the Sri Lanka Ports Authority established by the Sri Lanka Ports Authority Act, No. 51 of 1979, for the recovery of any dues collectible under that Act,",
                    "pre_block_list": [
                      "the purchaser of such article shall be deemed to be a person referred to in paragraph ( a ) of section 2, and the provisions of this Act shall apply to such person accordingly."
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "20",
            "text": "The turnover arising from any Islamic financial transaction shall be subject to levy in a similar manner as equivalent in substance to non-Islamic financial transactions.",
            "pre_block_list": [
              "Islamic financial transactions"
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "VI",
        "text": "",
        "pre_block_list": [
          "A PPEALS"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "21",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Any registered person or any person whose registration has been cancelled under this Act may, if he is dissatisfied with any assessment, additional assessment or penalty, as the case may be, made in respect of him under this Act, appeal against such assessment, additional assessment or penalty, as the case may be, to the Commissioner-General within thirty days after the service of notice of such assessment, additional assessment or imposition of penalty, as the case may be. Such person shall, notwithstanding such appeal, pay the levy charged by such assessment or additional assessment together with any penalty imposed on him by this Act.",
                "pre_block_list": [
                  "Appeals to the Commissioner- General"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Commissioner-General, upon being satisfied that, owing to absence from Sri Lanka, sickness or other reasonable cause, the appellant was prevented from appealing within the time period specified in subsection (1),  shall grant an extension of time for preferring the appeal.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every appeal shall be preferred to the Commissioner- General by a petition in writing or by electronic means and shall state precisely the grounds of such appeal.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The receipt of every appeal shall be acknowledged within thirty days of its receipt and where so acknowledged, the date of the letter of acknowledgement shall for the purpose of this section, be deemed to be the date of receipt of such appeal:",
                "pre_block_list": [
                  "Provided however, if the receipt of any appeal is not acknowledged as specified in this subsection, such appeal shall be deemed to have been received by the Commissioner- General on the day on which it was delivered to the Commissioner-General."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Where the appeal against the assessment has been made in the absence of a return, the appeal shall be accompanied by a return with the proof of payment of the levy and penalty due on such return.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "Every person preferring an appeal under subsection (1) shall unless such person has already done so, pay to the Commissioner-General the amount of the levy payable by such person on the basis of the return furnished by him for the relevant quarter together with any penalty thereon accrued up to the date of such notice of assessment, and shall attach, to the appeal a receipt in proof of such payment:",
                "pre_block_list": [
                  "Provided however, the Commissioner-General, upon being satisfied that owing to serious financial hardship suffered by the appellant at or about the time of such notice of assessment or, owing to other reasonable cause the appellant was prevented from paying such levy and penalty, may grant an extension of time for the payment of such levy and penalty thereon accrued up to the date of payment, and the receipt furnished within such extended time shall, for the purposes of subsections (1), (5) and (6), be deemed to have been attached to the  appeal."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "Every appeal which was not made within the period specified in subsection (1) or does not conform to the provisions of subsections (3), (5) and (6) shall not be valid.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "8",
                "text": "Upon receipt of a valid appeal, the Commissioner- General may cause inquiry to be made by an Assistant Commissioner, other than the Assistant Commissioner who made such assessment against which the appeal is preferred and if, in the course of such inquiry, an agreement is reached as to the matters specified in the appeal, the necessary adjustment of the assessment shall be made.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "9",
                "text": "Where no agreement is reached between the appellant and the Assistant Commissioner in the manner specified in subsection (8), the Commissioner-General shall fix a time and place for the hearing of the appeal.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "10",
                "text": "The appellant may attend the hearing of the appeal in person or by an authorized representative. The Commissioner-General may, if he thinks fit, from time to time, adjourn the hearing of an appeal for such time and place as he shall fix. In any case in which an authorized representative attends on behalf of the appellant, the Commissioner-General may adjourn the hearing of the appeal and may, if he considers that the personal attendance of the appellant is necessary for the determination of the appeal, require that the appellant shall attend in person at the time and place fixed for the adjourned hearing of the appeal. If the appellant or his authorized representative fails to attend at the time and place fixed for the hearing or any adjourned hearing of the appeal, or if the appellant fails to attend in person when required so to attend by the Commissioner- General, the Commissioner-General shall dismiss the appeal:",
                "pre_block_list": [
                  "Provided however, if the appellant, within a reasonable time after the dismissal of an appeal, satisfies the Commissioner-General that he or his authorized representative was prevented from due attendance at the hearing or at any adjourned hearing of such appeal by reason of absence from Sri Lanka, sickness, or other reasonable cause, the Commissioner-General may vacate the order of dismissal and fix a time and place for the hearing of the appeal."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "11",
                "text": "The Commissioner-General shall have power to summon any person, whom he may consider able to give evidence in respect of the appeal, to attend before him and examine such person on oath or otherwise. Any person so attending may be allowed by the Commissioner-General any reasonable expenses necessarily incurred by such person in so attending.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "12",
                "text": "The Commissioner-General may -",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "before making his determination on any appeal, if he considers it necessary so to do, require any person, by notice given in writing or by electronic means to produce for examination, or to transmit to the Commissioner-General within the period specified in such notice, any such deeds, plans, instruments, books of accounts, trade lists, stock lists, registers, cheques, paying-in-slips, auditors reports or other documents in his possession as may be specified in such notice;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "obtain the assistance of a Commissioner, a Senior Deputy Commissioner, a Deputy Commissioner or an Assistant Commissioner who is familiar with the issues involved in such hearing of an appeal.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "13",
                "text": "Where the Commissioner-General hears the evidence of the appellant or of any other person in respect of the appeal, he shall maintain or cause to be maintained a record of such evidence.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "14",
                "text": "In determining an appeal under this section, the Commissioner-General may confirm, reduce, increase or annul the assessment appealed against and shall give notice in writing or by electronic means to the appellant of his determination on the appeal.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "15",
                "text": "Every appeal preferred under this section, shall be agreed to or determined by the Commissioner-General, within a period of two years from the date on which such appeal is received by the Commissioner- General, unless the agreement or determination of such appeal depends on",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the decision of a competent court on any matter relating to or connected with or arising from such appeal and referred to it by the Commissioner- General or the appellant; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the furnishing of any document or the taking of any action -",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "by the appellant, upon being required to do so by the Commissioner-General or an Assistant Commissioner by notice given in writing to such appellant (such notice being given not later than six months prior to the expiry of two years from the date on which the appeal is received by the Commissioner-General); or",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "by any other person, other than the Commissioner-General or an Assistant Commissioner.",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "16",
                "text": "For the purposes of subsection (15) where an extension of time has been granted to an appellant for the payment of the levy, the date of receipt in proof of the payment of levy shall be deemed to be the date of receipt of such appeal.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "17",
                "text": "Where any appeal is not agreed to or determined within the period specified in subsection (15), the appeal shall be deemed to have been allowed and levy charged accordingly.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "22",
            "text": "Any person aggrieved by the determination of the Commissioner-General under section 21 may appeal against such determination to the Tax Appeals Commission established under the Tax Appeals Commission Act, No. 23 of 2011.",
            "pre_block_list": [
              "Appeals to the Tax Appeals Commission"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "23",
            "text": "Where",
            "pre_block_list": [
              "Finality of assessment"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "no valid appeal to the Commissioner-General has been preferred under this Part against an assessment or an additional assessment, such assessment or additional assessment; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "the Commissioner-General has determined the amount of the levy on appeal, the assessment made, reduced, increased or confirmed, as the case may be, on such appeal,",
                "pre_block_list": [
                  "shall be treated as final for all purposes of this Act:",
                  "Provided however, subject to the limitation of time specified in section 15, nothing in this section shall prevent an Assistant Commissioner from making an assessment or additional assessment for any relevant quarter if it does not involve any matter which has already been determined on appeal."
                ],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "VII",
        "text": "",
        "pre_block_list": [
          "R ECOVERY   OF  L EVY"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "24",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "For the purposes of this Part levy includes the penalty imposed under this Act.",
                "pre_block_list": [
                  "Recovery of levy"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Whenever the Commissioner-General issues or submits, as the case may be, a certificate under section 27 or 28 or a notice under section 29, he shall at the same time issue to the defaulter a notification thereof by personal service",
                "pre_block_list": [
                  "or by registered post or by telegraph or electronic means so however, the non-receipt of such notification by the defaulter shall not invalidate proceedings under this section."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "25",
            "text": "Any levy in default shall be a first charge on all the assets of the defaulter:",
            "pre_block_list": [
              "Levy to be a first charge",
              "Provided that, "
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "such charge shall not extend to or affect any assets sold by such person to a  bona fide  purchaser for value, prior to the seizure of the same in accordance with the provisions of section 27;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "as regards immovable property, the levy shall not rank in priority to any lease or encumbrance created bona fide  for value and registered prior to the date of the seizure; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "as regards movable property, where the levy for the relevant quarters for more than five years is in default, the levy for relevant quarters within five years only to be selected by the Commissioner- General, shall rank in priority to any lien or encumbrance created  bona fide  for value prior to the date of default of such levy.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "26",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where any levy is in default, the Commissioner- General shall, before proceeding to recover such levy, issue a notice in writing or by electronic means to the defaulter stating",
                "pre_block_list": [
                  "Notice to defaulter"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the particulars of such levy; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "that action is being contemplated to recover such levy.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where an assessment has been made and the defaulter has not appealed within the specified time period against",
                "pre_block_list": [
                  "the assessment in respect of which such levy is charged, he may, within thirty days of the date of such notice make any objection to the Commissioner-General in respect of the levy so charged and the Commissioner-General shall notwithstanding the provisions of section 23 consider such objections and give his decision thereon which shall be final."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "27",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where any levy is in default, the Commissioner- General may issue a certificate to a Divisional Secretary, an Assistant Divisional Secretary, a Fiscal, a Deputy Fiscal or a levy collector containing particulars of such levy and the name and address of the defaulter empowering the officer to whom such certificate is issued to recover or required to cause the levy to be recovered from the defaulter named in the certificate by seizure and sale of his movable property.",
                "pre_block_list": [
                  "Recovery of levy by seizure and sale"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The seizure referred to in subsection (1) shall be effected in such manner as the said officer shall deem most expedient in that behalf and any property so seized shall be kept for seven days at the costs and charges of the defaulter. If the defaulter fails to pay the said levy in default together with the costs and charges within the said seven days, the Divisional Secretary, the Assistant Divisional Secretary, the Fiscal, the Deputy Fiscal or the levy collector, as the case may be, shall cause such property to be sold by public auction.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The sum realized by the sale shall be applied",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "i",
                    "text": "firstly in payment of the costs and charges of seizing, keeping and selling the property; and",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "secondly in satisfaction of the levy in default,",
                        "pre_block_list": [
                          "and any balance shall be paid to the defaulter."
                        ],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where the Commissioner-General is of the opinion that recovery of any levy by the means specified in subsection (2) is impracticable or inexpedient, he may submit a certificate to the District Court having jurisdiction in the district where the defaulter resides or in which any property movable or immovable owned by the defaulter is situated, containing such particulars of levy and the name and address of the defaulter, and the Court shall thereupon issue a writ of execution to the Fiscal authorizing and requiring him to seize and sell all or any of the property movable and immovable of the defaulter or such part thereof as he may deem necessary for recovery of the levy, and the provisions of sections 226 to 297 of the Civil Procedure Code shall, mutatis mutandis , apply to such seizure and sale.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "For the purposes of this section, movable property shall include plant and machinery whether fixed to a building or not.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "28",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where the Commissioner-General is of the opinion in any case that recovery of levy in default by seizure and sale is impracticable or inexpedient or where the full amount of the levy in default has not been recovered, he may submit a certificate containing particulars of such levy and the name and last known place of business or residence of the defaulter, to a Magistrate having jurisdiction in the division in which such place of business or residence of the defaulter is situated.",
                "pre_block_list": [
                  "Proceedings for recovery before a Magistrate"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "The Magistrate shall thereupon summon such defaulter before him to show cause as to why further proceedings for the recovery of the levy should not be taken against him.",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "If sufficiant cause is shown, the levy in default shall be deemed to be a fine imposed by a sentence of the Magistrate on such defaulter for an offence punishable with fine only or not punishable with imprisonment and the provisions of subsection (1) of section 291 (except paragraphs ( a ), ( d ) and (i) thereof) of the Code of Criminal",
                    "pre_block_list": [
                      "Procedure Act, No. 15 of 1979, relating to default of payment of a fine imposed for such an offence, shall thereupon apply, and the Magistrate may make any direction which, by the provisions of that subsection, he could have made at the time of imposing such sentence."
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "Nothing in subsections (2) to (5) of section 291 of the Code of Criminal Procedure Act, No. 15 of 1979, shall apply in any case referred to in this subsection.",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "In any case referred to in this subsection, the Magistrate may grant time for the payment of the fine in installments.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Nothing in this section shall authorize or require the Magistrate in any proceeding thereunder to consider, examine or decide the correctness of any statement in the certificate of the Commissioner-General or to postpone or defer such proceeding for a period exceeding thirty days, by reason only of the fact that an appeal is pending against the assessment in respect of which the levy in default is charged.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The Court may be required bail to be given as a condition precedent allowing time under subsection (2) for showing cause for the payment of the fine and the provisions of Chapter XXXIV of the Code of Criminal Procedure Act, No. 15 of 1979 shall apply where the defaulter is so required to be given bail.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Where payment of the fine is directed to pay in installments under paragraph (d) of subsection (2) and default is made in the payment of any one installment, the same proceedings may be taken as if default had been made in payment of all the installments then remaining unpaid.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "29",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where the levy payable by any person is in default and it appears to the Commissioner-General to be probable that any person",
                "pre_block_list": [
                  "Recovery of levy out of debts"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "owes or is about to pay money to the defaulter or his agent;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "holds money for or on account of the defaulter or his agent;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "holds money for or on account of some other person for payment to the defaulter or his agent; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "has authority from some other person to pay money to the defaulter or his agent,",
                    "pre_block_list": [
                      "the Commissioner-General may give such person, a notice in writing or by electronic means, a copy of which shall be sent by post to the defaulter, requiring him to pay any such moneys not exceeding the amount of the levy in default to the officer named in such notice."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The notice shall apply to all such moneys which are in the hands of such person or due from such person at the date of receipt of such notice, or come into his hands or become due from him or are about to be paid by him at any time within a period of three months after the date of such notice.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Any person who has made any payment in pursuance of this section shall be deemed to have acted under the authority of the defaulter and of all other persons concerned, and shall be indemnified in respect of such payment against all proceedings, civil or criminal, notwithstanding the provisions of any written law, contract or agreement.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where any person to whom a notice has been given under subsection (1), is unable to comply therewith owing to the fact that moneys in question do not come into his hands or custody or become due from him during the period referred to in subsection (2), he shall within fourteen days of the expiration thereof give notice in writing to the Commissioner-General appraising him of the facts.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Where any person to whom a notice has been given under subsection (1) is unable to comply therewith and has failed to give notice to the Commissioner-General as required by subsection (4) or where such person has deducted or could have deducted the levy to which the notice relates or any part thereof and has not paid over as required by the Commissioner-General the amount of such levy or part thereof within fourteen days after the expiration of the period referred to in subsection (2), such person shall, if he is an individual, be liable or where such person is a company, or body of persons, whether corporate or unincorporated the secretary, manager or the principal officer of such company or body be personally liable, for the whole of the levy which such person has been required to deduct, and such levy may be recovered from such individual, secretary, manager or other principal officer, as the case may be, by all means provided for in this Act.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "For the purposes of this section, the expression defaulter shall be deemed to include the agent of a person who is in default and the provisions of this section shall apply in any case where the levy which would have been payable by any person if he were alive is in default, and for the purpose of the application of these provisions in any such case, the expression defaulter in subsection (1) means",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the executor or administrator of such deceased person; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "any person who takes possession of, or intermeddles with, the property of such deceased person; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "any person who has applied or is entitled to apply to a District Court for the grant or resealing of probate or letters of administration in respect of the estate of such deceased person.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "30",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where the Commissioner-General is of the opinion that any person is about to or likely to leave Sri Lanka without paying the levy due from him, the Commissioner-General may submit a certificate containing particulars of such levy and the name of such person to a Magistrate, who shall on receipt thereof issue a direction to the Inspector-General of Police to take such measures as may be necessary to prevent such person from leaving Sri Lanka without paying the levy or furnishing security to the satisfaction of the Commissioner-General for payment thereof.",
                "pre_block_list": [
                  "Recovery of levy from persons leaving Sri Lanka"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Commissioner-General shall, at the time of submission of the certificate to the Magistrate, issue to such person a notification thereof by personal service, or registered post or telegraph or by electronic means but the non-receipt of any such notification by such person shall not invalidate proceedings under this section.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The production of a certificate signed by the Commissioner-General stating that the levy has been paid or that security has been furnished for the payment of the levy or payment of the levy to an officer in charge of a police station shall be sufficient authority for allowing such person to leave Sri Lanka.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Any officer in charge of a police station to whom the amount of any levy specified in such certificate has been paid shall forthwith pay such amount to the Commissioner- General.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "31",
            "text": "Where the Commissioner-General is of the opinion that application of any one of the means of recovery specified in this Act has failed or is likely to fail to secure payment of the full amount of levy due from any person, he may proceed to recover any sum remaining unpaid, by any means of recovery specified in this Act, notwithstanding that an order has been made by a Magistrate under section 28 and carried into effect.",
            "pre_block_list": [
              "Use of more than one means for the recovery of levy"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "32",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where a body corporate has not paid any levy on or before the due date as specified in section 17, it shall be lawful to proceed under all or any of the provisions of this Act against a manager, director, secretary or any other principal officer of such body corporate, as if such officer is responsible for such default unless he proves the contrary to the satisfaction of the Commissioner-General notwithstanding anything in any other written law relating to such body corporate.",
                "pre_block_list": [
                  "Recovery of levy from the principal officer and others"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where an unincorporated body of persons has not paid any levy on or before the due date as specified in section 17, it shall be lawful to proceed under all or any of the provisions of this Act against any partner or office-bearer of such unincorporated body of persons as if he is responsible for such default unless he proves the contrary to the satisfaction of the Commissioner-General, notwithstanding anything in any other written law.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "33",
            "text": "The Commissioner-General may, by notice given in writing or by electronic means to any person, require that person within the period specified in such notice to furnish any information which the Commissioner-General may require for the purpose of recovering any levy due from such person or any other person.",
            "pre_block_list": [
              "Power of Commissioner- General to obtain information for the recovery of levy"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "34",
            "text": "The Commissioner General shall not commence any action under sections 27, 28, 29 and 32 of this Act, for the recovery of levy in default where a period of five years has lapsed from the completion of three months from the end of the relevant quarter in which the assessment by which such levy was charged or levied becomes final and conclusive under section 23.",
            "pre_block_list": [
              "Time limit for the recovery of a levy in default"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "35",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Commissioner-General may, by writing under his hand, delegate to any Assistant Commissioner any of the powers or functions conferred on or assigned to the Commissioner-General by this Part.",
                "pre_block_list": [
                  "Commissioner- General to delegate powers and functions"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every Assistant Commissioner to whom any power or function has been delegated under subsection (1) shall exercise or discharge such power or function subject to the general or special directions of the Commissioner-General.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "36",
            "text": "Any registered person who has paid any levy or penalty in excess of any amount which he was liable to pay for any relevant quarter shall be treated as an advance payment made for any quarter succeeding the relevant quarter.",
            "pre_block_list": [
              "Levy or penalty paid in excess to be treated as an advance payment"
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "VIII",
        "text": "",
        "pre_block_list": [
          "L IABILITY   OF  C ERTAIN  P ERSONS   TO  P AY  L EVY"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "37",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where any registered person chargeable with the levy dies, the executor of such deceased person shall, in respect of all relevant quarters prior to the date of death of such person, be chargeable with levy which such person would be chargeable if he were alive, and shall be liable to do all acts, matters and things which such person if he were alive, would be liable to do under this Act:",
                "pre_block_list": [
                  "Liability of executor to pay levy",
                  "Provided that, "
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "no proceedings shall be instituted against the executor in respect of any act or default of action of the deceased person;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "no assessment or additional assessment in respect of a period prior to the date of such persons death shall be made after three years from the end of the relevant quarter in which the death occurred; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "the liability of the executor under this section shall be limited to the sum of",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "the deceased persons estate in his possession or control at the date when notice is given to",
                        "pre_block_list": [
                          "him that liability to levy will arise under this section; and"
                        ],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "any part of the estate which may have passed to a beneficiary.",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where an executor on behalf of the estate of a deceased person carries on any taxable activity which is a part of such estate, such executor shall, in respect of such taxable activity, be chargeable with the levy with which such person would be chargeable if he were alive.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "38",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where any taxable activity in respect of which levy is payable is carried on or carried out by any person on behalf of any other person as the agent of such other person, the first mentioned person shall be chargeable with the levy in respect of that taxable activity in like manner and to the like amount as the second mentioned person would be chargeable under this Act.",
                "pre_block_list": [
                  "Liability of certain persons to pay levy in respect of a taxable activity not belonging to them"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "All the liable turnover of a non-resident person shall be assessable either directly or in the name of his agent, in or derived from Sri Lanka, whether such agent has the receipt of such turnover or not, and the levy in terms of this Act so assessed whether directly or in the name of the agent shall be recoverable in the manner provided for in this Act, out of the assets of the non-resident person or from the agent. Where there are more agents than one, they may be assessed jointly or severally in respect of the liable turnover of the non- resident person and shall be jointly and severally liable for levy thereon, in terms of this Act.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "39",
            "text": "Where two or more persons act in the capacity as trustees or executors of a deceased persons estate, they may be charged jointly and severally with the levy with which they are chargeable in the capacity under this Act and shall be jointly and severally liable for the payment of such levy.",
            "pre_block_list": [
              "Trustees and executors"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "40",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Notwithstanding anything in the Companies Act, No. 7 of 2007, where a company is wound up and where any levy to which that company is liable cannot be recovered, then, every person who was a director of the company at any time during the period in respect of which such levy is payable shall be jointly and severally liable for the payment of such levy unless such person proves that the default in payment of the levy cannot be attributed to any gross neglect, malfeasance or breach of duty on his part in relation to the affairs of the company, and the provisions of this Act relating to collection and recovery of levy shall apply accordingly.",
                "pre_block_list": [
                  "Persons liable to pay levy upon liquidation of a company or dissolution of a body of persons"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where a body of persons is dissolved and where any levy to which that body of persons is liable cannot be recovered, then, every person who was a partner or an office- bearer of such body of persons at any time during the period in respect of which such levy is payable shall be jointly and severally liable for the payment of such levy unless he proves that the default in payment of the levy cannot be attributed to any gross neglect, malfeasance or breach of duty on his part in relation to the affairs of such unincorporated body and the provisions of this Act relating to collection and recovery of levy shall apply accordingly.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "41",
            "text": "Any act or thing required by or under this Act to be done by any person shall, if such person is an incapacitated person, be deemed to be required to be done by the trustee of such incapacitated person.",
            "pre_block_list": [
              "Who may act for incapacitated persons"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "42",
            "text": "Any act or thing required by or under this Act to be done by any person shall, in the case of two or more persons in partnership, be deemed to be required to be done by the precedent partner of such partnership:",
            "pre_block_list": [
              "Precedent partner to act on behalf of partnership",
              "Provided that, any person to whom a notice has been given under the provisions of this Act as a precedent partner of a partnership shall be deemed to be the precedent partner thereof unless he proves that he is not a partner of such partnership or that some other person in Sri Lanka is the precedent partner thereof."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "43",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The secretary, manager, director or other principal officer of every company or body of persons shall be liable to do all such acts, matters or things as are required to be done under the provisions of this Act by such company or body of persons:",
                "pre_block_list": [
                  "Principal officer to act on behalf of a company or body of persons",
                  "Provided however, any person to whom a notice has been given under the provisions of this Act on behalf of a company or body of persons shall be deemed to be the principal officer thereof unless he proves that he has no connection with such company or body of persons or that some other person resident in Sri Lanka is the principal officer thereof."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where an offence under this Act is committed by a company or body of persons, every person who at the time of the commission of the offence was the secretary, manager, director or other principal officer of the company or body of persons shall be deemed to be guilty of that offence unless he proves that the offence was committed without his knowledge and that he exercised all such diligence to prevent the commission of that offence as he ought to have exercised having regard to the nature of his functions in such capacity.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "IX",
        "text": "",
        "pre_block_list": [
          "O FFENCES   AND  P ENALTIES"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "44",
            "text": "Every person who-",
            "pre_block_list": [
              "Offences relating to breach of secrecy &c."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "being a person required to take an oath fails to take an oath of secrecy when so required under section 58;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "acts in contravention of the provisions of section 58; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "aids, abets or incites any other person to act in contravention of any of the provisions of this Act,",
                "pre_block_list": [
                  "commits an offence under this Act and shall on conviction after summary trial before a Magistrate be liable to a fine not exceeding ten thousand rupees or to imprisonment of either description for a term not exceeding six months or to both such fine and imprisonment."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "45",
            "text": "Any person who",
            "pre_block_list": [
              "Offences relating to fraud"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "gives any false answer whether orally or in writing or by electronic means to any question or when requested to furnish information in accordance with the provisions of this Act;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "omits from a return made under this Act, any particulars which he should have included in such return;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "makes any false return or false entry in any return made under this Act;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "submits false documents for online registration, uploading incorrect information for registration or submitting false documents under the electronic filing system permitted under the revenue administration and the management information system,",
                "pre_block_list": [
                  "and thereby evades or attempts to evade levy or assists any other person to evade or to attempt to evade levy commits an offence under this Act, and shall be liable, after summary trial before a Magistrate, to a fine consisting of"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "i",
                    "text": "a sum equal to twice the amount of levy so evaded or attempted to be evaded for which he is liable under this Act for the relevant quarter in respect of which the offence was committed; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "a sum not exceeding twenty five thousand rupees or to imprisonment of either description for a term not exceeding six months or to both such fine and imprisonment.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "46",
            "text": "Every person who",
            "pre_block_list": [
              "Offences relating to returns &c."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "fails to apply for registration as required under section 4;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "fails to notify the Commissioner-General of any matters required to be notified under section 7;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "fails to furnish a return under section 8;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "having appeared before an officer of the Department of Inland Revenue in compliance with a notice issued to him under section 8 fails, without sufficient cause, to answer any question lawfully put to him by an officer acting under this Act;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "gives any incorrect information relating to any matter or thing affecting his own liability to levy or the liability of any other person;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "pays the amount under section 29 to any other person other than the officer named in the notice;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "g",
                "text": "wilfully  obstructs  or  delays  the Commissioner-General or any other officer in the exercise of his power under section 51 or 52; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "h",
                "text": "fails to maintain records as required under section 53,",
                "pre_block_list": [
                  "commits an offence under this Act, and shall on conviction after summary trial before a Magistrate, be liable to a fine not exceeding twenty five thousand rupees, or to imprisonment of either description for a term not exceeding six months or both such fine and imprisonment."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "47",
            "text": "No prosecution in respect of an offence under this Part shall be commenced except at the instance, or with the sanction of the Commissioner-General.",
            "pre_block_list": [
              "Prosecution to be with the sanction of the Commissioner- General"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "48",
            "text": "The Commissioner-General may with the consent of the parties and having regard to the circumstances in which any offence under this Act was committed, compound such offence for a sum not exceeding one third of the maximum fine imposed for that offence under this Act. Any sum received by the Commissioner-General in compounding an offence under this section shall be credited to the Consolidated Fund.",
            "pre_block_list": [
              "Compounding of offences"
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "X",
        "text": "",
        "pre_block_list": [
          "M ISCELLANEOUS"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "49",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Every notice to be given by the Commissioner- General, a Deputy Commissioner-General, Senior Commissioner,  Commissioner,  Senior  Deputy Commissioner, Deputy Commissioner or an Assistant Commissioner under this Act shall bear the name of the Commissioner-General, the Deputy Commissioner-General, Senior Commissioner, Commissioner, Senior Deputy Commissioner, Deputy Commissioner or an Assistant Commissioner, as the case may be, and every such notice shall be valid if the name of the Commissioner-General, the Deputy Commissioner-General, the Senior Commissioner, the Commissioner, the  Senior Deputy Commissioner, the Deputy Commissioner or the Assistant Commissioner is duly printed or signed thereon.",
                "pre_block_list": [
                  "Signature and service of notice"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every notice given by virtue of this Act may be served on a person either personally, by electronic means delivered at, or sent by post to, his last known place of abode or any place at which he is, or during the period to which the notice relates, was carrying on or carrying out a taxable activity.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Any notice sent by post shall be deemed to have been served on the day on which it could have been received in the ordinary course of post.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "In proving service by post it shall be sufficient to prove that the letter containing the notice was duly addressed and posted.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "50",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Any notice, assessment, certificate or other proceeding under this Act shall not be quashed, or deemed to be void or voidable, for want of form, or be affected by reason of a mistake, defect or omission therein, if the same is in substance and effect in conformity with, the intent and meaning of this Act, and if the person assessed or intended to be assessed or affected thereby is designated therein according to common intent and understanding.",
                "pre_block_list": [
                  "Validity of assessments"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Without prejudice to the generality of subsection (1) an assessment shall not be affected or impugned by reason of",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "a mistake therein as to the name or surname of person chargeable, the amount of the value of the liable turnover or the amount of the levy charged; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "any variance between the assessment and the notice therefor,",
                    "pre_block_list": [
                      "if notice of such assessment is duly served on the person intended to be charged and contains in substance and effect the particulars set out in paragraph ( a ) of this subsection."
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "51",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Any officer of the Department who is specially authorized by the Commissioner-General in that behalf may, accompanied by a peace officer, where necessary, do all or any of the following acts:-",
                "pre_block_list": [
                  "Power to search buildings or places"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "enter and search any building or place where he has reason to believe that any books of accounts, registers, records or other documents, which in his opinion will be useful for or relevant to any proceeding under this Act may be found, and examine them if found;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "seize any such books of accounts, registers, records or other documents or place marks of identification thereon or make extracts or copies therefrom; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "make a note or an inventory of any other thing found in the course of any search under this section which in his opinion will be useful for, or relevant to, any proceedings under this Act, and the provisions of the Code of Criminal Procedure Act, No.15 of 1979, relating to searches shall apply, so far as may be, to searches under this section.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "In this subsection peace officer shall have the same meaning as in the Code of Criminal Procedure Act, No. 15 of 1979.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Before authorizing any officer to exercise the powers under subsection (1), the Commissioner-General shall record the circumstances which necessitate the exercise of such powers by such officer.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where any officer authorized by the Commissioner- General under subsection (1) takes into his possession any book of accounts, register, record or other document from any person, such officer shall issue to such person a memorandum specifying the book, register, record or other document he has taken into his possession.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Any book of account, register, record or other document taken into his possession under subsection (1) by any officer may be retained in the possession of such officer as long as may be necessary for a scrutiny of such book, register, record or other document or for the institution of legal proceedings against the person to whom such book, register, record or other document belongs.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "52",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Commissioner-General or any other officer of the Department who is specially authorized in that behalf by the Commissioner-General in writing may do all or any of the following acts:-",
                "pre_block_list": [
                  "Power to search where taxable activity is carried on or carried out"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "enter and inspect any place or building where any taxable activity is carried on or carried out by any person for the purpose of ascertaining whether the provisions of this Act are being complied with;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "open and examine any book of account, register, record or any other document which may be found therein and make an inventory of any of the articles found therein;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "examine and take copies of, or make extracts from, any book of account, register, record or other document found in such place or building;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "take possession of any book of account, register, record or other document or place marks of identification thereon;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "count and make a record immediately of the cash found in such place or building;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "require any person whom he finds in such place or building to give such information within his knowledge with respect to matters under this Act; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "g",
                    "text": "examine, either alone or in the presence of any other person, as he thinks fit, with respect to matters under this Act, every person whom he finds in such place or building.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where an officer authorized by the Commissioner- General under subsection (1) takes into his possession any book of account, register, record or other document from any person, such officer shall issue to that person a memorandum specifying the book, register, record or document he has taken into his possession.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Any book of account, register, record or other document taken into his possession under subsection (1), by any officer may be retained in the possession of such officer for a period not exceeding three years from the date of taking such possession for the purposes of scrutinizing such book, register, record or document or for the institution of legal proceedings against the person to whom such book, register, record or other documents belongs:",
                "pre_block_list": [
                  "Provided however, where the Commissioner-General has instituted action in case of wilful evasion under sections 45 or 46, as the case may be, such book, register, record or document may be retained as long as it is required for the purposes of such prosecution."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "53",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Every registered person shall keep and maintain records in respect of the taxable activity carried on or carried out by such person to enable the Commissioner-General or any other officer authorized by the Commissioner-General in that behalf to ascertain the liability for the payment of the levy.",
                "pre_block_list": [
                  "Keeping of records"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The form of the records to be maintained under subsection (1) and the particulars to be submitted therein shall be specified by the Commissioner-General.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "For the purpose of this section records includes-",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "books of accounts, (whether contained in a manual, mechanical or electronic format or combination thereof) recording receipts of payments,  income or expenditure, and also includes vouchers, bank statements, invoice, tax invoices, tax credit notes, tax debit notes, receipts and such other documents as are necessary to verify the entries in any such books of account;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "details of any warehouse, go-down or any other place where stock of goods are kept and the stock of goods kept in such warehouses, go- down, or any other place, as the case may be; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "any list or record required to be maintained or kept in accordance with the provisions of this Act or under any regulations made thereunder.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "XI",
        "text": "",
        "pre_block_list": [
          "A DMINSTRATION  P ROVISIONS"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "54",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Commissioner-General shall be in charge of the administration of this Act, assisted by such number of Deputy Commissioner-Generals, Senior Commissioners, Commissioners, Senior Deputy Commissioners, Deputy Commissioners and Assistant Commissioners of the Inland Revenue Department (in this Act referred to as the Department) as may be necessary for the purpose of giving effect to the provisions of this Act.",
                "pre_block_list": [
                  "The Administration of the Act"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "The Commissioner-General may authorize any Deputy Commissioner-General, Senior Commissioner, Commissioner, Senior Deputy Commissioner, Deputy Commissioner or Assistant Commissioner of the Department",
                    "pre_block_list": [
                      "to exercise, perform or discharge any power, duty or function which is conferred or imposed on, or assigned to the Commissioner-General by this Act."
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "A Deputy Commissioner-General, Senior Commissioner,  Commissioner,  Senior  Deputy Commissioner, Deputy Commissioner or Assistant Commissioner of the Department exercising, performing or discharging any power, duty or function conferred or imposed on, or assigned to the Commissioner-General by any provision of this Act shall be deemed for all purposes to be authorized to exercise, perform or discharge that power, duty or function, until the contrary is proved.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "A Commissioner or a Senior Deputy Commissioner of the Department may exercise, perform or discharge any power, duty or function conferred or imposed on, or assigned to, an Assistant Commissioner by any provision of this Act.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "55",
            "text": "The Commissioner-General may, from time to time, specify the forms to be used for the purposes of this Act, and any form so specified may, from time to time, be amended by the Commissioner-General.",
            "pre_block_list": [
              "Forms"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "56",
            "text": "For the purposes of this Act, the Minister may, on the recommendation of the Commissioner- General make regulations authorizing or facilitating the use of data messages, electronic records, electronic documents or electronic communications for matters specified in section 8 of the Electronic Transactions Act, No. 19 of 2006.",
            "pre_block_list": [
              "Use of electronic communications"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "57",
            "text": "The Commissioner-General may pay, from sums appropriated for that purpose by Parliament, such sums of money as he considers reasonable in the circumstances of the case, to any individual who provides information which results in the assessment of the levy payable and paid by any other person.",
            "pre_block_list": [
              "Commissioner General may pay rewards to informants"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "58",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Every person having a duty under this Act or being employed in the administration of this Act, shall regard as secret and confidential all information received in an official capacity in relation to a taxable person, and may disclose that information only to the following persons:-",
                "pre_block_list": [
                  "Official secrecy"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the employees of the Department and of the Department of Customs in the course, and for the purpose, of carrying out their duties;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the Minister assigned the subject of Finance in the course, and for the purpose of carrying out the supervision of the Department;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "the Auditor-General or any officer of the Auditor Generals Department authorized by the Auditor- General, only when such disclosure is necessary for the purposes of official duties;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "any tax authority of a foreign country, in accordance with an international agreement entered into with a specific authority;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "the Attorney-General for the purpose of any criminal or civil proceeding where actions are instituted by the State or actions filed against the State or where the opinion or advice of the Attorney-General has been sought in writing by the Department;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "a Court, in a proceeding to establish the tax liability or responsibility of a registered person in respect of an offence;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "g",
                    "text": "the Land Reform Commission, only when such disclosure is necessary for the purposes of official duties;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "h",
                    "text": "the Head of the Department of Foreign Exchange for the purpose of prosecuting for violations of the Foreign Exchange Act, No.12 of 2017;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "i",
                    "text": "a Commission of Inquiry appointed under the Commissions of Inquiry Act, No.17 of 1948 in an investigation into the affairs of any person or the spouse or child of such person; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "j",
                    "text": "the Commission to Investigate Allegations of Bribery or Corruption established under the Commission to Investigate Allegations of Bribery or Corruption Act, No.19 of 1994.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "A person who receives information under subsection (1) shall maintain secrecy of such information except to the minimum extent that any disclosure under this Act is permitted.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The obligation as to secrecy imposed by this section shall continue to apply in respect of any person notwithstanding that such person ceases to be appointed under or employed in carrying out the provisions of this Act.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "XII",
        "text": "",
        "pre_block_list": [
          "G ENERAL"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "59",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Minister may make regulations in respect of matters required by this Act to be prescribed or in respect of matters authorised by this Act to be made.",
                "pre_block_list": [
                  "Regulations"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every regulation made by the Minister shall come into operation on the date of its publication in the  Gazette or on such date as may be specified in the regulation.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every regulation shall within three months after its publication in the  Gazette , be brought before Parliament for",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "60",
            "text": "In  this  Act,  unless  the  context  otherwise requires",
            "pre_block_list": [
              "Interpretation",
              "article includes any goods, material or any agricultural or horticultural produce;",
              "Assistant Commissioner means an Assistant Commissioner of Inland Revenue appointed under section 97 of the Inland Revenue Act, No. 24 of 2017 and includes Deputy Commissioner;",
              "authorised representative shall have the same meaning as in the Inland Revenue Act, No. 24 of 2017;",
              "body of persons shall have the same meaning as in the Inland Revenue Act, No. 24 of 2017;",
              "business includes trade, profession or vocation;",
              "Commissioner-General shall have the same meaning as in the Inland Revenue Act, No. 24 of 2017;",
              "Deputy Commissioner means the Deputy Commissioner of Inland Revenue appointed under section 97 of the Inland Revenue Act, No. 24 of 2017;",
              "Freight Forwarder shall have the same meaning as in the Licensing of Shipping Agents, Freight Forwarders, Non Vessel Operating Common Carriers and Container Operators Act, No.10 of 1972;",
              "importation excludes bringing any article in the personal baggage of the passenger into Sri Lanka [baggage shall have the same meaning as in section 107 A  of the Customs Ordinance (Chapter 235)];",
              "manufacture means any process for"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "making an article;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "assembling or joining any article whether by chemical process or otherwise;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "adapting for sale any article; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "packaging, bottling, putting into boxes, cutting into pieces, cleaning, polishing, wrapping, labeling, or in any other way whatsoever preparing for sale any article otherwise than in a retail store for the purpose of sale in such store exclusively and directly to the consumer;",
                "pre_block_list": [
                  "Minister means the Minister assigned the subject of Finance under Article  44 or 45 of the Constitution;",
                  "non-resident persons means persons who are not resident persons under section 69 of the Inland Revenue Act, No. 24 of 2017;",
                  "open market value in relation to any sale of article or provision of service at any date, means, the consideration in money which a similar sale or provision would generally fetch if sold or provided in similar circumstances at that date in   Sri  Lanka, being a sale or provision freely offered and made between persons who are not associated persons;",
                  "partnership shall have the same meaning as in the Inland Revenue Act, No. 24 of 2017;",
                  "person shall have the same meaning as in the Inland Revenue Act, No. 24 of 2017;",
                  "quarter means the period of three months commencing on the first day of January, April, July or October of any year;",
                  "registered distributor in relation to any manufacturer or producer of any goods in Sri Lanka means any person or partnership appointed by such manufacturer or producer for the sale in the wholesale market, of such goods, at such price as may be determined by such manufacturer or producer, from time to time;",
                  "service includes any business of real estate and improvement thereon; and",
                  "supply of financial services shall have the same meaning assigned to such expression under section 25 F  of the Value Added Tax Act, No.14 of 2002."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "61",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency",
              "FIRST SCHEDULE",
              "[Section 3(2)( a ) and ( b )]",
              "PART IA",
              "E XEMPTED  A RTICLES",
              "1. Any article exported by the manufacturer;",
              "2. Any article not being a plant, machinery or fixture imported by any person exclusively for the use in, or for, the manufacture of any article for export;",
              "3. Any article sold by a taxable person to any exporter, if the Commissioner-General is satisfied on the production of any documentary evidence that such article or any other article manufactured, of which such article is a constituent part, has in fact been exported from Sri Lanka by such exporter directly or through a trading house established for export purposes;",
              "4. Any article which is imported, is proved to the satisfaction of the Commissioner- General, that such article is imported to Sri Lanka for"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "the display at an exhibition;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "the temporary use in Sri Lanka in any project approved by the Minister;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "the purposes of repairs to that article to be carried out in Sri Lanka;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "any other similar purpose, and is to be re-shipped, within a period of one year from the date of importation of such article to Sri Lanka or within a period of ninety days after the completion of such project; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "producing any cinematographic film or teledrama in Sri Lanka and taking out of Sri Lanka for further processing or printing with the approval of the National Film Corporation;",
                "pre_block_list": [
                  "5. Any article imported, if proved to the satisfaction of the Director-General of Customs, that such article was, prior to its importation, taken out of Sri Lanka for repairs;",
                  "6. Any spare part imported by any airline or shipping company, if proved to the satisfaction of the Commissioner-General, that such spare part is to be used for the maintenance of any aircraft or ship, used in international traffic and owned or chartered by such airline or shipping company;",
                  "7. Any article sold, to the United Nations Organization or to any specialized agency of such organization or to the diplomatic mission of any foreign Government or to any member of the diplomatic staff of such mission or to any other person approved by the Minister on the recommendation of the Minister of Foreign Affairs as being of the status of a diplomatic mission;",
                  "8. Any article imported if such article is subject to the Special Commodity Levy charged under the Special Commodity Levy Act, No. 48 of 2007;",
                  "9. Fertilizer;",
                  "10. Petroleum and petroleum products other than lubricants classified under Harmonized Commodity Description and Coding Numbers for Customs purpose;",
                  "11. L.P. Gas;",
                  "12. Pharmaceuticals identified under Harmonized Commodity Description and Coding Numbers for Customs purpose;",
                  "13. Tea supplied by the Manufacturer being a manufacturer registered with the Sri Lanka Tea Board established by the Sri Lanka Tea Board Law, No. 14 of 1975, to any registered broker for sale at the Colombo Tea Auctions;",
                  "14. Any article for the use in any project approved by the relevant Minister and by the Minister in charge of the subject of Finance taking into consideration the economic benefit to the country and where the tax in respect of such project is borne by the Government;",
                  "15. Bitumen classified under HS Code No. 2714;",
                  "16. Raw materials or packing materials imported for the manufacture of pharmaceuticals subject to the approval of the relevant authority;",
                  "17. Plant, machinery or equipment imported on temporary basis for the use of large-scale infrastructure development projects approved by the Minister in charge of the subject of Finance as being of beneficial for the economic development of Sri Lanka, on condition that goods will be re-exported after the completion of work;",
                  "18. Foreign currency notes imported, being notes classified under HS Codes  4907.00.90;",
                  "19. Raw materials or packing materials imported for the manufacture of ayurvedic preparations which belong to the Ayurveda Pharmacopoeia or ayurveda preparation subject to the approval of the relevant authority;",
                  "20. Pure-bred breeding animals under HS 0102.10 or HS 0104.20.10, milking machines under HS 8434.10, dairy machinery under HS 8434. 20 and spare parts under HS 8434.90, at the point of importation;",
                  "21. Solar panel modules, accessories or solar home systems for the generation of solar power energy classified under Harmonized Commodity Description and Coding Numbers for Customs purposes at the point of importation;",
                  "22. Coal;",
                  "23. Any article manufactured by a company identified as a Strategic Development Project in terms of subsection (4) of section 3 of the Strategic Development Project Act, No. 14 of 2008 sold to another Strategic Development Project or to a specialized project approved by the Minister of Finance or to a company registered with Board of Investment of Sri Lanka established under the Board of Investment Law, No. 4 of 1978, so far as such articles are considered as import replacement and supplied during the project implementation period; and",
                  "24. Any machinery or equipment imported or purchased locally for the purpose of generating electricity by the Ceylon Electricity Board established under the Ceylon Electricity Board Act, No. 17 of 1969 or any institution which has entered into an agreement with the Ceylon Electricity Board to supply electricity, being machinery or equipment classified under Harmonized Commodity Description and Coding Numbers for Customs purposes and approved by the Minister of Finance.",
                  "PART IB",
                  "[Section 3(2)( d )]",
                  "E XEMPTED  A RTICLES",
                  "1. Pharmaceuticals;",
                  "2. Any article which is subject to the Special Commodity Levy under the provisions of the Special Commodity Levy Act, No. 48 of 2007, where such article is sold by the importer of such article without any processing except for adaption for sale;",
                  "3. any article exported;",
                  "4. petrol, diesel or kerosene sold in a filling station;",
                  "5. L.P. Gas; and",
                  "6. fresh milk, green leaf, cinnamon or rubber (latex, crepe or sheet rubber) purchased from any local manufacturer or local producer.",
                  "PART II",
                  "E XEMPTED  S ERVICES",
                  "1. Generation of electricity and supply of electricity other than the supply of electricity by Ceylon Electricity Board established under the Ceylon Electricity Board Act, No. 17 of 1969;",
                  "2.  Medical services;",
                  "3.  Supply of water;",
                  "4.  Transportation of goods and passengers;",
                  "5.  Services provided to any exporter of any  article, being services directly related to improving the quality and character of such article;",
                  "6.  Services of sewing garments provided to any exporter of such garments;",
                  "7.  Services of a freight forwarder and a shipping agent licensed under the Licensing of Shipping Agents, Freight Forwarders, Non Vessel Operating Common Carriers, and Container Operators Act, No. 10 of 1972 or courier services in so far as such services are in respect of the exporter of any article from Sri Lanka;",
                  "8.  Services provided by a public corporation, in so far as such services are in respect of the exportation of any article from Sri Lanka;",
                  "9.  Services of an auctioneer, broker, insurance agent or commission agent of any local product to the extent of the brokerage receivable by such auctioneer or broker, or commission receivable by such insurance agent or commission agent, as the case may be;",
                  "10.  Services of",
                  "( a ) a travel agent in respect of inbound tours operated; or",
                  "( b ) a hotel, guest house, restaurant or other similar businesses,",
                  "where the payment for such services is received in foreign currency through a bank and such agent, hotel, guest house, restaurant or other similar business is registered with the Sri Lanka Tourism Development Authority;",
                  "11.  Client support services provided over the internet, telephone or by an enterprise, exclusively for the provision of such services, to one or more identified clients outside Sri Lanka, for payment in foreign currency;",
                  "12.  The business of life insurance;",
                  "13. Distribution, production and supply of any cinematographic films primarily for exhibition in cinemas;",
                  "14.  Exhibiting films in a cinema;",
                  "15.  Any service provided to the United Nations Organization or to any specialized agency of such organization or to the diplomatic mission of any foreign Government or to any member of the diplomatic staff of such mission or to any other person approved by the Minister on the recommendation of the Minister of Foreign Affairs as being of the status of a diplomatic mission;",
                  "16.  Any service rendered in or outside Sri Lanka to any person or partnership outside Sri Lanka for the utilization out of Sri Lanka for payment in foreign currency, if such foreign currency is remitted to Sri Lanka through a bank;",
                  "17. Services provided to any specific project carried on, out of foreign funds or donations received by the Government, as approved by the Minister considering the economic benefit to the country;",
                  "18.  Any service provided by the Central Bank of Sri Lanka established under the Monetary Law Act (Chapter 422);",
                  "19.  Any service provided free of charge by any public corporation out of the funds voted by Parliament from the Consolidated Fund or out of any loan arranged through the Government, on behalf of the Government;",
                  "20.  Services provided by any Government Department, Ministry or any Local Authority;",
                  "21.  Services provided by foreign consultancies for the large-scale infrastructure development projects being projects which have been approved by the Minister of Finance, as beneficial for the economic development of Sri Lanka;",
                  "22.  Services provided in relation to ship building for the international market for payments made in foreign currency; and",
                  "23.  Any service provided by the Employees Trust Fund, Provident Fund, Pension Fund, Pension Trust Fund and Gratuity Fund.",
                  "SECOND SCHEDULE [Section 3(1)] L IABLE  T URNOVER",
                  "1. Importation of any article                  [Section 2 ( a )]",
                  "100% of the turnover referred to in section 3(2)( a )",
                  "2. Manufacture of any article                  [Section 2 ( b )]",
                  "85% of the turnover referred to in section 3(2)( b )",
                  "3. Providing a service                  [Section 2 ( c )]",
                  "( a ) Supply of Financial services",
                  "100% of the Value addition attributable to financial services referred to in section 3(2)( c )(i)",
                  "The  value  addition attributable to such financial services shall be computed for the payment of levy on the business of financial services for the purpose of this Act by applying the attributable method referred to in Chapter IIIA of the Value Added Tax Act, No. 14 of 2002:",
                  "Provided however, that in calculating the value addition attributable to such financial service, where the amount of profits for each relevant quarter cannot be accurately ascertained, such amount may be estimated on the basis of available information. The estimated amount shall be adjusted to reflect the actual amount with the audited statement of accounts on yearly basis and such adjustment shall be submitted within six months after the closing date of the relevant accounting period;",
                  "100% of the turnover referred  to  in  section 3(2)( c )(ii); and",
                  "( b ) Land and improvements",
                  "( c ) Services other than ( a ) and ( b )",
                  "100% of the turnover referred  to  in  section 3(2)( c )(iii).",
                  "4. Wholesale and retail sale",
                  "( a ) Sale of any article by a registered distributor in relation to any manufacturer or producer of any goods in Sri Lanka; and",
                  "25% of the turnover referred to in section 3(2)( d )",
                  "50%  of  the  turnover referred to in section 3(2)( d )",
                  "( b ) Wholesale or retail sale other than item ( a ) above including importation and sale",
                  "English Acts of the Parliament can be purchased at the P RAKASHANA  P IYASA , D EPARTMENT   OF G OVERNMENT  P RINTING , N O . 118, D R . D ANISTER  D E  S ILVA  M AWATHA , C OLOMBO  8."
                ],
                "child_level_list": []
              }
            ]
          }
        ]
      }
    ]
  }
}