{
  "n_pages": 11,
  "title_page": {
    "title": "Registration Of Documents (Amendment) Act",
    "num": "32",
    "year": "2022",
    "date_certified": "2022-10-31",
    "date_published": "2022-11-04",
    "price": 20.0,
    "price_postage": 15.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 31St Of October 2022]",
      "L.D.O. 2/2021",
      "A N  A Ct   To   Amend   The  R Egistration   Of  D Ocuments  O Rdinance (C Hapter  117)",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:-"
    ],
    "pre_section_list": [
      {
        "class_name": "ActL1Section",
        "num": "1",
        "text": "This Act may be cited as the Registration of Documents (Amendment) Act, No. 32 of 2022.",
        "pre_block_list": [
          "Short title"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "2",
        "text": "Section 32 of the Registration of Documents Ordinance (Chapter 117) (hereinafter referred to as the principal enactment) is hereby amended as follows:-",
        "pre_block_list": [
          "Amendment  of section  32  of Chapter 117"
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "by the repeal of subsection (1) thereof and the substitution therefor of the following subsection: -",
            "pre_block_list": [
              "(1) ( a ) A person (hereinafter referred to as the caveator) who"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "has a right, title or interest; or",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "claims to have a right, title or interest,",
                    "pre_block_list": [
                      "to a land, an undivided land, a land parcel or a condominium parcel (hereinafter in this section referred to as the land) may present for registration a caveat substantially in Form VIII of the Second Schedule hereto requiring him to be served a notice of the presentation for registration of any instrument affecting such land.",
                      "( b ) Every caveat presented for registration shall",
                      "(i) be in duplicate and accompanied by an affidavit of the caveator together with a certificate issued by an Attorney-at-law",
                      "substantiating the right, title or interest in the land or claims to a right, title or interest in the land of the caveator;",
                      "(ii)  be accompanied by such number of copies of the notice set out in Form X of the Second Schedule hereto together with stamped envelopes, to be served on the owners of the land whose names and addresses are given in the relevant volume and folio in which such land is registered, where the caveator is not the owner;"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iii",
                    "text": "be accompanied by a certified copy of the original of the Power of Attorney duly registered with the Registrar General or the Registrar of the relevant Land Registry or the Registrar of Title (hereinafter in this section referred to as the Registrar) where the caveator is a holder of a Power of Attorney (hereinafter in this section referred to as the attorney); and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iv",
                    "text": "contain the name, signature and the National Identity Card number or the passport number or the driving licence number and address  of the caveator in Sri Lanka at which notices relating to the caveat shall be served, the date of the caveat, the names and addresses of the persons to whom the notice of the caveat shall be sent where the caveator is not the owner, the right, title or interest in the land claimed by the caveator, grounds in support of the claim and the description of the land, including the boundaries, indicating the correct volume and folio in which such land, is registered.",
                    "pre_block_list": [
                      "( c ) For the purpose of this section-",
                      "(i) caveator includes a body of persons, a beneficiary under any trust affecting a land, the lawful guardian or the next friend of a minor or of a person of unsound mind or mentally deficient person, an attorney of a person, a judgement creditor, an executor or an administrator of an estate of a deceased, or a legal heir, or an intended purchaser who has entered into an agreement with the owner of a land or a developer of a land;",
                      "(ii) condominium parcel means a condominium parcel registered under the Registration of Title Act, No.21 of 1998 in terms of section 10 of the Apartment Ownership Law, No.11 of 1973 or registered under this Ordinance; and",
                      "(iii) interest includes an interest arising from an unregistered deed or instrument relating to a land which is incapable of immediate registration, a trust, an inheritance either by testate or intestate succession, instruments relating to a mortgage or an agreement to sell, co- ownership, an ownership arising from a condominium parcel or the estate of a minor, or of a person of unsound mind or mentally deficient person.;"
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "by the insertion, immediately after subsection (1) thereof, of the following new subsections: -",
            "pre_block_list": [
              "(1 A ) The Registrar, on being satisfied that all required documents and information referred to in paragraph ( b ) of subsection (1) are provided by the caveator, shall acknowledge",
              "the receipt of such caveat and record the prescribed particulars referred to in subsection (1) of section 27.",
              "(1 B ) Upon the acknowledgement, the Registrar shall forthwith notify the persons, whose names and addresses have been furnished by the caveator under subparagraph (iv) of paragraph ( b ) of subsection (1) and shall make an endorsement in the Remark Column by inserting the date and the names of the persons to whom and the addresses to which the notices referred to in subparagraph (ii) of paragraph ( b ) in subsection (1) were sent.;"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "by the repeal of subsection (3) thereof and the substitution therefor of the following subsection: -",
            "pre_block_list": [
              "(3) A caveat shall be in force for a maximum period of two years.;"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "4",
            "text": "in subsection (4) thereof, by the substitution for the words The notice to be given to the caveator shall be in the prescribed form, of the words and figures Where an instrument affecting the same land described in the caveat has been subsequently presented for registration, a notice shall be given to the caveator in Form XI of the Second Schedule hereto;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "5",
            "text": "in subsection (5) thereof, by the substitution for the words a competent court within thirty days of the words a competent court within sixty days.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "3",
        "text": "Section 33 of the principal enactment is hereby amended as follows: -",
        "pre_block_list": [
          "Amendment of section 33 of the principal enactment"
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "in subsection (1) thereof, by the substitution for the words seizure priority notice, caveat, or  lis pendens , of the   words seizure priority notice or  lis pendens ;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "by the addition immediately after subsection (1) thereof, of the following new subsection: -",
            "pre_block_list": [
              "(1 A ) ( a ) A caveat may be withdrawn or cancelled, as the case may be, at the request in writing -"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "by the caveator;",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "by an attorney;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iii",
                    "text": "upon the death of a caveator, by an executor, administrator, or a legal heir;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iv",
                    "text": "by the guardian or next friend of a minor of a person of unsound mind or mentally deficient person on whose interest the caveat was lodged, on the death or removal of the guardian, by the successor or by the minor upon the minor attaining the age of majority;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "v",
                    "text": "where there are joint caveators, and upon the death of one or more of them, by the surviving caveator or caveators;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "vi",
                    "text": "where the caveator is adjudicated a bankrupt, by the Official Assignee;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "vii",
                    "text": "where the caveator is a body corporate and is in liquidation, and the estate or interest claimed by the caveator has become vested in the liquidator appointed by court,  by the liquidator or by the Official Receiver; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "viii",
                    "text": "where an order has been issued by a competent court on an estate which is the subject of a caveat, by a Fiscal officer, or any other person receiving the rights under such order.",
                    "pre_block_list": [
                      "( b ) on receipt of the instrument for withdrawal under paragraph ( a ) hereof, the Registrar shall",
                      "(i) cancel the entry of the caveat in the register in the aforesaid manner and setting out the date thereof, and",
                      "(ii) notify the persons or body of persons, whose right, title or interest for registration of an instrument was affected by such caveat.;"
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "by the insertion, immediately after subsection (2) thereof, of the following new subsection: -",
            "pre_block_list": [
              "(2 A ) Notwithstanding anything to the contrary in any other written law, any summons, notice, decree nisi or order in relation to any proceeding under subsection (2) on a caveat, shall be served to the address of the caveator in Sri Lanka referred to in sub-paragraph (iv) of paragraph ( b ) of subsection (1) of section 32.;"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "4",
            "text": "by the addition, immediately after subsection (3) thereof, of the following new subsection:",
            "pre_block_list": [
              "(4) The Registrar shall not register a caveat of the same caveator in respect of the same land or same iterest in the land, in respect of which registration of caveat was cancelled under subsection (3)",
              ""
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "4",
        "text": "Section 50 of the principal enactment is hereby amended by the substitution for the words, require, but such Schedule may be altered or added to by regulation, of the words require",
        "pre_block_list": [
          "",
          "Amendment to section 50 of the principal enactment"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "5",
        "text": "The Second Schedule to the principal enactment is hereby amended as follows:",
        "pre_block_list": [
          "Amendment of the Second Schedule to the principal enactment"
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "by the repeal of Form VIII thereof, and the substitution therefor, of the following new Form:",
            "pre_block_list": [
              "FORM VIII [section 32( b )]",
              "FORM OF THE CAVEAT",
              "Take notice that, I, ............. (full name and the address of the caveator) bearing (NIC/passport/ driving licence) no.. require to be served with notice of the presentation for registration of any instrument affecting land.. (owned by me / owned by other- specify the right/ title/ or interest) referred to in the Schedule hereto.",
              "And I further declare that I present this caveat in my behalf/ in behalf of",
              ". (where the caveator is not the owner) on the following ground/s.",
              "Title under deed no Under the last will of Other (specify) .",
              "And I appoint (the address in Sri Lanka) as the place at which notices relating hereto shall be sent.",
              "",
              "",
              "(Signature of the caveator/his Attorney-at-Law or notary/attorney)",
              "Date",
              "Signed by the above-named",
              "in the presence of (full name and address of the two witnesses)",
              "1. Signature of the first witness 2. Signature of the second witness",
              "Schedule",
              "(describe land as in section 13 and previous registration, if known); and"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "by the insertion immediately after Form IX of that Schedule, of the following new Forms: -",
            "pre_block_list": [
              "FORM X",
              "[section 32(1)( b )(ii)]",
              "NOTICE TO AN OWNER OF A PROPERTY IN RESPECT OF WHICH A CAVEAT HAS BEEN LODGED",
              "Take notice that a caveat has been lodged by  of  in respect of the property named. bearing assessment  no  and  registered  under folio. of volume",
              "at this land registry.",
              "(signature)",
              ". Registrar of Lands of",
              "",
              "Date :.......................",
              "FORM XI",
              "[section 32(4)]",
              "NOTICE TO THE CAVEATOR OF AN INSTRUMENT PENDING REGISTRATION",
              "You are hereby notified that the instrument specified in the Schedule hereto is pending registration in volume and folio.. of  . at this Land Registry, as opposed to caveat No dated.. submitted by you.",
              "(signature)",
              ". Registrar of Lands of",
              "",
              "Date :.......................",
              "Deed Nature of the Name of the Description  Parties No. deed/ Notary who of the Land instrument attested the (as per the deed/ Schedule) instrument",
              "",
              ""
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "6",
        "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail. Sinhala text to prevail in case of inconsistency",
        "pre_block_list": [
          "English Acts of the Parliament can be purchased at the P RAKASHANA  P IYASA , D EPARTMENT   OF G OVERNMENT  P RINTING , N O . 118, D R . D ANISTER  D E  S ILVA  M AWATHA , C OLOMBO  8."
        ],
        "child_level_list": []
      }
    ],
    "part_list": []
  }
}