{
  "n_pages": 25,
  "title_page": {
    "title": "Merchant  Shipping  (Amendment) Act",
    "num": "17",
    "year": "2019",
    "date_certified": "2019-10-02",
    "date_published": "2019-10-04",
    "price": 28.0,
    "price_postage": 20.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 02Nd Of October, 2019]",
      "L.D.  O 31/2015",
      "A N  A Ct   To   Amend   The  M Erchant  S Hipping A Ct , N O . 52  Of  1971",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :-"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Merchant Shipping (Amendment) Act, No. 17 of 2019.",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "Section 138 of the Merchant Shipping Act, No. 52 of 1971 (hereinafter referred to as the principal enactment) is hereby amended as follows:-",
            "pre_block_list": [
              "Amendment of section 138 of the Act, No. 52 of 1971."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the repeal of the definition of the expression certificate, and the substitution therefor, of the following new definitions:",
                "pre_block_list": [
                  "certificate means, unless the context otherwise requires, the appropriate certificate as may be prescribed by regulations made under sections 143(1)( b ), 144(1)( b ), 144(2)( a ) and 144(2)( b ) as the case may be;",
                  "Code means, an instrument made mandatory under the Convention;;"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the repeal of the definition of the expression Convention, and the substitution therefor, of the following new definition:-",
                "pre_block_list": [
                  "Convention means, the International Convention for the Safety of Life at Sea 1974, Protocol of 1988 as amended from time to time and any subsequent amendment made to such Protocol;;",
                  "Merchant Shipping (Amendment) Act, No. 17 of 2019 2"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "by the repeal of the definition of the expression country to which the Convention applies, and the substitution therefor, of the following new definition:-",
                "pre_block_list": [
                  " country to which the Convention applies means, a country which is a contracting Government to the Convention;;"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "by the repeal of the definition of the expression international voyage, and the substitution therefor, of the following new definition:",
                "pre_block_list": [
                  " international voyage means, a voyage between-   ( a ) a port or place in Sri Lanka and a port or place outside Sri Lanka; or"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "a port or place in a country to which the Convention applies (other than Sri Lanka) and a port or place in any other country or territory which is outside Sri Lanka",
                    "pre_block_list": [
                      ""
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "Section 139 of the principal enactment is hereby amended as follows:-",
            "pre_block_list": [
              "Amendment of section 139 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the repeal of subsection (1) thereof and the substitution therefor, of the following:",
                "pre_block_list": [
                  "(1) The Minister may make such regulations as he considers necessary or expedient to give effect to and for the better carrying out of the objectives and purposes of this Part and to provide generally for safety at sea and for carrying out the Convention, Codes, any Annexes thereto and any amendments or replacements of such Convention, Codes and Annexes and for ships which the",
                  "Convention does not apply and without prejudice to the generality of such powers, may make regulations making provision for-"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "inspection and survey of ships, surveys of life-saving appliances and other equipment of ships, surveys of  radio installation of ships, surveys of structure, machinery, equipment and other installations of ships;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "maintenance of condition after survey;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "issue or endorsement of certificates and their availability, acceptance and qualification;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "forms of certificates and records of equipment;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "duration and validity of certificates issued by Sri Lanka or issued by countries to which the Convention applies;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "control of ships when in a port or place in Sri Lanka;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "g",
                    "text": "safety investigation of marine casualties and marine incidents;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "h",
                    "text": "the construction-structure, subdivision and stability of ships, their equipment, machinery and electrical installations, fire protection, fire detection and fire extinction in passenger and cargo ships, the general fire precautions to be taken on such ships and special fire safety measures for passenger ships;",
                    "pre_block_list": [
                      "Merchant Shipping (Amendment) Act, No. 17 of 2019 4"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "i",
                    "text": "life-saving appliances and arrangements;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "j",
                    "text": "radio communications;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "k",
                    "text": "safety of navigation;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "l",
                    "text": "carriage of cargoes and oil fuels;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "m",
                    "text": "carriage of dangerous goods;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "n",
                    "text": "nuclear ships;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "o",
                    "text": "management of safe operation of ships;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "p",
                    "text": "safety measures for high-speed craft;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "q",
                    "text": "special measures to enhance maritime safety;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "r",
                    "text": "special measures to enhance maritime security;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "s",
                    "text": "additional safety measures for bulk carriers;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "t",
                    "text": "safety measures for ships operating in Polar waters;",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "v",
                        "text": "such other matters as are to be prescribed under this part;",
                        "pre_block_list": [
                          "( w ) any other matters generally giving effect to the provisions of the Convention, Codes, any Annex thereto and any amendments of such Convention, Codes and Annexes",
                          ""
                        ],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "in subsection (2) thereof, by the substitution for the words fine not exceeding one thousand rupees., of the words a fine not exceeding five million rupees",
                "pre_block_list": [
                  "",
                  "Amendment of section 143 of the principal enactment."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "Section 143 of the principal enactment is hereby amended as follows:-",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the repeal of subsection (1) thereof and the substitution therefor, of the following :",
                "pre_block_list": [
                  "(1) ( a ) A passenger ship shall not go to sea on a voyage to or from any port or place in Sri Lanka, or a Sri Lanka passenger ship shall not perform an international voyage, unless there are in force Convention certificates prescribed by regulations."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "A passenger ship shall not perform a voyage from one port or place in Sri Lanka to another such port or place in Sri Lanka, unless there are in force certificates as may be prescribed by regulations.;",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "in subsection (2) thereof, by the substitution for the words a fine not exceeding two hundred rupees, of the words a fine not exceeding one million rupees.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "Section 144 of the principal enactment is hereby amended as follows:-",
            "pre_block_list": [
              "Amendment of section 144 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the repeal of subsections (1) and (2) thereof and the substitution therefor, of the following:",
                "pre_block_list": [
                  "(1)( a ) A cargo ship to which the Convention applies shall not go to sea on a voyage to or from any port or place in Sri Lanka, or a Sri Lanka cargo ship which the Convention applies shall not perform an international voyage, unless there are in force Convention certificates as may be prescribed by regulations.",
                  "Merchant Shipping (Amendment) Act, No. 17 of 2019 6"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "A cargo ship of five hundred tons gross or more shall not perform a voyage from one port or place in Sri Lanka to another such port or place in Sri Lanka, unless there are in force certificates as may be prescribed by regulations.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "A cargo ship to which the Convention does not apply shall not go to sea on a voyage to or from any port or place in Sri Lanka, or a Sri Lanka cargo ship which the Convention does not apply shall not perform an international voyage, unless there are in force valid certificates as may be prescribed by regulations and in the case of foreign ships, such equivalent certificates as are acceptable to the Director -General of Merchant Shipping.",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "A cargo ship of less than five hundred tons gross shall not perform a voyage from one port or place in Sri Lanka to another such port or place in Sri Lanka, unless there are in force certificates as may be prescribed by regulations.;",
                    "pre_block_list": [
                      "(2) in subsection (3) thereof, by the substitution for the words a fine not exceeding one thousand rupees., of the words a fine not exceeding five million rupees",
                      ""
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "Section 152 of the principal enactment is hereby amended, in subsection (2) thereof, by the substitution for the words a fine not exceeding five hundred rupees., of the words a fine not exceeding three million rupees",
            "pre_block_list": [
              "",
              "Amendment of section 152 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "Section 155 of the principal enactment is hereby amended, by the substitution for the words a fine not exceeding three thousand rupees,, of the words a fine not exceeding ten million rupees,.",
            "pre_block_list": [
              "Amendment of section 155 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "Section 156 of the principal enactment is hereby amended, by the substitution for the words a fine not exceeding three thousand rupees,, of the words a fine not exceeding ten million rupees,.",
            "pre_block_list": [
              "Amendment of section 156 of the principal enactment.",
              "Amendment of section 157 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "Section 157 of the principal enactment is hereby amended as follows:-",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the repeal of subsections (1) and (2) thereof and the substitution therefor, of the following:-",
                "pre_block_list": [
                  "(1) Every ship shall be supplied with such information as prescribed by regulations as is necessary for the accurate guidance as to the stability of the ship under varying conditions of service."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The information required by subsection (1) shall be in such form as may be prescribed.;",
                "pre_block_list": [
                  "(2)  in subsection (4) thereof, by the substitution for the words a fine not exceeding one thousand rupees., of the words a fine not exceeding five million rupees",
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "10",
            "text": "Section 158 of the principal enactment is hereby amended, in subsection (2) thereof, by the substitution for the words a fine not exceeding two hundred rupees., of the words a fine not exceeding one million rupees",
            "pre_block_list": [
              "",
              "Amendment of section 158 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "11",
            "text": "Section 159 of the principal enactment is hereby amended by the repeal of the definitions of the expressions Convention certificate, Convention of 1966 and Convention country, and the substitution therefor, of the following new definitions:",
            "pre_block_list": [
              "Amendment of section 159 of the principal enactment.",
              "Merchant Shipping (Amendment) Act, No. 17 of 2019 8",
              "Convention means, the International Convention on Load Lines, 1966 as modified by the Protocol of 1988 and any subsequent amendment made to such Protocol;",
              "Convention certificate means, a certificate issued in accordance with the Convention;",
              "Convention country means, a country which is a contracting Government to the Convention;."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "12",
            "text": "Section 160 of the principal enactment is hereby amended by the repeal of paragraph ( b ) thereof and the substitution therefor, of the following:-",
            "pre_block_list": [
              "Amendment of section 160 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "new ships of less than 24 metres in length;.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "13",
            "text": "Sections 161 and 162 of the principal enactment are hereby repealed and the following substituted therefor:-",
            "pre_block_list": [
              "Replacement of sections 161 and 162  of the principal enactment. Definition of international voyage.",
              "161. In this part, international voyage means a voyage between-"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "a port or place in Sri Lanka and a port or place outside Sri Lanka; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "a port or place in a country to which the Convention applies (other than Sri Lanka) and a port or place in any other country or territory which is outside Sri Lanka:",
                "pre_block_list": [
                  "Provided, however, that in determining the ports between which a voyage is made no account shall be taken of any deviation by a ship from her intended voyage which is due solely to such stress of weather or such other circumstance that neither the master nor owner",
                  "nor the charterers (if any) of the ship could have prevented or forestalled.",
                  "162. In this part, new ship means, a ship the keel of which is laid, or which is at a similar stage of construction, on or after",
                  "Definition of new ship.",
                  "( a ) in the case of a ship registered in or flying the flag of a country which is a Convention country (other than Sri Lanka), the date from which the present Convention has entered into force; and",
                  "( b ) in the case of any other ship, the 25th day of January, 1972",
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "14",
            "text": "Section 164 of the principal enactment is hereby amended as follows:-",
            "pre_block_list": [
              "Amendment of section 164 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "in subsection (1) thereof-",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "by the substitution for the words and figures Convention of 1966,, of the word Convention,.",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "by the repeal of paragraphs ( h ), ( i ), and ( j ) thereof and the substitution therefor of the following:-",
                    "pre_block_list": [
                      "( h ) control of ships when in a port of Sri Lanka;"
                    ],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "safety investigation of marine casualties and marine incidents;",
                        "pre_block_list": [
                          "( j ) forms of certificates;",
                          "( k ) verification of compliance;",
                          "Merchant Shipping (Amendment) Act, No. 17 of 2019 10",
                          "( l ) zones, areas and seasonal periods;",
                          "( m ) repairs, alterations and modification;",
                          "( n ) maintenance of condition after survey;",
                          "( o ) the  validity  of  certificates issued under the Convention by Governments, other than the Government of Sri Lanka;",
                          "( p ) such other matters as are to be prescribed under this Part; and",
                          "( q ) any other matters generally for giving effect to the provisions of the Convention and any amendments of such Convention",
                          ""
                        ],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "in subsection (2) thereof, by the substitution for the words a fine not exceeding one thousand rupees., of the words a fine not exceeding five million rupees",
                "pre_block_list": [
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "15",
            "text": "Section 166 of the principal enactment is hereby amended, in subsection (2) thereof, by the substitution for the words a fine not exceeding two hundred rupees., of the words a fine not exceeding one million rupees",
            "pre_block_list": [
              "",
              "Amendment of section 166 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "16",
            "text": "Section 167 of the principal enactment is hereby amended, in subsection (2) thereof, by the substitution for the words a fine not exceeding five hundred rupees, and to an additional fine (not exceeding ten rupees for each centimeter by which the load line is submerged) as the court may think fit to impose., of the words a fine not exceeding three million rupees, and to an additional fine (not exceeding one hundred thousand rupees for each centimeter by which the load line is submerged) as the court may think fit to impose",
            "pre_block_list": [
              "",
              "Amendment of section 167 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "17",
            "text": "Section 168 of the principal enactment is hereby amended, by the substitution for the words a fine not exceeding two hundred rupees., of the words a fine not exceeding one hundred thousand rupees",
            "pre_block_list": [
              "",
              "Amendment of section 168 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "18",
            "text": "Section 169 of the principal enactment is hereby amended, in paragraph ( a ) of subsection (2) thereof, by the substitution for the words and figures International Load Line Certificate (1966);, of the words International Load Line Certificate;.",
            "pre_block_list": [
              "Amendment of section 169 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "19",
            "text": "Section 171 of the principal enactment is hereby amended, in subsection (3) thereof, by the substitution for the words a fine not exceeding two hundred rupees., of the words a fine not exceeding one hundred thousand rupees",
            "pre_block_list": [
              "",
              "Amendment of section 171 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "20",
            "text": "Section 172 of the principal enactment is hereby amended, in subsection (2) thereof, by the substitution for the words a fine not exceeding fifty rupees., of the words a fine not exceeding fifty thousand rupees",
            "pre_block_list": [
              "",
              "Amendment of section 172 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "21",
            "text": "Section 173 of the principal enactment is hereby amended, by the substitution for the words and figures International Load Line Certificate (1966);, of the words International Load Line Certificate;.",
            "pre_block_list": [
              "Amendment of section 173 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "22",
            "text": "Section 174 of the principal enactment is hereby amended, in subsection (3) thereof, by the substitution for the words a fine not exceeding two hundred rupees., of the words a fine not exceeding one hundred thousand rupees",
            "pre_block_list": [
              "",
              "Amendment of section 174 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "23",
            "text": "Section 175 of the principal enactment is hereby amended, in subsection (2) thereof, by the substitution for the words fine not exceeding five hundred rupees, and to an additional fine (not exceeding ten rupees for each complete centimeter whereby the load line is submerged) as the court may think fit to impose., of the words fine not",
            "pre_block_list": [
              "Amendment of section 175 of the principal enactment.",
              "Merchant Shipping (Amendment) Act, No. 17 of 2019 12",
              "exceeding three million rupees, and to an additional fine (not exceeding one hundred thousand rupees for each complete centimeter whereby the load line is submerged) as the court may think fit to impose",
              ""
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "24",
            "text": "Section 205 of the principal enactment is hereby amended as follows:-",
            "pre_block_list": [
              "Amendment of section 205 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "in subsection (1) thereof, by the substitution for the words any port in Sri Lanka, of the words any port or place in Sri Lanka;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "in subsection (2) thereof, by the substitution for the words any port in Sri Lanka, of the words any port or place in Sri Lanka; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "in subsection (4) thereof, by the substitution for the words a fine not exceeding three thousand , of the words a fine not exceeding five million.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "25",
            "text": "Section 207 of the principal enactment is hereby amended, by the repeal of subsection (1) thereof and the substitution therefor, of the following:-",
            "pre_block_list": [
              "Amendment of section 207 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where any ship, being in any port or place in Sri Lanka, is found to be an unsafe ship,  is, by reason of the defective condition of such ships hull, equipment, machinery, under manning, overloading or improper loading or any other condition that is not consistent with the Conventions as may be provided in this Act, unfit to proceed to sea without serious damage to human life having regard to the nature of the service for which such ship is intended, such ship may be provisionally detained for the purpose of being surveyed or rectifying the defective condition and either finally detained or released under section 208",
                "pre_block_list": [
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "26",
            "text": "The following new Part is hereby inserted immediately after PART  VII of the principal enactment, and shall have effect as PART VIIA of that enactment :-",
            "pre_block_list": [
              "Insertion of Part VIIA to the principal enactment."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "VII",
        "text": "",
        "pre_block_list": [
          "P REVENTION   OF  P OLLUTION   FROM  S HIPS",
          "Chapter 1",
          "PRELIMINARY",
          "215 A .  In this Part",
          "Interpretation.",
          "certificate means a certificate issued in  accordance  with  the Convention;",
          "Convention means International Convention for the Prevention of Pollution from Ships, 1973 as modified by the Protocol of 1978 and the Protocol of 1997 and any subsequent amendment made to such Protocols;",
          "country to which the Convention applies means a country which is a contracting Government to the Convention;",
          "International voyage means a voyage between",
          "( a ) a port or place in Sri Lanka and a port or place outside Sri Lanka; or",
          "( b ) a port or place in a country to which the Convention applies  (other  than Sri Lanka) and a port or place in any other country or territory which is outside Sri Lanka; and",
          "ship means a vessel of any type whatsoever operating in the marine environment  and  includes hydrofoil boats, air-cushion vehicles, submersibles, floating craft and fixed or floating platforms.",
          "Merchant Shipping (Amendment) Act, No. 17 of 2019 14",
          "215 B . The Minister may make regulations in respect of",
          "Regulations.",
          "( a ) any matter relating to the issuance of certificates and, recognition of certificates issued under the authority of a country to which the Convention applies;",
          "( b ) the form of certificates to be issued under this Part; and",
          "( c ) such other   matters as are to be prescribed under this Part.",
          "Chapter 2",
          "CERTIFICATE",
          "215 C . (1) A ship shall not go to sea on a voyage to or from any port or place in Sri Lanka or any Sri Lanka ship shall not perform an international voyage, unless there is in force in respect of the ship a certificate issued under this Part.",
          "Prohibition on ships sailing without certificate issued under this Part.",
          "(2) If any ship goes or attempts to go to sea in contravention of subsection (1), the owner or the master of the ship shall be guilty of an offence and on conviction thereof, shall be liable to imprisonment for a term not exceeding one year or to a fine not exceeding one hundred thousand rupees or to both such imprisonment and fine.",
          "215 D . In the event of any amendment or replacement of any provisions of the Convention affecting the nature of the certificate referred to in subsection (1) of section 215 C , the Minister may by Order direct that such subsection shall have effect as if there were substituted therefor references to such other certificate, appropriate to the Convention as so amended, as the Minister may by such Order prescribe.",
          "Variation of certificate on amendment of Convention.",
          "215 E . The master of every ship shall produce to the relevant officer, at the time a clearance for the ship is demanded for voyage, the certificate referred to in subsection (1) of section 215 C , to be in force when the ship goes to sea and, a clearance shall not be granted and the ship may be detained, until the said certificate is so produced.",
          "Production of certificate.",
          "215  F . (1) The owner, the master or the agent of a ship requiring the issue of a certificate referred to in subsection (1) of section 215 C shall apply for the ship to be surveyed, examined or investigated by the relevant authority to the effect that the condition of the ship and its equipment are in good order.",
          "Survey, examination or investigation.",
          "(2) The relevant authority conducting the survey, examination or investigation shall, if he is satisfied that the condition of the ship and its equipment are in good order, complete a declaration of survey, examination or investigation in a form prescribed by regulation.",
          "(3) The declaration of survey, examination or investigation shall be sent forthwith by the relevant authority to the Director-General of Merchant Shipping.",
          "215 G . Upon receipt of the declaration of survey, examination or investigation of a ship referred to in section 215 F , the Director-General of Merchant Shipping shall, if satisfied that the relevant provisions of this Part and the regulations made thereunder have been complied with, issue such certificate to such ship.",
          "Issue of certificate.",
          "215 H . A certificate shall not remain in force",
          "Period of validity of certificate.",
          "( a ) for longer than such period as may be specified in the certificate, or as may be prescribed; or",
          "Merchant Shipping (Amendment) Act, No. 17 of 2019 16",
          "( b ) after notice has been given to the owner, master or agent that the Director-General of Merchant Shipping has cancelled the certificate under section 215 I  and shall not remain in force during the period of any suspension made under such section.",
          "215 I .   (1) The Director-General of Merchant Shipping may cancel or suspend a certificate relating to any ship where he has reason to believe that",
          "Cancellation or suspension of certificate.",
          "( a ) any  declaration  of  survey, examination or investigation on which the certificate was founded has been made fraudulently or erroneously;",
          "( b ) the certificate has been issued on false or erroneous information; or",
          "( c ) since the making of the declaration of survey, examination or investigation, the condition of the ship or its equipment has sustained any damage, or is otherwise insufficient.",
          "(2) In every such case, the Director-General of Merchant Shipping may require the owner to have the ship again surveyed, examined or investigated and to obtain a further declaration of survey, examination or investigation before the reissue of the certificate or the grant of a fresh certificate in lieu thereof.",
          "215 J .   The Director-General of Merchant Shipping shall inform the owner, master or agent of the ship that the certificate has been cancelled or suspended.",
          "Information relating to cancellation or suspension.",
          "Recognition of certificate issued outside Sri Lanka.",
          "215 K . (1) A certificate issued under the authority of a country to which the Convention applies to the effect that the condition of the ship and its equipment are in good order, shall be accepted by the Director-General of Merchant Shipping and, regarded for all purposes covered by the Convention as having the same validity as a certificate issued by such country.",
          "(2) Every ship shall be required to hold the certificate referred to in subsection (1), while in the ports or offshore terminals under the jurisdiction of Sri Lanka.",
          "(3) Where the ship does not carry a valid certificate, the Director-General of Merchant Shipping shall take such steps to ensure that the ship shall not sail until it may proceed to sea without presenting an unreasonable threat of harm to the marine environment:",
          "Provided, the Director-General of Merchant Shipping may grant such a ship permission to leave the port or offshore terminal for the purpose of proceeding to the nearest appropriate repair yard available",
          ""
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "27",
            "text": "The following new sections are hereby inserted immediately after section 321 of the principal enactment, and shall have effect as sections 321 A , 321 B  and 321 C  of that enactment:",
            "pre_block_list": [
              "Insertion of new sections 321 A , 321 B  and 321 C in the principal enactment.",
              "321 A . (1) The Director-General of Merchant Shipping may, with the concurrence of the Minister issue such implementing standards for the compliance with the minimum technical standards of the provisions of any Convention or Protocol as provided in this Act, as may be",
              "Implementing standards.",
              "Merchant Shipping (Amendment) Act, No. 17 of 2019 18",
              "required for the implementation of the provisions of this Act or regulations made thereunder."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "It shall be the duty of all persons in respect of whom any implementation standards are issued under subsection (1) to comply with the same.",
                "pre_block_list": [
                  "321 B . (1) Where the Director- General of Merchant Shipping  has sufficient evidence to believe that any person has acted in contravention of the provisions of this Act or any regulation, rule, order or direction made thereunder, he may",
                  "Imposition of a penalty."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "on the recommendation of the panel appointed under section 321 D  of this Act; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "in the case of a first offender, having regard to the circumstances in which the offence was committed,",
                    "pre_block_list": [
                      "if it is appropriate to impose a penalty, cause a notice to be served in a form prescribed by regulation on such person, requiring him to appear within a period of one month of the date of the receipt of such notice and show cause why a penalty should not be imposed on him.",
                      "(2) Where the person on whom the notice is served admits that he acted in contravention of the provisions of this Act or any regulation, rule, Order or direction made thereunder within a period of one month of the date of receipt of such notice, the Director-General of Merchant Shipping shall impose on that person a monetary penalty not exceeding one third of the maximum fine that could be imposed under this Act to which such person would be liable, if convicted by a court."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "Where the person on whom the notice is served, appears within a period of one month of the date of receipt of such notice and states that he has a cause to show against the imposition of the penalty, the Director-General of Merchant Shipping may proceed forthwith to hear and decide the matter.",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "Where the Director-General of Merchant Shipping is not satisfied with reasons given, he may after assigning reasons therefor, impose the penalty specified in subsection (2) of this section.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where the Director-General of Merchant Shipping imposes a monetary penalty on any person under this section for any contravention of the provisions of this Act or any regulation made thereunder, he shall cause the decision to be served on such person, in a form prescribed by regulation.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Any person aggrieved by the decision of the Director-General of Merchant Shipping, may appeal to the Secretary of the Ministry of the Minister to whom implementation of the provisions of this Act is assigned, (hereinafter referred to as the Secretary)  within a period of  thirty days from the date of receipt of such decision made under subsection (3).",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "The Secretary shall make a decision on any such appeal taking into consideration the decision of the Director-General of Merchant Shipping and the circumstances in which the offence was committed, and may either",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "allow, alter or vary the decision of the Director-General of Merchant Shipping and direct the Director- General of Merchant Shipping to act accordingly; or",
                    "pre_block_list": [
                      "Merchant Shipping (Amendment) Act, No. 17 of 2019 20"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "disallow the appeal for reasons stated therein.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "The Director-General of Merchant Shipping shall comply with any direction issued to him by the Secretary within a period of fourteen days from such direction and shall communicate the direction of the Secretary to the person aggrieved by his decision.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "8",
                "text": "Every notice under this section shall be sent under registered post, and if sent under registered post or exhibited in the last known place of abode, it shall be deemed to have been served on that person.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "9",
                "text": "Notwithstanding anything contained in this Act, no suit or prosecution shall lie in any court regarding the same offence, where the alleged offender has admitted the commission of such offence and paid such penalty.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "10",
                "text": "Any person aggrieved by the decision of the Secretary may prefer an appeal to the Court of Appeal within thirty days from the date of communication of such decision, on question of law.",
                "pre_block_list": [
                  "321 C . (1) Upon the lapse of one month of the decision made under subsections (4) or (10) of section 321 B , where the person on whom such decision is made makes default in the payment of penalty, the Director-General of Merchant Shipping   shall issue a Certificate in a form determined by the Director-General of Merchant Shipping together with certified copy of the notice and decision served on such person to the Magistrate having jurisdiction in the division in which the violation occurred.",
                  "Recovery of penalty.",
                  "(2) The Magistrate shall, thereupon, summon such person who makes default in the payment of penalty under subsection (1) before him to show cause why further  proceedings for the recovery of the sum due under this Act should not be taken against him, and in default of sufficient cause being shown, such sum  shall be deemed to be a fine imposed by a sentence of the Magistrate on such person for an offence punishable with imprisonment and the provisions of section 291 (except paragraphs ( a ), ( d ) and (i)  of  subsection (1)  thereof) of the Code of Criminal  Procedure Act, No.15 of 1979 relating to the default of payment of a fine imposed for such an offence shall thereupon apply and the Magistrate may make any direction which, by the provisions of that subsection, he could have made at the time of imposing such sentence.",
                  "321 D . (1) There shall be appointed by the Director-General of Merchant Shipping in consultation with the Secretary a panel of experts consisting of five persons who have the knowledge and experience in the fields of marine navigation, marine engineering, administration, law or accountancy.",
                  "Panel of Experts.",
                  "(2) It shall be the function of such panel of experts to make recommendations to the Director-General of Merchant Shipping on circumstances under which he shall impose a monetary penalty on any person.",
                  "(3) The Minister shall pay such remuneration as he shall determine in consultation with the Minister to whom the subject of Finance is assigned to members of the panel",
                  "",
                  "Merchant Shipping (Amendment) Act, No. 17 of 2019 22"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "28",
            "text": "The following new section is hereby inserted immediately after section  323 of the principal enactment, and shall have effect as section 323 A  of that enactment:",
            "pre_block_list": [
              "Insertion of new section 323 A  in the principal enactment.",
              "323 A . The Director General of Merchant shipping may exempt such ship or class or description of ship from any specified requirement contained in or prescribed in regulations made under this Act , if he is satisfied that such exemption is within the scope of the relevant Convention",
              "",
              "Power of exemption."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "29",
            "text": "Section 330 of the principal enactment is hereby repealed and the following substituted therefor:",
            "pre_block_list": [
              "Replacement of section 330 of the principal enactment. Application of international conventions.",
              "330.   Until other provision is made therefor by regulations made under this Act"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "the provisions of the International Convention for the Safety of Life at Sea 1974, Protocol of 1988 as amended from time to time and any subsequent amendment made to such Protocol shall have effect as regulations made under section 139, and shall take effect with such modification as may be necessary to adapt them to the circumstances of Sri Lanka; and any reference therein to the Administration shall be construed as a reference to the Director General of Merchant Shipping, or to such other person or officer as the Director-General of Merchant Shipping may for such purposes appoint;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "the provisions of the International Convention on Load Lines, 1966 as modified by the Protocol of 1988 and any subsequent amendment made to",
                "pre_block_list": [
                  "such Protocol, shall have effect as regulations made under Part VI of this Act, and shall take effect with such modification as may be necessary to adapt them to the circumstances of Sri Lanka;"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "the provisions of the International Convention on Tonnage Measurement of Ships, 1969 shall have effect as regulations made under section 44, and shall take effect with such modification as may be necessary to adapt them to the circumstances of Sri Lanka; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "the provisions of the International Convention for the prevention of pollution from ships, 1973, as modified by the Protocol of 1978 and the Protocol of 1997 and any subsequent amendment made to such Protocols shall have effect as regulations made under section 215 B , and shall take effect with such modification as may be necessary to adapt them to the circumstances of Sri Lanka",
                "pre_block_list": [
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "30",
            "text": "Notwithstanding the repeal of the definition of the expression Convention in sections 138 and 159 of the principal enactment, every regulation made in relation to the repealed Conventions in force on the date of commencement of this Act, in so far as such regulation is not inconsistent with the provisions of this Act, shall be deemed to have been made under this Act.",
            "pre_block_list": [
              "Savings."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "31",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency.",
              "Merchant Shipping (Amendment) Act, No. 17 of 2019 24",
              "English Acts of the Parliament can be purchased at the P RAKASHANA  P IYASA , D EPARTMENT   OF G OVERNMENT  P RINTING , N O . 118, D R . D ANISTER  D E  S ILVA  M AWATHA , C OLOMBO  8."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}