{
  "n_pages": 15,
  "title_page": {
    "title": "Prevention  Of  Domestic  Violence Act",
    "num": "34",
    "year": "2005",
    "date_certified": "2005-10-03",
    "date_published": "2005-10-07",
    "price": 12.25,
    "price_postage": 7.5
  },
  "body_pages": {
    "preamble": [
      "Prevention Of Domestic Violence Act, No. 34 Of 2005 1",
      "[Certified On 3Rd October, 2005]",
      "L.D. O. 8/2002",
      "A N  A Ct   To   Provide   For   The   Prevention   Of   Any   Act   Of   Domestic",
      "Violence   And   For   Matters   Connected   Therewith   Or   Incidental",
      "Thereto",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :",
      "Short Title."
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Prevention of Domestic Violence Act, No. 34 of 2005.",
            "pre_block_list": [
              "An aggrieved person to make an application."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "A person, in respect of whom an act of domestic violence has been, is, or is likely to be, committed (hereinafter referred to as an aggrieved person) may make an application to the Magistrates  Court for a Protection Order, for the prevention of such act of domestic violence.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "An application under subsection (1) may be made",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "by an aggrieved person ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "where the aggrieved person is a child, on behalf of such child by",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "a parent or guardian of the child ;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "a person with whom the child resides;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "a person authorised in writing by the National Child Protection Authority established under the National Child Protection Authority Act, No. 50 of 1998; or",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "by a police officer on behalf of an aggrieved person.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "An application under subsection (1) shall be made in duplicate and shall be substantially in the form set out in Schedule II hereto and shall be made to the Magistrates Court within whose jurisdiction the  aggrieved person or  the relevant person temporarily or permanently resides, or the act of domestic violence has been or is likely to be committed.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Affidavits of any person who has knowledge of the aforesaid acts of domestic violence may  be attached affidavits to the application, in support thereof.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "Upon an application being made in accordance with the provisions of this Act, the Court shall forthwith consider the application.",
            "pre_block_list": [
              "Considering the application."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Upon the consideration of the application and the affidavits, if any, the court shall",
                "pre_block_list": [
                  "Procedure for the issue or refusal of an Interim Protection Order."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "where it is satisfied that it is necessary to issue an Interim Protection Order (hereinafter referred to as an Interim Order), until the conclusion of the inquiry into the application, forthwith issue an Interim Order having regard to the provisions of subsection (2), and shall also make an Order for the holding of an inquiry in respect of such application on a date not later than fourteen days from the date of the application; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "where it is satisfied that it is not necessary to issue an Interim Order in the circumstances, make an Order for the holding of an inquiry in respect of such application, on a date not later than fourteen days from the date of the application :",
                    "pre_block_list": [
                      "Provided however, that the court may, where it considers it necessary, examine on oath prior to the issue of such Interim Order, any person referred to in subsection (2) of section 2 or any other material witness, as the case may be."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "In determining the issue of an Interim  Order the court shall take into consideration the urgent need to prevent the commission of any act of domestic violence, and the need to ensure the safety of the aggrieved person.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Upon the issuing of an Order under paragraph ( a ) or paragraph ( b ) of subsection (1), as the case may be, the court shall cause Notice to be issued on the respondent, to show cause on the date specified therein, why a Protection Order should not be issued against him.",
                "pre_block_list": [
                  "Prevention of Domestic Violence Act, No. 34 of 2005 3"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "An Interim Order made under paragraph ( a ) of subsection (1), together with the Order made under paragraph ( a ) or paragraph ( b ) of subsection (1) as the case may be, shall be served on the respondent along with the Notice issued under subsection (3). Where service of such documents cannot, by the exercise of due diligence be effected by the fiscal or other authorized officer, such documents shall be deemed to be served on such respondent if it is posted in a conspicuous place at his usual place of residence.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "An Interim Order",
                "pre_block_list": [
                  "Interim Order."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "shall, pending the issue of a Protection Order prohibit the respondent from committing or causing the commission of any act of domestic violence;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "may, contain any other prohibition or condition specified in sub-paragraphs ( a ) to ( l ) of subsection (1) of section 11 where the Court is satisfied, that by reason of the circumstances of the case, and upon evidence given on oath by the aggrieved person or any other person on behalf of the aggrieved person, or any material witness, that such prohibition or condition is necessary to prevent any act of domestic violence.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where an Interim Order has been made, the Court may where it is satisfied that it is",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "in the interest of the parties to do so, order a social worker or a family counselor to counsel the parties and order the parties to attend such counseling sessions.",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "reasonably necessary to protect and provide for the immediate safety of the aggrieved person, order a social worker, family counselor, probation officer, family health worker or child rights promotion officer to monitor the observance of the Order and submit to Court a report on the date specified for the inquiry into the application in terms of subsection (1) of section 4.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "An Interim Order shall remain in force until a Protection Order is issued by the court or such Interim Order is vacated.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where, on the date specified in the Notice issued under subsection (3) of section 4, the respondent is present in Court, the Court shall proceed to inquire into the application, and consider any evidence previously received along with such further affidavits or oral evidence as it may deem necessary which shall form part of the record of the proceedings.",
                "pre_block_list": [
                  "Issue of Protection Order where the respondent appears."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where the respondent is not represented by a legal representative, the Court may of its own accord or on the request of the aggrieved person, order",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "that the examination of witnesses including the aggrieved person shall not be conducted by the respondent ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the respondent to state the questions to Court so as to enable the Court to repeat the question accurately to the aggrieved person or witness.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "After the inquiry where the Court is satisfied that it is necessary to issue a Protection Order,  issue a Protection Order having regard to the provisions of section 8.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where on the date specified in the Notice issued under subsection  (3) of section 4 the respondent appears and does not admit to the act or acts of violence, but does not object to the issue of a Protection Order, the court shall issue a Protection Order having regard to the provisions of section 8.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where  on the date specified in the Notice issued under subsection (3) of section 4 the respondent does not appear and the Court is satisfied that the Notice has been served on the respondent, the court shall proceed to consider the application on the evidence previously received and such further evidence by way of affidavits or any oral evidence recorded in the absence of the respondent as it may deem necessary, which shall form part of the record of the proceedings.",
                "pre_block_list": [
                  "Issue of protection order when respondent does not appear.",
                  "Prevention of Domestic Violence Act, No. 34 of 2005 5"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Court may upon being satisfied on a consideration of the evidence before it, that it is necessary to issue a Protection Order, issue a Protection Order having regard to the provisions of section 8.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "In determining whether  a Protection Order should be issued or not, the court shall take into consideration the need to prevent the commission of any act of domestic violence and the need to ensure the safety of the aggrieved person.",
            "pre_block_list": [
              "Matters to be taken into consideration in issuing a protection order."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "Upon the issuing of a Protection Order the Court shall forthwith cause",
            "pre_block_list": [
              "Protection Order to be served on the respondent."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "such order to be served on the respondent; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "certified copies of such Order, to be served on the",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "i",
                    "text": "aggrieved person ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "applicant, where the applicant is not the aggrieved person ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iii",
                    "text": "officers in charge of the police stations within whose jurisdiction the respondent and the aggrieved person reside.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "10",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "A Protection Order",
                "pre_block_list": [
                  "Protection Order."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "shall, prohibit the respondent from committing or causing the commission of, any act of domestic violence;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "may, contain any other prohibition specified in subparagraph, ( a ) to ( l ) of subsection (1) of section 11, or any supplementary order specified in subsection (1) of section 12 where the court is satisfied that by reason of the circumstances of the case, and upon evidence given on oath by the aggrieved person or any other person on behalf of the aggrieved person as the case may be, or any other material witness, that it is necessary to do so to ensure the safety and well being of the aggrieved person.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "A Protection Order shall remain in force for a period not exceeding 12 months as specified therein.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "11",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Court may, by means of an Interim Order or Protection Order prohibit the respondent from :",
                "pre_block_list": [
                  "Prohibitions that an Interim Order or Protection Order may contain."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "entering a residence or any specified part thereof, shared by the aggrieved person and the respondent;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "entering the aggrieved persons",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "residence; (ii) place of employment; (iii) school;",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "entering any shelter in which the aggrieved person may be temporarily accommodated;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "preventing the aggrieved person who ordinarily lives or has lived in a shared residence from entering or remaining in the shared residence or a specified part of the shared residence;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "occupying the shared residence ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "having contact with any child of the aggrieved person or having contact with such child other than on the satisfaction of such conditions as it may consider appropriate, where the Court is satisfied that it is in the best interest of such child ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "g",
                    "text": "preventing the aggrieved person from using or having access to shared resources ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "h",
                    "text": "contacting or attempting to establish contact with the aggrieved person in any manner whatsoever ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "i",
                    "text": "committing acts of violence against any other person, whether it be a relative, friend, social worker or medical officer, who may be assisting the aggrieved person ;",
                    "pre_block_list": [
                      "Prevention of Domestic Violence Act, No. 34 of 2005 7"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "j",
                    "text": "following the aggrieved person around as to cause a nuisance ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "k",
                    "text": "engaging in such other conduct as in the opinion of the  Court will be detrimental to the safety, health or well being of the aggrieved person or other person who may require protection from the respondent as the Court may specify in the Protection Order ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "l",
                    "text": "selling, transferring, alienating or encumbering the matrimonial home so as to place the aggrieved person in a destitute position.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "In imposing any prohibition referred to in subsection (1) the Court shall have regard to",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the need for the accommodation of the aggrieved person or the children (if any) of the aggrieved person and the children (if any) of the respondent ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "any hardship that may be caused to the respondent or to any other person as a result of the making of the Order.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "12",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where a Protection Order has been made and where the Court is satisfied that it is reasonably necessary to protect and provide for the immediate safety, health or welfare of the aggrieved person the Court may order",
                "pre_block_list": [
                  "Supplementary Orders."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the police to seize any weapons that the respondent may have in his or her possession ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the police to accompany the aggrieved person to any place to assist with the collection of personal property of such person and of any children ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "the respondent and the aggrived person to attend mandatory counseling sessions, psychotherapy or other forms of rehabilitative therapy as may be available ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "the aggrieved person if such person so requests, be placed in a shelter or provided with temporary accommodation the location and other details of which shall be kept confidential if necessary ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "a social worker, family counsellor, probation officer or family health worker to monitor the observance of the Protection Order between the aggrieved person and  the respondent and submit to Court a report relating thereto, once in every three months.",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "the respondent to provide urgent monetary assistance to any person, where such respondent has a duty to support such person ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "g",
                    "text": "the respondent to make such payments and provide such facilities, or make such payments or provide such facilities as the case may be, as are necessary to enable the aggrieved party to continue in occupation of any residence in which such aggrieved party will reside during the period of operation of such Order, notwithstanding that the respondent has been prohibited from entering or remaining in such residence by an Order made under section 11.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "An Order under paragraphs ( f ) and ( g ) of subsection (1) shall only be made after due inquiry and having regard to the financial needs and other resources of the aggrieved person and the respondent :",
                "pre_block_list": [
                  "Provided however such an Order shall not affect the rights of any person under the Maintenance Act, No. 37 of 1999."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Court may, on the failure of the respondent to make any payment ordered under paragraph ( f ) of subsection (1) direct an employer of the respondent, to directly pay to the aggrieved person a part or the whole of the remuneration due to the respondent as financial relief that the Court may have ordered.",
                "pre_block_list": [
                  "Prevention of Domestic Violence Act, No. 34 of 2005 9"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "13",
            "text": "The Court may, with the consent of the parties to the proceedings, make any Order under this Act without proof or admission of guilt and such Order shall not be construed as having been made consequent to an admission of guilt or upon proof of guilt.",
            "pre_block_list": [
              "Orders made with consent of parties."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "14",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "A Protection Order may be altered, modified, varied, extended or revoked, on an application made either by the aggrieved person or the respondent, and where the Court is satisfied that there is a change of circumstances that require such alteration, modification, variation, extention, or revocation :",
                "pre_block_list": [
                  "Variation or revocation of a Protection Order.",
                  "Provided however, no such alteration, modification, variation, extention or revocation, shall be made without hearing both the aggrieved person and the respondent :",
                  "Provided further that the Court shall not grant such an application to the aggrieved person unless it is satisfied that the application is made freely and voluntarily."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "15",
            "text": "The provisions of Chapter V and VI of the Code of Crimianl Procedure Act, No. 15 of 1979 shall be applicable for compelling the attendance of the respondent and any person required by the applicant to give evidence, and for requiring the production of any document necessary, for the purposes of this Act.",
            "pre_block_list": [
              "Attendance of respondent   and witnesses.",
              "Spouse to be a competent witness."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "16",
            "text": "In any proceedings under this Act a spouse shall be a competent witness against the other spouse.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "17",
            "text": "Any person who is  dissatisfied with an Order made by a Magistrate under section 6 or section 7 may prefer an appeal to the  High Court established under Article 154 P  of the Constitution in like manner as if the Order was a final Order pronounced by a Magistrates Court in a criminal case or matter, and sections 320 to 330 (both inclusive) and sections 357 and 358 of the Code of Criminal Procedure Act, No. 15 of 1979 shall,  mutatis mutandis , apply to such appeal :",
            "pre_block_list": [
              "Right of Appeal.",
              "Provided however, that notwithstanding anything to the contrary in section 323 of the Code of Criminal Procedure Act, No. 15 of 1979 an Order under section 6 or section 7 shall not be stayed by reason of such appeal, unless the High Court for reasons to be recorded directs otherwise :",
              "Provided further that the Magistrate in forwarding the record to the High Court shall retain a copy of his Order for purposes of enforcement."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "18",
            "text": "Where respondent against whom an Interim Order or a Protection Order, as the case may be, has been issued and has failed to comply with such Order, such respondent shall be guilty of an offence and shall be liable on conviction after summary trial before a Migistrate to a fine not exceeding ten thousand rupees or to imprisonment of either description for a term not exceeding one year or to both such fine and imprisonment.",
            "pre_block_list": [
              "Enforcement of Order."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "19",
            "text": "Notwithstanding anything contained in the Code of Criminal Procedure Act, No. 15 of 1979, the Court may adopt a procedure as it may seem expedient in respect of the framing of charges.",
            "pre_block_list": [
              "Court to adopt procedure in framing charges."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "20",
            "text": "Any person who prints or publishes",
            "pre_block_list": [
              "Persons printing or publishing any matter in certain cases to be punished."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "the name or any matter which may make known the identity of an applicant or a respondent in an application under this Act; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "any matter other than a judgment of the Supreme Court or Court of Appeal, in relation to any proceeding under this Act, in any Court,",
                "pre_block_list": [
                  "shall be punished with imprisonment of either description for a term which may extend to two years or to a fine or to both such imprisonment and fine.",
                  "Prevention of Domestic Violence Act, No. 34 of 2005 11"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "21",
            "text": "Nothing in this Act shall be construed  as depriving an aggrieved person of a right if any, to institute a separate civil action or criminal proceeding.",
            "pre_block_list": [
              "Other actions not barred."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "22",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "23",
            "text": "In this  Act unless the context otherwise requires",
            "pre_block_list": [
              "Interpretation.",
              "child means a person who is under the age of 18 years ;",
              "domestic violence means"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "an act which constitutes an offence specified in Schedule I ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "any emotional abuse,",
                "pre_block_list": [
                  "committed or caused by a relevant person within the environment of the home or outside and arising out of the personal relationship between the aggrieved person and the relevant person ;",
                  "emotional abuse means a pattern of cruel, inhuman, degrading or humiliating conduct of a serious nature directed towards an aggrieved person ;",
                  "shared resources means movable or immovable property which both the aggrieved person and the respondent have habitually used or have had access to ;",
                  "relevant person in relation to an aggrieved person means,",
                  "( a ) (i) the spouse ;"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "ex-spouse ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iii",
                    "text": "cohabiting partner ,",
                    "pre_block_list": [
                      "of an aggrieved person ;",
                      "( b ) (i) the father, mother, grandfather, grandmother, stepfather, stepmother ;",
                      "(ii) the son, daughter, grandson, grand daughter, stepson, stepdaughter ;",
                      "(iii) the brother, sister, half-brother, half- sister, step brother, step-sister ;"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iv",
                    "text": "siblings of a parent ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "v",
                    "text": "the child of a sibling ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "vi",
                    "text": "child of a sibling of a parent,",
                    "pre_block_list": [
                      "of an aggrieved person or of the spouse, former spouse or cohabiting partner of the aggrieved person ;",
                      "respondent in relation to a Protection Order or an Interim Order means the relevant person against whom such Order is sought or made.",
                      "Prevention of Domestic Violence Act, No. 34 of 2005 13",
                      "SCHEDULE I Section 22",
                      "1. All offences contained in Chapter XVI of the Penal Code",
                      "2. Extortion-Section 372 of the Penal Code",
                      "3. Criminal Intimidation-Section 483 of the Penal Code",
                      "4. Attempt to commit any of the above offences",
                      "SCHEDULE II Section 2(3)",
                      "A PPLICATION",
                      "In the Magistrates Court of.........................",
                      "A.B. of........................(name, description and address of the aggrieved person, and if he/she sues in any repesentative capacity, state the capacity- e. g., if the aggrieved person is a minor or person of unsound mind appearing by his/her guardian or next friend, say a minor, by C. D. of..............his/her next friend)...................(Aggrieved person).",
                      "Y.Z., of............................(name, description and addresses of the respondent)......................Respondent.",
                      "The.............day of...................20...............",
                      "The application of the above-named aggrieved person (and if the case is so add: appearing by  C. H, his/her registered attorney) states as follows :",
                      "(Here set out the circumstances of the case)",
                      "Wherefore the aggrieved person (or aggrieved persons) prays for a Protection Order against the  respondent   with effect from the...............day of ....................20................",
                      "........................................ Signature of Applicant",
                      "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), payable to the S UPERINTENDENT , G OVERNM   ENT  P UBLICATIONS  B UREAU , N O . 32, T RANSWORKS  H OUSE ,  L OTUS R OAD , C OLOMBO  01 before 15th December each year in respect of the year following."
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}