{
  "n_pages": 5,
  "title_page": {
    "title": "Sri Lanka Rupavahini Corporation (Amendment)  Act",
    "num": "26",
    "year": "2022",
    "date_certified": "2022-09-26",
    "date_published": "2022-09-30",
    "price": 15.0,
    "price_postage": 15.0
  },
  "body_pages": {
    "preamble": [
      "1",
      "[Certified On 26Th Of September, 2022]",
      "L.D.O. 1/2020",
      "A N  A Ct   To   Amend   The  S Ri  L Anka  R Upavahini  C Orporation A Ct , No. 6  Of  1982",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows: -"
    ],
    "pre_section_list": [
      {
        "class_name": "ActL1Section",
        "num": "1",
        "text": "This Act may be cited as the Sri Lanka Rupavahini Corporation (Amendment) Act, No. 26 of  2022.",
        "pre_block_list": [
          "Short title"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "2",
        "text": "Section 3 of the Sri Lanka Rupavahini Corporation Act, No. 6 of 1982 (hereinafter referred to as the principal enactment) is hereby amended as follows :-",
        "pre_block_list": [
          "Amendment of section 3 of Act, No. 6 of 1982"
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "by the repeal of subsection (1) thereof and the substitution therefor, of the following subsection:-",
            "pre_block_list": [
              "(1) The Corporation shall consist of the following members :"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "one,  ex-officio  member namely, Secretary to the Ministry of the Minister or an officer not below the rank of an Additional Secretary of that Ministry nominated by that Secretary;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "four members nominated in the following manner and appointed by the Minister:-",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "i",
                    "text": "one member who shall be a representative of the Ministry of the Minister assigned the subject of Finance nominated by such Minister;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "one member who shall be a representative of the Ministry of the Minister assigned the subject of Education nominated by such Minister;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iii",
                    "text": "one member who shall be a representative of the Sri Lanka Broadcasting  Corporation established under Sri Lanka Broadcasting Corporation Act, No. 37 of 1966, nominated by the Minister to whom such Corporation is assigned;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iv",
                    "text": "one member who shall be a representative of the National Film Corporation established under Act, No. 47 of 1971, nominated by the Minister to whom such Corporation is assigned; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "four members appointed by the Minister (hereinafter referred to as the appointed Members) who appear to the Minister to have wide experience, capacity and recognition in television engineering or other forms of engineering or legal or financial matters or administration or labour relations or in the field of broadcasting and communication.;",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "in subsection (5) thereof by the substitution for the words Every member of the words Every appointed member;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "in subsection (6) thereof by the substitution for the words by any member of the words by any appointed member;",
            "pre_block_list": [
              "3"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "4",
            "text": "in subsection (7) thereof by the substitution for the words any member of the words any appointed member;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "5",
            "text": "in subsection (8) thereof, by the substitution for the words remove any member of the words remove any appointed member;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "6",
            "text": "in subsection (9) thereof by the substitution for the words Any member of the words Any appointed member.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "3",
        "text": "Section 32 of the principal enactment is hereby amended by the insertion immediately after the definition of the expression agent of the following definition:-",
        "pre_block_list": [
          "Amendment of section 32 of the principal enactment",
          " Minister means the Minister to whom the Rupavahini Corporation is assigned under Article 44 or 45 of the Constitution;."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "4",
        "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
        "pre_block_list": [
          "Sinhala text to prevail in case of inconsistency",
          "English Acts of the Parliament can be purchased at the P RAKASHANA  P IYASA , D EPARTMENT   OF G OVERNMENT  P RINTING , N O . 118, D R . D ANISTER  D E  S ILVA  M AWATHA , C OLOMBO  8."
        ],
        "child_level_list": []
      }
    ],
    "part_list": []
  }
}