{
  "n_pages": 4,
  "title_page": {
    "title": "Industrial Disputes (Amendment) Act",
    "num": "11",
    "year": "2003",
    "date_certified": "2003-03-20",
    "date_published": "2003-03-21",
    "price": 4.25,
    "price_postage": 4.5
  },
  "body_pages": {
    "preamble": [
      "[Certified On 20Th March, 2003]",
      "L. D.O. 53/2002.",
      "A N  A Ct   To   Amend   The  I Ndustrial  D Isputes  A Ct",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :",
      "1 This Act May Be Cited As The Industrial Disputes (Amendment)  Act, No. 11 Of 2003 And Shall Come Into Operation On Such Date As The Minister May Appoint By Order Published In The Gazette (Hereinafter Referred To As The Appointed Date).",
      "Short Title And Date Of Operation."
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "Section 31 A  of the Industrial Disputes Act (hereinafter referred to as the principal enactment) is hereby amended by the insertion immediately after subsection (1) of that section, of the following new subsection :",
            "pre_block_list": [
              "Amendment of section 31 A  of Chapter 131.",
              "(1 A ) There shall be appointed in respect of the labour tribunals established under subsection (1) a Secretary, and in respect of each labour tribunal so established, an Assistant Secretary",
              ""
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "Section 31 B  of the principal enactment is hereby amended in subsection (7) of that section, by the substitution for the words period of six months, of the words period of three   months.",
            "pre_block_list": [
              "Amendment of section 31 B  of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "Section 31 D  of the principal enactment is hereby amended as follows :",
            "pre_block_list": [
              "Amendment of section 31 D  of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the repeal of subsection (1) of that section ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "in subsection (6) of that section, by the substitution for all the words from the words has furnished such security. The petition of appeal shall be filed, to the end of that subsection, of the words has furnished such security.;",
                "pre_block_list": [
                  "2H 0168595,600 (2002/10)"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "by the repeal of subsection (7) of that section ; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "by the repeal of subsection (8) of that section and the substitution therefor of the following subsection :",
                "pre_block_list": [
                  "(8) Every appeal or application referred to in subsection (4) shall be accompanied by a certificate issued under the hand of the President of the labour tribunal, to the effect that the appellant or the applicant as the case may be, has furnished the security which he is required to furnish under that subsection",
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "Section 31 DD  of the principal enactment is hereby amended by the repeal of subsection (3) of that section.",
            "pre_block_list": [
              "Amendment of section 31 DD  of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "Section 31 DDD  of the principal enactment is hereby repealed.",
            "pre_block_list": [
              "Repeal of section 31 DDD  of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "Section 34 of the principal enactment is hereby amended in subsection (1) of that section, by the substitution for the words or of an order made under this Act by a labour tribunal, of the words or of an order made under this Act by a labour tribunal, other than an order made on an application made under section 31 B   of this Act,.",
            "pre_block_list": [
              "Amendment of section 34 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text  to prevail in case of inconsistency.",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , N O . 32, T RANSWORKS   H OUSE ,  L OTUS   R OAD ,  C OLOMBO  01  before  15th  December  each  year  in   respect  of the year following."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}