{
  "n_pages": 11,
  "title_page": {
    "title": "Act",
    "num": "39",
    "year": "2014",
    "date_certified": "2014-11-01",
    "date_published": "2014-11-07",
    "price": 10.0,
    "price_postage": 20.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 01St November, 2014]",
      "L.D.O.25 / 2014.",
      "A N  A Ct   To   Make   Provisions   For   Registration   Of   The  Dfcc B Ank",
      "As   A   Public   Limited   Company   With   The   Name  Dfcc B Ank  Plc",
      "And   To   Provide   For   The   Provisions   Consequential   To   Such",
      "Registration  ;  To   Repeal   The  Dfcc B Ank  A Ct  (C Hapter  165)",
      "And   For   Matters   Connected   Therewith   Or   Incidental   Thereto",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:"
    ],
    "pre_section_list": [
      {
        "class_name": "ActL1Section",
        "num": "1",
        "text": "This Act may be cited as the DFCC Bank (Repeal and Consequential Provisions) Act, No. 39 of 2014.",
        "pre_block_list": [
          "Short title."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "2",
        "text": "The DFCC Bank Act (Chapter 165) shall as from such date as may be specified by the Minister by Order published in the  Gazette  (hereinafter referred to as the specified date) be repealed. Such date shall be a date which is not later than six months from the date of commencement of this Act.",
        "pre_block_list": [
          "Repeal of the DFCC Bank Act (Chapter 165)."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "3",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "The Minister may, at any time after the date of commencement of this Act, forward to the Registrar of Companies Articles of Association duly approved by the Monetary Board together with a direction to such Registrar requiring him to register the DFCC Bank as a public limited company under the Companies Act, No. 07 of 2007, with the name DFCC Bank PLC with effect from the specified date.",
            "pre_block_list": [
              "Registration of the DFCC Bank as a public limited company under the Companies Act, No. 07 of 2007."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "Notwithstanding anything contained in the Companies Act, No. 07 of 2007, the Registrar of Companies shall, on receipt of a direction under subsection (1)",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "issue a Certificate of Incorporation under subsection (1) of section 5 of the aforesaid Act, in the name DFCC Bank PLC; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "publish an Order in the  Gazette  declaring that from the specified date a public limited company is incorporated in the name DFCC Bank PLC",
                "pre_block_list": [
                  "(hereinafter referred to as the Company) to take over and carry on the business of the DFCC Bank as a going concern."
                ],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "4",
        "text": "With effect from the specified date, the business of the DFCC Bank shall vest absolutely in the Company.",
        "pre_block_list": [
          "Business of DFCC Bank to vest in the Company. Transitional provisions."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "5",
        "text": "With effect from the specified date notwithstanding any provision in any other law",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL3Paragraph",
            "num": "a",
            "text": "the share capital and any amount lying to the credit of the share premium account, of the DFCC Bank on the day immediately preceding the specified date shall be deemed to be the stated capital of the Company as at the specified date;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "b",
            "text": "all shareholders of the DFCC Bank on the day immediately preceding the specified date shall be deemed to be the shareholders of the Company as at the specified date and the shares held by such shareholders in the Company shall be identical in number to that held by them in the DFCC Bank on the day immediately preceding the specified date and all share certificates issued by the DFCC Bank shall be read and construed as if such share certificates were share certificates issued by the Company;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "c",
            "text": "all securities of any kind issued by the DFCC Bank and outstanding on the day immediately preceding the specified date shall from the specified date be deemed to be securities issued by the Company;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "d",
            "text": "the Chairman, directors, officers, employees and servants of the DFCC Bank holding office on the day immediately preceding the specified date shall be deemed to be the Chairman, directors, officers, employees and servants of the Company with effect from the specified date and such Chairman, directors, officers, employees and servants shall continue to hold office in the Company on terms and conditions enjoyed by them under the DFCC Bank, immediately preceding the specified date;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "e",
            "text": "all contracts, deeds, bonds, agreements, guarantees, powers of attorney, grants of legal representation and other instruments of whatever nature of the DFCC Bank subsisting and having effect on the day immediately preceding the specified date and to which the DFCC Bank is a party or which are in favour of the DFCC Bank shall be deemed with effect from the specified date to be contracts, deeds, bonds, agreements, guarantees, powers of attorney, grants of legal representation and other instruments entered into by or granted in favour of the Company ;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "f",
            "text": "unless specifically revoked or substituted in the manner provided for in any other law, all approvals or licences granted to the DFCC Bank by the Monetary Board, the Director of Bank Supervision, Controller of Exchange, Securities and Exchange Commission, Urban Development Authority, any other regulatory body or authority, Provincial Council, local authority subsisting or having effect on the day immediately preceding the specified date shall be deemed with effect from the specified date to be approvals or licences granted to the Company ;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "g",
            "text": "any account maintained between the DFCC Bank and any other person in or outside Sri Lanka including the Government of Sri Lanka, its departments and statutory bodies on the day immediately preceeding the specified date, whether it be an asset or liability of such Bank shall be deemed with effect from the specified date to be an account between the Company and that other person with the same rights and subject to the same obligations and incidents (including rights of set off) as would have been applicable thereto if the account between the DFCC Bank and that other person had continued and so that any instruction,",
            "pre_block_list": [
              "order, direction, mandate or authority given by such other person in relation to such account and subsisting on the day immediately preceding the specified date shall, unless and until revoked or cancelled, apply to and have effect in relation to, the account between the Company and that other person ;"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "h",
            "text": "any mortgage, security or indemnity held by the DFCC Bank on the day immediately preceding the specified date as security for the payment of debts or liabilities (whether present or future actual or contingent) of any person shall be deemed with effect from the specified date to be a mortgage, security or indemnity held by and be available to the Company as security for the payment of such debt and liabilities to the Company; and where the moneys secured by such mortgage, security or indemnity include future advances to or liabilities of that person, the security for future advances to or liabilities of that person to the Company shall be deemed to the same extent to which future advances by or liabilities to the DFCC Bank were secured thereby immediately preceding the specified date;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "i",
            "text": "the custody of any document, goods or other property held by the DFCC Bank on the day immediately preceding the specified date as bailee for any other person shall be deemed with effect from the specified date to be a document, goods or property in the custody of the Company as a bailee for such other person and the rights and obligations of the DFCC Bank under any contract of bailment relating to such document, goods or property shall be deemed to be the rights and obligations of the Company;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "j",
            "text": "any listing of shares or securities of any kind whatsoever issued by the DFCC Bank on a stock",
            "pre_block_list": [
              "exchange or securities exchange whether in Sri Lanka or elsewhere on the day immediately preceding the specified date shall be deemed with effect from the specified date to be listing of such shares or securities of the Company ;"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "k",
            "text": "all reserves maintained by the DFCC Bank for the purpose of the provision of any law, regulatory requirement or otherwise, on the day immediately preceding the specified date shall be deemed with effect from the specified date to be reserves of the Company held for such purpose;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "l",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL4SubParagraph",
                "num": "i",
                "text": "all property immovable and movable of the DFCC Bank (including cash balances, reserve funds, investments, trade marks, patents, licences and deposits);",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL4SubParagraph",
                "num": "ii",
                "text": "all liabilities, including deposits and contingent liabilities, of the DFCC Bank;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL4SubParagraph",
                "num": "iii",
                "text": "all rights, powers, privileges, authorities, obligations, duties and interest arising in or out of the business, such property and such liabilities including the licence issued to the DFCC Bank by the Monetary Board under subsection (3) of section 76 A  of the Banking Act;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL4SubParagraph",
                "num": "iv",
                "text": "all books, accounts and documents relating or appertaining to the DFCC Bank or to any property of the Bank,",
                "pre_block_list": [
                  "subsisting on the day immediately preceding the specified date, shall be deemed as from the specified date to be property, liabilities, rights, powers, privileges, authorities, obligations, duties, interest, books, accounts and documents of the Company;"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "m",
            "text": "all applications, actions, proceedings or appeals of whatever nature instituted under the provision of any law by or against the DFCC Bank and pending on the day immediately preceding the specified date shall be deemed as from the specified date, to be applications, actions, proceedings or appeals instituted by or against the Company and may be continued accordingly;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "n",
            "text": "any pension fund, gratuity fund or unfunded liability in respect of a pension, gratuity or other liability relating to post employment benefit to any employee or former employee of the DFCC Bank and existing on the day immediately preceding the specified date shall be deemed as from the specified date, to be a pension fund, gratuity fund or such liability as the case may be, of the Company in respect of such employee or former employee;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "o",
            "text": "where the DFCC Bank on the day immediately preceding the specified date was a contributor to any provident fund approved by the Commissioner of Labour for the benefit of its employees, the Company shall be deemed as from the specified date, to be the contributor to such provident fund in respect of such employees;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "p",
            "text": "all tax credits, refunds, losses, concessions, reliefs, benefits and liabilities of the DFCC Bank subsisting on the day immediately preceding the specified date shall be deemed as from the specified date, to be tax credits, refunds, losses, concessions, reliefs, benefits and liabilities of the Company;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "q",
            "text": "all judgments, decrees or orders entered in favour of, or against the DFCC Bank by any Court in any action or proceeding shall be deemed with effect from the specified date, to be judgments, decrees or orders entered in favour of, or against the Company;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "r",
            "text": "all rights to intellectual property including trademarks, patents, softwares subsisting in favour of the DFCC Bank on the day immediately preceding the specified date shall be deemed as from the specified date, to be such rights in favour of the Company.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "6",
        "text": "Notwithstanding the repeal of the DFCC Bank Act (Chapter 165) by section 2 of this Act, the provisions of subsection (2) of section 10 and section 14 of the aforesaid repealed Act shall from and after the specified date, continue to be operative and of full force and avail in law as if such Act had never been repealed, until the loans so guaranteed by the Government of Sri Lanka in terms of such sections are repaid in full and no further. Every loan guaranteed as aforesaid prior to the specified date and subsisting on the day immediately preceding the specified date, shall as from the specified date continue to subsist as if the loans so guaranteed were loans raised by the Company.",
        "pre_block_list": [
          "Limited applicability of section 10 and 14 of the DFCC Bank Act (Chapter 165)."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "7",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "With effect from the specified date, every reference to the DFCC Bank in any Act, regulation, notification, contract, instrument, record, share certificate, document, deed, bond, agreement, guarantee, power of attorney, grant of legal representation and other instruments of whatever nature shall be deemed to be a reference to the Company to give effect to the provisions of this Act.",
            "pre_block_list": [
              "Consequential amendments to written laws &c."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "For the provisions of section 5 and subsection (1) to take effect, it shall not be necessary to replace the name the DFCC Bank with the name of the Company in any register or record maintained by any department, court of law, tribunal or agency of the government, provincial council or local authority under any law or regulation provided however that where the Company makes an application to the person responsible for maintaining such register or record with a copy of the certificate of incorporation certified as true copy by a notary public, such person shall substitute the name of the Company in such record or register.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "8",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "The Minister may make regulations for the purposes of facilitating the vesting of the business of the DFCC Bank in the Company in pursuance of the provisions of section 4.",
            "pre_block_list": [
              "Regulations."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "Every regulation made by the Minister under subsection (1) shall be published in the  Gazette  and shall come into operation on the date of such publication or on such later date as may be specified in the regulation.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "Every regulation made under subsection (1) shall as soon as convenient be placed before Parliament for approval. Any regulation which is not so approved shall be deemed to be rescinded as from the date of such disapproval, but without prejudice to anything previously done thereunder.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "4",
            "text": "Notice of the date on which the regulation is disapproved shall be published in the  Gazette .",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "9",
        "text": "In the event the Company formed under the provisions of this Act merges or amalgamates with any other company under the provisions of Part VIII of the Companies Act, No. 07 of 2007 to carry on business as a licensed commercial bank under the licence issued by the Monetary Board, section 6 of this Act shall  mutatis mutandis  continue to apply.",
        "pre_block_list": [
          "Merger and amalgamation."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "10",
        "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
        "pre_block_list": [
          "Sinhala text to prevail in case of inconsistency.",
          "Interpretation."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "11",
        "text": "For purposes of this Act, unless the context otherwise requires",
        "pre_block_list": [
          "Banking Act means the Banking Act, No. 30 of 1988 as amended from time to time;",
          "Business includes the business carried on by the DFCC Bank as a licensed specialized bank, as at the specified date;",
          "Company means the company referred to in the paragraph ( b ) of subsection (2) of section 3;",
          "Controller of Exchange means the head of the Department of Exchange Control of the Central Bank, established by the Monetary Board under the Exchange Control Act (Chapter 423);",
          "DFCC Bank means the DFCC Bank established by the DFCC Bank Act as amended from time to time (Chapter 165);",
          "Director of Bank Supervision means the head of the Department of the Bank Supervision of the Central Bank of Sri Lanka established by the Monetary Law Act (Chapter 422);",
          "Monetary Board means the Monetary Board of the Central Bank of Sri Lanka established under the Monetary Law Act (Chapter 422);",
          "Provincial Council means a Provincial Council established by Chapter XVII A  of the Constitution;",
          "Securities and Exchange Commission means the Securities and Exchange Commission of Sri Lanka established by the Securities and Exchange Commission of Sri Lanka Act, No. 36 of 1987;",
          "Urban Development Authority means the Urban Development Authority established by the Urban Development Authority Law, No. 41 of 1978.",
          "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , D EPARTMENT   OF G OVERNMENT  I NFORMATION , N O . 163, K IRULAPONA  M AWATHA , P OLHENGODA , C OLOMBO  05 before 15th December each year in respect of the year following ."
        ],
        "child_level_list": []
      }
    ],
    "part_list": []
  }
}