{
  "n_pages": 14,
  "title_page": {
    "title": "Amaradeva Aesthetic And Research Centre Act",
    "num": "27",
    "year": "2018",
    "date_certified": "2018-09-03",
    "date_published": "2018-09-07",
    "price": 16.0,
    "price_postage": 35.0
  },
  "body_pages": {
    "preamble": [
      "Amaradeva Aesthetic And Research Centre Act, No. 27 Of 2018 1",
      "[Certified On 03Rd Of September, 2018]",
      "L.D.O. 46/2017",
      "A N   A Ct   To   Provide   For   The   Establishment   Of   An   Aesthetic   And Research   Centre   Called   The  A Maradeva  A Esthetic   And R Esearch  C Entre   In   Gratitude   Of   The   Legendary   Music   Icon   In S Ri  L Anka ,  Late  P Andith  W Annakuwattawaduge  D On A Maradeva ;  To   Specify   Its   Objects   And   Powers   And   To   Provide For   The   Matters   Connected   Therewith   Or   Incidental   Thereto .",
      "Be It  Therefore Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:"
    ],
    "pre_section_list": [
      {
        "class_name": "ActL1Section",
        "num": "1",
        "text": "This Act may be cited as the Amaradeva Aesthetic and Research Centre Act, No. 27 of  2018.",
        "pre_block_list": [
          "Short title."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "2",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "There shall be established an aesthetic and research centre which shall be called the Amaradeva Aesthetic and Research Centre (hereinafter referred to as the Centre) and also known as Amaradeva Asapuwa equipped with a research laboratory, an archive, a library and a museum.",
            "pre_block_list": [
              "Establishment of Amaradeva Aesthetic and Research Centre."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "The Centre shall, by the name assigned to it by subsection (1), be a body corporate with perpetual succession, and a common seal and may sue and be sued in such name.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "3",
        "text": "The general objects for which the body corporate is established are",
        "pre_block_list": [
          "General objects of the Centre."
        ],
        "child_level_list": [
          {
            "class_name": "ActL3Paragraph",
            "num": "a",
            "text": "to secure and archive the instruments of the Centre;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "b",
            "text": "to facilitate research activities of graduate and postgraduate courses on aesthetic studies; and",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "c",
            "text": "to conduct workshops, lectures and appreciation programmes or any other function to promote the style of music of late Pandith Wannakuwattawaduge Don  Amaradeva  (hereinafter  referred  to  as W. D. Amaradeva).",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "4",
        "text": "The objects of the Centre shall be carried out in such manner so as not to create any conflict between the work of the Centre and any work being carried out simultaneously by any Ministry or Department of the Government or of any Provincial Council or Amaradeva Foundation.",
        "pre_block_list": [
          "Centre to ensure no conflict with work of Ministry or Department etc."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "5",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "The administration and management of the affairs of the Centre shall be vested in a Board of Management (hereinafter referred to as the Board).",
            "pre_block_list": [
              "Composition of the Board of Management."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "The Board shall consist of the following members:",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "Ex-officio  members:",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "i",
                    "text": "Secretary to the Ministry of Higher Education or a representative of the Ministry nominated by him;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "the Secretary to the Ministry to which the Centre for the time being assigned to or a representative nominated by him;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iii",
                    "text": "the Director General of the Department of National Archives or any person nominated by him;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iv",
                    "text": "Chairman of the National Library and Documentation Services Board or any person nominated by him;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "v",
                    "text": "the Director of the Department of National Museums or any person nominated by him; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "vi",
                    "text": "the Director of the Department of Cultural Affairs or any person nominated by him.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "Nominated or appointed members:",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "i",
                    "text": "a member appointed by the President;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "a member appointed by the Prime Minister;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iii",
                    "text": "the family members of late W. D. Amaradeva namely Wimala Amaradeva, Ranjana  Amaradeva,  Priyanvada Amaradeva and Subhanie Amaradeva;",
                    "pre_block_list": [
                      "Amaradeva Aesthetic and Research Centre Act, No. 27 of 2018 3"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iv",
                    "text": "a member nominated by the Amaradeva Foundation incorporated under the Companies Act, No. 07 of 2007; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "v",
                    "text": "four members, who have experience and shown capacity in the fields of aesthetics and literature, appointed by the Minister with the concurrence of the Amaradeva Foundation.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "The President shall appoint one of the members of the Board to be the Chairman of the Board.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "4",
            "text": "A vacancy occurring as a result of a member appointed under subparagraphs (i) or (ii) of paragraph ( b ) of subsection (2) vacating office by death, resignation or removal shall be filled by the President or the Prime Minister as the case may be. Any person so appointed to fill a vacancy shall hold office for the unexpired period of the term of the predecessor.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "5",
            "text": "A vacancy occurring as a result of a member appointed under subparagraph (iii) of paragraph ( b ) of subsection (2) vacating office by death, resignation or removal, the successive member shall be appointed with the concurrence of the majority of the remaining family members and such appointee shall not necessarily be a family member of late Pandith W. D. Amaradeva:",
            "pre_block_list": [
              "Provided that, where there are no family members remaining on the Board, the successive member shall be appointed with the concurrence of the majority of the members of the Board."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "6",
            "text": "A vacancy occurring as a result of a member appointed under subparagraphs (iv) and (v) of paragraph ( b ) of subsection (2) vacating office by death, resignation, cessation of office as a member or removal shall be filled by the Board by nominating a member from the Amaradeva Foundation or by appointing a member as the case may be for the unexpired period of the term of office.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "7",
            "text": "The members of the Board may be paid such remuneration out of the Fund of the Centre as may be determined by the Minister.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "6",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "All members specified in paragraph ( b ) of subsection (2) of section 5 shall hold office for a period of three years from the date of nomination or appointment:",
            "pre_block_list": [
              "Terms of office of members of the Board.",
              "Provided however, if any nominated or appointed member vacates his office prior to the expiry of his term, his successor shall, unless he vacates his office earlier, hold office for the unexpired period of the term of office of his predecessor."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "Where the Chairman or any other member of the Board becomes by reason of illness, infirmity or absence from Sri Lanka, unable to perform the duties of his office for a period of not less than one month, another person may having regard to the provisions of section 5, be appointed to act in his place.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "7",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "The Director General of the Centre shall be the Chief Executive Officer of the Centre and shall be appointed by the Board.",
            "pre_block_list": [
              "Staff of the Centre."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "The Director General shall be responsible for general management and administration of officers and employees of the Centre.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "The required number of officers and employees for the management and administration of the Centre shall be determined by the Board and they shall be paid such remuneration determined by the Board in consultation with the Minister to whom the subject of Finance is assigned.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "8",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "At the request of the Board any officer in the public service may with the consent of that officer and the Secretary to the Ministry of the Minister in charge of the subject of Public Administration, be temporarily appointed to the staff of the Centre for such period as may be determined by the Board, or with like consent be permanently appointed to such staff.",
            "pre_block_list": [
              "Appointment of public officers to the staff of the Centre.",
              "Amaradeva Aesthetic and Research Centre Act, No. 27 of 2018 5"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "Where any officer in the public service is temporarily appointed to the staff of the Centre, the provisions of subsection (2) of section 14 of the National Transport Commission Act, No. 37 of 1991, shall,  mutatis mutandis, apply to and in respect of such officer.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "Where any officer in the public service is permanently appointed to the staff of the Centre, the provisions of subsection (3) of section 14 of the National Transport Commission Act, No. 37 of 1991, shall,  mutatis mutandis, apply to and in respect of such officer.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "4",
            "text": "Where the Board employs any person who has agreed to serve the Government for a specified period, any period of service to the Centre by that person shall be regarded as service to the Government for the purpose of discharging the obligations of such agreement.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "5",
            "text": "At the request of the Board, any member of the Local Government Service or any officer or servant of a local authority may, with the consent of such member, officer or servant and the Local Government Service Commission or the local authority, as the case may be, be temporarily appointed to the staff of the Centre for such period as may be determined by the Board or with like consent be permanently appointed to such staff on such terms and conditions, including those relating to pension or provident fund rights, as may be agreed upon by the Centre and the Local Government Service Commission or the Local Authority.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "6",
            "text": "At the request of the Board any officer or servant of a public corporation may, with the consent of such officer or servant and the governing body of such public corporation, be temporarily appointed to the staff of the Centre for such",
            "pre_block_list": [
              "period as may be determined by the Board or with like consent be permanently appointed to such staff on such terms and condidtions, including those relating to pension or provident fund rights, as may be agreed upon by the Board and the governing body of such public corporation."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "7",
            "text": "Where any person is temporarily appointed to the staff of the Centre under subsection (5) or (6) of this section, such person shall be subject to the same disciplinary control as any other member of such staff.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "9",
        "text": "Subject to the provisions of this Act and any other written law, the Centre shall have the power",
        "pre_block_list": [
          "Powers of the Centre."
        ],
        "child_level_list": [
          {
            "class_name": "ActL3Paragraph",
            "num": "a",
            "text": "to accept and receive books, documents, files, photographs, films, disks, audio and video tapes, significant personal belongings and souvenirs of the childhood and youth of late Pandith W. D. Amaradeva, his creations and collections with personal interest, official portraits, grants, awards and gifts received by him to be deposited, and to take all measures to secure, archive, administer and exhibit those instruments;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "b",
            "text": "to purchase, lease and rent, lands or buildings which may be required for the purposes of the Centre and to transfer, sell or exchange of the same as may be deemed expedient with a view to promoting the objects of the Centre;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "c",
            "text": "to construct and renovate any building required for the objects specified herein;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "d",
            "text": "to borrow or raise funds with or without securities and to receive grants, gifts or donations in cash or kind:",
            "pre_block_list": [
              "Amaradeva Aesthetic and Research Centre Act, No. 27 of 2018 7",
              "Provided that, the Board shall obtain the prior written approval of the Department of External Resources of the Ministry of the Minister assigned the subject of Finance, in respect of all foreign grants, gifts or donations made to the Centre;"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "e",
            "text": "to make, draw, accept, discount, endorse, negotiate, buy, sell  and issue bills of exchange, cheques, promissory notes and other negotiable instruments, and to open, operate, maintain and close accounts in any bank;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "f",
            "text": "to invest any funds that are not immediately required for the purposes of the Centre, in such manner as may be determined by the Centre;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "g",
            "text": "to undertake, accept, execute, perform and administer any lawful trust or any real or personal property of the Centre with a view to promoting the objects of the Centre;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "h",
            "text": "to appoint, employ, dismiss or terminate the services of officers and servants of the Centre and exercise disciplinary control over them and to pay them such salaries, allowances and gratuities in terms of the written laws;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "i",
            "text": "to organize lectures, seminars and conferences with a view to promoting the objectives of the Centre;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "j",
            "text": "to liaise and co-ordinate with other local and foreign institutions having similar objects to that of the Centre; and",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "k",
            "text": "to do all other things as are necessary or expedient for the proper and effective carrying out of the objects of the Centre.",
            "pre_block_list": [
              "Amaradeva Aesthetic and Research Centre Act, No. 27 of 2018 8"
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "10",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "It shall be lawful for the Board, from time to time, at any general meeting and by a majority of not less than two-thirds of the members present and voting, to make rules,  not inconsistent with the provisions of this Act or any other written law, for all or any of the following matters:",
            "pre_block_list": [
              "Rules of the Centre."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "admission, expulsion or resignation of members and any other matter relating to membership;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "the qualifications or disqualifications to be a member of the Board;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "the procedure to be followed for the summoning and holding of meetings of the Centre and of the Board, the quorum of such meeting and the exercise and performance of the powers and duties of the Board;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "the appointment, powers, duties and functions of the various officers, agents and employees of the Centre; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "the administration and management of the property of the Centre.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "Any rule made by the Board may be amended, altered, added to or rescinded at a like meeting and in like manner, as a rule made under subsection (1).",
            "pre_block_list": [
              "(4) The members of the Board shall at all times be subject to the rules of the Centre."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "11",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "The Centre shall have its own Fund called and known as Amaradeva Asapuwa Development Fund (hereinafter referred to as the Fund) and all moneys heretofore or hereafter to be received by way of gifts,",
            "pre_block_list": [
              "Fund of  the Centre.",
              "Amaradeva Aesthetic and Research Centre Act, No. 27 of 2018 9",
              "bequests, donations, subscriptions, contributions, fees or grants for and on account of the Centre shall be deposited to the credit of the Fund in one or more banks as the Board shall determine."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "All such sums of money as are required to defray the expenses incurred by the Centre in the exercise, performance and discharge of the powers, duties and functions of the Centre shall be paid out of the Fund.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "12",
        "text": "Subject to the provisions of this Act, the Centre shall be able and capable in law to acquire and hold any property, both movable and immovable, which may become vested in it by virtue of any purchase, grant, lease, gift, testamentary disposition or otherwise and all such property shall be held by the Centre for the purposes of this Act and subject to the rules made under section 10, with power to sell, mortgage, lease, exchange, or otherwise dispose of the same.",
        "pre_block_list": [
          "Centre may hold property movable and immovable."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "13",
        "text": "The moneys and property of the Centre however derived shall be applied solely towards the promotion of its objects as setforth herein and no portion thereof shall be paid or transferred directly or indirectly by way of dividend, bouns, profit or otherwise howsoever to the members of the Board.",
        "pre_block_list": [
          "Application of money and property."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "14",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "If upon the dissolution of the Centre there remains, after the satisfaction of all its debts and liabilities any property whatsoever, such property shall not be distributed among the members of the Board but shall be given or transferred to some other institution or institutions having objects similar to those of the Centre which is or are by its or their rules, prohibited from distributing any income or property among their members.",
            "pre_block_list": [
              "Property remaining on dissolution."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "For the purposes of subsection (1), the appropriate institution or institutions shall be determined by the members of the Board immediately before the dissolution at a general meeting by the majority of votes of the members present.",
            "pre_block_list": [
              "Amaradeva Aesthetic and Research Centre Act, No. 27 of 2018 10",
              "Audit of  Accounts."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "15",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "The Centre shall cause proper books of accounts to be kept of its income and expenditure, assets and liabilities and all other transactions of the Centre.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "The financial year of the Centre shall be the calendar year.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "The accounts of the Centre shall be audited annually by the Auditor-General or a qualified auditor appointed by the Auditor-General in terms of the provisions of Article 154 of the Constitution.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "4",
            "text": "For the purposes of this section qualified auditor means:-",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "an individual who, being a member of the Institute of Chartered Accountants of Sri Lanka or of any other Institute established by law, possesses a certificate issued by the Council of such Institute to practice as an accountant; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "a firm of accountants, each of the resident partners of which, being a member of the Institute of Chartered Accountants of Sri Lanka or of any other Institute established by Law, possesses a certificate issued by the Council of such Institute to practice as an accountant.",
                "pre_block_list": [
                  "Annual report."
                ],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "16",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "The Board shall prepare a report of the activities of the Centre for each financial year and submit such report together with the audited  statement of accounts to the Secretary to the Ministry of the Minister to whom the Centre for the time being is assigned before the expiration of six months of the year succeeding the year to which such report relates.",
            "pre_block_list": [
              "Amaradeva Aesthetic and Research Centre Act, No. 27 of 2018 11"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "A separate account relating to the foreign and local funds received by the Centre during the financial year shall be attached to the report referred to in subsection (1).",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "17",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "The seal of the Centre shall not be affixed to any instrument whatsoever except in the presence of such number of persons as may be provided for in the rules made under section 10 who shall sign their names to the instrument in token of their presence and such signing shall be independent of the signing of any person as a witness.",
            "pre_block_list": [
              "Seal of the Centre."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "The seal of the Centre shall be in the custody of the persons as may be determined by the rules made under section 10.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "18",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "The Minister may make regulations in respect of matters required by this Act to be prescribed or in respect of which regulations are authorized to be made.",
            "pre_block_list": [
              "Regulations."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "Every regulation made by the Minister shall be published in the  Gazette  and shall come into operation on the date of such publication or on such later date as may be specified in the regulation.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "Every regulation made under subsection (1) shall be placed before the Parliament within three months from the date of publication of such regulation  in the  Gazette .",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "4",
            "text": "A notification specifying the date on which the Parliament has approved the regulation shall be published in the  Gazette . Any regulation which is not so approved shall be deemed to be rescinded from the date of disapproval but without prejudice to anything previously done thereunder.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "5",
            "text": "Notification of the date on which any regulation is deemed to be rescinded shall be published in the  Gazette .",
            "pre_block_list": [
              "Amaradeva Aesthetic and Research Centre Act, No. 27 of 2018 12"
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "19",
        "text": "Nothing  in this Act contained  shall prejudice or affect the rights of the Republic of any body politic or corporate.",
        "pre_block_list": [
          "Savings of the rights of the Republic."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "20",
        "text": "In this Act, unless the context otherwise requires:-",
        "pre_block_list": [
          "Interpretation.",
          "Aesthetics means fine arts including music, dancing, art, sculpture and the literary arts including poems, short stories, novels and any activity in the field of cinema; and",
          "Minister means the Minister of the Ministry to whom the Centre is assigned to."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "21",
        "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
        "pre_block_list": [
          "Sinhala text to prevail in case of inconsistency.",
          "Amaradeva Aesthetic and Research Centre Act, No. 27 of 2018 13",
          "English Acts of the Parliament can be purchased at the P RAKASHANA  P IYASA , D EPARTMENT   OF G OVERNMENT  P RINTING , N O . 118, D R . D ANISTER  D E  S ILVA  M AWATHA , C OLOMBO  8."
        ],
        "child_level_list": []
      }
    ],
    "part_list": []
  }
}