{
  "n_pages": 4,
  "title_page": {
    "title": "Debits Tax (Repeal)  Act",
    "num": "14",
    "year": "2011",
    "date_certified": "2011-03-31",
    "date_published": "2011-04-01",
    "price": 2.0,
    "price_postage": 5.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 31St March, 2011]",
      "L.D.O. 18/2011.",
      "A N  A Ct   To   Provide   For    The  R Epeal   Of   The  D Ebits  T Ax A Ct , N O . 16  Of  2002",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Debits Tax (Repeal) Act, No. 14 of 2011.",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Debits Tax Act, No. 16 of 2002 is hereby deemed to be repealed with effect from March 31, 2011.",
                "pre_block_list": [
                  "Repeal and savings."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The provisions of this Act shall, notwithstanding such repeal, in respect of the matters set out in subsection (3), be in force for a period of three years from the date of the coming into operation of this Act.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Notwithstanding the repeal of the Debits Tax Act, No. 16 of 2002 with effect from March 31, 2011:",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the debits tax imposed under section 2 of the repealed Act, with effect from April 1, 2011, to the day immediately preceding the day on which the operation of the period of three years as specified in subsection (2) expires, be collected by every licensed commercial bank or specialised bank or every financial institution in terms of section 5 of the repealed Act and all sums so recovered by every such bank and financial institution as debits tax shall be remitted to the Commissioner-General in terms of section 6 of the repealed Act ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "any action, proceeding or matter filed under the provisions of the Debits Tax Act, No. 16 of 2002 prior to its repeal, shall notwithstanding such repeal, with effect from April 1, 2011, be continued until they are concluded :",
                    "pre_block_list": [
                      "2PL 005611 -4,090 (03/2011)",
                      "Debits Tax (Repeal) Act, No. 14 of 2011 2",
                      "Provided that, the period of three years specified in subsection (2) of section 2 shall not apply in respect of any action, proceeding or matter filed under the repealed Act, which has not as at the end of such period of three years, been concluded."
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail. In case of inconsistency the Sinhala text to prevail.",
            "pre_block_list": [
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , D EPARTMENT   OF G OVERNMENT  I NFORMATION , N O . 163, K IRULAPONA  M AWATHA , P OLHENGODA , C OLOMBO  05 before 15th December each year in respect of the year following ."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}