{
  "n_pages": 25,
  "title_page": {
    "title": "Value Added Tax (Amendment) Act",
    "num": "20",
    "year": "2016",
    "date_certified": "2016-11-01",
    "date_published": "2016-11-04",
    "price": 20.0,
    "price_postage": 20.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 01St November, 2016]",
      "L.D.O. 27/2016.",
      "A N  A Ct   To   Amend   The  V Alue  A Dded  T Ax  A Ct , N O . 14  Of  2002",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:"
    ],
    "pre_section_list": [
      {
        "class_name": "ActL1Section",
        "num": "1",
        "text": "This Act may be cited as the Value Added Tax (Amendment) Act, No. 20 of 2016 and shall come into operation on November 1, 2016 unless the dates on which certain provisions thereof shall come into operation are specified in such sections.",
        "pre_block_list": [
          "Short title and the date of operation."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "2",
        "text": "Section 2 of the Value Added Tax Act, No.14 of 2002 (hereinafter referred to as the principal enactment) is hereby amended as follows:",
        "pre_block_list": [
          "Amendment of section 2 of Act, No.14 of 2002."
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "in item (iii) of sub-paragraph (v) of subsection (1) of that section by the substitution for the words and figures at the rate of twelve  per centum  (of which the tax fraction is 3/28); and  of the words and figures at the rate of twelve  per centum  (of which the tax fraction is 3/28);;",
            "pre_block_list": [
              ". (2) in item (iv) of sub-paragraph (v) of subsection (1) of that section by the substitution for the words and figures for any taxable period commencing on or after January 1, 2015 of the words and figures for any taxable period commencing on or after January 1, 2015 and ending on or before March 31, 2016 and for the period commencing on April 1, 2016 and ending on May 1, 2016 and for the period commencing on July 12, 2016 and ending prior to November 1, 2016; and; and",
              "2PL 0102272,961  (10/2016)",
              "(3) by the insertion immediately after item (iv) of sub- paragraph (v) of subsection (1) of that section of the following:"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "v",
                "text": "for the period commencing on May 2, 2016 and ending on June 30, 2016, for the period commencing on July 1, 2016 and ending on July 11, 2016, and for any period commencing on November 1, 2016 and any taxable period thereafter at the rate of fifteen  per centum  (of which the tax fraction is 3/23)",
                "pre_block_list": [
                  ""
                ],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "3",
        "text": "Section 3 of the principal enactment is hereby amended as follows:",
        "pre_block_list": [
          "Amendment of section 3 of the principal enactment."
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "in paragraph ( f ) of subsection (1)  as follows:",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "in subparagraph (ii) of that paragraph by the substitution for the words and figures before December 31, 2014; and of the words and figures before December 31, 2014;;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "in subparagraph (iii) of that paragraph by the substitution for the words and figures January 1, 2015, of the words and figures January 1, 2015 but ending on or before March 31, 2016, for the period commencing on April 1, 2016 but ending before May 2, 2016; and for the period commencing from July 11, 2016 but ending on or before November 1, 2016; and;",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "immediately after subparagraph (iii), by the insertion of the following:",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL4SubParagraph",
                "num": "iv",
                "text": "twelve million and five hundred thousand, for any such period of three months falling within any period commencing on or after November 1, 2016,.",
                "pre_block_list": [
                  "Amendment of section 5 of the principal enactment."
                ],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "4",
        "text": "Section 5 of the principal enactment is hereby amended by the insertion immediately after subsection (13) of that section, of the following new subsections:-",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "14",
            "text": "where, for the period from January 1, 2016 to January 13, 2016 a registered person has issued an invoice other than a tax invoice, the value of supply shall be,",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "where tax has been collected at a rate other than the rate of eleven  per centum",
                "pre_block_list": [
                  "( a ) in the case of supply of any goods, the value shall be deemed to be equal to the amount derived by multiplying the total invoiced value by 200/297; and",
                  "( b ) in the case of supply of any service, the value shall be deemed to be equal to the amount derived by multiplying the total invoiced value by 100/99."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "where no tax has been collected, the value shall be deemed to be equal to tax inclusive consideration and excluding the tax at the rate of eleven  per centum .",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "15",
            "text": "The value of supply of healthcare services shall be the value of such supply less the cost of diagnostic tests, dialysis and, services provided by the Out Patient Department but excluding medical consultation services:",
            "pre_block_list": [
              "Provided that, the Minister may, from time to time, in consultation with the Minister in charge of the subject of Health, prescribe any value of supply which may be excluded for the purposes of this subsection. Any such regulation made by the Minister shall be approved by the Cabinet of Ministers and published",
              "in the  Gazette.  Such regulations shall be placed before the Parliament for its approval and shall be effective only upon it being approved by the Parliament.",
              "For the purpose of this subsection ",
              "medical consultation includes a procedure whereby a medical practitioner registered under the Medical Ordinance reviews the medical history of a patient, examines a patient and makes recommendations as to care and treatment of such patient",
              ""
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "5",
        "text": "Section 8 of the principal enactment is hereby amended as follows:",
        "pre_block_list": [
          "Amendment of section 8 of the principal enactment."
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "in the first proviso to that section, by the substitution for the words be treated as liable supplies of such registered person and chargeable of the words and figures be treated as liable supplies of such registered person, for any period ending prior to January 1, 2016 and chargeable.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "in the second proviso to that section, by the substitution for the words Provided further, in the case of  of the words and figures Provided further, for any period ending prior to January 1, 2016,  in the case of .",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "6",
        "text": "Section 10 of the principal enactment is hereby amended as follows:",
        "pre_block_list": [
          "Amendment of section10 of the principal enactment."
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "in subsection (1) of that section",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "by the substitution in paragraph (iv), for the words and figures on or after January 1, 2015 carries on of the words and figures on or after January 1, 2015, but prior to April 1, 2016 carries on;",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "by the insertion immediately after paragraph (iv) thereof, of the following new paragraph:",
                    "pre_block_list": [
                      "(v) on or after April 1, 2016, carries on or carries out any taxable activity in Sri Lanka shall be required to be registered under this Act if ",
                      "( a ) at the end of any taxable period of one month or three months, as the case may be, the total value of the taxable supplies of goods or services or goods and services of such person, made in Sri Lanka in that taxable period of one month or three months, as the case may be, has three million rupees; or",
                      "( b ) in the twelve months period then ending, the total value of the taxable supplies of goods or services or goods and services of such person, made in Sri Lanka has exceeded twelve million rupees; or",
                      "( c ) at any time, there are reasonable grounds to believe that the total value of the taxable supplies of goods or services or goods and services of such person in Sri Lanka, in the succeeding one month or three months taxable period, as the case may be, is likely to exceed three million rupees or in the succeeding",
                      "twelve months period is likely to exceed twelve million rupees.;"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iii",
                    "text": "by the addition immediately after the first proviso to subsection (1) of that section of the following proviso:",
                    "pre_block_list": [
                      "Provided further, for the purposes of paragraph (v), the requirement for the registration shall arise with effect from May 2, 2016",
                      ""
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "in subsection (2) of that section",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "by the substitution in sub-paragraph (c), for the words and figures on or after January 1, 2015 of the words and figures on or after January 1, 2015, but prior to April 1, 2016 and for the period from July 11, 2016 but ending on or before November 1, 2016; and;",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "by the insertion immediately after sub- paragraph ( c ) of that section of the following new sub-paragraph:-",
                    "pre_block_list": [
                      "( d ) twelve million and five hundred thousand, for any such period of three months falling within any period commencing on or after November 1, 2016,."
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "7",
        "text": "Section 20 of the principal enactment is hereby amended in subsection (2) of that section by the repeal of items ( b ) and ( c ) and the substitution therefor of the following:",
        "pre_block_list": [
          "Amendment of section 20 of the principal enactment."
        ],
        "child_level_list": [
          {
            "class_name": "ActL3Paragraph",
            "num": "b",
            "text": "the name, address and the registration number of the person to whom the supply was made;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "c",
            "text": "the date on which the tax invoice was issued and its serial number which does not exceed 40 characters without any space;.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "8",
        "text": "Section 21 of the principal enactment is hereby amended as follows:",
        "pre_block_list": [
          "Amendment of section 21 of the principal enactment."
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "in subsection (1) of that section",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "by the substitution for the words every such return shall be in the specified form and shall contain all such particulars as may be required to be set out in such form. of the words every such return shall be in the specified form containing all such particulars and relevant schedules as the Commissioner-General may specify by Order published in the  Gazette. ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "by the insertion immediately after subsection (1) of that section, of the following new subsections:",
                "pre_block_list": [
                  "(1A) Every registered person who furnishes a return of supplies which is not in such form and does not contain all such particulars with relevant schedules as are specified in subsection (1), shall be deemed for the purposes of this Act, not to have furnished a return on supplies.",
                  "(1B) Where any registered person furnishes a return on supplies on or before the date specified in subsection (1) for any taxable period, and deemed under the provisions of subsection (1A) not to have furnished a return, the Assistant Commissioner shall before the expiry of fourteen days from the last day of the month",
                  "after the expiry of such taxable period issue a notice to such registered person and inform him that the return furnished by him is not a proper return as it does not contain all such particulars in such form and relevant schedules as specified in subsection (1).",
                  "(1C) Where any registered person receives a notice under subsection (1B), such person shall within fourteen days of receipt of such notice, furnish a proper return containing all such particulars in such form and relevant schedules required to make such return a proper return, and then the provisions of subsection (1A) shall thereafter not apply in respect of such return.",
                  "(1D) The Assistant Commissioner shall acknowledge receipt of the return only upon receipt of a proper return which shall be considered a valid return for the purposes of subsection (1).;"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "in subsection (2) of that section, by the substitution for the words, in the specified form within the time of the words containing all such particulars in such form and relevant schedules within the time.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "9",
        "text": "section 22 of the principal enactment is hereby amended as follows:",
        "pre_block_list": [
          "Amendment of section 22 of the principal enactment."
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "in paragraph ( a ) of the first proviso to subsection (1) of that section by the substitution for the words shall be rupees twenty five for each such garment so supplied within Sri Lanka of the following:",
            "pre_block_list": [
              "shall be rupees twenty five, in respect of any period commencing prior to November 1, 2016, and rupees seventy five, for any period commencing on or after November 1, 2016 for each such garment so supplied within Sri Lanka;"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "in paragraph ( b ) of the first proviso to subsection (1) of that section by the substitution for the words starting from shall be at the following rate:- up to the words (v) any other fabric at rupees forty per kilogram of the following:",
            "pre_block_list": [
              "shall be for any period commencing prior to November 1, 2016 at the following rates:"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "linen or curtains at rupees forty per kilogram;",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "towels at rupees twenty five per item;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iii",
                    "text": "bags made out of fabric at rupees forty per item;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iv",
                    "text": "excess fabric as cut pieces not more than two metres in length of each piece at rupees twenty five per kilogram;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "v",
                    "text": "any other fabric at rupees forty per kilogram; and",
                    "pre_block_list": [
                      "for any period commencing on or after November 1, 2016 at the rate of seventy five rupees for each unit specified in paragraphs (i) to (v).;"
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "in paragraph ( e ) of the second proviso to subsection (5) of that section, by the substitution for the words being a supplier of goods to exporters of goods of the words being a supplier of goods to any person referred to in items (i) to (vii) of paragraph ( e ) of subsection (2) of section 2;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "4",
            "text": "in item (ii) of the second proviso to subsection (10) of that section,  by the substitution for the words made to exporters by a supplier of the words made to any person referred to in items (i) to (vii) of paragraph ( e ) of subsection (2) of section 2 by a supplier;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "5",
            "text": "by the insertion, immediately after subsection (13) of that section the following new subsection:",
            "pre_block_list": [
              "(14) where any person referred to in paragraph ( f ) of subsection (1) of section 3 supplies goods in wholesale or retail trade is registered under this Act for any period commencing on or after May 2, 2016, and supply of such goods is supported by an invoice other than a tax invoice on his purchases of goods from a person who is not registered for tax under this Act and such goods are not specified in the First Schedule to this Act, a deemed input tax may be allowed to such first mentioned person on account of such purchases at the rate of the tax fraction specified in section 2 of this Act, if an Assistant Commissioner is satisfied that the goods which have been sold are such purchased goods:",
              "Provided that, a record shall be maintained for such purchases as the Commissioner General may specify by Order published in the  Gazette and submitted such record along with the relevant return of such person",
              ""
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "10",
        "text": "Section 25A of the principal enactment is hereby amended as follows:",
        "pre_block_list": [
          "Amendment of section 25A of the principal enactment."
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "in paragraph ( c ) of subsection (2) of that section, by the substitution for the words and figures on or after January 1, 2015. of the words and figures on or after January 1, 2015 but prior to May 2, 2016; or;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "by the insertion immediately after paragraph ( c ) of subsection (2) of that section of the following new paragraph:",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "where the value of such supplies for a period of three months exceeds three million rupees",
                "pre_block_list": [
                  "or for a period of twelve months exceeds twelve million rupees, as the case may be, if such registration has taken place for any period on or after May 2, 2016",
                  ""
                ],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "11",
        "text": "Section 25B of the principal enactment is hereby amended as follows:",
        "pre_block_list": [
          "Amendment of section 25B of the principal enactment."
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "In subsection (1) of that section",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "in paragraph ( a ) of that subsection by the substitution for the words and figures period prior to January 1, 2011; and of the words and figures period prior to January 1, 2011;;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "in paragraph ( b ) of that subsection by the substitution for the words and figures commencing on or after January 1, 2011. of the words and figures commencing on or after January 1, 2011 but ending prior to April 1, 2017;;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "by the insertion immediately after the proviso to paragraph ( b ) of that subsection the following new paragraph:",
                "pre_block_list": [
                  "( c ) twelve months for any taxable period commencing on or after January 1, 2017."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "by the insertion of the following proviso to paragraph ( c ) of that subsection:",
                "pre_block_list": [
                  "Provided that, in the case of a specified institution  or any person whose accounts are made up for a period of twelve months ending on the 31st day March, such period of twelve months may be commenced on the 1st day of April:",
                  "Provided further, in the event of changing the accounting period with the approval of",
                  "the Commissioner-General, the taxable period may be adjusted at the time of such change."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "by the repeal of subsection (2) of that section and the substitution therefor of the following new subsections:-",
            "pre_block_list": [
              "(2) Every registered specified institution or other person shall in respect of each taxable period furnish a return in the specified form "
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "before the end of the following month of the taxable period, if such taxable period is a taxable  period commencing prior to January 1, 2017;  and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "within six months immediately succeeding the end of that taxable period, if such taxable period is a taxable period commencing on or after January 1, 2017.",
                "pre_block_list": [
                  "(2A) ( a ) Every registered person who furnishes a return which is not in such form or fails to furnish an interim estimate on every six months referred to in paragraph ( b ) of the proviso to subsection (1) of section 25C or fails to furnish the contents of such return or the interim estimate as specified by the Commissioner-General, shall be deemed for the purposes of this Act, not to have furnished a return of Value Added Tax on the supply of financial services.",
                  "( b ) Where any registered person furnishes a return of Value Added Tax on the supply of financial services or an interim estimate on or before the date as specified in this section and paragraph ( b ) of the proviso to subsection (1)",
                  "of section 25C for any taxable period or any six months period, as the case may be,  and is deemed under the provisions of paragraph ( a ) of subsection (2A) of section 25B not to have furnished a return of Value Added Tax on  the supply of financial services, Assistant Commissioner shall, before the expiry of thirty days from the due date for the submission of the return or interim estimate, inform such person in writing, that the return or the interim estimate furnished by him does not contain all such particulars in such form and relevant schedules as specified by the Commissioner- General."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "Where any registered person receives any notice under paragraph ( b ), such person may within thirty days of receipt of such notice, furnish to the Commissioner-General all such particulars in such form and relevant schedules required to make the return submitted a proper return, and then the provisions of paragraph ( a ) shall thereafter not apply in respect of such return",
                "pre_block_list": [
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "in paragraph ( a ) of subsection (3) of that section, by the substitution for the words in this section. of the following:-",
            "pre_block_list": [
              "in this section:",
              "Provided that, for any taxable period commencing on or after January 1, 2017, the tax payable by every registered specified institution or other person on monthly basis shall be adjusted with the  total liability for every six months  period on the  interim estimate  referred to in the proviso to paragraph ( b ) of section 25C and  payable with the submission of the interim estimate if the monthly payments made are less than the tax calculated based on the interim estimate",
              ""
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "12",
        "text": "Section 25C of the principal enactment is hereby amended as follows:-",
        "pre_block_list": [
          "Amendment of section 25C of the principal enactment."
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "in subsection (1) of that section,",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "by the substitution for the words interest of economy by Order of the words interest of economy and maintaining the uniformity of allowable depreciation by Order;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "by the repeal of the proviso to subsection (1) and the substitution therefor of the following new proviso:-",
                "pre_block_list": [
                  "Provided however,",
                  "( a ) for any taxable period commencing prior to January 1, 2017, where the amount of profits for each taxable period cannot be accurately ascertained, such amount may be estimated on the basis of available information. The estimated amounts shall be adjusted to reflect the actual amounts with the audited statement of accounts on yearly basis and such adjustment shall be submitted within six months after the closing date of the relevant accounting period; and",
                  "( b ) for any taxable period commencing on or after January 1, 2017, where the amount of profits cannot be accurately ascertained for monthly payments, such amount may be estimated on the basis of available information, and every registered specified institution or any other person shall furnish an interim estimate of the profits in the specified form in respect of each six months",
                  "Value Added Tax  (Amendment) Act, No. 20 of 2016 15",
                  "period of the taxable period before the twentieth day of the succeeding month of the each such six months period."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "in subsection (3) of that section by the repeal of paragraphs ( d ) and ( e ) of that subsection and the substitution therefor of the following:",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "commencing from January 1, 2015, but prior to May 2, 2016 shall be eleven  per centum ; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "commencing from May 2, 2016, shall be fifteen  per centum",
                "pre_block_list": [
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "in subsection (5) of that section",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "by the substitution in paragraph ( gg ) thereof for the words the profits or income arising to of the words the profits or income, not being profit from a business, arising to;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "by the insertion of the following at the end of that subsection:-",
                "pre_block_list": [
                  "For the purposes of this subsection, the expression A person who is not registered with the Central Bank of Sri Lanka, but providing services similar to the services provided by a finance company includes, any person or body of persons, corporate or unincorporated, whose business or part of whose business consists in the acceptance of money by way of deposit, debenture or bond or in any other form, and on the payment of",
                  "interest, profit or discount thereon, whether such acceptance is on its own behalf or on behalf of any other person or provision of loans for the receipt of interest",
                  ""
                ],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "13",
        "text": "Section 25F of the principal enactment is hereby amended by the repeal of sub-paragraph ( c ) of paragraph ( h ) of that section  and the substitution therefor of the following:-",
        "pre_block_list": [
          "Amendment of section 25F of the principal enactment."
        ],
        "child_level_list": [
          {
            "class_name": "ActL3Paragraph",
            "num": "c",
            "text": "of leasing facilities under any;",
            "pre_block_list": [
              "- finance lease agreement; or",
              "- operating lease agreement in respect of any installment  for any period prior to on November 1, 2016,",
              "on any asset other than any land or building, if such agreement is entered into on or after October 25, 2014 and not being an agreement entered into prior to October 25, 2014",
              ""
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "14",
        "text": "Section 66 of the principal enactment is hereby amended by the insertion immediately after paragraph (c) of that section, of the following new paragraph:",
        "pre_block_list": [
          "Amendment of section 66 of the principal enactment."
        ],
        "child_level_list": [
          {
            "class_name": "ActL3Paragraph",
            "num": "d",
            "text": "submit false documents for online registration, uploading incorrect information for registration or submitting false documents under electronic filing system permitted under the Revenue Administration, Management Information System .",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "15",
        "text": "Section 76 of the principal enactment is hereby amended as follows:",
        "pre_block_list": [
          "Amendment of section 76 of the principal enactment."
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "in subsection (1) of that section by the substitution for the words such supply  subsequently becomes a taxable supply of the words and figures such supply  subsequently becomes a taxable supply for any period prior to May 2, 2016;",
            "pre_block_list": [
              "Value Added Tax  (Amendment) Act, No. 20 of 2016 17"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "by the insertion immediately after subsection (2) of that section of the following new subsection:",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "Where any person supplying goods in wholesale or retail trade is registered under this Act for any period commencing on or after May 2, 2016 and ending on December 31, 2016, and if there remains any unsold stocks of goods of such person as at the date of registration which are not specified in the First Schedule to this Act, a deemed input tax may be allowed to such person for such taxable period where the registration became effective on account of such stocks at the rate specified in section 2:",
            "pre_block_list": [
              "Provided that, a similar record shall be maintained as specified in the proviso to subsection (14) of section 22 for such stocks and submitted such record along with the relevant return of such person",
              ""
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "16",
        "text": "The First Schedule to the principal enactment is hereby amended in PART II thereof as follows:",
        "pre_block_list": [
          "Amendment of the First Schedule to the principal enactment."
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "in paragraph ( a ) of that PART",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "by the repeal of item (i) and the substitution therefor of the following:",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "i",
                    "text": "Wheat or wheat flour;.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "substitute in sub item ( c ) of item (xix) of paragraph ( a ) of PART II of the First Schedule for the words ( c ) light weight electrical and electronic items with effect from June 1, 2010; of the following:",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "light weight electrical and electronic items with effect from June 1, 2010 but prior to November 1, 2016;.",
                "pre_block_list": [
                  "( c ) by the repeal of sub-item ( e ) of item (xix) and the substitution therefor of the following:",
                  "( e ) telecommunication equipment with effect from January 1, 2011 but prior to May 2, 2016 and for the period commencing from July 11, 2016 but ending on or before on November 1, 2016;;"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "substitute in item (xviii) of paragraph ( a ) of PART II of the First Schedule for the words (xviii) petrol, coal or of the following:",
                "pre_block_list": [
                  "(xviii) petrol, coal (if supplied prior to November 1, 2016) or;"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "by the repeal of item (xx) and the substitution therefor of the following:",
                "pre_block_list": [
                  "(xx) any machinery or high-tech equipment for the telecom industry, having identified that such machinery or equipment is imported or purchased exclusively for the use in the telecom industry and imported or purchased by any operator of telecommunication services, with effect from January 1, 2011 but prior to May 2, 2016 and for the period commencing from July 11, 2016 but ending on or before November 1, 2016;;"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "substitute in item (xxi) of paragraph ( a ) of PART II of the First Schedule for the words (xxi) spare parts and accessories for exclusive use by Sri Lanka Transport Board and Department of Sri Lanka Railways",
                "pre_block_list": [
                  "Value Added Tax  (Amendment) Act, No. 20 of 2016 19",
                  "(including imports made on or after 18. 08. 2010) of the following:",
                  "(xxi) spare parts and accessories for exclusive use by Sri Lanka Railways, prior to November 1, 2016;;"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "g",
                "text": "substitute in sub-item (i) of item (xxii) of paragrph ( a ) of PART II of the First Schedule for the word perfumes, of the following:",
                "pre_block_list": [
                  "perfumes (if supplied prior to November 1, 2016),."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "h",
                "text": "by the repeal of item (xxv) and the substitution therefor of the following:",
                "pre_block_list": [
                  "(xxv) copper cables for telecom industry,",
                  "- imported prior to May 2, 2016 where such copper cables are not available in Sri Lanka; or",
                  "- purchased from a local manufacturer prior to May 2, 2016 and for the period commencing from July 11, 2016 but ending on or before November 1, 2016",
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "in paragraph ( b ) of that PART",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "by the repeal of sub-item ( c ) of sub-paragraph ( h ) of item ( x ) and the substitution therefor of the following:",
                "pre_block_list": [
                  "( c ) of leasing facilities under any;",
                  "- finance lease agreement; or",
                  "- operating lease agreement in respect of any installment  for any period prior to November 1, 2016,",
                  "on any asset, if such agreement is entered into on or after October 25, 2014 and not being an agreement entered into prior to October 25, 2014;"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "by the repeal of item (xi) and the substitution therefor of the following:",
                "pre_block_list": [
                  "(xi) services being the supply, lease or rent of residential accommodation ",
                  "( a ) if such supply  has taken place prior to November 1, 2016, other than the supply, lease or rent of residential accommodation by a person, being an enterprise which has entered into an agreement with the Board of Investment of Sri Lanka, under section 17 of the Board of Investment of Sri Lanka Law, No. 4 of 1978, on or after April 1, 2001 and the total cost of the projects which such agreement relates is not less than ten million United States Dollars or its equivalent in any other currency and the project relates exclusively to the aforesaid supply, lease or rental;",
                  "( b ) on or after November 1, 2016 by any person, other than any lease or rent of residential accommodation.",
                  "Value Added Tax  (Amendment) Act, No. 20 of 2016 21"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "by the repeal of item (xii) and the substitution therefor of the following:",
                "pre_block_list": [
                  "(xii) all healthcare services provided by medical institutions or professionally qualified persons providing such care, prior to May 2, 2016 and for the period commencing  from July 11, 2016, but ending on or before Novermber 1, 2016;;"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "by the repeal of item (xxvi) and the substitution therefor of the following:",
                "pre_block_list": [
                  "(xxvi) locally produced dairy products other than powdered milk containing added sugar or other sweetening matter, out of locally produced fresh milk in so far as such milk is produced in Sri Lanka and locally produced rice products containing rice produced in Sri Lanka",
                  ""
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "substitute in item (xxx) of paragrph ( b ) of PART II of the First Schedule for the words (xxx) locally manufactured jewellery of the following:",
                "pre_block_list": [
                  "(xxx) locally manufactured jewellery, prior to November 1, 2016",
                  ""
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "by the repeal of item (xxxi) and the substitution therefor of the following:",
                "pre_block_list": [
                  "(xxxi) telecommunication services subject to the telecommunication levy under the Telecommunication Levy Act, No. 21 of 2011, and the services specifically excluded from",
                  "such liability in the definition of the expression telecommunication services in that Act, prior to May 2, 2016 and for the period commencing from July 11, 2016, but ending on or before Novermber 1, 2016;;"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "g",
                "text": "by the repeal of item (xxxv) and the substitution therefor of the following:",
                "pre_block_list": [
                  "(xxxv) services being the issue of licenses to local telecom operators by Telecommunication Regulatory Commission, established by the Sri Lanka Telecommunications Act, No. 25 of 1991, prior to May 2, 2016 and for the period commencing from July 11, 2016, but ending on or before November 1, 2016."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "h",
                "text": "In item ( XL ) of that paragraph, by the substitution for the words provided to exporters or to providers of services which are zero rated of the words provided to any person referred to in item (i) to (vii) of paragraph ( e ) of subsection (2) of section 2 or to providers of services which are zero rated;",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "in paragraph ( f ) of that PART, by the repeal of item (iii) of that paragraph and the substitution therefor of the following:-",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL4SubParagraph",
                "num": "iii",
                "text": "any goods or services provided prior to November 1, 2016, by any society registered under the Co-operative Societies Law, No. 5 of 1972 or under any respective Statute enacted by any Provincial Council providing for such registration, or Lak Sathosa registered under the Companies Act, No. 7 of 2007",
                "pre_block_list": [
                  "",
                  "Value Added Tax  (Amendment) Act, No. 20 of 2016 23"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "4",
            "text": "in paragraph ( l)  of that PART",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "in sub-paragraph (b) of that paragraph, by the substitution for the words and figures after October 25, 2014 of the words and figures after October 25, 2014 but prior to Novermber 1, 2016",
                "pre_block_list": [
                  ""
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "substitute in sub-paragrph ( c ) of paragrph (I) of PART II of the First Schedule for the words ( c ) liquor identified under the Harmonized Commodity Description and Coding System Numbers for Custom Purposes of the following:",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "liquor, prior to November 1, 2016 and identified under the Harmonized Commodity Description and Coding System Numbers for Custom Purposes",
                "pre_block_list": [
                  ""
                ],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "17",
        "text": "Any person who is authorized to collect the Value Added Tax as provided for in this Act during the period commencing from January 1, 2016 and ending on Novermber 1, 2016, shall be deemed to have acted with due authority and such collection shall be deemed to have been, and to be, validly made and such person is hereby indemnified against all actions civil or criminal, in respect of such collection:",
        "pre_block_list": [
          "Validation.",
          "Provided that, the aforesaid provisions shall not affect any decision or Order made by any Court or any proceedings pending in any Court in respect of any tax collected as provided for in this Act during the said period."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "18",
        "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
        "pre_block_list": [
          "Sinhala text to prevail in case of inconsistency.",
          "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , D EPARTMENT   OF G OVERNMENT  I NFORMATION , N O . 163, K IRULAPONA  M AWATHA , P OLHENGODA , C OLOMBO  05 before 15th December each year in respect of the year following ."
        ],
        "child_level_list": []
      }
    ],
    "part_list": []
  }
}