{
  "n_pages": 39,
  "title_page": {
    "title": "Petroleum Resources  Act",
    "num": "21",
    "year": "2021",
    "date_certified": "2021-10-08",
    "date_published": "2021-10-08",
    "price": 45.0,
    "price_postage": 35.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 08Th Of October, 2021]",
      "L.D. O. 02/2008 (Ii)",
      "A N  A Ct   To   Provide   For ,  The   Establishment   Of   The  P Etroleum D Evelopment  A Uthority   Of  S Ri  L Anka ;  The   Formulation   Of   A N Ational  P Olicy   On   Upstream  P Etroleum  I Ndustry   And R Egulation   And  M Anagement   Structure   Capturing   The",
      "Maximum  E Conomic   Value   Of  D Omestic  P Etroleum  R Esources",
      "Through  M Odern  E Xploration , D Evelopment , P Roduction   And M Anagement   Practices   In  S Ri  L Anka ;  To   Repeal   The  P Etroleum R Esources  A Ct , N O . 26  Of  2003;  And   To   Provide   For   Matters",
      "Connected   Therewith   Or   Incidental   Thereto .",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:-"
    ],
    "pre_section_list": [
      {
        "class_name": "ActL1Section",
        "num": "1",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "This Act may be cited as the Petroleum Resources Act, No. 21 of 2021.",
            "pre_block_list": [
              "Short title and date of operation"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "All the provisions of this Act, other than the provisions of Part V, shall come into operation on the date on which the certificate of the speaker is endorsed in respect of this Act in terms of Article 79 of the Constitution.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "The provisions of Part V of this Act shall come into operation on such date as the Minister may, by Order published in the  Gazette , appoint for such purpose.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "2",
        "text": "The objects of the Act shall be -",
        "pre_block_list": [
          "Objects of the Act"
        ],
        "child_level_list": [
          {
            "class_name": "ActL3Paragraph",
            "num": "a",
            "text": "to establish a Policy Advisory Committee to advise on formulation of a National Policy for the upstream petroleum industry covering the exploration, development, production, and management of all petroleum resources in Sri Lanka;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "b",
            "text": "to provide the legal framework to regulate all processes of the exploration, development,",
            "pre_block_list": [
              "production and management of all petroleum resources in Sri Lanka including the provision of operational guidelines;"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "c",
            "text": "to establish an independent, efficient, and transparent regulatory framework in relation to the exploration, development, production and management of petroleum resources in Sri Lanka;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "d",
            "text": "to manage the available petroleum resources in an equitable, safe, and environmentally sustainable manner; and",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "e",
            "text": "to design, implement, monitor and revise fiscal regimes that meet evolving economic needs of the country, while providing fiscal stability to contractors.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      }
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "I",
        "text": "",
        "pre_block_list": [
          "P ETROLEUM  D EVELOPMENT  A UTHORITY   OF  S RI  L ANKA"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be established an Authority to be called and known as the Petroleum Development Authority of Sri Lanka (hereinafter referred to as the \"Authority\").",
                "pre_block_list": [
                  "Establishment of the Petroleum Development Authority of Sri Lanka"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Authority shall, by the name assigned to it by subsection (1), be a body corporate and shall have perpetual succession and a common seal and may sue and be sued in its corporate name.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Authority shall be responsible for",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "making recommendations in respect of the National Policy on Upstream Petroleum Industry to the Policy Advisory Committee;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "implementing the provisions of the Act; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "performing all regulatory functions connected to the upstream petroleum industry in Sri Lanka, in the manner provided for in the Act.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "The powers, duties and functions of the Authority shall be:",
            "pre_block_list": [
              "Powers, duties and functions of the Authority"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "to prepare a map dividing the offshore and onshore areas into graticular sections to demarcate and designate exploration blocks and development blocks and to define and demarcate areas to be designated for joint studies;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "to promote and market acreage available for investment in the blocks as demarcated and designated in terms of section 16;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "to negotiate with contractors the terms and conditions to be incorporated into each Petroleum Resources Agreement, where necessary, in consultation with the Negotiating Committee appointed by the Cabinet of Ministers;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "to issue all licences and certificates as may be required to be issued in terms of this Act and to cancel, suspend, vary or amend the same;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "to determine and charge the licence fee for licences issued in terms of this Act;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "to issue such directions and guidelines as may be required to regulate petroleum operations;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "g",
                "text": "to enter into all agreements relating to the upstream petroleum industry, such as agreements pertaining to data acquisition, licensing and management of data;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "h",
                "text": "to make recommendations to the Minister on matters relating to the assignment or transfer of a contractors participating interest in a Petroleum Resources Agreement, on such terms and conditions in keeping with the objects of this Act;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "to provide all infrastructural and other administrative support as may be required in the process of calling for, evaluation of and awarding of bids;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "j",
                "text": "to employ such staff as may be required for the Authority to achieve the objects of this Act;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "k",
                "text": "to perform competent and responsible regulation of an internationally competitive upstream petroleum industry;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "l",
                "text": "to acquire and hold, take or give on lease or hire, mortgage, pledge, sell or otherwise dispose of, any movable or immovable property;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "m",
                "text": "to accept grants, gifts or donations from persons or bodies of persons within or outside Sri Lanka:",
                "pre_block_list": [
                  "Provided that, notwithstanding anything to the contrary in any other provisions of this Act, the Authority shall obtain prior written approval of the Department of External Resources in respect of all foreign grants, gifts or donations in cash;"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "n",
                "text": "to open and maintain accounts, including in foreign currencies, in any bank or financial institution as approved by the Board, and to administer the Petroleum Resources Development Fund in terms of this Act;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "o",
                "text": "to issue such guidelines and directions as may be required for efficient and effective management of petroleum operations and, for management of petroleum operations in the event of a disaster;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "p",
                "text": "to monitor and control activities which are necessary for or conducive or incidental to, achieve the objects of this Act; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "q",
                "text": "to do all such other acts and things which may be conducive or incidental to, the attainment of the objects of this Act.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "II",
        "text": "",
        "pre_block_list": [
          "A DMINISTRATION   AND  M ANAGEMENT   OF   THE  A UTHORITY"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The administration, management and control of the affairs of the Authority shall be vested in a Board of Directors (in this Act referred to as the \"Board\").",
                "pre_block_list": [
                  "Constitution of the Board of Directors"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Board shall, for the purpose of administering the affairs of the Authority, exercise, perform and discharge the powers, duties and functions conferred on, assigned to or imposed on, the Authority by this Act.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Board shall consist of -",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the  ex-officio  members namely",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "the Director-General of the Authority;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "the Secretary to the Ministry of the Minister assigned the subject of Finance or his representative;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "the Director -General of the Public Utilities Commission of Sri Lanka or his nominee;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iv",
                        "text": "the Secretary to the Ministry of the Minister assigned the subject of Petroleum Resources or his representative not below the rank of Additional Secretary of that Ministry; and",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "v",
                        "text": "the Chairman of the Marine Environment Protection Authority established under section 2 of the Marine Pollution Prevention Act, No. 35 of 2008 or his nominee; and",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "four members appointed by the Minister (hereinafter referred to as the appointed members) from among persons who have achieved eminence in the fields of law, finance, geology, petroleum industry, management or economics, whose qualifications shall be prescribed.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The members appointed under paragraph ( b ) of subsection (3) of this section shall be approved by the Cabinet of Ministers.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Minister shall appoint one of the appointed members to be the Chairperson of the Board.",
                "pre_block_list": [
                  "Chairperson of the Board"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Chairperson may resign from his office by letter addressed to the Minister and such resignation shall be effective from the date on which it is accepted by the Minister.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Minister may, for reasons assigned therefor remove the Chairperson from the office of the Chairperson.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Subject to the provisions of subsections (2) and (3), the term of office of the Chairperson shall be the period of his membership of the Board.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Where the Chairperson is temporarily unable to exercise, perform and discharge the powers, duties and functions of his office due to ill health, other infirmity, absence from Sri Lanka or any other cause, the Minister may appoint any other appointed member to act as the Chairperson in addition to his normal duties as an appointed member.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "A person shall be disqualified from being appointed as a member of the Board, if he -",
            "pre_block_list": [
              "Disqualifications for being appointed as a member of the Board"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "is or becomes a member, of the Parliament, any Provincial Council or any local authority;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "is not, or ceases to be a citizen of Sri Lanka;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "is a person who, having been declared an insolvent or a bankrupt under any law in Sri Lanka or in any other country, is an undischarged insolvent or bankrupt;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "is under any law in force in Sri Lanka or any other country found or declared to be of unsound mind;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "is convicted of an offence involving moral turpitude and punishable with imprisonment for a term not less than six months;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "is serving or has served a sentence of imprisonment imposed by a court of Sri Lanka or any other country;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "g",
                "text": "holds or enjoys any right or benefit under any contract made by, or on behalf of the Authority; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "h",
                "text": "has any financial or other interest as is likely to affect prejudicially the discharge by him of his functions as a member of the Board.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "Every appointed member of the Board shall, unless he vacates office earlier by death, resignation or removal, hold office for a period of three years from the date of his appointment and unless removed from office shall be eligible for re-appointment for not more than one further term, whether consecutive or otherwise.",
            "pre_block_list": [
              "Terms of office of the appointed members of the Board"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Any appointed member of the Board may at any time, resign his office by letter in that behalf addressed to the Minister, and such resignation shall take effect from the date on which the resignation is accepted in writing by the Minister.",
                "pre_block_list": [
                  "Removal, resignation etc. of appointed members"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Minister may, for reasons assigned therefor remove any appointed member from office. An appointed member who has been removed from office shall not be eligible for re-appointment as a member of the Board or to serve the Board in any other capacity.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "In the event of the vacation of office by death, resignation or removal of any appointed member, the Minister shall subject to the provisions of section 5(3)( b ) appoint another person to fill such vacancy and such person shall hold office for the un-expired period of the term of office of the member whom he succeeds.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where any appointed member of the Board is temporarily unable to perform the duties of his office on account of ill health or any other cause or if he is absent from Sri Lanka for a period of not less than three months, the Minister shall, subject to the provisions of section 5(3)( b ) appoint any other person to act in place of such member during his absence.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Where any appointed member of the Board fails to attend three consecutive meetings of the Board without notifying his absence in advance to the  Chairperson, such member shall be deemed to have vacated his office and the Minister shall appoint another person to fill such vacancy subject to the provisions of section 5(3)( b ).",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "10",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The  quorum  for any meeting of the Board shall be five members including the Chairperson and two  ex- officio  members.",
                "pre_block_list": [
                  "Quorum  and the Meetings of the Board"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Director- General shall summon all meetings of the Board.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "A meeting of the Board may be held either -",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "by the number of members who constitute a quorum  being assembled at the place, date and time appointed for the meeting; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "by means of audio- visual communication by which all members participating and constituting a  quorum  can simultaneously see and hear each participating member for the duration of the meeting.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "All questions for decision at any meeting of the Board shall be decided by the vote of the majority of members present and voting at such meeting. In the case of an equality of votes, the Chairperson shall, in addition to his vote, have a casting vote.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "The Chairperson shall preside at every meeting of the Board. In the absence of the Chairperson from any meeting of the Board, any member elected by the members present shall preside at such meeting of the Board.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "The meetings of the Authority shall be conducted in conformity with the rules made and procedure established, by it from time to time.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "11",
            "text": "The Board may act, notwithstanding any vacancy among its members, and any act or proceeding of the Board shall not be, or deemed to be, invalid by reason only of the existence of any vacancy among its members or any defect in the appointment of a member thereof.",
            "pre_block_list": [
              "Acts or proceedings of the Board deemed not to be invalid by reason of any vacancy"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "12",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The seal of the Authority",
                "pre_block_list": [
                  "Seal of the Authority"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "shall be in the custody of such person as the Board may decide from time to time;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "may be altered in such manner as may be determined by the Board;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "shall not be affixed to any instrument or document except with the sanction of the Board and in the presence of two members of the Board who shall sign the instrument or document in token of their presence.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Board shall maintain a register of the instruments and documents to which the seal of the Authority has been affixed.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "III",
        "text": "",
        "pre_block_list": [
          "O WNERSHIP   OF  P ETROLEUM  R ESOURCES   AND  P ETROLEUM   DATA   AND",
          "FORMULATION   OF  N ATIONAL  P OLICY   ON   UPSTREAM  P ETROLEUM  I NDUSTRY"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "13",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The absolute ownership of all petroleum resources occurring naturally",
                "pre_block_list": [
                  "Ownership of petroleum resources and petroleum data"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "within the subsurface of the land area of Sri Lanka; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "on or below the seabed, the sub soil of the submarine areas of Sri Lankas internal waters, historic waters, territorial sea, contiguous zone, exclusive economic zone, and continental shelf established in terms of the United Nations Convention on the Law of the Sea, including the Statement of Understanding contained in Annex II to the Final Act of the said Convention,",
                    "pre_block_list": [
                      "shall vest in the State, notwithstanding any right, ownership or otherwise which any person has to the soil below which such petroleum resources are found."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The ownership of all petroleum data obtained or prepared in pursuant to any petroleum operation in Sri Lanka shall be vested in the State and the management and control of such petroleum data shall be vested with the Authority.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Authority may issue a licence permitting access to the petroleum data for the commercial, educational or scientific use by any person subject to the procedure and the fees as may be prescribed.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "14",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Minister shall appoint a Policy Advisory Committee, in consultation with the Authority comprising experts in the fields of industry, commerce, law and any other subject to advise on formulating National Policy on Upstream Petroleum Industry.",
                "pre_block_list": [
                  "Policy Advisory Committee"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Upon the advice of the Policy Advisory Committee, the Minister may call for further information as necessary and he shall provide instructions to formulate the National Policy on Upstream Petroleum Industry embodying  inter alia  the guiding principles, actions and plans set out therein, and the cumulative process to be followed in relation to regulating the exploration, development, production and management of indigenous petroleum resources.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Minister shall thereafter submit the National Policy on Upstream Petroleum Industry to the Cabinet of Ministers for its approval.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The National Policy on Upstream Petroleum Industry which is not so approved shall be deemed to be rescinded as from the date of such disapproval.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Upon the approval granted by the Cabinet of Ministers under subsection (3), such National Policy shall be the National Policy on Upstream Petroleum Industry.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "The National Policy on Upstream Petroleum Industry may be reviewed by the Policy Advisory Committee whenever it requires to do so.",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "Such National Policy on Upstream Petroleum Industry may, on the advice of the Policy Advisory Committee, be amended or varied by the Minister to incorporate any new",
                    "pre_block_list": [
                      "developments in petroleum resource management practices or processes including the technological and commercial developments, whether local or global pertaining to the upstream petroleum industry."
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "Every such amendment or variation shall be carried out in accordance with the procedure specified in this section.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "The members of the Policy Advisory Committee shall be remunerated on such terms and at such rates as shall be determined by the Minister in consultation with the Minister assigned the subject of Finance.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "8",
                "text": "It shall be the duty of every stakeholder to comply with the National Policy on Upstream Petroleum Industry.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "IV",
        "text": "",
        "pre_block_list": [
          "D EMARCATION   AND  D ESIGNATION   OF   BLOCKS   OR   AREAS ,  ENTERING   INTO P ETROLEUM  R ESOURCES  A GREEMENT   OR  J OINT  S TUDY  A GREEMENT   AND  G RANT   OF   EXPLORATION  L ICENCES   ETC ."
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "15",
            "text": "A person shall not conduct any petroleum operation in Sri Lanka, unless such person has entered into an agreement in the form of a Petroleum Resources Agreement or a Joint Study Agreement in terms of this Act.",
            "pre_block_list": [
              "Petroleum Resources Agreement or Joint Study Agreement"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "16",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Minister may for the purposes of this Act, within both offshore and onshore areas identified as having petroleum potential and which are to be offered to conduct petroleum operations or study or research projects to any contractor, authorize the Authority to demarcate and designate blocks which shall be called exploration blocks or development blocks as the case may be.",
                "pre_block_list": [
                  "Demarcation and designation of exploration blocks or development blocks"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The designation of exploration blocks or development blocks shall be  based on the maps prepared by the Authority under section 4( a ) of this Act and be identified as follows:-",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "if situated offshore, be identified with reference to the area having petroleum potential; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "if situated onshore, be identified with reference to the Administrative District within which it is situated.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Each graticular section called an exploration block shall be given a unique reference number which shall be called as the \"block identifier\". Such exploration blocks may be grouped together into larger blocks, designated uniquely, if so desired.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Upon an exploration block being designated under subsection (1), the Authority shall obtain the approval of the Minister to publish the same in a manner prescribed by regulation.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "17",
            "text": "The Authority shall, from time to time, call for investment proposals locally or internationally, for exploring or developing identified offshore or onshore blocks in conformity with the procedure approved by the Cabinet of Ministers and prescribed by regulation.",
            "pre_block_list": [
              "Calling of proposals for the conduct of petroleum operations in respect of defined exploration blocks"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "18",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "A contractor shall enter into a Petroleum Resources Agreement in conformity with the provisions of this Act and such any as may be other manner prescribed by regulation.",
                "pre_block_list": [
                  "Petroleum Resources Agreement"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where the circumstances of an exploration block requires any concern related to security, environment, social, cultural and archaeological matter, such matters may be included in the Petroleum Resources Agreement. The",
                "pre_block_list": [
                  "negotiated terms and conditions of the Petroleum Resources Agreement may differ subject to such concerns along with economic and technical considerations pertinent to each exploration block."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The contractor shall, upon entering into a Petroleum Resources Agreement, apply for and obtain an Exploration Licence prior to commencing petroleum operations.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The contractor upon the receipt of the Exploration Licence shall have the exclusive rights to carry out petroleum operations in the manner set out in the relevant Petroleum Resources Agreement.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "19",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Authority may define and demarcate areas to be designated for joint studies, and may entertain proposals thereto from any person that the Board deems suitable based on his experience, reputation and financial capability.",
                "pre_block_list": [
                  "Joint Study Agreements"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Authority shall submit the proposed Joint Study Agreement for the consideration of the Minister, and the Minister shall, upon being satisfied with the terms and conditions of the Joint Study Agreement, enter into Joint Study Agreement in conformity with the procedures as may be prescribed and submit the same for the information of the Cabinet of Ministers.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "20",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where a contractor discovers petroleum resources in commercially viable quantities in the course of conducting petroleum operations within an exploration block, such contractor shall -",
                "pre_block_list": [
                  "Development Licence"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "forthwith inform the Authority of such discovery and conduct or cause to be conducted the required tests for the purpose of determining whether such discovery merits appraisal; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "submit a programme of work designed to appraise the petroleum potential of the designated area for approval of the Authority.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "In the event that the appraisal discloses the existence of a commercially viable quantity of petroleum resources, the Authority may proceed to declare the discovery as commercially viable in a manner as may be prescribed by regulation.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The contractor shall, having considered the circumstances and the extent of the commercial discovery declared in terms of subsection (2), submit to the Authority a Development and Investment Plan which shall comprise",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "such matters as may be prescribed; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the proposal of the contractor for the development and production of the commercial discovery within the exploration block,",
                    "pre_block_list": [
                      "within such period as may be determined by the Board."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where the quantity of petroleum resources declared to be a commercial discovery in terms of subsection (2) is located within the exploration block or within more than one exploration blocks, the Authority may",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "on the basis of the Development and Investment Plan submitted by the contractor; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "if located within more than one exploration block and if no agreement has been entered into with other contractors in respect of such other exploration blocks,",
                    "pre_block_list": [
                      "issue a Development Licence substantially in the format as may be prescribed to a contractor in respect of the area comprising the full extent of the discovery, subject to the terms and conditions set out in the Development Licence and to the requirements set out in the Petroleum Resources Agreement."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "When obtaining the Development Licence, a contractor shall pay a surface rental in such amount as shall be determined by the Authority taking into consideration the specific extent assigned for development under the relevant Development Licence.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "21",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The contractor may apply for transfer or assignment of a participating interest in a Petroleum Resources Agreement, Exploration Licence or Development Licence as the case may be, to the Authority and the Authority may submit the same with its recommendation to the Minister, who shall submit such application and the recommendation of the Authority for the approval of the Cabinet of Ministers.",
                "pre_block_list": [
                  "Transfer or assignment of a participating interest"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The contractor shall, subject to such terms and conditions as may be imposed by the Cabinet of Ministers, have the right to transfer or assign any or all of his participating interest.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Upon the receipt of the decision of the Cabinet of Ministers on an application made under subsection (1), it shall be the duty of the Authority, to communicate such decision to the contractor making the application.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The transfer or assignment of participating interest in a Petroleum Resources Agreement, Exploration Licence or Development Licence shall be as prescribed by regulation.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "22",
            "text": "Any person having a participating interest in the designated area to which the Petroleum Resources Agreement applies, shall be responsible",
            "pre_block_list": [
              "Responsibility of persons with a participating interest"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "for ensuring that the provisions of this Act, any regulations made thereunder, the terms and conditions of the relevant Petroleum Resources Agreement, the Exploration Licence, the Development Licence or the Unit Development Licence, and the directions and guidelines are complied with; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "for liabilities to any injury or damage caused to a third person.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "23",
            "text": "A person shall not carry on the business of a provider of goods or services to a contractor with respect to upstream petroleum operations of a relevant Petroleum Resources Agreement or for, or on behalf of a contractor (hereinafter referred to as the \"service provider\") except under authority of a licence issued by the Authority. The procedure and fee for the issue of licence shall be prescribed.",
            "pre_block_list": [
              "Licensing of service providers"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "24",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where a petroleum reservoir which is capable of being commercially developed",
                "pre_block_list": [
                  "Unit Development Plan"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "straddles two or more exploration blocks; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "covers an area which is regulated by two or more Development Licences,",
                    "pre_block_list": [
                      "the Authority shall, for securing more efficient commercial development of the petroleum reservoir situated therein, require the contractors having an interest in the entire reservoir or such portion of such blocks as the case may be, to jointly submit to the Authority a Unit Development Plan which shall comprise such matters as shall be specified by the Authority and such other matters which may in the circumstances be required for the more efficient commercial development thereof."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Authority shall, upon a consideration of the Unit Development Plan submitted to it under subsection (1), recommend such Unit Development Plan with amendments required if necessary, to the Minister for approval.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "After obtaining an approval of the Minister under subsection (2), the Authority shall notify the contractors who submitted the Unit Development Plan, that the Development Licence issued to such contractors shall cease to be effective from the date of such notification and be",
                "pre_block_list": [
                  "converted to an Unit Development Licence authorising the conduct of joint petroleum operations within the area to which the Unit Development Plan relates, under the terms and conditions as may be prescribed."
                ],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "V",
        "text": "",
        "pre_block_list": [
          "N ATIONAL  P ETROLEUM  O PERATOR"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "25",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be incorporated under the Companies Act, No.7 of 2007, a separate corporate entity for the purpose of managing interests of the State in respect of all aspects of petroleum resources development (in this Act referred to as the \"National Petroleum Operator\") and the Minister shall by Order published in the  Gazette ,  designate it as the National Petroleum Operator.",
                "pre_block_list": [
                  "Minister to designate a body of persons to be the National Petroleum Operator"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The National Petroleum Operator shall -",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "hold the participating interest of the State in any joint venture and manage the share of the State of the petroleum produced;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "be jointly and severally liable with all other holders of participating interest to comply with the requirements of the Petroleum Resources Agreement and the terms and conditions set out in any Exploration Licence or Development Licence or Unit Development Licence issued by the Authority to the joint venture; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "be liable severally not jointly, for the debts of other holders of participating interest.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "26",
            "text": "The State may, through the National Petroleum Operator, hold a participating interest as specified in the relevant Petroleum Resources Agreement.",
            "pre_block_list": [
              "Extent of States participating interest"
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "VI",
        "text": "",
        "pre_block_list": [
          "F ISCAL  P ROVISIONS"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "27",
            "text": "Every Petroleum Resources Agreement shall be approved by the Cabinet of Ministers including the fiscal provisions and the production sharing mechanism between the contractor and the State, as shall be negotiated by the Authority.",
            "pre_block_list": [
              "Terms as to production sharing"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "28",
            "text": "A mechanism of fiscal stability for any Petroleum Resources Agreement aimed at mutually preserving the original project economic commitments, shall be provided within such Petroleum Resources Agreement.",
            "pre_block_list": [
              "Fiscal stability"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "29",
            "text": "The provisions of the Inland Revenue Act, No. 24 of 2017 shall be applicable to the revenue of the contractor from any upstream operations unless otherwise specified in the Petroleum Resources Agreement.",
            "pre_block_list": [
              "Determination of profits and income"
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "VII",
        "text": "",
        "pre_block_list": [
          "C HIEF  E XECUTIVE  O FFICER   AND  S TAFF   OF   THE  A UTHORITY"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "30",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be a Director-General of the Authority appointed by the Minister and approved by the Cabinet of Ministers who shall be the Chief Executive Officer of the Authority.",
                "pre_block_list": [
                  "Appointment of a Director- General of the Authority"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Director- General shall, subject to the general directions and control of the Board, be responsible for the conduct of all affairs of the Authority, including the administrative control of the staff of the Authority.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Director-General of the Authority shall possess such qualifications and experience as may be  prescribed by regulation.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The Director-General shall be charged with the responsibility of ensuring that the powers, duties and functions assigned to the Director-General be exercised, performed and discharged in accordance with the provisions of this Act and any regulations made thereunder.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "The Director-General shall be responsible and answerable to the Board in the exercise, performance and discharge of his powers, duties and functions assigned under subsection (4).",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "31",
            "text": "The powers, duties and functions of the Director- General shall be",
            "pre_block_list": [
              "Powers, duties and functions of the Director- General"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "to maintain all related registers, maps and other records in respect of each block or area in respect of which a Petroleum Resources Agreement, an Exploration Licence, a Joint Study Agreement, a Development Licence or Unit Development Licence has been issued under this Act;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "to prepare draft Petroleum Resources Agreements on a case by case basis, in accordance with such directions as may be issued from time to time by the Authority in that regard;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "to collect, compile, analyze and publish or cause to be collected, compiled, analyzed and published, geological, geophysical, engineering and economic data pertaining to the available petroleum resources of Sri Lanka and to ensure the recognition of intellectual property rights;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "to formulate guidelines for technical evaluation of geological samples;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "to monitor petroleum operations conducted by contractors in Sri Lanka and to examine and inspect all books, records, reports, accounts, samples and data maintained (whether in electronic format or otherwise) by such contractors;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "to require a contractor to whom a Exploration Licence, a Development Licence or a Unit Development Licence as the case may be has been issued, by notice in writing, to furnish such return or information as the Authority considers necessary for the due discharge of its functions;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "g",
                "text": "to measure quantities of petroleum resources recovered in Sri Lanka and to take samples thereof;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "h",
                "text": "to approve the annual work programmes and budgets submitted by contractors in terms of a Petroleum Resources Agreement;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "to discharge all regulatory functions relating to any Petroleum Resources Agreement;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "j",
                "text": "to charge fees or any other payments for any services provided by the Authority;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "k",
                "text": "to retain consultants and expert advisors, when necessary, subject to the approval of the Board, and implement such capacity building measures as are necessary; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "l",
                "text": "to conduct activities which are necessary for, or conducive or incidental to, the carrying out of the functions of the Authority.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "32",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Authority shall employ such staff as is required for the efficient exercise, perform and discharge of the powers, duties and functions assigned to the Authority, including technical and skilled personnel, administrative and managerial personnel and such other persons as it may require.",
                "pre_block_list": [
                  "Staff of the Authority and remuneration"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Director-General and staff of the Authority shall be remunerated in such manner and at such rates, and shall be subject to such conditions of service, as may be prescribed by the Minister in consultation with the Minister in charge of the subject of Finance.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "33",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "At the request of the Authority any officer in the public service may, with the consent of that officer and the Public Service Commission, be temporarily appointed to the staff of the Authority for such period as may be determined by the Authority or with like consent be permanently appointed to the staff of the Authority.",
                "pre_block_list": [
                  "Appointment of public officers to the staff of the Authority"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where any officer is temporarily appointed to the staff of the Authority, the provisions of subsection (2) of section 14 of the National Transport Commission Act, No. 37 of 1991, shall,  mutatis mutandis , apply to, and in relation to, him.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where any officer is permanently appointed to the staff of the Authority, the provisions of subsection (3) of section 14 of the National Transport Commission Act, No. 37 of 1991, shall,  mutatis mutandis  apply to, and in relation to him.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where the Authority employs any person, who has entered into a contract with the Government by which he has agreed to serve the Government for a specified period, any period of service with the Authority by that person shall be regarded as service to the Government, for the purpose of discharging the obligations of such contract.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "34",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "At the request of the Board, any officer or other employee of any higher educational institution established under the Universities Act, No. 16 of 1978 may, with the consent of that officer or the employee and the principal executive officer of that higher educational institution, be temporarily appointed to the staff of the Authority. Such appointment shall be for a period as may be determined by the Board or with like consent be permanently appointed to such staff, on such terms and conditions, including those relating to pension or provident fund rights, as may be agreed upon by the Board and such principal executive officer.",
                "pre_block_list": [
                  "Appointment of officers from higher educational institutions to the Authority"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where any person is temporarily appointed to the staff of the Authority under subsection (1) such person shall be subject to the same disciplinary control as any other member of the staff of the Authority.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "VIII",
        "text": "",
        "pre_block_list": [
          "P ETROLEUM  R ESOURCES  D EVELOPMENT  F UND"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "35",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be established a Fund to be called and known as the Petroleum Resources Development Fund (hereinafter referred to as the \"Fund\") administered by the Authority, into which shall be paid",
                "pre_block_list": [
                  "Establishment of the Petroleum Resources Development Fund"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "all such sums of money as may be voted by Parliament;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the fees charged by the Authority under this Act;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "all grants, donations, contributions, or any other income;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "all monies collected in terms of Petroleum Resources Agreements; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "the amount of fines recovered under this Act.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Authority shall utilize the monies in the Fund",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "towards meeting costs relating to the administration and development of the Authority and providing remuneration and incentives to the staff;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "to improve the facilities of the Authority;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "to conduct such researches or operations as are necessary to preserve and protect the environment from any adverse impacts of petroleum operations;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "to acquire and enhance such data as may be required to further understand the existence of potential petroleum resources of Sri Lanka;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "to invest in knowledge transfer training and capacity building of staff and other employees of the Authority carrying out functions connected with the upstream petroleum industry for enhancing the management of the upstream petroleum sector; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "to pay all other such expenses as may be required to be incurred by the Board to achieve the objects of the Act.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Authority shall at the end of every financial year credit to the Consolidated Fund, a sum amounting to ten  per centum  of the monies lying to the credit of the Fund.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "36",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The financial year of the Fund shall be the calendar year.",
                "pre_block_list": [
                  "Financial year and the audit of accounts"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The provisions of Article 154 of the Constitution relating to the auditing of accounts shall apply in relation to the audit of accounts of the Fund.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "IX",
        "text": "",
        "pre_block_list": [
          "G ENERAL  P ROVISIONS"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "37",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where any land or any servitude in a land is required by the contractor for petroleum operations conducted or proposed to be conducted by him under a Petroleum Resources Agreement, a Joint Study Agreement, an Exploration Licence, a Development Licence or a Unit Development Licence as the case may be, he shall notify the Authority of such requirement.",
                "pre_block_list": [
                  "Acquisition of property for contractors"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where such land or servitude therein is required by the Authority for the purpose of the Authority, such land or servitude therein may be acquired under the Land Acquisition Act (Chapter 460) by the Government or Authority and the provisions of that Act shall  mutatis mutandis  apply for the purpose of acquisition of that land or servitude therein. Such land or servitude therein shall, for the purposes of the Land Acquisition Act, be deemed to be required for a public purpose.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Any sum payable for the acquisition of any such land or servitude therein under the Land Acquisition Act, shall be paid by the contractor.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where any State land is required for the purpose of the Authority, such purpose shall be deemed to be a purpose for which a special grant or lease of such property may be made under section 6 of the Crown Lands Ordinance (Chapter 454) and, accordingly, the provisions of that Ordinance shall apply to a special grant or lease of that property to the Authority.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "38",
            "text": "The Minister may from time to time issue such general or special directions in writing to the Authority relating to the exercise, performance and discharge of its powers, duties and functions and it shall be the duty of the Authority to give effect to such directions.",
            "pre_block_list": [
              "Directions of the Minister"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "39",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Board may, subject to such conditions as may be specified in writing, delegate to the Director-General or any officer of the Authority, any of its powers, duties and functions under this Act, other than the powers, duties and functions  specified  in  paragraphs  ( g ), ( h ), ( j ) and ( m ) of section 4 and the Director-General or such officer shall exercise, discharge and perform such powers, duties or functions subject to any special or general directions issued by the Board.",
                "pre_block_list": [
                  "Delegation of powers, duties and functions of the Board"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Notwithstanding any delegation made under subsection (1), the Board may exercise, discharge and perform any such powers, duties or functions so delegated.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "40",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Director-General may delegate any of his powers, duties and functions under this Act, to any officer of the Authority.",
                "pre_block_list": [
                  "Delegation of powers, duties and functions by the Director- General"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "An officer to whom any power, duty or function is delegated under subsection (1), shall exercise, discharge and perform, such powers, duties and functions subject to such directions as may be given by the Director-General.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Director-General shall, notwithstanding any delegation made under subsection (1), have the right to exercise, discharge and perform any powers, duties or functions so delegated.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "41",
            "text": "Any officer authorized in writing by the Authority may, at any time enter into, and inspect any site where petroleum operations are being conducted and carry out investigations or surveys thereon as may be necessary to ascertain whether the terms and conditions of the Petroleum Resources Agreement or Joint Study Agreement or any other Agreement or the terms and conditions imposed by an Exploration Licence, a Development Licence or a Unit Development Licence, any provision of this Act or regulation made thereunder are being complied with.",
            "pre_block_list": [
              "Powers of entry"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "42",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Authority shall within six months of the end of each calendar year transmit an annual report including financial report giving full accounts of the activities of the Authority during that year to the Minister.",
                "pre_block_list": [
                  "Annual report"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Minister shall cause copies of the annual report to be placed in Parliament.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "43",
            "text": "All members of the Authority, officers, employees and agents of the Authority shall be deemed to be public servants within the meaning and for the purpose of the Penal Code (Chapter 19).",
            "pre_block_list": [
              "All members of the Authority etc. deemed to be public Servants"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "44",
            "text": "The Authority shall be deemed to be a Scheduled Institution within the meaning of the Bribery Act (Chapter 26) and the provisions of that Act shall be construed accordingly.",
            "pre_block_list": [
              "Authority deemed to be a Scheduled Institution"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "45",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "All expenses incurred by the Authority in any suit or prosecution brought by or against it before any court, shall be paid out of the Fund of the Authority and only costs paid to or recovered by the Authority in any such suit or prosecution, shall be credited to the Fund of the Authority.",
                "pre_block_list": [
                  "Expenses to be paid out of the Fund of the Authority"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any expense incurred by a member of the Board, Director-General, or any officer or other employee of the Authority, in any suit or prosecution brought by or against such person before any court in respect of any act which is done or purported to be done by such person under this Act, shall if the court holds that the act was done in good faith, be paid out of the Fund of the Authority, unless such expenses are recovered by him in such suit or prosecution.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "46",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Any person who",
                "pre_block_list": [
                  "Offences"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "contravenes the provisions of this Act or regulations made thereunder;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "resists or obstructs a person authorized under section 41 in the exercise by such person of any powers conferred on him by or under this Act;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "fails without reasonable cause, to comply with the requirements of a notice issued under this Act;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "knowingly makes any false statement in any return or information furnished by him under this Act or in any application to enter into a Petroleum Resources Agreement or Joint Study Agreement in respect of an exploration block or a development block;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "willfully omits any material fact from any return or information furnished by him under this Act or in any application to enter into a Petroleum Resources Agreement and Joint Study Agreement, to Exploration Licence, Development Licence, or Unit Development Licence or, in any Development Plan or Unit Development Plan in respect of an exploration block or a development block;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "willfully damages or sabotages any petroleum operations; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "g",
                    "text": "fraudulently or negligently deprives the State of its share of petroleum resources or petroleum resources royalty,",
                    "pre_block_list": [
                      "commits an offence under this Act and shall be liable on conviction after summary trial before a Magistrate, to a fine of not less than four million rupees and not exceeding one hundred million rupees or to imprisonment for a term not exceeding ten years or to both such fine and imprisonment, and if the offence of which he is convicted is continued after the conviction, he commits a further offence and shall be liable in respect hereof to a fine not exceeding fifty thousand rupees for each day on which the offence is so continued."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where a person is convicted of an offence under paragraph ( g ) of subsection (1), the Magistrate may order the offender to pay the State, compensation in such sum as is equivalent to the value of the petroleum resources or the petroleum resources royalty, as the case may be, which the State has been deprived of, as a result of the act constituting the offence.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "47",
            "text": "Where an offence in terms of this Act is committed by a body of persons, then if that body of persons",
            "pre_block_list": [
              "Offences by a body of persons"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "is a body corporate, every director, manager, or secretary of that body corporate;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "is a firm, every partner of the firm; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "is an unincorporated body other than a firm, every member of such body,",
                "pre_block_list": [
                  "shall be deemed to have committed that offence:",
                  "Provided that, any person referred to in paragraphs ( a ), ( b ) and ( c ) above shall not be deemed to have committed such offence if he proves that such offence was committed without his knowledge or that he exercised all due diligence to prevent the commission of such offence."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "48",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Minister may make regulations in respect of any other matter which is required by this Act to be prescribed or in respect of which regulations are authorized or required to be made.",
                "pre_block_list": [
                  "Regulations"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Without prejudice to the generality of the powers conferred by subsection (1), regulations may be made in respect of any or all of the following matters:-",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the procedure to be followed in relation to data licensing;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the form of application for an Exploration Licence, a Development Licence and a Unit Development Licence and the format of such Licences to be issued under the Act;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "the procedure for calling of proposals and selecting of contractors for the conduct of petroleum operations in respect of defined exploration blocks;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "the procedure to be followed when entering into Petroleum Resources Agreements and Joint Study Agreements and to specify the criteria to be included in the Petroleum Resources Agreement and the Joint Study Agreement;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "the summary of estimated fiscal projections at the outset of the project for the information of the Minister and the Authority and for monitoring over the lifetime of the development;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "the specifications for the scope of",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "geophysical operations and surveys;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "drilling operations; and",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "diving activities,",
                        "pre_block_list": [
                          "required to be carried out prior to the issue of the respective licences under the Act;"
                        ],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "g",
                    "text": "the specifications for the matters",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "to be included in the programme of work and the Unit Development Plan;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "relating to the qualifications of non-officials of the Authority, Board members and the Director-General, of the Authority;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "relating to environmental protection and occupational health and safety as are applicable in relation to the conduct of petroleum operations; and",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iv",
                        "text": "to be included in relation to local content.",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every regulation made by the Minister shall be published in the  Gazette  and shall come into operation on the date of such publication or on such later date as may be specified in the regulation.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Every regulation made by the Minister shall, within three months after its publication in the  Gazette , be brought",
                "pre_block_list": [
                  "before Parliament for approval. Any such regulation that is not so approved shall be deemed to be rescinded as from the date of disapproval, but without prejudice to anything duly done thereunder."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Notification of the date on which a regulation is deemed to be rescinded shall be published in the  Gazette .",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "49",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Authority may make rules in respect of",
                "pre_block_list": [
                  "Rules"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the appointment, employment and dismissal of various officers and their powers, duties and functions;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the procedure to be observed at the summoning and holding of meetings, annual general meeting and extraordinary meetings of the Board;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "the administration and management of the affairs of the Authority;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "all matters in respect of which, rules are required or authorized to be made under this Act.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every rule made under subsection (1) shall be approved by the Minister.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every rule so approved shall be published in the Gazette  and shall come into operation upon such publication.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "50",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Petroleum Resources Act, No. 26 of 2003 is hereby repealed.",
                "pre_block_list": [
                  "Repeals, savings and transitional provisions"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Director-General who, and the Authority which, is identified and were functioning as such in terms of subsection (5) of section 5 and section 20 of the Petroleum Resources Act, No. 26 of 2003, prior to the date of",
                "pre_block_list": [
                  "commencement of this Act shall from and after the date of commencement of this Act, be deemed to continue to be the "
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "Director-General appointed in terms of section 30 of this Act; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the Authority established in terms of section 3 of this Act.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Notwithstanding the repeal, of the aforesaid Act",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "all movable and immovable property vested in the Authority in terms of the Petroleum Resources Act, No. 26 of 2003, on the day preceding the date of commencement of this Act shall with effect from the date of commencement of this Act, vest in the Authority established by section 3 of this Act;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "all contracts, Memorandums of Understanding and Agreement entered into by or with the Authority in terms of the Petroleum Resources Act, No. 26 of 2003, subsisting on the date of commencement of this Act, shall, with effect from the date of commencement of this Act, be deemed to be contracts, Memorandums of Understanding and agreements entered into by or with the Authority established by section 3 of this Act;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "all actions and proceedings instituted by or against the Authority in terms of the Petroleum Resources Act, No. 26 of 2003, and pending on the date of commencement of this Act, shall, with effect from the date of commencement of this Act, be deemed to be actions and proceedings as the case may be, instituted by or against the Authority established by section 3 of this Act and may accordingly be continued and completed;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "all persons who were members, officers and employees of the  Authority in terms of the Petroleum Resources Act, No. 26 of 2003, and holding office on the day immediately preceding the date of commencement of this Act, shall, with effect from the date of commencement of this Act, be deemed to continue to be members, officers and employees of the Authority under this Act;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "all judgments and orders made in favour of or against the Authority in terms of the Petroleum Resources Act, No. 26 of 2003, and remaining unsatisfied on the day immediately preceding the date of commencement of this Act, shall, with effect from the date of commencement of this Act, be deemed to be judgments and orders made in favour of or against the Authority established by section 3 of this Act and be enforced accordingly;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "all service providers providing goods and services to any contractor under the terms of a licence issued by the Authority in terms of the Petroleum Resources Act, No. 26 of 2003, and who are on the day immediately preceding the date of commencement of this Act, continuing to provide such goods and services, shall, with effect from the date of commencement of this Act, be deemed to be service providers for the purposes of section 23 of this Act; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "g",
                    "text": "all interests, rights, assets, obligations, debts and liabilities of the Authority in terms of the Petroleum Resources Act, No. 26 of 2003, on the day immediately preceding the date of commencement of this Act, shall be deemed with effect from the date of commencement of this Act, to be interests, rights, assets, obligations, debts and liabilities of the Authority.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "All licences issued, regulations made in terms of the Petroleum Resources Act, No. 26 of 2003, and in force on the day immediately preceding the date of commencement of this Act and all data sales concluded, surveys conducted, petroleum operations and connected matters and all operational arrangements carried out, relating to each licence or agreement as the case may be, shall, with effect from the date of commencement of this Act -",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "be deemed to continue to be valid and effectual, unless expressly repealed or if they become inconsistent with any new licences issued, agreements entered into, or regulations made under this Act. In the case of an inconsistency, the new licences, agreements, or regulations as the case may be, shall prevail;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "be deemed to continue to be valid and effective as if they were concluded, conducted, or carried out under this Act, unless express provision is made to the contrary.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "51",
            "text": "In  this  Act  unless  the  context  otherwise requires -",
            "pre_block_list": [
              "Interpretation",
              "contiguous zone means, the zone declared to be the Contiguous Zone of Sri Lanka by Proclamation made under section 4 of the Maritime Zones Law, No. 22 of 1976;",
              "contractor means, any person or body corporate, local or foreign, authorised to conduct petroleum operations under a Petroleum Resources Agreement which shall include joint study operations;",
              "exclusive economic zone means, the Zone declared to be the Exclusive Economic Zone by Proclamation made under section 5 of the Maritime Zones Law, No. 22 of 1976;",
              "fiscal stability means, maintaining for both contractor and the State the same overall project economics as agreed mutually at the time of entering into a Petroleum Resources Agreement by allowing the adjustment of any of the fiscal parameters in case of change of a government fiscal policy;",
              "historic waters mean, the limits of the historic waters declared by Proclamation made under section 9 of the Maritime Zones Law, No. 22 of 1976;",
              "Joint Study Agreement means, an Agreement entered into between the State and one or more contractors in terms of section 19 of the Act, to study and evaluate the hydrocarbon potential of a defined area;",
              "Minister means, the Minister assigned the subject and functions relating to this Act under Article 44 and 45 of the Constitution;",
              "National Policy for the Upstream Petroleum Industry means, a policy which outlines the general principles, management, development and all other related aspects of the upstream petroleum sector by recognizing the challenges and providing the recommendations in order to monitor and guide the upstream industry by ensuring the right balance between the national interest of the State and the interests of the contractors or operators;",
              "non-material terms and conditions mean, items that will not directly impact the evaluation results of the proposals;",
              "participating interest means, the share of ownership or equity of a participant in any entity or a joint venture;",
              "petroleum data means, geological, geophysical, geochemical, petrophysical, engineering, well logs,",
              "maps, magnetic tapes, cores, cuttings and production data as well as all interpretative and derivative data including reports, analyses, interpretations and evaluation prepared in respect of petroleum operations, economic data and geological samples including all information interpretation reports;",
              "petroleum operations mean, activities in exploration, development and recovery of petroleum resources, including but not limited to geological surveys, interpretation of seismic data, well drilling, production testing, separation, processing, storage, recovery, transportation and marketing;",
              "petroleum reservoir mean, a naturally occurring discrete accumulation of petroleum resources;",
              "petroleum resources mean, crude oil, natural gas and hydrocarbons whether in natural liquid, gaseous, solid or semisolid state, hydrates of oil and gas, sulphur and other similar substances associated with hydrocarbons that are in site or recovered by petroleum operations;",
              "Petroleum Resources Agreement means, a contract for production sharing entered into in terms of section 18 of this Act, between the State and one or more contractors;",
              "petroleum resources royalty means, the royalty that is payable by a contractor on the market value of all petroleum resources that are recovered by him from the area covered by a Development Licence;",
              "territorial sea means, the limits of the sea declared to be the territorial sea of Sri Lanka by proclamation made under section 2 of the Maritime Zones Law, No. 22 of 1976 and includes the internal waters of Sri Lanka;",
              "unit development means, the development of a common reservoir that is situated within the boundaries of two or more exploration blocks or the area covered by two or more development licences;",
              "United Nations Convention on the Law of the Sea means, the United Nations Convention on the Law of the Sea adopted in 1992 in Montego Bay, Jamaica, entered into force on November 16, 1994 and ratified by Sri Lanka on July 19, 1994; and",
              "upstream means, the operational stages in the oil and gas industry that involve exploration and development and deal with a contractor initially taking steps to locate, drill, test and produce oil and gas."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "52",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency",
              "English Acts of the Parliament can be purchased at the P RAKASHANA  P IYASA , D EPARTMENT   OF G OVERNMENT  P RINTING , N O . 118, D R . D ANISTER  D E  S ILVA  M AWATHA , C OLOMBO  8."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}