{
  "n_pages": 4,
  "title_page": {
    "title": "Ports And Airports Development Levy  (Amendment) Act",
    "num": "21",
    "year": "2016",
    "date_certified": "2016-11-07",
    "date_published": "2016-11-11",
    "price": 6.0,
    "price_postage": 10.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 07Th November, 2016]",
      "L.D.O. 15/2016.",
      "A N  A Ct   To   Amend   The  P Orts   And  A Irports  D Evelopment   L Evy A Ct , N O . 18  Of  2011",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Ports and Airports Development  Levy (Amendment) Act, No. 21  of 2016 and shall be deemed to have come into operation on January 1, 2016.",
            "pre_block_list": [
              "Short title and the date of operation."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "Section 3 of the Ports and Airports Development Levy Act, No. 18 of 2011 (hereinafter referred to as the principal enactment) is hereby amended by the repeal of subsection (1) thereof and substitution therefor of the following subsection:",
            "pre_block_list": [
              "Amendment of section 3 of Act, No. 18 of 2011."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The levy to be charged and levied in respect of the cost, insurance and freight value of any article referred to in section 2 shall be calculated",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "for the period commencing on January 1, 2011 and ending on December 31, 2015 at the rate of 5.0  per centum ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "from January 1, 2016 at the rate of 7.5  per centum",
                    "pre_block_list": [
                      ""
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "Where the Director-General of Customs who charges or collects, during the period commencing on January 1, 2016 and ending on the date on which the certificate of the Speaker is endorsed in respect of this Act, the Levy as provided in subsection (1) of section 3 of the principal enactment as amended by section 2 of this Act shall be",
            "pre_block_list": [
              "Validation.",
              "2PL 0101622961 (08/2016)",
              "deemed to have acted and to be acting with due authority and such charge or collection, shall be deemed for all purposes to have been, and to be, validly made. The Director- General of Customs is hereby indemnified against all action, civil or criminal, in respect of such charge or collection."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail. Sinhala text to prevail in case of inconsistency.",
            "pre_block_list": [
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , D EPARTMENT   OF G OVERNMENT  I NFORMATION , N O . 163, K IRULAPONA  M AWATHA , P OLHENGODA , C OLOMBO  05 before 15th December each year in respect of the year following ."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}