{
  "n_pages": 4,
  "title_page": {
    "title": "Municipal  Councils  (Amendment) Act",
    "num": "20",
    "year": "2017",
    "date_certified": "2017-10-12",
    "date_published": "2017-10-13",
    "price": 6.0,
    "price_postage": 10.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 12Th Of October, 2017]",
      "L.D.O. 49/2017",
      "A N  A Ct   To   Amend   The  M Unicipal  C Ouncils  O Rdinance  (C Hapter  252)",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the  Municipal Councils (Amendment) Act, No. 20 of 2017.",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "Section 5 of the  Municipal Councils Ordinance (Chapter 252)   is hereby repealed and the following section substituted therefor:",
            "pre_block_list": [
              "Replacement of section 5 of Chapter 252.",
              "5. (1) Each  Municipal Council  shall consist of such number of Councillors",
              "Composition of  Municipal Councils .",
              "( a ) equivalent to sixty  per centum  of the number of Councillors to be elected and returned, for such Municipal Council, as specified by the Minister by Order published in the  Gazette , based on the number of wards specified in the Orders published under sections 3 C  and 3 D  of the Local Authorities Elections Ordinance (Chapter 262);",
              "( b ) equivalent to forty  per centum  of the number of Councillors to be elected and returned for such Municipal Council, who shall be returned in terms of section 65 B  of the Local Authorities Elections Ordinance (Chapter 262); and",
              "2PL 0103312,962 (09/2017)",
              "Municipal Councils (Amendment) Act, No. 20 of 2017 2",
              "( c ) determined by the Commissioner under paragraph ( a ) of subsection (4) of section 65 B  of the Local Authorities Elections Ordinance (Chapter 262)."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where the number constituting forty  per centum  referred to in paragraph ( b ) of subsection (1), is an integer and fraction, the integer shall be deemed to be the number which shall constitute such forty  per centum , for the  purpose of that subsection",
                "pre_block_list": [
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}