{
  "n_pages": 22,
  "title_page": {
    "title": "Petroleum  Resources Act",
    "num": "26",
    "year": "2003",
    "date_certified": "2003-09-09",
    "date_published": "2003-09-12",
    "price": 16.25,
    "price_postage": 6.75
  },
  "body_pages": {
    "preamble": [
      "Petroleum Resources Act, No. 26 Of 2003 1",
      "[Certified On 9Th September, 2003]",
      "L. D. O. 1/2003.",
      "A N  A Ct   To   Provide   For   The   Exploration   And   Recovery   Of",
      "Petroleum   Resources   In  S Ri  L Anka   And   For   The   Regulation",
      "Of   The   Same  ;  To   Repeal   Certain   Provisions   Of   The  C Eylon P Etroleum  C Orporation , A Ct , N O . 28  Of  1961 ;  And   To   Provide",
      "For   Matters   Connected   Therewith   Or   Incidental   Thereto .",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :-"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Petroleum Resources Act, No. 26 of 2003, and shall come into operation on such date as the Minister may by Order published in the Gazette appoint (hereinafter referred to as the appointed date).",
            "pre_block_list": [
              "Short title and date of operation."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "I",
        "text": "",
        "pre_block_list": [
          "O WNERSHIP   OF  P ETROLEUM  R ESOURCES"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "Absolute ownership of all petroleum resources occurring naturally within",
            "pre_block_list": [
              "Ownership of petroleum resources to vest in State."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "the sub-surface of the land area ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "the internal waters, historic waters, territorial sea, contiguous zone, continental margin and the exclusive economic zone,",
                "pre_block_list": [
                  "of Sri Lanka shall vest in the State, notwithstanding any right of ownership or otherwise which any person may have to the soil under which such petroleum resources are found."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "The State shall take all steps possible to ensure that the exploration and exploitation of petroleum resources are carried out with investor participation adopting internationally recognized engineering practices and proven technology.",
            "pre_block_list": [
              "State to develop petroleum resources in accordance with international practice.",
              "2H 18535 5,650 (2003/06)",
              "Petroleum Resources Act, No. 26 of 2003 2"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Cabinet of Ministers may delegate to the Minister the power to enter into agreements, for and on behalf of the Government of Sri Lanka, for promoting the survey, exploration and exploitation of petroleum resources with any investor.",
                "pre_block_list": [
                  "Agreements relating to exploration of petroleum resources."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every such agreement shall be between the Government of Sri Lanka and a person or body of persons, for the implementation of the Petroleum Resources Agreement entered into with the Government of Sri Lanka, in terms of section 7.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "II",
        "text": "",
        "pre_block_list": [
          "P ETROLEUM  R ESOURCES  D EVELOPMENT  C OMMITTEE"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be established a Committee known as the Petroleum Resources Development Committee (hereinafter referred to as the PRDC), which shall be charged with the responsibility for the effective implementation of the provisions of this Act.",
                "pre_block_list": [
                  "Establishment of the Petroleum Resources Development Committee."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Committee shall be appointed by the Minister and shall consist of :",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the Secretary to the Ministry of the Minister in charge of the subject of Petroleum Resources Development, who shall be the Chairman ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the Secretary to the Ministry of the Minister in charge of the subject of Power ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "the Secretary to the Ministry of the Minister in charge of the subject of Energy ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "the Secretary to the Ministry of the Minister in charge of the subject of Finance ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "the Secretary to the Ministry of the Minister in charge of the subject of Environment ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "the Secretary to the Ministry of the Minister in charge of the subject of Natural Resources ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "g",
                    "text": "the Secretary to the Ministry of the Minister in charge of  subject of Fisheries ;",
                    "pre_block_list": [
                      "Petroleum Resources Act, No. 26 of 2003 3"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "h",
                    "text": "the Secretary to the Ministry of the Minister in charge of the subject of Ocean Resources ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "i",
                    "text": "the Secretary to the Ministry of the Minister in charge of the subject of Defence;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "j",
                    "text": "the Chairman, Board of Investment of Sri Lanka established under the Sri Lanka Board of Investment Law, 4 of 1978 ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "k",
                    "text": "a nominee of the Ministry of the Minister in charge of the subject of Policy Development and Implementation ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "l",
                    "text": "a nominee of the Minister in charge of the subject of Petroleum Resources Development who shall be a person possessing the necessary qualifications and experience in connection with petroleum resources development.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where two or more of the subjects specified in sub- paragraphs ( a ) to ( i ) of subsection (2) are assigned to, or remain in the charge of, one Minister, then there shall be only one representative nominated by the Minister in respect of such subjects.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The persons appointed under paragraphs ( k ) and ( l ) of subsection (2), shall have no commercial interest in the development of petroleum resources in Sri Lanka.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "The PRDC shall be assisted by a Secretariat headed by the Director-General of Petroleum Resources (hereinafter referred to as the Director-General).",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "The powers and functions of the PRDC shall be",
            "pre_block_list": [
              "Powers and functions of the PRDC."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "to formulate policies and prepare plans aimed at promoting the development of Petroleum Resources in Sri Lanka;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "to call for bids and assist in the evaluation of any applications received in response to such bids, received from any investor who intends to enter into Petroleum Resources Agreements in respect of defined Exploration Blocks and to determine whether the applicants fulfill the prescribed financial and technical qualifications ;",
                "pre_block_list": [
                  "Petroleum Resources Act, No. 26 of 2003 4"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "to prepare model Petroleum Resource Agreements ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "to assist in the negotiations being carried out, for and on behalf of the State, for agreement as to the terms to be incorporated in a Petroleum Resources Agreement and to submit the same for execution as provided in section 4;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "to appoint a nominee who will assist in the negotiations being carried out with a view to finalizing a Petroleum Resources Agreement ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "to maintain registers, maps and other records in respect of all exploration blocks and areas covered by Development Licences issued under this Act;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "g",
                "text": "to cause to be collected, compiled, analyzed, and published, geological, geophysical, engineering and economic data pertaining to the available petroleum resources of Sri Lanka ; and to ensure the application of the law relating to intellectual property to the data so collected ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "h",
                "text": "to cause to be collected and stored, geological samples and to permit their removal from, and return to, Sri Lanka for purposes of technical evaluation ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "to issue licenses in terms of this Act and to cancel, suspend,  vary or amend the same ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "j",
                "text": "to suspend or cancel Development Licenses in terms of section 13 hereof ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "k",
                "text": "to approve assignments or transfers of a Contractors Participating Interest in a Development Licence issued in terms of the Act, on such conditions as are reasonable, having regard to the purposes of this Act;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "l",
                "text": "to monitor petroleum operations conducted by contractors in Sri Lanka, to measure quantities and",
                "pre_block_list": [
                  "Petroleum Resources Act, No. 26 of 2003 5",
                  "take samples of petroleum resources recovered ; and to inspect any books records, reports, accounts, samples and data maintained by a contractor;"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "m",
                "text": "to demand, receive and recover all fees, royalties and payments due to the State under this Act or under any regulations made thereunder or which is so due in terms of any Petroleum Resources Agreement and to credit the same to the Consolidated Fund of Sri Lanka ; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "n",
                "text": "to require a contractor to whom a development license has been issued, by notice in writing, to furnish any such return or information as the PRDC may consider necessary for the proper exercise of its powers or the discharge of its functions.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "III",
        "text": "",
        "pre_block_list": [
          "P ETROLEUM  R ESOURCES  A GREEMENT , E XPLORATION   BLOCKS   AND D EVELOPMENT  L ICENCES"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "No person shall conduct petroleum operations in Sri Lanka unless such person has entered into a Petroleum Resources Agreement or any other appropriate Agreement with the State or is otherwise authorized by or under this Act to conduct petroleum operations.",
            "pre_block_list": [
              "Restrictions on conduct of petroleum operations."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The PRDC may, by notice published in local or international media or by other means best calculated to give publicity thereto, invite persons possessing such techinical and financial qualifications as are prescribed, to apply to enter into a Petroleum Resources Agreement with the State in respect of the defined exploration blocks which are specified in the notice.",
                "pre_block_list": [
                  "Applications to enter into agreements in respect of exploration blocks."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every application to enter into a Petroleum Resources Agreement with the State in respect of a defined exploration block shall be made to the PRDC, in the prescribed form and shall contain the prescribed particulars.",
                "pre_block_list": [
                  "Petroleum Resources Act, No. 26 of 2003 6"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Each Petroleum Resources Agreement shall be in relation to only one exploration block.",
                "pre_block_list": [
                  "Petroleum Resources Agreements."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where applications are received by the PRDC under section 8 the PRDC shall forward such applications to the Cabinet of Ministers, who shall after considering all the applications, select from amongst the applicants, the person whom the Cabinet of Ministers considers best qualified by experience and technical capacity to conduct petroleum operations and whose participation would, in its view, afford the greatest economic benefit to Sri Lanka (in this section referred to as the preferred applicant).",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Cabinet of Ministers may authorise a negotiating committee to be called the Cabinet Appointed Negotiating Committee (CANC) or the PRDC to negotiate and place before Cabinet for approval the matters they recommend for inclusion in the relevant Petroleum Resources  Agreement. The Cabinet of Ministers shall thereupon enter into a Petroleum Resources Agreement in respect of the specific exploration block or part thereof as is agreed. Such agreement shall substantially conform to the model agreement prepared for this purpose, and be concluded in accordance with the provisions which the Cabinet of Ministers may from time to time determine  the conditions to which a Petroleum Resources Agreement shall be subject to. Any amendment or variation of the conditions applicable shall also be done only with the approval of the Cabinet of Ministers.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "10",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where a Contractor in the course of conducting exploration operations within an Exploration Block, discovers petroleum resources in commercially viable quantities, he shall submit a project development and investment proposal for approval by the PRDC. If such proposal is acceptable to the PRDC and it approves such proposal, the PRDC shall issue to the contractor a Development Licence for the recovery of petroleum resources of such commercial quantity as is set out in his proposal, within a designated area of the exploration block to which his Petroleum Resources Agreement relates.",
                "pre_block_list": [
                  "Development Licences for recovery of petroleum resources.",
                  "Petroleum Resources Act, No. 26 of 2003 7"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where the commercially viable quantity of petroleum resources referred to in subsection (1) is located within more than one exploration block, the PRDC may, if no Petroleum Resources Agreements have been entered into with other contractors in respect of such other explorations blocks, issue a Development License to the Contractor in respect of the area comprising the full extent of the discovery.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "11",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "In order to ensure the efficient conduct of petroleum operations within the area covered by the Development Licence issued under section 10 by the PRDC, the Cabinet of Ministers may from time to time determine the conditions to which such license shall be subject. Any amendment or variation of the conditions applicable shall also be done only with the approval of the Cabinet of Ministers.",
                "pre_block_list": [
                  "Conditions to be attached to Development Licences."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Cabinet of Ministers may, in consultation with the Ministry of the Minister in charge of the subject of Petroleum Resources Development and the PRDC, determine",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the additional conditions to be attached to a Development License, for the maintenance of navigation, protection of the environment, mitigating adverse social impacts on communities and in the interest of national security ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the amount of reasonable compensation to be paid by the Contractor to any person who may be adversely affected by petroleum operations conducted within the area for which the development license is issued.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The PRDC shall issue a development license in respect of a designated area of an exploration block for a period that will ensure the maximum efficient recovery of petroleum resources from that area, so however, that such period does not exceed the period for which a Petroleum Resources Agreement has been entered into, in respect of such exploration block.",
                "pre_block_list": [
                  "Petroleum Resources Act, No. 26 of 2003 8"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The PRDC may require a contractor by notice in writing, to furnish any such return or information as the PRDC may consider necessary for the proper exercise of its powers or the discharge of its functions, and it shall be the duty of the Contractor to comply with the requirements of such notice. No information or the contents of any return furnished in compliance with the requirements of a notice sent in terms of this subsection shall be published or communicated to any person except with the consent of the Contractor furnishing such return or information or  by the PRDC in the discharge of its functions.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "12",
            "text": "Where the PRDC has reasonable cause to believe that the Contractor is contravening the conditions attached to the Development License, the PRDC may cause a notice to be served on the Contractor",
            "pre_block_list": [
              "The PRDC to notify Contractor of contravention of conditions of Development License."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "specifying the alleged contravention; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "requiring the Contractor to rectify or to take reasonable steps to rectify or correct, the condition resulting from the contravention, or to show reasonable cause for the contravention, or to show that the contravention has not occurred within the period specified in the notice ; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "stating that a failure to comply with the requirements of the notice may result in the suspension or cancellation of the Development License.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "13",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where the PRDC is satisfied that a Contractor to whom a Development License has been issued",
                "pre_block_list": [
                  "Suspension or cancellation of Development License."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "has failed to comply with a notice issued under section 12 or has not taken reasonable steps to rectify or correct the condition resulting from the contravention specified in such notice or has not shown reasonable cause for such contravention;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "has not complied with any direction given by the PRDC under this Act; or",
                    "pre_block_list": [
                      "Petroleum Resources Act, No. 26 of 2003 9"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "has ceased to conduct petroleum operations according",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "to the work programme which is part of the Petroleum Resources Agreement ; or",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "to the project development and investment proposal submitted for the Development License; or",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "has abandoned or constructively abandoned the Development License by failure to diligently conduct petroleum operations in the area covered by the Development License; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "has surrendered the Development License; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "has been convicted of an offence under this Act or of any regulation made under this Act,",
                    "pre_block_list": [
                      "the PRDC may suspend or cancel the development license."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Contractor aggrieved by a decision of the PRDC to suspend or cancel a Development License issued under section 10 shall have recourse to the arbitration provisions if any, which forms part of the relevant Petroleum Resources Agreement, for resolution of the matter.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "14",
            "text": "A  Contractor to whom a Development Licence has been issued, shall have the right to recover, store, transport, and sell the share of the petroleum resources to which the Contractor is entitled under the terms of the relevant Petroleum Resources Agreement, subject to the provisions of this Act and to repatriate the proceeds of the sale of such petroleum resources.",
            "pre_block_list": [
              "Rights of Contractor under Development License."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "15",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "A Contractor may, with the approval of the Cabinet of Ministers and subject to such conditions as may be imposed by them in this regard, have the right to transfer or assign his participating interest in a Development License.",
                "pre_block_list": [
                  "Transfer of participating interest in a Development License.",
                  "Petroleum Resources Act, No. 26 of 2003 10"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Cabinet of Ministers shall grant approval for the transfer or assignment of a participating interest of a contractor, provided that :",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the assignee or transferee is of good standing, has financial capability to meet his obligations and is willing to provide an unconditional undertaking to the PRDC to perform its obligations and to provide the guarantees as provided in the relevant Petroleum Resource Agreement ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the assignee or transferee is not a company incorporated in a country with which the State has restricted trade or business ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "the assignor or transferor and assignee or transferee respectively, are willing to comply with any reasonable conditions as may be imposed by the Cabinet of Ministers, to ensure effective performance of the Agreement ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "the assignment or transfer will not adversely affect the performance of obligations under the Agreement or in any manner whatsoever be construed to be contrary to the interests of the State.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "A contractor aggrieved by the decision of the Cabinet of Minister,",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "withholding approval for a transfer or assignment; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "imposing conditions subject to which the approval for the transfer or assignment is given,",
                    "pre_block_list": [
                      "may have recourse to the procedure specified in the relevant Petroleum Resources Agreement for resolution of the matter."
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "16",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "No person shall carry on business as a petroleum operations service sub-contractor except under the authority of a license issued in that behalf by the PRDC.",
                "pre_block_list": [
                  "Licensing of service sub- contractors.",
                  "Petroleum Resources Act, No. 26 of 2003 11"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every person seeking to carry on business as a petroleum operations service sub-contracto, may apply to the PRDC, in the prescribed form, for a license in that behalf.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The PRDC shall, on receipt of an application in terms of subsection (2) issue a license authorizing the applicant to carry on the business specified in the license, if the PRDC is satisfied that the applicant is technically qualified to carry on such business and is of good financial standing.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "17",
            "text": "Notwithstanding the terms of a Petroleum Resources Agreement, all persons with a participating interest in a Development License shall be responsible",
            "pre_block_list": [
              "Liability of persons with participating interest in development license."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "for ensuring compliance with the terms of the Petroleum Resources Agreement ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "for  ensuring that the conditions of a Development License and regulations made under this Act are complied with; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "to third parties, for injury and damage resulting from petroleum operations conducted in the area described in the Development License :",
                "pre_block_list": [
                  "Provided, that any person with a participating interest ordered to pay damages for any such injury or damage, may pay such damages on a contributory basis with the other persons who have participating interests in the Development License."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "18",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where a portion of a reservoir of petroleum resources  is situated in another exploration block over which another Contractor has an interest and the entire reservoir of petroleum resources can together with such portion ; be move efficiently developed on a commercial basis,  the PRDC may, for securing the more effective exploration or recovery of petroleum resources from such reservoir, by notice in writing to such other Contractor, require him to enter into an Unit Development Agreement with such other parties for the joint development of the reservoir of petroleum resources.",
                "pre_block_list": [
                  "Unit Development.",
                  "Petroleum Resources Act, No. 26 of 2003 12"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "two or more contractors enter into an Unit Development Agreement, with the approval of the PRDC, to conduct joint petroleum operations; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "it is a condition of the Development License issued to each of such Contractors, that they conduct joint petroleum operations in respect of a common petroleum reservoir situated within the boundaries of their several exploration blocks or the areas covered by their several Development Licenses,",
                    "pre_block_list": [
                      "the PRDC may direct such Contractors to participate in  Unit Development of such reservoir."
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "19",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where a Contractor requires any movable or immovable property for petroleum operations conducted, or proposed to be conducted, by him under a Petroleum Resources Agreement or a Development License as the case may be and he notifies the PRDC of such requirement, such movable or immovable property shall be deemed to be property required for the purposes of the business of the PRDC, and may be acquired by the Government and made available to the Contractor, provided the PRDC considers such acquisition  essential, having regard to the circumstances of the case.",
                "pre_block_list": [
                  "Acquisition of property for contractors."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any sum payable by the PRDC for acquisition of any property referred to in subsection (1) shall be paid by the Contractor and such sum shall be calculated in such manner as may be prescribed.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "IV",
        "text": "",
        "pre_block_list": [
          "F UNCTIONS   OF   THE  S ECRETARIAT"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "20",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be a Secretariat headed by the Director-General of Petroleum Resources. The Secretariat The Secretariat.",
                "pre_block_list": [
                  "Petroleum Resources Act, No. 26 of 2003 13",
                  "shall discharge such functions as are to be assigned to it from time to time, by the Cabinet of Ministers. The Secretariat shall act for and on behalf of the State for all purposes related to Petroleum Resources Agreements entered into with the State, and shall have the right to"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "approve annual work programmes and budgets submitted by the Contractors under such Agreements ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "recover and arrange for the sale, storage and transport of the States share of petroleum resources, under such Agreement;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "discharge  such other functions regarding the contractual and operational interests of the Sate in connection with the Petroleum Resources Agreements ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The PRDC may delegate to the Director-General of Petroleum Resources, all or any of the powers and functions assigned to, or conferred on it by paragraphs ( a ), ( c ), ( d ), ( e ), ( f ), ( g ), ( h ) and ( l ) of section 6.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "21",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "At the request of the Secretariat, any officer in the public service may with the consent of that officer and the Secretary to the Ministry of the Minister in charge of the subject of Public Administration, be temporarily appointed to the staff of the Secretariat for such period as may be determined by the Secretariat or with like  consent be permanently appointed to the staff of the Secretariat.",
                "pre_block_list": [
                  "Secondment of officers in the public service &c,."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where any officer is temporarily appointed to the staff of the Secretariat, the provisions of subsection (2) of section 13 of the National Transport Commission Act, No. 37 of 1991, shall,  mutatis mutandis , apply to, and in relation to, him.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where any officer is permanently appointed to the staff of the Secretariat, the provisions of subsection (3) of section 13 of the National Transport Commission Act, No. 37 of 1991, shall,  mutatis mutandis , apply to, and in relation to him.",
                "pre_block_list": [
                  "Petroleum Resources Act, No. 26 of 2003 14"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Any person who is employed by the Corporation on the date of the coming into operation of this Act, may with the consent of that officer and of the Corporation, be either temporarily or permanently appointed to the staff of the Secretariat.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Where the Secretariat employs any person who has entered into a contract with he Government by which he has agreed to serve the Government for a specified period, any period of service with the Secretariat by that person shall be regarded as service to the Government, for the purpose of discharging the obligations of such contract.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "V",
        "text": "",
        "pre_block_list": [
          "F ISCAL  P ROVISIONS"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "22",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Every Petroleum Resources Agreement shall set out the respective shares of the petroleum resources, that are recovered from petroleum operations conducted under such Agreement, to which the Contractor and the State are entitled to.",
                "pre_block_list": [
                  "Terms as to production, sharing &c."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Petroleum Resources Agreement shall provide for the following fiscal matters :",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the contractors recovery of costs for petroleum operations conducted under the Agreement ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "any increase in the States entitlement to a share of petroleum resources recovered. Such increases to be in proportion to the profitability of the petroleum operations to the Contractor;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "the payment of a petroleum resource Royalty, on the totality of the petroleum resources recovered, in accordance with the provisions of this Part of this Act; and",
                    "pre_block_list": [
                      "Petroleum Resources Act, No. 26 of 2003 15"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "bonuses if any, that may be paid by the Contractor to the State.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "23",
            "text": "Every Petroleum Resources Agreements shall include terms that provide for an adjustment in the Contractors entitlement to a share of the petroleum  resource recovered in the event of any law or regulation being enacted or promulgated, as the case may be, imposing taxes, fees or levies on a Contractor's income from any petroleum operation or the share of petroleum resources that the Contractor is entitled to under the Agreement, in addition to the taxes fees or levies that were in force on the date the Petroleum Resources Agreement was entered into.",
            "pre_block_list": [
              "Adjustments of terms in case of increases in taxes etc."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "24",
            "text": "The provisions of the Inland Revenue Act, No. 38 of 2000 shall be applicable to the contractors profits and income from any operations relating to the exploration or exploitation of petroleum resources.",
            "pre_block_list": [
              "Determination of profits and income."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "25",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Contractor shall pay to the State a Petroleum Resources Royalty on the value of all petroleum resources as are recovered under a Development Licence and the State will have the option to obtain the Royalty in cash or kind as prescribed in the relevant Petrolaum Resources Agreement.",
                "pre_block_list": [
                  "Petroleum Resources Royalty."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The methods for measuring the petroleum resources recovered, and the periods for payment of the Royalty, shall be as prescribed in the relevant Petroleum Resources Agreement.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "26",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Contractor's share of petroleum resources recovered shall be exempt from all customs and export duties.",
                "pre_block_list": [
                  "Exemptions from customs duties etc."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "A Contractor shall be exempt from the payment of customs duty payable on any machinery or equipment imported by him for the conduct of petroleum operations under a the terms  of a Petroleum Resources Agreement and no export duty shall, be payable on the re-export of such machinery or equipment.",
                "pre_block_list": [
                  "Petroleum Resources Act, No. 26 of 2003 16"
                ],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "VI",
        "text": "",
        "pre_block_list": [
          "G ENERAL"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "27",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Minister may make regulations for the purposes of carrying out or giving effect to the principles and provisions of this Act, and in respect of matters that are by this Act required to be prescribed.",
                "pre_block_list": [
                  "Regulations."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every regulation made under subsection (1), shall be published in the Gazette and shall come into operation on the date of such publication or on such later date as may be specified in the regulation.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every regulation made under subsection (1) shall, as soon as convenient after its publication in the Gazette, be brought before Parliament for approval. Any such regulation that is not so approved shall be deemed to be rescind as from the date of disapproval, but without prejudice to anything previously done thereunder.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Notification of the date on which a regulation is deemed to be rescind shall be published in the Gazette.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "28",
            "text": "Any person authorised in writing by the PRDC may at any time enter into, and inspect, any site where petroleum operations are being conducted and carry out such investigations or surveys thereon as may be necessary to ascertain whether the terms of a Petroleum Resources Agreement or the conditions imposed in relation to a Development License or any provision of this Act or any regulation made thereunder are being complied with.",
            "pre_block_list": [
              "Powers of entry."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "29",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Any person who",
                "pre_block_list": [
                  "Offences."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "conducts petroleum operations in contravention of the provisions of section 7;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "resists or obstructs a person authorized under section 29 in the exercise by such person or officer of any powers conferred on him by or under this Act;",
                    "pre_block_list": [
                      "Petroleum Resources Act, No. 26 of 2003 17"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "fails without reasonable cause, to comply with the requirements of a notice issued under paragraph ( n ) of section 6;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "knowingly makes any false statement in any return or information furnished by him under section 6 or in any application to enter into a Petroleum Resources Agreement in respect of an exploration block;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "willfully omits any material fact from any return or information furnished by him under section 6 or in any application to enter into a Petroleum Resources Agreement in respect of an exploration block;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "willfully damages or sabotages any petroleum operations;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "g",
                    "text": "fraudulently or negligently deprives the State of its share of petroleum resources or Petroleum Resources Royalty;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "h",
                    "text": "contravenes any regulation made under this Act,",
                    "pre_block_list": [
                      "shall be guilty of an offence under this Act and shall be liable on condition after summary trial before a Magistrate, to a fine of not less than four million rupees and not exceeding one hundred million rupees or to imprisonment for a term not exceeding one year or to both such fine and imprisonment, and if the offence of which he is convicted is continued after the conviction, he shall be guilty of a further offence and shall be liable in respect hereof to a fine not exceeding fifty thousand rupees for each day on which the offence is so continued."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where a person is convicted of an offence under paragraph ( g ) of subsection (1), the Magistrate may order the offender to pay to the State, compensation in such sum as is equivalent to the value of the petroleum resources or the Petroleum Resources Royalty, which the State has been deprived of, as a result of the act constituting the offence.",
                "pre_block_list": [
                  "Petroleum Resources Act, No. 26 of 2003 18"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "30",
            "text": "When an offence under this Act is committed by a body corporate, every person who at the time of the commission of the offence was a director, manager, secretary or other similar officer of that body corporate shall be deemed to be guilty of that offence unless he proves that the offence was committed without his consent or connivance and that he exercised all such diligence to prevent the commission of that offence as he ought to have exercised having regard to the nature of his functions and in all the circumstances.",
            "pre_block_list": [
              "Offences by bodies of persons."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "31",
            "text": "Section 5 D , 5 F , 5 G  and 34 A  of the Ceylon Petroleum Corporation Act, No. 28 of 1961 are hereby repealed.",
            "pre_block_list": [
              "Amendment of Act No. 28 of 1961"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "32",
            "text": "The provisions of this Act shall have effect notwithstanding anything contained in any other written law, and accordingly, in the event of any inconsistency between the provisions of this Act and such other law, the provisions of this Act shall prevail.",
            "pre_block_list": [
              "This Act to prevail over other law."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "33",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act the Sinhlala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "34",
            "text": "In this Act unless the context otherwise requires",
            "pre_block_list": [
              "Interpretation.",
              "contiguous zone means the zone declared to be the contiguous zone of Sri Lanka by Proclamation made under section 4 of the Maritime Zones Law, No. 22 of 1976;",
              "continental margin means the sea bed and subsoil defined in Article 76 of the United Nations Convention on the Law of the Sea, 1982;",
              "Contractor means any person or body corporate, local or foreign, authorized to conduct petroleum operations under a Petroleum Resources Agreement, and shall include  joint venture operations ;",
              "Petroleum Resources Act, No. 26 of 2003 19",
              "Corporation means the Ceylon Petroleum Corporation, established by the Ceylon Petroleum Corporation Act, No. 28 of 1961;",
              "Development License means the authority to recover and save commercial quantities of petroleum resources in a designated area of an exploration block issued in terms of section 10;",
              "Director-General Petroleum Resources (DPR) means the head of the Secretariat to be established to carry out the functions assigned to it by the Cabinet of Ministers as the agent of the Government;",
              "exclusive economic zone means zone declared by Proclamation made under section 5 of the Maritime Zones Law, No of 1976;",
              "exploration block means an exploration block set out in the relevant Petroleum Resources Agreement;",
              "historic waters mean the limits of the historic waters declared by Proclamation made under section 9 of the Maritime Zones Law, No 22 of 1976;",
              "investor may include private sector investors, public sector investors, and any state agency or public corporation ;",
              "Minister means the Minister in charge of the subject of Petroleum Resources Development ;",
              "participating interest means an interest expressed by right to a percentage in the share of petroleum resources recovered and saved under a Development License, and set out in the Petroleum Resources Agreement ;",
              "petroleum operations mean activities in      exploration, development and recovery of petroleum resources including but not limited to geological surveys, interpretation of seismic data, well drilling, production testing, separation, processing, storage, recovery, transportation and marketing ;",
              "Petroleum Resources Act, No. 26 of 2003 20",
              "petroleum reservoir means a naturally occurring discrete accumulation of petroleum resources;",
              "petroleum resources means crude oil, natural gas and hydrocarbons whether in natural liquid, gaseous, solid or semisolid state hydrates of oil and gas, sulfur and other similar substances associated with hydrocarbons that are in situ or recovered by petroleum operations;",
              "Petroleum Resources Agreement means a contract for production sharing entered into in terms of section 9 of this Act, between the State and one or more Contractors ;",
              "Petroleum Resources Development Committee (PRDC) means the Committee to be established to implement the provisions of the Petroleum Resources Act ;",
              "Petroleum Resources Royalty means the royalty that is payable by a Contractor on the market value of all petroleum resources that are recovered by him from the area covered by a Development License;",
              "service sub-contractor means a person who provides goods or services to a Contractor for petroleum operations for, or on behalf of, a Contractor;",
              "territorial sea means the limits of the sea declared to be the territorial sea of Sri Lanka by proclamation made under section 2 of Maritime Zones Law, No. 22 of 1976 and includes the internal waters of Sri Lanka;",
              "unit development means the development of a common reservoir that is situated within the boundaries of two or more exploration blocks or the area covered by two or more development licenses;",
              "Unit Development Agreement means an arrangement between two or more Contractors for jointly conducting petroleum operations in respect of a common reservoir of petroleum resources.",
              "Petroleum Resources Act, No. 26 of 2003 21",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , N O . 32, T RANSWORKS   H OUSE ,  L OTUS   R OAD ,  C OLOMBO  01  before  15th  December  each  year  in   respect  of the year following."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}