{
  "n_pages": 4,
  "title_page": {
    "title": "Employees  Provident  Fund (Amendment) Act",
    "num": "23",
    "year": "2021",
    "date_certified": "2021-10-13",
    "date_published": "2021-10-15",
    "price": 10.0,
    "price_postage": 15.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 13Th Of October, 2021]",
      "L.D.O. 35/2019",
      "A N  A Ct   To   Amend   The  E Mployees  P Rovident  F Und A Ct , N O . 15  Of  1958",
      "Be It  Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:"
    ],
    "pre_section_list": [
      {
        "class_name": "ActL1Section",
        "num": "1",
        "text": "This Act may be cited as the Employees Provident Fund (Amendment) Act, No. 23  of  2021 and shall come into operation on such date as the Minister may appoint by Order published in the  Gazette .",
        "pre_block_list": [
          "Short title and date of operation"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "2",
        "text": "Section 47 of the Employees Provident Fund Act, No. 15 of 1958 is hereby amended as follows:",
        "pre_block_list": [
          "Amendment of section 47 of Act, No. 15 of 1958"
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "in the definition of employee, by the substitution for the words at any particular time; of the words at any particular time, and does not include a detached worker for the period of time specified in a social security agreement applicable to such detached worker;;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "immediately after the definition of the expression covered employment, by the insertion of the following new definition:",
            "pre_block_list": [
              "   detached worker means an international worker on a temporary assignment in covered employment in Sri Lanka and contributing to a social security programme in the country in which he is a citizen and who in terms of a social security agreement has been exempted from making any contribution under this Act for the period as set out in such agreement;;"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "immediately after the definition of employer, by the insertion of the following new definition:",
            "pre_block_list": [
              "   international worker means, an employee who is a citizen of a country other than Sri Lanka;;"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "4",
            "text": "immediately after the definition of regulation, by the insertion of the following new definition:",
            "pre_block_list": [
              "   Social Security Agreement means a bilateral agreement to which Sri Lanka is a party and which provides exemptions to citizens of one country working in another  country,  on  temporary assignment as detached workers, from contributing to a social security programme in such other country;."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "3",
        "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
        "pre_block_list": [
          "Sinhala text to prevail in case of inconsistency",
          "English Acts of the Parliament can be purchased at the P RAKASHANA  P IYASA , D EPARTMENT   OF G OVERNMENT  P RINTING , N O . 118, D R . D ANISTER  D E  S ILVA  M AWATHA , C OLOMBO  8."
        ],
        "child_level_list": []
      }
    ],
    "part_list": []
  }
}