{
  "n_pages": 18,
  "title_page": {
    "title": "Code Of Criminal Procedure (Amendment) Act",
    "num": "50",
    "year": "2024",
    "date_certified": "2024-09-13",
    "date_published": "2024-09-20",
    "price": 30.0,
    "price_postage": 150.0
  },
  "body_pages": {
    "preamble": [
      "Code Of Criminal Procedure (Amendment) Act, No. 50 Of 2024 1",
      "[Certified On 13Th Of September, 2024]",
      "L. D.- O 24/2023",
      "A N  A Ct   To   Amend   The  C Ode   Of  C Riminal  P Rocedure A Ct , N O . 15  Of  1979",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows: -"
    ],
    "pre_section_list": [
      {
        "class_name": "ActL1Section",
        "num": "1",
        "text": "This Act may be cited as the Code of Criminal Procedure (Amendment) Act, No. 50 of 2024.",
        "pre_block_list": [
          "Short title"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "2",
        "text": "Section 183 of the Code of Criminal Procedure Act, No. 15 of 1979 (hereinafter referred to as the principal enactment) is hereby amended by the repeal of the marginal note to that section and the substitution therefor of the following: -",
        "pre_block_list": [
          "Amendment of section 183 of Act, No. 15 of 1979",
          "Plea of guilty and sentencing without written plea agreement."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "3",
        "text": "The following new section is hereby inserted immediately after section 183 of the principal enactment and shall have effect as section 183 A  of the principal enactment: -",
        "pre_block_list": [
          "Insertion of new section 183 A  in the principal enactment",
          "Plea of guilty and sentencing with written plea agreement",
          "183 A .  (1) A plea agreement may be entered into between the prosecutor and an accused who is charged in the Magistrates Court at any time before the sentence is passed, subject to the procedure specified in this section."
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "Where the parties to a case intend to negotiate a plea agreement under this section, the court shall be informed of the same:",
            "pre_block_list": [
              "2PL 014724 1,977 (07/2024)",
              "Code of Criminal Procedure (Amendment) Act, No. 50 of 2024 2",
              "Provided that, the court shall not participate in the negotiations for such plea agreement."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "The prosecutor, the Attorney-at-Law for the accused, or the accused, may initiate the offer to enter into a plea agreement:",
            "pre_block_list": [
              "Provided that, the prosecutor shall maintain the sole discretion on whether or not to enter into a plea agreement with the accused."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "4",
            "text": "If the accused is charged with an offence under the Schedule to the Prevention of Crimes Ordinance (Chapter 22), the Magistrate shall cause the accused to be fingerprinted and call for a fingerprint report.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "5",
            "text": "Negotiations for a plea agreement shall be conducted between the prosecutor and the Attorney-at-Law representing the accused:",
            "pre_block_list": [
              "Provided that, where an accused who intends to enter into a plea agreement is not represented by an Attorney-at-Law, the court shall, assign an Attorney-at-Law to negotiate on behalf of the accused if the accused on being asked by the court, so requests."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "6",
            "text": "As part of the plea negotiation process, the prosecutor may meet with the Attorney-at- Law for the accused, to ascertain to the satisfaction of the prosecution, a complete description of the criminal conduct engaged in by the accused, and the details of criminal conduct engaged in by others, which the accused may provide as cooperation during the negotiation.",
            "pre_block_list": [
              "Code of Criminal Procedure (Amendment) Act, No. 50 of 2024 3"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "7",
            "text": "During the plea negotiations, the prosecutor shall-",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "consider the nature and the circumstances relating to the case, the impact of the commission of the offence on the victim, the personal circumstances of the accused, the interests of the public, and the value of any information provided by the accused including any cooperation provided by the accused as part of the negotiation;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "not use the information obtained from an accused during the course of plea negotiations against him during the prosecution of the case if the plea negotiations are ultimately unsuccessful; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "afford-",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "i",
                    "text": "the victim;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "the Attorney-at-Law of the victim; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iii",
                    "text": "the National Authority for the Protection of Victims of Crimes  and  Witnesses established  under  the Assistance to and Protection of Victims of Crime and Witnesses Act, No. 10 of 2023,",
                    "pre_block_list": [
                      "Code of Criminal Procedure (Amendment) Act, No. 50 of 2024 4",
                      "a reasonable opportunity to make a written representation to the prosecution regarding the impact of the crime, unless the circumstances prevent such representation."
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "8",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "A prosecutor and the accused or the Attorney-at-Law for the accused, may each make a specific recommendation to the court as to the sentence to be imposed and include the recommendation in writing in the final plea agreement.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "Notwithstanding the recommendation of the parties, the court shall retain the sole discretion in sentencing and discretion to indicate the sentence that may be imposed.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "Where the prosecutor recommends to the court the imposition of a sentence that is more severe than the recommendation included in the plea agreement, the accused may withdraw the plea of guilty and set aside the plea agreement.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "Where the accused recommends to the court the imposition of a sentence that is less severe than the recommendation in the plea agreement, the accused shall not be permitted to withdraw his plea of guilty on that ground alone.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "Where the accused recommends to the court the imposition of a sentence that is less severe than the recommendation in the plea agreement, the prosecutor may recommend to the court any other appropriate sentence.",
                "pre_block_list": [
                  "Code of Criminal Procedure (Amendment) Act, No. 50 of 2024 5"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "9",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "The prosecutor shall present the court with the factual basis of the plea set out in the plea agreement between the prosecutor and the accused by presenting the court with the final plea agreement at the hearing, where the accused pleads guilty in accordance with the terms of the plea agreement. The factual basis will be included in writing as part of the completed plea agreement.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "The plea agreement submitted to the court shall be in the format specified in Form 23 in the Second Schedule.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "Where the accused is a child, the plea agreement shall be signed by the childs parent or guardian.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "A plea agreement shall be finalized when the accused signs the agreement.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "10",
            "text": "Upon being satisfied that the accused signed the plea agreement knowingly and voluntarily, the court may accept the plea agreement.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "11",
            "text": "Where the court accepts a plea agreement, the agreement shall become binding upon the parties and the court shall proceed to convict the accused accordingly.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "12",
            "text": "An appeal shall not lie from a conviction imposed after the court has accepted the plea agreement and convicted the accused under subsection (11).",
            "pre_block_list": [
              "Code of Criminal Procedure (Amendment) Act, No. 50 of 2024 6"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "13",
            "text": "An appeal shall not lie from a sentence imposed by the court which falls within the range of punishment recommended by the parties in the plea agreement.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "14",
            "text": "Where the court rejects a plea agreement",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "the reasons for such rejection shall be recorded and the parties shall be informed thereof; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "the plea agreement shall become null and void and the parties shall not be bound by such agreement.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "15",
            "text": "Upon rejection, or withdrawal, of a plea agreement, fresh plea negotiations in a trial relating to the same facts may be considered with prior permission of the court.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "16",
            "text": "Where the court has rejected a plea agreement under this section, no party shall appeal against, or apply for a review of, the order of the court rejecting the agreement.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "17",
            "text": "For the purposes of this section",
            "pre_block_list": [
              "child means, a person under eighteen years of age;",
              "prosecutor shall have the same meaning assigned to such expression in subsection (1) of section 191 of this Code and includes the Director-General of the Commission to Investigate Allegations of Bribery or Corruption established under the",
              "Code of Criminal Procedure (Amendment) Act, No. 50 of 2024 7",
              "Anti-Corruption Act, No. 9 of 2023, an officer of such Commission authorized by the Commission or any other Attorney-at-Law  specially authorized by such Commission to conduct the prosecution at a trial of an offence held in the Magistrates Court on a charge sheet",
              ""
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "4",
        "text": "Section 195 A  of the principal enactment is hereby amended in paragraph ( b ) of subsection (3) thereof, by the substitution for the words to a lesser offence;, of the words and figures to a lesser offence or whether he intends to negotiate for a plea agreement under section 197 A ;.",
        "pre_block_list": [
          "Amendment of section 195 A  of the principal enactment"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "5",
        "text": "Section 197 of the principal enactment is hereby amended by the repeal of the marginal note to that section and the substitution therefor of the following: -",
        "pre_block_list": [
          "Amendment of section 197 of the principal enactment",
          "Plea of guilty and sentencing without written plea agreement."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "6",
        "text": "The following new section is hereby inserted immediately after section 197 of the principal enactment and shall have effect as section 197 A  of that enactment: -",
        "pre_block_list": [
          "Insertion of new section 197 A  in the principal enactment",
          "197 A .  (1) A plea agreement may be entered into between the prosecutor and an accused who is indicted in the High Court, at any time before the sentence is passed, subject to the procedure specified in this section.",
          "Plea of guilty and sentencing with written plea agreement",
          "Code of Criminal Procedure (Amendment) Act, No. 50 of 2024 8"
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "Where the parties to a case intend to negotiate a plea agreement under this section, the court shall be informed of the same:",
            "pre_block_list": [
              "Provided that, the court shall not participate in the negotiations for such plea agreement."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "The prosecutor, the Attorney-at-Law for the accused, or the accused, may initiate the offer to enter into a plea agreement:",
            "pre_block_list": [
              "Provided that, the prosecutor shall maintain the sole discretion on whether or not to enter into a plea agreement with the accused person."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "4",
            "text": "If the accused is indicted in the High Court, the court shall cause the accused to be fingerprinted and call for a fingerprint report pursuant to the provisions of paragraph ( e ) of section 195.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "5",
            "text": "Negotiations for a plea agreement shall be conducted between the prosecutor and the Attorney-at-Law representing the accused:",
            "pre_block_list": [
              "Provided that, where an accused who intends to enter into a plea agreement is not represented by an Attorney-at-Law, the court shall, assign an Attorney-at-Law to negotiate on behalf of the accused if the accused on being asked, so requests."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "6",
            "text": "As part of the plea negotiation process, the prosecutor may meet with the Attorney-at- Law for the accused to ascertain to the satisfaction of the prosecution, a complete description of the criminal conduct engaged",
            "pre_block_list": [
              "Code of Criminal Procedure (Amendment) Act, No. 50 of 2024 9",
              "in by the accused, and the details of criminal conduct engaged in by others, which the accused may provide as cooperation during the negotiation."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "7",
            "text": "During the plea negotiations with the Attorney-at-Law representing the accused, the prosecutor shall-",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "consider the nature and the circumstances relating to the case, the impact of the commission of the offence on the victim, the personal circumstances of the accused, and the interests of the public, and the value of any information provided by the accused, including any cooperation provided by the accused as part of the negotiation;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "not use the information obtained from an accused during the course of plea negotiations against him during the prosecution of the case if the plea negotiations are ultimately unsuccessful; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "afford-",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "i",
                    "text": "the victim;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "the victims Attorney-at-Law; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iii",
                    "text": "the National Authority for the Protection of Victims of",
                    "pre_block_list": [
                      "Code of Criminal Procedure (Amendment) Act, No. 50 of 2024 10",
                      "Crimes  and  Witnesses established  under  the Assistance to and Protection of Victims of Crime and Witnesses Act, No. 10 of 2023,",
                      "a reasonable opportunity to make a written representation to the prosecution regarding the impact of the crime, unless the circumstances prevent such representation."
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "8",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "A prosecutor and the accused or the Attorney-at-Law for the accused, may each make a specific recommendation to the court as to the sentence to be imposed and include the recommendation in writing in the final plea agreement.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "Notwithstanding the recommendation of the parties, the court shall retain the sole discretion in sentencing and discretion to indicate the sentence that may be imposed.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "Where the prosecutor recommends to the court the imposition of a sentence that is more severe than the recommendation included in the plea agreement, the accused may withdraw the plea of guilty and set aside the plea agreement.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "Where an accused has withdrawn the plea under paragraph ( c ), the Judge shall proceed to trial as if a conviction has not been entered.",
                "pre_block_list": [
                  "Code of Criminal Procedure (Amendment) Act, No. 50 of 2024 11"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "Where the accused recommends to the court the imposition of a sentence that is less severe than the recommendation in the plea agreement the accused shall not be permitted to withdraw the plea of guilty on the ground alone.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "Where the accused person recommends to the court the imposition of a sentence that is less severe than the recommendation in the plea agreement, the prosecutor may recommend to the court any other appropriate sentence.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "9",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": ") The prosecutor shall present the court with the factual basis of the plea set out in the plea agreement by presenting the court with the final plea agreement at the hearing, where the accused pleads guilty in accordance with the terms of the plea agreement. The factual basis shall be included in writing as part of the completed plea agreement.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "The plea agreement submitted to the court shall be in the format specified in Form 23 in the Second Schedule.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "Where the accused is a child, the plea agreement shall be signed by the childs parent or guardian.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "A plea agreement shall be finalized when the accused signs the agreement.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "10",
            "text": "Upon being satisfied that the accused signed the plea agreement knowingly and voluntarily, the court may accept the plea agreement.",
            "pre_block_list": [
              "Code of Criminal Procedure (Amendment) Act, No. 50 of 2024 12"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "11",
            "text": "Where the court accepts a plea agreement, the agreement shall become binding upon the parties and the court shall proceed to convict the accused accordingly.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "12",
            "text": "An appeal shall not lie from a conviction imposed after the court has accepted the plea agreement and convicted the accused under subsection (11).",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "13",
            "text": "An appeal shall not lie from a sentence imposed by the court which falls within the range of punishment recommended by the parties in the plea agreement.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "14",
            "text": "Where the court rejects a plea agreement",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "the reasons for such rejection shall be recorded and the parties shall be informed thereof; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "the plea agreement shall become null and void and the parties shall not be bound by such agreement.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "15",
            "text": "Upon rejection, or withdrawal, of a plea agreement, fresh plea negotiations in a trial relating to the same charge and facts may be considered.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "16",
            "text": "Where the court has rejected a plea agreement under this section, no party shall appeal against, or apply for a review of, the order of the court rejecting the agreement.",
            "pre_block_list": [
              "Code of Criminal Procedure (Amendment) Act, No. 50 of 2024 13"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "17",
            "text": "For the purposes of this section",
            "pre_block_list": [
              "child means, a person under eighteen",
              "years of age;",
              "prosecutor shall have the same",
              "meaning assigned to such",
              "expression in section 193 of this",
              "Code and includes the Director-",
              "General of the Commission to",
              "Investigate Allegations of",
              "Bribery or Corruption established",
              "under the Anti-Corruption Act,",
              "No. 9 of 2023, an officer of such",
              "Commission authorized by the",
              "Commission or any other",
              "Attorney-at-Law  specially",
              "authorized by such Commission",
              "to conduct the prosecution at a",
              "trial of an offence held in the High",
              "Court on an indictment signed by",
              "the Director-General of such",
              "Commission",
              ""
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "7",
        "text": "The Second Schedule to the principal enactment is",
        "pre_block_list": [
          "Amendment of the Second Schedule to the principal enactment",
          "hereby amended by the insertion immediately after Form 22",
          "thereof, of the following new Form and shall have effect as Form 23 of that Schedule: -",
          "Code of Criminal Procedure (Amendment) Act, No. 50 of 2024 14",
          "No. 23",
          "(sections 183 A  and 197 A )",
          "DEMOCRATIC SOCIALIST REPUBLIC OF SRI LANKA",
          "IN THE COURT _______________________________",
          "CASE NO. ________________________",
          "NAME OF THE ACCUSED: ______________________",
          "PLEA AGREEMENT",
          "Pursuant to   section 183 A /197 A  of the Code of Criminal Procedure",
          "Act, No. 15 of 1979, the Accused, ______________________agrees",
          "as follows:",
          "1. The Accused enters into this Plea Agreement and pleads",
          "guilty freely, voluntarily, without threat, force, intimidation,",
          "or coercion of any kind and without promise or benefit of",
          "any kind, other than as contained herein.",
          "2. The Accused knowingly, voluntarily and truthfully admits",
          "the facts contained herein.",
          "3. The  Accused  pleads  guilty  to  the  offence  of",
          "_____________________________  punishable under",
          "________",
          "4. The Accused understands every element of the offence to",
          "which the Accused is pleading guilty, and that the maximum",
          "penalty for that offense is  _________________",
          "Code of Criminal Procedure (Amendment) Act, No. 50 of 2024 15",
          "5. Upon acceptance by the Court, and fulfillment by the Accused",
          "of all terms and conditions of the Plea Agreement, the",
          "Prosecution agrees that the Accused will face no other charges",
          "from the investigation which led to the present indictment.",
          "6. The Accused has been advised by his/her legal representative",
          "and the Court, of his/her Constitutional rights, including the",
          "right to trial, the right to examine and cross-examine witnesses,",
          "and the Accused being well informed, has knowingly and",
          "voluntarily waived these rights, including the right to appeal,",
          "and agrees to enter a plea of guilty as set forth in this Plea",
          "Agreement.",
          "7. The Accused understands that the sentence to be imposed",
          "upon conviction on his/her plea of guilty is within the sole",
          "discretion of the Court.  At sentencing, the Prosecutor will",
          "recommend  __________________________________",
          "At  sentencing,  the  Accused  will  recommend",
          "_____________________________________."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "8",
        "text": "The Accused understands and agrees no promises, agreements",
        "pre_block_list": [
          "and conditions have been entered into regarding the charges",
          "herein other than those expressly set out in this Plea Agreement",
          "and none shall be entered into, or shall be binding upon the",
          "Accused and the Prosecution, unless expressly set forth herein,",
          "in writing.",
          "I plead guilty to the offences covered by this Plea Agreement, and",
          "every element set out in the Plea Agreement, which has been explained",
          "to me in a language I understand. I do this knowingly, freely and",
          "voluntarily, and without any threat, force, intimidation, or coercion",
          "of any kind.",
          "Accused: _______________________",
          "Date: __________________________.",
          "Code of Criminal Procedure (Amendment) Act, No. 50 of 2024 16",
          "8.  In the event of any inconsistency between the Sinhala and the Tamil texts of this Act, the Sinhala text shall prevail.",
          "Sinhala text to prevail in case of inconsistency",
          "Code of Criminal Procedure (Amendment) Act, No. 50 of 2024 17",
          "English Acts of the Parliament can be purchased at the P RAKASHANA  P IYASA , D EPARTMENT   OF G OVERNMENT  P RINTING , N O . 118, D R . D ANISTER  D E  S ILVA  M AWATHA , C OLOMBO  8."
        ],
        "child_level_list": []
      }
    ],
    "part_list": []
  }
}