{
  "n_pages": 4,
  "title_page": {
    "title": "Sri Lanka Transport Board (Amendment) Act",
    "num": "39",
    "year": "2008",
    "date_certified": "2008-11-07",
    "date_published": "2008-11-07",
    "price": 6.0,
    "price_postage": 5.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 07Th November, 2008]",
      "L. D. O. 10/2008.",
      "A N  A Ct   To   Amend   The  S Ri  L Anka  T Ransport  B Oard A Ct , N O . 27  Of  2005",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Sri Lanka Transport Board (Amendment) Act, No. 39 of 2008.",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "The Sri Lanka Transport Board Act, No. 27 of 2005 (hereinafter referred to as the principal enactment) is hereby amended by the insertion immediately after section 1 thereof of the following new section which shall have effect as section 1 A  of that enactment :",
            "pre_block_list": [
              "Insertion of new section in the Act, No. 27 of 2005.",
              "1 A . (1) There shall be established a Board which shall be called the Sri Lanka Transport Board (hereinafter referred to as the Board).",
              "Establishment of Sri Lanka Transport Board."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Board shall by the name assigned to it by subsection (1), be a body corporate with perpetual succession and a common seal and may sue and be sued in such name",
                "pre_block_list": [
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "Section 2 of the principal enactment is hereby amended as follows :",
            "pre_block_list": [
              "Amendment of section 2 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "in subsection 1 of that section, by the substitution for the words, There shall be established a Board which shall be called the Sri Lanka Transport Board (hereinafter referred to as the Board) and which shall consist of the following members : of the words, The Board shall consist of-;",
                "pre_block_list": [
                  "2PL 0032294,250 (09/2008)"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the substitution for paragraph (iii) of that section, the following new paragraph :",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iii",
                    "text": "an officer not below the rank of Additional Secretary of the Ministry of the Minister in charge of the subject of Finance or the Director- General of the Treasury nominated by the Secretary to the Treasury.; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "by the substitution for the marginal note to that section of the following :",
                "pre_block_list": [
                  "Composition of the Board."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "The amendment made to the principal enactment by section 1 A  of this Act, shall for all purposes be deemed to have come into force on the date of coming into operation of the principal enactment.",
            "pre_block_list": [
              "Retrospective effect."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "In the event of any inconsistency between the Sinhala and Tamil  texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency.",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , D EPARTMENT   OF G OVERNMENT  I NFORMATION , N O . 163, K IRULAPONA  M AWATHA , P OLHENGODA , C OLOMBO  05 before 15th December each year in respect of the year following ."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}