{
  "n_pages": 37,
  "title_page": {
    "title": "Ayurveda (Amendment )  Act",
    "num": "19",
    "year": "2023",
    "date_certified": "2023-10-09",
    "date_published": "2023-10-13",
    "price": 60.0,
    "price_postage": 150.0
  },
  "body_pages": {
    "preamble": [
      "Ayurveda (Amendment)  Act, No. 19 Of 2023 1",
      "[Certified On 09Th Of October, 2023]",
      "L.D.O. 39/2022",
      "A N  A Ct   To   Amend   The  A Yurveda  A Ct , N O . 31  Of  1961",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows: -"
    ],
    "pre_section_list": [
      {
        "class_name": "ActL1Section",
        "num": "1",
        "text": "This Act may be cited as the Ayurveda (Amendment) Act, No. 19 of 2023.",
        "pre_block_list": [
          "Short title"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "2",
        "text": "The long title of the Ayurveda Act, No. 31 of 1961 (hereinafter referred to as the principal enactment) is hereby amended by the substitution for the words commencing from FOR THE REGISTRATION OF AYURVEDA HOSPITALS to the words DISPENSARIES ATTACHED THERETO; of the following: -",
        "pre_block_list": [
          "Amendment of the Long Title to Act, No. 31 of 1961",
          " FOR THE REGISTRATION OF AYURVEDA HOSPITALS, AYURVEDA  PHARMACIES,  AYURVEDA DISPENSARIES, AYURVEDA STORES, HERBAL CULTIVATIONS AND HERBAL GARDENS FOR RESEARCH  AND  EXTENTION;  FOR  THE ESTABLISHMENT OF AN AYURVEDA MEDICAL COUNCIL TO REGISTER AYURVEDA PRACTITIONERS, AYURVEDA PHARMACISTS, AYURVEDA NURSES AND AYURVEDA MASSAGE  THERAPISTS AND TO DEAL WITH MATTERS RELATING TO THEIR PROFESSIONAL CONDUCT; FOR THE ESTABLISHMENT OF AN AYURVEDA EDUCATION AND HOSPITAL BOARD TO DISCHARGE CERTAIN FUNCTIONS IN RELATION TO THE AWARD OF DIPLOMAS, CERTIFICATES, DEGREES AND POSTGRATUATE DEGREES IN RELATION TO THE EDUCATION AND TRAINING IN AYURVEDA AND TO DEAL WITH MATTERS RELATING TO THE AYURVEDA NATIONAL HOSPITAL, AYURVEDA TEACHING HOSPITALS, AYURVEDA RESEARCH HOSPITALS AND THE PHARMACIES, HERBARIA AND DISPENSARIES ATTACHED THERETO;.",
          "Ayurveda (Amendment)  Act, No. 19 of 2023 2"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "3",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "In the principal enactment and in any other written law, there shall be substituted for the words the Commissioner for Ayurveda, Ayurvedic Medical Council,  ayurvedic hospitals, ayurvedic pharmacy, ayurvedic pharmacies, ayurvedic dispensary, ayurvedic dispensaries, ayurvedic store , ayurvedic stores, ayurvedic practitioners, ayurvedic pharmacists, ayurvedic nurses, the Central Hospital of Ayurveda and the Ayurvedic Research Committee, of the words Commissioner-General for Ayurveda, Ayurveda Medical Council,   Ayurveda hospitals, Ayurveda pharmacy, Ayurveda pharmacies, Ayurveda dispensary, Ayurveda dispensaries, Ayurveda store , Ayurveda stores, Ayurveda practitioners, Ayurveda pharmacists, Ayurveda nurses, the Ayurveda National Hospital and the Ayurveda Research Committee, respectively.",
            "pre_block_list": [
              "General Amendments"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "Every reference to the Commissioner for Ayurveda, Ayurvedic Medical Council,  ayurvedic hospitals, ayurvedic pharmacy, ayurvedic pharmacies, ayurvedic dispensary, ayurvedic dispensaries, ayurvedic store , ayurvedic stores, ayurvedic practitioners, ayurvedic pharmacists, ayurvedic nurses, the Central Hospital of Ayurveda and the Ayurvedic Research Committee , appearing in any notice, notification or other document shall be read and construed as a reference to the Commissioner- General for Ayurveda, Ayurveda Medical Council, Ayurveda hospitals, Ayurveda pharmacy, Ayurveda pharmacies, Ayurveda dispensary, Ayurveda dispensaries, Ayurveda store , Ayurveda stores, Ayurveda practitioners, Ayurveda pharmacists, Ayurveda nurses, the Ayurveda National Hospital and the Ayurveda Research Committee, respectively.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "Every reference to the Commissioner in sections 3, 4, 6,8, 9,10, 11, 13, 15, 22, 23, 24, 26, 33, 34, 35, 37, and 75 in the principal enactment shall be read and construed as a reference to the Commissioner-General of Ayurveda.",
            "pre_block_list": [
              "Ayurveda (Amendment)  Act, No. 19 of 2023 3"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "4",
            "text": "Every reference to the Council in sections 11 to 21, 42, 50 to 63, 71 and 81 in the principal enactment shall be read and construed as a reference to the Ayurveda Medical Council.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "4",
        "text": "Section 3 of the principal enactment is hereby amended in subsection (2) thereof, by the substitution for the words, Deputy Commissioners for Ayurveda, of the words Additional Commissioner-Generals for Ayurveda, Commissioners for Ayurveda, Deputy Commissioners for Ayurveda,.",
        "pre_block_list": [
          "Amendment of section 3 of the principal enactment"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "5",
        "text": "Section 4 of the principal enactment is hereby amended by the substitution for the words, Deputy Commissioners for Ayurveda, of the words Additional Commissioner- Generals for Ayurveda, Commissioners for Ayurveda, Deputy Commissioners for Ayurveda,.",
        "pre_block_list": [
          "Amendment of section 4 of the principal enactment"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "6",
        "text": "Section 5 of the principal enactment is hereby amended by the substitution for the words, Deputy Commissioners for Ayurveda, of the words Additional Commissioner- Generals for Ayurveda, Commissioners for Ayurveda, Deputy Commissioners for Ayurveda,.",
        "pre_block_list": [
          "Amendment of section 5 of the principal enactment"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "7",
        "text": "Section 7 of the principal enactment is hereby repealed and the following section is substituted therefor:-",
        "pre_block_list": [
          "Replacement of section 7 of the principal enactment",
          "Objects of the Act",
          "7. The objects of the Act shall be -"
        ],
        "child_level_list": [
          {
            "class_name": "ActL3Paragraph",
            "num": "a",
            "text": "the provision of-",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL4SubParagraph",
                "num": "i",
                "text": "establishments and services necessary for the treatment of diseases; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL4SubParagraph",
                "num": "ii",
                "text": "the primary health care,",
                "pre_block_list": [
                  "according to ayurveda;",
                  "Ayurveda (Amendment)  Act, No. 19 of 2023 4"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "b",
            "text": "the encouragement of the study of, and research in, ayurveda by the grant of scholarships and other facilities to persons employed or proposed to be employed in the Department and by the grant of financial aid and other assistance to institutions providing courses of study or engaged in research in ayurveda;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "c",
            "text": "the taking, development or encouragement of measures for the investigation of diseases, and for the improvement of public health, according to ayurveda;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "d",
            "text": "the management of any herbarium established under section 8;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "e",
            "text": "the provision for the wellbeing of people by creating and maintaining orderly and efficient practices of Ayurveda medicine and surgery;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "f",
            "text": "the assurance of high professional standards by regulating performance and activities of registered Ayurveda professionals; and",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "g",
            "text": "the provision of quality Ayurveda articles, substances, and drugs and the management of  any Herbal Gardens for Research and Extension or herbal cultivation  by implementing provisions of the Code referred to in section 77, by the Department or through any Body established under Part VI of the Act for that purpose",
            "pre_block_list": [
              "",
              "Ayurveda (Amendment)  Act, No. 19 of 2023 5"
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "8",
        "text": "The following new section is hereby inserted immediately after section 7 of the principal enactment and shall have effect as section 7 A :-",
        "pre_block_list": [
          "Insertion of new section 7 A  in the principal enactment",
          "7 A .  (1) The moneys granted from the Consolidated Fund from time to time shall be utilized in carrying out the objects of the Act.",
          "Utilization of moneys granted from the Consolidated Fund and crediting of moneys to the Consolidated Fund"
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "All such sums of money as may be received, levied, or collected under this Act by way of fees or otherwise in carrying out the objects specified in the Act and in the discharge of the functions of the Department  shall be credited to the Consolidated Fund. .",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "9",
        "text": "Section 8 of the principal enactment is hereby amended as follows:-",
        "pre_block_list": [
          "Amendment of section 8 of the principal enactment"
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "by the substitution for the words, In carrying out the objects specified in section 7, the Commissioner of the words, The Commissioner- General shall have the power to carry out the objects specified in paragraphs ( a ) to ( e ) of section 7 and in doing so the Commissioner-General; and",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "by the substitution for the words, Ayurvedic hospitals of the words  Ayurveda hospitals, Herbal Gardens for Research and Extension Services.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "10",
        "text": "Section 10 of the principal enactment is hereby amended as follows:-",
        "pre_block_list": [
          "Amendment of section 10 of the principal enactment"
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "by the substitution for the words, ayurvedic hospitals, wherever those words appear, of the words  Ayurveda hospitals, herbal cultivation,;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "by the substitution for the words, ayurvedic hospitals wherever those words appear, of the words  Ayurveda hospitals, herbal cultivation;",
            "pre_block_list": [
              "Ayurveda (Amendment)  Act, No. 19 of 2023 6"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "by the substitution for the words, hospitals wherever those words appear, of the words hospitals, herbal cultivation.",
            "pre_block_list": [
              "Amendment of section 11 of the principal enactment"
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "11",
        "text": "Section 11 of the principal enactment is hereby amended in subsection (1) thereof, as follows: -",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "by the repeal of  paragraph ( b ) thereof, and the substitution therefor, of the following new paragraph:-",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "the Dean of the  Faculty of Indigenous Medicine  of the University of Colombo, Sri Lanka, the Dean of the Faculty of Indigenous Medicine of Gampaha Wickramarachchi  University  of Indigenous Medicine, Sri Lanka, the Head of the Unit of Siddha Medicine of the University of Jaffna, Sri Lanka and the Dean of the Faculty of Siddha Medicine of the Eastern University, Sri Lanka;;",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "by the repeal of paragraph ( c ) thereof, and the substitution therefor, of the following new paragraph:-",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "five members-",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "i",
                    "text": "two of them each representing Ayurveda and Unani systems of medicine of the Faculty of Indigenous Medicine of the University of Colombo, Sri Lanka and elected from",
                    "pre_block_list": [
                      "among the Senior Lecturers;",
                      "Ayurveda (Amendment)  Act, No. 19 of 2023 7"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "one of them elected from among the Senior Lecturers of the Faculty of Indigenous Medicine of the Gampaha Wickramarachchi University of Indigenous Medicine, Sri Lanka;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iii",
                    "text": "one of them elected from among the Senior Lecturers of the Unit of Siddha Medicine of the University of Jaffna, Sri Lanka ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iv",
                    "text": "one of them elected from among the Senior Lecturers of the Faculty of Siddha Medicine of the Eastern University, Sri Lanka.;",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "by the repeal of paragraph ( f ) thereof,  and the substitution therefor, of the following new paragraph:-",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "not more than twelve members appointed by the Minister of whom-",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "i",
                    "text": "three shall be so appointed from among persons who are not registered Ayurveda practitioners;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "three shall be so appointed from a panel of ten nominated by the All Ceylon Ayurvedic Practitioners Congress; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iii",
                    "text": "two shall be so appointed from among registered Ayurveda practitioners who are not members of the All Ceylon Ayurvedic Practitioners Congress; and; and",
                    "pre_block_list": [
                      "Ayurveda (Amendment)  Act, No. 19 of 2023 8"
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "4",
            "text": "by the addition, immediately after paragraph ( f ), the following new paragraph:-",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "g",
                "text": "one member shall be so appointed as nominated by the Secretary to the Ministry of the Minister assigned the subject of Finance or Treasury, as the case may be",
                "pre_block_list": [
                  "",
                  "Amendment of"
                ],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "12",
        "text": "Section 12 of the principal enactment is hereby amended by the substitution for the words, commencing from Each member of the Council to or reappointment: of the following:-",
        "pre_block_list": [
          "section 12 of the",
          "principal enactment",
          "Each member of the Council, other than the Commissioner-General, the Dean of the  Faculty of Indigenous Medicine  of the University of Colombo, Sri Lanka, the Dean of the Faculty of Indigenous Medicine of the Gampaha Wickramarachchi University of Indigenous Medicine, Sri Lanka, the Head of the Unit of Siddha Medicine of the University of Jaffna, Sri Lanka and the Dean of the Faculty of Siddha Medicine of the Eastern University, Sri Lanka,  shall, unless he vacates office earlier, hold office for a term of three years and shall be eligible for re-election or reappointment, as the case may be:."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "13",
        "text": "Section 13 of the principal enactment is hereby repealed and the following section is substituted therefor: -",
        "pre_block_list": [
          "Replacement of section 13 of the principal enactment",
          "Vacation of office by members of the Council",
          "13. (1) A member of the Council, other than the Commissioner-General, the Dean of the  Faculty of Indigenous Medicine  of the University of Colombo, Sri Lanka, the Dean",
          "Ayurveda (Amendment)  Act, No. 19 of 2023 9",
          "of the Faculty of Indigenous Medicine of the Gampaha Wickramarachchi University of Indigenous Medicine, Sri Lanka, the Head of the Unit of Siddha Medicine of the University of Jaffna, Sri Lanka and the Dean of the Faculty of Siddha Medicine of the Eastern University, Sri Lanka, shall be deemed to have vacated office",
          "( a ) where he is not a public officer, on sending his resignation in writing to the President of the Council;",
          "( b ) where he is not a public officer, on being absent without excuse sufficient in the opinion of the Council, from three consecutive meetings of the Council;",
          "( c ) on his ceasing to be a registered Ayurveda practitioner, or on the taking effect of an order made by the Council under this Act suspending his registration as an Ayurveda practitioner; or",
          "( d ) on his being convicted of any offence under the Penal Code (Chapter 19)."
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "The Commissioner-General shall be deemed to have vacated office as a member of",
            "pre_block_list": [
              "the Council on his ceasing to hold office as the Commissioner-General.",
              "Ayurveda (Amendment)  Act, No. 19 of 2023 10"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "The Dean of the  Faculty of Indigenous Medicine  of the University of Colombo, Sri Lanka, the Dean of the Faculty of Indigenous Medicine of the Gampaha Wickramarachchi University of Indigenous Medicine, Sri Lanka, the Head of the Unit of Siddha Medicine of the University of Jaffna, Sri Lanka or the Dean of the Faculty of Siddha Medicine of the Eastern University, Sri Lanka, as the case may be, shall be deemed to have vacated office as a member of the Council on him ceasing to hold office as the Dean or the Head of any of the aforesaid respective Institutions as the case may be",
            "pre_block_list": [
              ""
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "14",
        "text": "Section 16 of the principal enactment is hereby amended, by the substitution for the words, shall be six., of the words  shall be thirteen",
        "pre_block_list": [
          "",
          "Amendment  of section 16 of the principal enactment"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "15",
        "text": "Section 18 of the principal enactment is hereby amended as follows:-",
        "pre_block_list": [
          "Amendment of section 18 of the principal enactment"
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "by the insertion immediately after paragraph ( d ) thereof, the following new paragraph:-",
            "pre_block_list": [
              "( da ) the registration of persons as Ayurveda massage therapists;;"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "in paragraph ( e ) thereof, by the substitution for the words, registration; and of the words, registration;;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "in paragraph ( f ) thereof, in subparagraph (i), by the substitution for the words and ayurvedic nurses; and of the words and Ayurveda nurses, and Ayurveda massage therapist; and.",
            "pre_block_list": [
              "Ayurveda (Amendment)  Act, No. 19 of 2023 11"
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "16",
        "text": "Section 22 of the principal enactment is hereby amended in subsection (1) thereof, as follows:-",
        "pre_block_list": [
          "Amendment of section 22 of the principal enactment"
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "by the insertion, immediately after paragraph ( a ), the following new paragraph:-",
            "pre_block_list": [
              "( aa ) a representative of the Secretary to the Ministry of Finance or the Secretary to the Treasury;;"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "by the repeal of  paragraph ( b ) thereof, and the substitution therefor, of the following new paragraph:-",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "the Dean of the  Faculty of Indigenous Medicine  of the University of Colombo, Sri Lanka, the Dean of the Faculty of Indigenous Medicine of the Gampaha Wickramarachchi University of Indigenous Medicine, Sri Lanka, the Head of the Unit of Siddha Medicine of the University of Jaffna, Sri Lanka and the Dean of the Faculty of Siddha Medicine of the Eastern University, Sri Lanka;;",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "by the insertion, immediately after paragraph ( b ) thereof, the following new paragraph:-",
            "pre_block_list": [
              "( ba ) the Head of the National Institute of Traditional Medicine;;"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "4",
            "text": "by the repeal of  paragraph ( c ) thereof, and the substitution therefor, of the following new paragraph:-",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "the Head of the Ayurveda National Hospital;;",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "5",
            "text": "by the repeal of  paragraph ( d ) thereof, and the substitution therefor, of the following new paragraph:-",
            "pre_block_list": [
              "Ayurveda (Amendment)  Act, No. 19 of 2023 12"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "an officer of the rank of a Senior Assistant Secretary or of a higher rank of the Ministry of the Minister assigned the subject of Higher Education appointed by the Minister on recommendation of the Minister assigned the subject of Higher Education;;",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "6",
            "text": "by the repeal of  paragraph ( e ) thereof, and the substitution therefor, of the following new paragraph:-",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "five members appointed by the Minister on the recommendation of the Minister assigned the subject of Higher Education-",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "i",
                    "text": "two of them each representing Ayurveda and Unani systems of medicine of the Faculty of Indigenous Medicine of the University of Colombo, Sri Lanka;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "one of them from the  Faculty of Indigenous Medicine of the Gampaha Wickramarachchi University of Indigenous Medicine, Sri Lanka;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iii",
                    "text": "one of them from the Unit of Siddha Medicine of University of Jaffna, Sri Lanka; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iv",
                    "text": "one of them from the Faculty of Siddha Medicine of the Eastern University, Sri Lanka,",
                    "pre_block_list": [
                      "from among the lecturers of each Faculty or Unit;"
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "7",
            "text": "by the repeal of  paragraph ( f ) thereof, and the substitution therefor, of the following new paragraph:-",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "five members, other than the members appointed under paragraph ( e )-",
                "pre_block_list": [
                  "Ayurveda (Amendment)  Act, No. 19 of 2023 13"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "i",
                    "text": "two of them each representing Ayurveda and Unani systems of medicine of the Faculty of Indigenous Medicine  of the University of Colombo, Sri Lanka;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "one of them from the  Faculty of",
                    "pre_block_list": [
                      "Indigenous Medicine of the Gampaha  Wickramarachchi University of Indigenous Medicine, Sri Lanka;"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iii",
                    "text": "one of them from  the Unit of Siddha Medicine of University of Jaffna, Sri Lanka; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iv",
                    "text": "one of them from the Faculty of Siddha Medicine of the Eastern University, Sri Lanka,",
                    "pre_block_list": [
                      "and elected by the lecturers of each  Faculty or the  Unit from among themselves;;"
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "8",
            "text": "by the repeal of paragraph ( i ), thereof and the substitution therefor, of the following new paragraph:-",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "not more than eight members appointed by the Minister from among registered Ayurveda practitioners of whom not more than two shall be so appointed from a panel of six nominated by the All Ceylon Ayurvedic Practitioners Congress; and.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "17",
        "text": "Section 23 of the principal enactment is hereby amended by the substitution for the words from Each member of the Board to or reappointment: of the following: -",
        "pre_block_list": [
          "Amendment of section 23 of the principal enactment",
          "Ayurveda (Amendment)  Act, No. 19 of 2023 14",
          "Each member of the Board, other than the Commissioner-General, the Dean of the  Faculty of Indigenous Medicine  of the University of Colombo, Sri Lanka, the Dean of the Faculty of Indigenous Medicine of the Gampaha Wickramarachchi University of Indigenous Medicine, Sri Lanka, the Head of the Faculty of Siddha Medicine of the University of Jaffna, Sri Lanka, the Dean of the Faculty of Siddha Medicine of the Eastern University, Sri Lanka, the Head of the Ayurveda National Hospital and the Head of the National Institute of Traditional Medicine, shall, unless such member vacates his office earlier, hold office for a term of three years and shall be eligible for re-election or reappointment, as the case may be:."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "18",
        "text": "Section 24 of the principal enactment is hereby amended as follows:-",
        "pre_block_list": [
          "Amendment of section 24 of the principal enactment"
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "in subsection (1) thereof, by the substitution for the words from A member of the Board to Hospital of Ayurveda, of the words, A member of the Board, other than the Commissioner-General, the Dean of the  Faculty of Indigenous Medicine  of the University of Colombo, Sri Lanka the Dean of the Faculty of Indigenous Medicine of the Gampaha Wickramarachchi University of Indigenous Medicine, Sri Lanka, the Head of the Unit of Siddha Medicine of University of Jaffna, Sri Lanka, the Dean of the Faculty of Siddha Medicine of the Eastern University, Sri Lanka, the Head of the Ayurveda National Hospital and the Head of the National Institute of Traditional Medicine,;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "by the repeal of subsection (3) thereof, and the substitution therefor of the following:-",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "The Dean of the  Faculty of Indigenous Medicine  of the University of Colombo, Sri Lanka, the Dean of the Faculty of Indigenous",
            "pre_block_list": [
              "Ayurveda (Amendment)  Act, No. 19 of 2023 15",
              "Medicine of the Gampaha Wickramarachchi University of Indigenous Medicine, Sri Lanka, the Head of the Unit of Siddha Medicine of the University of Jaffna, Sri Lanka or the Dean of the Faculty of Siddha Medicine of the Eastern University, Sri Lanka, shall be deemed to have vacated office as a member of the Board on his ceasing to hold the office of the Dean of the Faculty of Indigenous Medicine  of the University of Colombo, Sri Lanka, the Dean of the Faculty of Indigenous Medicine of the Gampaha Wickramarachchi University of Indigenous Medicine, Sri Lanka, the Head of the Unit of Siddha Medicine of University of Jaffna, Sri Lanka or the Dean of the Faculty of Siddha Medicine of Eastern University, Sri Lanka, as the case may be.;",
              "(3) by the repeal of subsection (4) thereof, and the substitution therefor, of the following:-"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "4",
            "text": "The Head of the Ayurveda National Hospital shall be deemed to have vacated office as a member of the Board on his ceasing to hold the office of the Head of the Ayurveda National Hospital. .",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "19",
        "text": "Section 27 of the principal enactment is hereby amended, by the substitution for the words, shall be six., of the words shall be fourteen",
        "pre_block_list": [
          "",
          "Amendment of section 27 of the principal enactment"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "20",
        "text": "Section 30 of the principal enactment is hereby amended as follows:-",
        "pre_block_list": [
          "Amendment of section 30 of the principal enactment"
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "by the repeal of paragraph ( a ), thereof, and the substitution therefor, of the following new paragraph: -",
            "pre_block_list": [
              "Ayurveda (Amendment)  Act, No. 19 of 2023 16"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "to determine-",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "i",
                    "text": "the qualifications required for the award of postgraduate degrees, basic degrees, diplomas, and certificates under this Act;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "the standards of the courses conferring basic degrees, diplomas and certificates, conducted by local or foreign universities or degree-awarding institutions, to be considered for registration under the Act;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iii",
                    "text": "and to hold examinations for the holders of basic degrees, diplomas and certificates conferred by local or foreign universities or degree-awarding institutions, to be considered for registration under the Act;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iv",
                    "text": "the standards and period of internship or training required by holders of basic degrees, diplomas and certificates conferred by local or foreign universities or degree awarding institutions, to be considered for registration under the Act;;",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "in paragraph ( b ) thereof, by the substitution for the words enable persons to obtain of the words enable persons to obtain postgraduate degrees or basic degrees or;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "in paragraph ( c ) thereof, by the substitution for the words enable persons to obtain of the words enable persons to obtain postgraduate degrees or basic degrees or;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "4",
            "text": "by the insertion, immediately after paragraph ( c ) thereof, of the following new paragraph:-",
            "pre_block_list": [
              "Ayurveda (Amendment)  Act, No. 19 of 2023 17",
              "( ca ) to make recommendations to the Minister in respect of any fees to be prescribed, where necessary, for the award of postgraduate degrees, basic degrees, diplomas, and certificates under this Act;."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "21",
        "text": "Section 33 of the principal enactment is hereby amended by the repeal of subsection (1) thereof, and the substitution therefor of the following:-",
        "pre_block_list": [
          "Amendment of section 33 of the principal enactment"
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "There shall be a Committee which shall be called the Ayurveda Research Committee, (hereinafter in this Part referred to as the Committee) which shall consist of fourteen members, namely-",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "the Commissioner-General;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "the Head of the Ayurveda National Hospital;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "the Head of the Bandaranayake Memorial Ayurveda Research Institute;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "four Professors of traditional medicine, each representing the University of Colombo, Sri Lanka, the Gampaha Wickramarachchi University of Indigenous Medicine, the University of Jaffna, and the Faculty of Siddha Medicine of Eastern University, Sri Lanka;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "one member duly appointed by the National Science Foundation established under the Science and Technology Development  Act, No. 11 of 1994 ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "one member duly appointed by the National Intellectual Property Office of Sri Lanka established under the Intellectual Property Act, No. 36 of 2003;",
                "pre_block_list": [
                  "Ayurveda (Amendment)  Act, No. 19 of 2023 18"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "g",
                "text": "one member nominated by the Secretary to the Ministry of the Minister assigned the subject of  Science;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "h",
                "text": "one member appointed by the Minister from among persons who possess ten or more years of experience in the field of law;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "two members appointed by the Minister, from among the Ayurveda Practitioners registered in the special register; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "j",
                "text": "one member not below the rank of Senior Assistant Secretary appointed by the Secretary to the Ministry of the Minister to whom the subject of Finance is assigned",
                "pre_block_list": [
                  ""
                ],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "22",
        "text": "Section 38 of the principal enactment is hereby amended, by the substitution for the words, shall be three., of the words  shall be five",
        "pre_block_list": [
          "",
          "Amendment of section 38 of the principal enactment"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "23",
        "text": "Section 41 of the principal enactment is hereby amended as follows:-",
        "pre_block_list": [
          "Amendment of section 41of the principal enactment"
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "in paragraph ( c ) of  subsection (1) thereof, by the substitution for the words   ayurvedic clinical treatment of the  words ayurveda clinical treatment and Ayurveda Primary Health Care;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "in subsection (2) thereof, by the insertion immediately after paragraph ( d ), the following new paragraph: -",
            "pre_block_list": [
              "( da ) the charging of any prescribed fees in respect of any matters referred to in paragraphs ( a ) to ( d );;"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "by the addition, immediately after subsection (2) thereof, of the following new subsection:-",
            "pre_block_list": [
              "Ayurveda (Amendment)  Act, No. 19 of 2023 19",
              "(3) Formulating one or more sub-committees to carry out duties and responsibilities specified in sub sections (1) and (2)",
              ""
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "24",
        "text": "Section 51 of the principal enactment is hereby amended in subsection (1) thereof, by the addition, immediately  after  paragraph  ( c ), of the  following  new paragraph:-",
        "pre_block_list": [
          "Amendment of section 51 of the principal enactment"
        ],
        "child_level_list": [
          {
            "class_name": "ActL3Paragraph",
            "num": "d",
            "text": "a register for the registration of Ayurveda massage therapists",
            "pre_block_list": [
              ""
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "25",
        "text": "Section 53 of the principal enactment is hereby amended by the substitution for the words ayurvedic pharmacist or ayurvedic nurse wherever they appear in that section, of the words Ayurveda pharmacist, Ayurveda nurse or Ayurveda massage therapist.",
        "pre_block_list": [
          "Amendment of section 53 of the principal enactment"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "26",
        "text": "Section 54 of the principal enactment is hereby amended by the substitution for the words ayurvedic pharmacist or ayurvedic nurse wherever they appear in that section, of the words Ayurveda pharmacist, Ayurveda nurse or Ayurveda massage therapist.",
        "pre_block_list": [
          "Amendment of section 54 of the principal enactment"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "27",
        "text": "Section 55 of the principal enactment is hereby amended in paragraph ( c ) of subsection (1) thereof, by the substitution for the words The institute of Ayurveda of the University of Ceylon; or of the words the  Faculty of Indigenous Medicine  of the University of Colombo, Sri Lanka,  the Faculty of Indigenous Medicine of the Gampaha Wickramarachchi University of Indigenous Medicine, Sri Lanka, the Unit of Siddha Medicine of the University of Jaffna, Sri Lanka, the Faculty of Siddha Medicine of the Eastern University, Sri Lanka; or.",
        "pre_block_list": [
          "Amendment of section 55 of the principal enactment"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "28",
        "text": "Section 56 of the principal enactment is hereby repealed and the following section is substituted therefor: -",
        "pre_block_list": [
          "Replacement of section 56 of the principal enactment",
          "Ayurveda (Amendment)  Act, No. 19 of 2023 20",
          "56. No person shall be entitled to be registered as an Ayurveda pharmacist, Ayurveda nurse or Ayurveda massage therapist unless such person-",
          "Qualifications for registration as Ayurveda pharmacist, Ayurveda nurse or Ayurveda massage therapist"
        ],
        "child_level_list": [
          {
            "class_name": "ActL3Paragraph",
            "num": "a",
            "text": "is a citizen of Sri Lanka; and",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "b",
            "text": "satisfies the Council that such person possesses  sufficient  knowledge, experience and skill in the science of manufacturing Ayurveda medicines efficiently or sufficient experience in Ayurveda nursing or professional skill as an Ayurveda massage therapist , as the case may be",
            "pre_block_list": [
              ""
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "29",
        "text": "Section 57 of the principal enactment is hereby amended as follows: -",
        "pre_block_list": [
          "Amendment of section 57 of the principal enactment"
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "in subsection (1) thereof-",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "in paragraph ( a ), by the substitution for the words pharmacist, ayurvedic nurse of the words pharmacist, Ayurveda nurse, Ayurveda massage therapist,;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "in paragraph ( b ), by the substitution for the words pharmacist, ayurvedic nurse of the words pharmacist, Ayurveda nurse, Ayurveda massage therapist,;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "in paragraph ( c ), by the substitution for the words any diploma or certificate of the words any postgraduate degree or basic degree or diploma or certificate;",
                "pre_block_list": [
                  "Ayurveda (Amendment)  Act, No. 19 of 2023 21"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "in subsection (2) thereof, by the substitution for the",
            "pre_block_list": [
              "words ayurvedic pharmacist or ayurvedic nurse",
              "wherever those words appear in that subsection, of",
              "the words Ayurveda pharmacist or Ayurveda nurse",
              "or Ayurveda massage therapist; ."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "30",
        "text": "Section 58 of the principal enactment is hereby",
        "pre_block_list": [
          "Amendment of section 58 of the principal enactment",
          "amended by the substitution for the words ayurvedic",
          "pharmacist or ayurvedic nurse wherever they appear in that",
          "section, of the words Ayurveda pharmacist or Ayurveda",
          "nurse or Ayurveda massage therapists,."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "31",
        "text": "Section 59 of the principal enactment is hereby",
        "pre_block_list": [
          "amended as follows:-"
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "in subsection (1) thereof, by the substitution for the",
            "pre_block_list": [
              "Amendment of section 59 of the principal enactment",
              "words ayurvedic pharmacist or ayurvedic nurse",
              "and the words register of ayurvedic nurses,",
              "wherever those words appear, of the words",
              "Ayurveda pharmacist, Ayurveda nurse or",
              "Ayurveda massage therapist and the words",
              "register of Ayurveda nurses, the register of",
              "Ayurveda massage therapists,, respectively;"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "in subsection (2) thereof, by the substitution for the",
            "pre_block_list": [
              "words ayurvedic pharmacist or ayurvedic nurse",
              "and the words register of ayurvedic nurses,",
              "wherever those words appear, of the words",
              "Ayurveda pharmacist or Ayurveda nurse or",
              "Ayurveda massage therapist and the words",
              "register of Ayurveda nurses, the register of",
              "Ayurveda massage therapists,, respectively; and",
              "Ayurveda (Amendment)  Act, No. 19 of 2023 22"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "in subsection (3) thereof, by the substitution for the words ayurvedic pharmacist or ayurvedic nurse and the words register of ayurvedic nurses, of the words Ayurveda pharmacist or Ayurveda nurse or Ayurveda massage therapist and the words register of Ayurveda nurses, the register of Ayurveda massage therapists,, respectively.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "32",
        "text": "Section 60 of the principal enactment is hereby repealed and the following section is substituted therefor:-",
        "pre_block_list": [
          "Replacement of section 60 of the principal enactment Fees to be charged for the purposes of section 18, in the exercise of powers under section 30 and in carrying out duties under section 41",
          "60.(1) The fee for registration as an Ayurvedic practitioner, Ayurveda pharmacist or Ayurveda nurse or Ayurveda massage therapist, shall be such sum as may be prescribed by rules made by the Council under this Act."
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "The Registrar shall not register the name of any person in the register of Ayurveda practitioners, the register of Ayurveda pharmacists, register of Ayurveda nurses, the register of Ayurveda massage therapists, until the fee for registration as an Ayurveda practitioner, Ayurveda pharmacist or Ayurveda nurse or Ayurveda massage therapist, as the case may be, is paid by that person.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "The fees chargeable by the Ayurveda Education and Hospital Board in the exercise, discharge and performance of its powers, functions, and duties under section 30 of this Act, shall be as prescribed by regulations.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "4",
            "text": "The fees chargeable by the Ayurveda Research Committee for the performance of its duties under section 41 of the Act, shall be as prescribed by regulation",
            "pre_block_list": [
              "",
              "Ayurveda (Amendment)  Act, No. 19 of 2023 23"
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "33",
        "text": "Section 61 of the principal enactment is hereby amended by the substitution for the words Ayurvedic pharmacist or ayurvedic nurse of the words Ayurveda pharmacist or Ayurveda nurse or Ayurveda massage therapist;",
        "pre_block_list": [
          "Amendment of section 61 of the principal enactment"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "34",
        "text": "Section 62 of the principal enactment is hereby amended by the substitution for the words register of Ayurvedic nurses, and the words ayurvedic pharmacist or Ayurvedic nurse of the words register of Ayurveda nurses, the register of Ayurveda massage therapists, and the words, Ayurveda pharmacist or Ayurveda nurse or Ayurveda massage therapist respectively.",
        "pre_block_list": [
          "Amendment of section 62 of the principal enactment"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "35",
        "text": "Section 63 of the principal enactment is hereby amended as follows: -",
        "pre_block_list": [
          "Amendment of section 63 of the principal enactment"
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "in subsection (1) thereof, by the substitution for the words ayurvedic pharmacist or ayurvedic nurse of the words Ayurveda pharmacist or Ayurveda nurse or Ayurveda massage therapist;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "in subsection (3) thereof, by the substitution for the words ayurvedic pharmacist or ayurvedic nurse and the words register of ayurvedic nurses, of the words Ayurveda pharmacist or Ayurveda nurse or Ayurveda massage therapist and the words, register of Ayurveda nurses, the register of Ayurveda massage therapists, respectively.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "36",
        "text": "Section 66 of the principal enactment is hereby repealed and the following section is substituted therefor: -",
        "pre_block_list": [
          "Replacement of section 66 of the principal enactment Ayurveda pharmacist, Ayurveda nurse or Ayurveda massage therapist to be treated as duly qualified",
          "66. For the purposes of any written law, a registered Ayurveda pharmacist, Ayurveda nurse or Ayurveda massage therapist shall be deemed to be a legally or duly qualified Ayurveda pharmacist, Ayurveda nurse or Ayurveda massage therapist, respectively",
          "",
          "Ayurveda (Amendment)  Act, No. 19 of 2023 24",
          "Amendment of section 69 of the principal enactment"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "37",
        "text": "Section 69 of the principal enactment is hereby amended in subsection (2) thereof, by the substitution for the words special register of ayurvedic practitioners, of the words in the Special register of Ayurveda practitioners,.",
        "pre_block_list": [],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "38",
        "text": "Section 70 of the principal enactment is hereby repealed and the following section is substituted therefor: -",
        "pre_block_list": [
          "Replacement of section 70 of the principal enactment",
          "70. (1) Every registered Ayurveda pharmacist shall be entitled to manufacture Ayurveda medicines.",
          "Registered Ayurveda pharmacist, registered Ayurveda nurse or registered Ayurveda massage therapist entitled to manufacture or practice"
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "Every registered Ayurveda nurse shall be entitled to practise ayurveda nursing.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "Every registered Ayurveda massage therapist shall be entitled to practise Ayurveda massage techniques",
            "pre_block_list": [
              ""
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "39",
        "text": "Section 71 of the principal enactment is hereby amended as follows: -",
        "pre_block_list": [
          "Amendment of section 71 of the principal enactment"
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "in subsection (1) thereof, by the substitution for the words registered ayurvedic nurse, wherever those words appear in that subsection, of the words registered Ayurveda nurse or registered Ayurveda massage therapist,;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "by the repeal of subsection (2) thereof, and the substitution therefor, of the following subsection: -",
            "pre_block_list": [
              "(2) A person who is registered under section 10 as the proprietor of a registered Ayurveda hospital, herbal cultivation, Ayurveda pharmacy, herbarium, Ayurveda sale centre or Ayurveda store may, notwithstanding that he is not a registered",
              "Ayurveda (Amendment)  Act, No. 19 of 2023 25",
              "Ayurveda pharmacist, use, for the purposes of the business of such Ayurveda hospital, herbal cultivation, pharmacy herbarium, Ayurveda sale centre or stores, any name, title, addition, or description which may be used by a registered Ayurveda pharmacist, if-"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "he employs a registered Ayurveda pharmacist to personally superintend and manage the cultivation, distribution, sale or manufacturing of medicines, drugs or poisons at such Ayurveda hospital, herbal cultivation, pharmacy, herbarium, Ayurveda sale centre or Ayurveda store, as the case may be; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "the name of the pharmacist so employed has been notified in writing to the Council",
                "pre_block_list": [
                  ""
                ],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "40",
        "text": "Section 72 of the principal enactment is hereby amended by the substitution for the words ayurvedic pharmacist or ayurvedic nurse wherever those words appear in that section of the words Ayurveda pharmacist or Ayurveda nurse or Ayurveda massage therapist.",
        "pre_block_list": [
          "Amendment of section 72 of the principal enactment",
          "Amendment of section 77 of the principal enactment"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "41",
        "text": "Section 77 of the principal enactment is hereby amended as follows: -",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "by the repeal of subsection  (1) thereof and the substitution therefor, of the following:-",
            "pre_block_list": [
              "(1) Regulations may be made under this Act prescribing an Ayurveda Code containing all such provisions in respect of all such matters as the authority empowered to make such regulations may deem necessary to prohibit, regulate or control the manufacture, preparation, importation, exportation, purchase, storage, advertising, transportation, quality control, sale,",
              "Ayurveda (Amendment)  Act, No. 19 of 2023 26",
              "supply, distribution or dispensing of any article, substance or drug for the purpose of Ayurveda medicine and surgery. Such Code may, without prejudice to the generality of the powers hereinbefore conferred, make provision in respect of all or any of the following matters:-"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "the declaration of any article, substance or drug as a poison, poisonous substance or dangerous drug, as the case may be, for that purpose;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "the prohibition, regulation or control of, the  manufacture,  preparation, importation, exportation, purchasing, storing, advertising, transportation, quality control, sale, supply, or distribution of any Ayurveda product;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "the registration and maintenance of any herbal Garden for Research and Extension;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "the registration of or issuance of licences or permits for any herbal cultivation and for any related activity, including transportation and storing of crop;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "the introduction and operation of a system of registration, licensing or issuance of permits for the purpose of effecting such regulation or control, including, but not limited to, the making of application for such registration, licensing or issuance of permits, the grant, refusal, suspension and cancellation of such registration, licence or permit;",
                "pre_block_list": [
                  "Ayurveda (Amendment)  Act, No. 19 of 2023 27"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "the precautions to be taken, and the conditions to be complied with, in such herbal cultivation and in such manufacture, preparation, importation, exportation,  purchase,  storage, advertising, transportation, quality control, sale, supply, distribution or dispensing;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "g",
                "text": "the books and records to be kept and maintained, and the returns to be furnished, by persons engaged in such herbal cultivation and in such manufacture, preparation, importation, exportation,  purchase,  storage, advertising, transportation, quality control, sale, supply, distribution or dispensing;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "h",
                "text": "the inspection of the premises in which such herbal cultivation is carried out and in which such manufacture, preparation, importation, exportation, purchase, storage, advertising, transportation, quality control, sale, supply, distribution or dispensing is carried on, and of the records and books kept and maintained for that purpose;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "the charging of fees, where necessary, in respect of any matter referred to  in this section;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "j",
                "text": "the declaration of any medicinal plant which requires a licence or  permit for cultivation; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "k",
                "text": "any other matter incidental to or connected with the matters aforesaid.;",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "in subsection (2) thereof, by the substitution for the words the Prime Minister. of the words the President",
            "pre_block_list": [
              "",
              "Ayurveda (Amendment)  Act, No. 19 of 2023 28",
              "Amendment of section 79 of the principal enactment"
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "42",
        "text": "Section 79 of the principal enactment is hereby amended by the substitution for the words registered ayurvedic hospital, any registered ayurvedic pharmacy,, wherever those words appear in that section, of the words registered Ayurveda hospital, any registered Ayurveda pharmacy, any Ayurveda drug manufactory, any herbal cultivation,.",
        "pre_block_list": [
          "Replacement of section 80 of the principal enactment offences and penalties"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "43",
        "text": "Section 80 of the principal enactment is hereby repealed and the following section is substituted therefor: -",
        "pre_block_list": [
          "80.  (1) Any person who ",
          "( a ) resists or obstructs a person authorized in that behalf under this Act in the exercise by such person of any powers conferred on him by or under this Act;",
          "( b ) fails without reasonable cause, to comply with the requirements of a notice issued under this Act;",
          "( c ) knowingly makes any false statement in any return or information furnished by him under this Act; or",
          "( d ) willfully omits any material fact from any return or information furnished by him under this Act in respect of which he is required to furnish information,",
          "commits an offence under this Act and shall be liable on conviction after summary trial before a Magistrate, to a fine of not exceeding fifty thousand rupees  or to imprisonment of",
          "Ayurveda (Amendment)  Act, No. 19 of 2023 29",
          "either description, for a term not exceeding six months or to both such fine and imprisonment."
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "Any person who contravenes the provisions of this Act or any regulation made thereunder, while practicing Ayurveda under the Authority of a licence issued under this  Act, commits an offence under this Act  and shall be liable on conviction after summary trial before a Magistrate, to a fine of not exceeding one hundred thousand rupees or to imprisonment of either description, for a term not exceeding one year or to both such fine and imprisonment.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "Any person who commits an offence under section 79 of this Act, shall be liable on conviction after summary trial before a Magistrate, to a fine  not exceeding  one hundred thousand rupees or to imprisonment of either description, for a term not exceeding one year or to both such fine and imprisonment.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "4",
            "text": "Any person who-",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "carries  out any activity without a licence or permit for which a licence or permit is required under this Act; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "fraudulently displays a logo or a mark or a sign indicating that a premises, establishment, an article, a drug, substance or an Ayurveda product has a valid licence issued under this Act,",
                "pre_block_list": [
                  "commits an offence under this Act and shall be liable on conviction after summary trial before a Magistrate, to a fine not exceeding two hundred thousand rupees or to imprisonment of either description for a term not exceeding one year or to both such fine and imprisonment.",
                  "Ayurveda (Amendment)  Act, No. 19 of 2023 30"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "5",
            "text": "Any person who acts in contravention of any provision of this Act, (other than the provisions referred to in subsections (1), (2), (3) and (4) of this section) or any requirements imposed under any such provision, or any regulations made under the Act, shall be guilty of an offence under this Act and shall, on conviction after summary trial before a Magistrate, be liable",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "where such person is not a body corporate, to a fine not less than rupees five thousand and not exceeding rupees fifty thousand or to imprisonment of either description for a term not exceeding one year or to both such fine and imprisonment in the case of a first offence, and to a fine not less than rupees ten thousand and not exceeding rupees one hundred thousand or to an imprisonment of either description for a term not exceeding two years or to both such fine and imprisonment in the case of a subsequent offence ; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "where such person is a body corporate, to a fine not less than rupees fifty thousand and not exceeding rupees one million in the case of a first offence, and to a fine not less than rupees one hundred thousand and not exceeding rupees two million in the case of  a subsequent offence",
                "pre_block_list": [
                  ""
                ],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "44",
        "text": "Section 83 of the principal enactment is hereby amended by the substitution for the words pharmacy or nursing, of the words ayurveda drug manufacturing, nursing or Ayurveda massage therapy,.",
        "pre_block_list": [
          "Amendment of section 83 of the principal enactment",
          "Ayurveda (Amendment)  Act, No. 19 of 2023 31",
          "Amendment of section 89 of the principal enactment"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "45",
        "text": "Section 89 of the principal enactment is hereby amended as follows:-",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "by the repeal of the definition of the expression Ayurveda and the substitution therefor, of the following:-",
            "pre_block_list": [
              " Ayurveda includes the Ayurveda, Siddha, Unani and  Desiya Chikitsa systems of medicine and surgery and any other system of medicine indigenous to Asian countries and recognized as such by the Governments of such respective countries;;"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "by the insertion, immediately after the definition of the expression ayurveda pharmacy, the following new definition: -",
            "pre_block_list": [
              " Ayurveda Product means any Ayurveda article, substance or drug which is manufactured or refined for sale, and includes any locally manufactured or imported medicinal extract or fraction, a health supplement, a food supplement, a cosmeceutical, or a device;;"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "by the insertion, immediately after the definition of the expression dispensary, the following new definitions:-",
            "pre_block_list": [
              " Eastern University of Sri Lanka means the Eastern University of Sri Lanka established under Order made under section 21 of the Universities Act, No.16 of 1978 and published in the  Gazette  Extraordinary No. 420/25 of September 26, 1986;",
              "Ayurveda (Amendment)  Act, No. 19 of 2023 32",
              " Faculty of Indigenous Medicine  of the University of Colombo, Sri Lanka means the  Faculty of Indigenous Medicine  of the University of Colombo, Sri Lanka established by Order made under the Universities Act, No.16 of 1978 and published in the  Gazette Extraordinary No. 2319/22 of February 13, 2023;",
              "Gampaha Wickramarachchi University of Indigenous Medicine, Sri Lanka means the the Gampaha Wickramarachchi University of Indigenous Medicine, Sri Lanka established by Order made under the Universities Act, No.16 of 1978 and published in the  Gazette  Extraordinary No. 2199/12 of October 28, 2020;",
              "Herbal Cultivation means the cultivation of any medicinal plants for Ayurveda purposes as prescribed in the Ayurveda Code and shall include crop harvest or residual of such growth used for any commercial purposes;",
              "Herbal  Gardens for Research  and Extension means  a dedicated space devoted to grow medicinal plants for research purposes, either by the Department of Ayurveda or a person registered for such purposes under this Act;;"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "4",
            "text": "by the insertion, immediately after the definition of the expression Hospital of Indigenous Medicine, the following new definitions:-",
            "pre_block_list": [
              "Ayurveda (Amendment)  Act, No. 19 of 2023 33",
              " Medicinal plant means any plant which, in one or more of its organs, contain substances that can be used for thereputic purposes or which are precursors for the synthesis of useful drugs;",
              "Minister means the Minister  assigned the subject of Ayurveda under Article 44 or 45 of the Constitution;",
              "Primary Health Care means a whole-of-society approach to health that aims at ensuring the highest possible level of health and well-being  and  their  equitable distribution by focusing on people's needs and as early as possible along the continuum from health promotion and disease prevention to treatment, rehabilitation and palliative care, and as close as feasible to people's everyday environment;;"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "5",
            "text": "by the repeal of the definition of the expression register of Ayurveda practitioners and the substitution therefor, of the following:-",
            "pre_block_list": [
              " register of Ayurveda practitioners means the General register, or the Special register maintained by the Ayurveda Medical Council under this Act for the registration of Ayurveda practitioners, and includes any register which is deemed to be a General  register  of  Ayurveda practitioners or a Special register of Ayurveda practitioners under subsection (3) of section 51;;",
              "Ayurveda (Amendment)  Act, No. 19 of 2023 34"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "6",
            "text": "by the insertion, immediately after the definition of the expression registered ayurvedic practitioner, the following new definitions:-",
            "pre_block_list": [
              " Registered Ayurveda  massage therapist means any person registered as an Ayurveda massage therapist  under this Act;",
              "Register of Ayurveda  massage therapist means the register maintained by the Ayurveda Medical Council for the registration of Ayurveda massage therapist under this Act;",
              "University of Colombo, Sri Lanka means the University of Colombo, Sri Lanka established under section 139 of  the Universities Act, No.16 of 1978;",
              "University of Jaffna, Sri Lanka means the University of Jaffna, Sri Lanka established under section 139 of  the Universities Act, No.16 of 1978;."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "46",
        "text": "For the avoidance of doubt, it is hereby declared that the provisions of this Act shall not affect or be deemed to have affected any act previously done or any decision previously made under the principal enactment prior to the date of commencement of this Act.",
        "pre_block_list": [
          "Avoidance of doubt",
          "Sinhala text to prevail in case of inconsistency"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "47",
        "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
        "pre_block_list": [
          "Ayurveda (Amendment)  Act, No. 19 of 2023 35",
          "English Acts of the Parliament can be purchased at the P RAKASHANA  P IYASA , D EPARTMENT   OF G OVERNMENT  P RINTING , N O . 118, D R . D ANISTER  D E  S ILVA  M AWATHA , C OLOMBO  8."
        ],
        "child_level_list": []
      }
    ],
    "part_list": []
  }
}