{
  "n_pages": 9,
  "title_page": {
    "title": "Nation  Building  Tax   (Amendment) Act",
    "num": "20",
    "year": "2019",
    "date_certified": "2019-10-31",
    "date_published": "2019-11-01",
    "price": 12.0,
    "price_postage": 15.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 31St Of October, 2019]",
      "L.D.O. 9/2019",
      "A N  A Ct   To   Amend   The  N Ation  B Uilding  T Ax  A Ct , N O . 9  Of  2009",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Nation Building Tax (Amendment) Act, No. 20  of 2019, and shall be deemed to have come into operation on November 1, 2019, unless different dates of operation are specified hereunder.",
            "pre_block_list": [
              "Short title and date of operation."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "Section 3 of the Nation Building Tax Act, No. 9 of 2009 (hereinafter referred to as the principal enactment) as last amended by Act, No. 20 of 2018, is hereby further amended in subparagraph (12) of paragraph (iv) of subsection (2), by the substitution for the words importer himself.; and, of the words and figures importer himself, prior to November 1, 2019 ; and.",
            "pre_block_list": [
              "Amendment of section 3 of Act, No. 9 of 2009."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "Section 8 of the principal enactment is hereby repealed and the following new section is substituted therefor:",
            "pre_block_list": [
              "Replacement of section 8 of the principal enactment.",
              "8. (1) The provisions in sections 106, 107, 108 and 112 of Chapter XII relating to Returns etc, Chapter XXII relating to Assessments, Chapter XXIII relating to Appeals, Chapter XXIV relating to Finalty of Assessments and Penalty for Incorrect Returns, Chapter XXV relating to Tax in Default and Sums Added Thereto, Chapter XXVI relating to Recovery of Tax, Chapter XXVII relating to Miscellaneous, Chapter XXIX relating to Penalties and Offences, Section 209 of Chapter",
              "Certain provisions of the Inland Revenue Act to apply.",
              "XXX relating to Administration and Chapter XXXI on General matters, of the Inland Revenue Act, No. 10 of 2006, shall  mutatis muandis apply to the furnishing of returns, assessments, appeal against assessments, finality of assessments and penalty for incorrect returns, tax in default and sums added thereto, recovery of tax, miscellaneous, penalties and offences, administration and general metters under this Act, for the period prior to April 1, 2018."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The provisions in Chapter IX, X, XI, XII, XIII, XV, XVI, XVII, XVIII and XIX of the Inland Revenue Act, No. 24 of 2017 relating to Administration, Record Keeping and Information Collection, Tax Returns, Assessments, Objection and Appeals, Interest, recovery of Tax, Penalties, Criminal Proceedings and Regulations, respectively shall  mutatis mutandis  apply to administration, record keeping and information collection, tax returns assessements, objection and appeals, interest, recovery of tax, penalties,  criminal proceedings and regulations, respectively under this Act, for any period commencing on or after April 1, 2018, subject to provisions of subsection (3).",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Provisions of precceding subsections (1) and (2) shall apply subject to following modifications:",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "every reference to the year of assessment in any such provision of the Inland Revenue Act, shall be deemed to be a reference to the relevant quarter in this Act;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "every reference to assessable income or taxable income in any such provision",
                    "pre_block_list": [
                      "of the Inland Revenue Act, shall be deemed to be a reference to the liable turnover in this Act;"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "every reference to income tax in any such provision of the Inland Revenue Act, shall be deemed to be a reference to the tax charged and levied in terms of the provisions of this Act;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "return for any relevant quarter under this Act shall be furnished on or before the twentieth  day  of  the  month commencing immediately after the expiry of such quater; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "no assessment or additional assessment shall be made under this Act in respect of any person",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "who has furnished a return for the relevant quarter in the year of assessment on or before the date referred to in paragraph ( d ) of this subsection, after the expiry of eighteen months for any period prior to April 1, 2018 and after the expiry of thirty months for any period commencing on or after April 1, 2018 from the thirtieth day of November of the year of assessment immediately succeeding the year of assessment in which such relevant quarter falls; or",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "who has failed to furnish a return on or before such date as is referred to in paragraph ( d ) of this subsection, after the expiry",
                        "pre_block_list": [
                          "of four years from the thirtieth day of November of the year of assessment immediately succeeding the year of assessment within which such relevant quarter falls",
                          ""
                        ],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "Section 10 of the principal enactment as last amended by Act, No. 12 of 2015 is further amended by the repeal of the definition of expression Inland Revenue Act and substitute therefor of the following new definition:",
            "pre_block_list": [
              "Amendment of section 10 of the principal enactment.",
              " Inland Revenue Act means"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "for any period prior to April 1, 2018, the Inland Revenue Act, No. 10 of 2006; and",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "for any period on or after April 1, 2018, the Inland Revenue Act, No. 24 of 2017;.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "The First Schedule to the principal enactment as last amended by Act, No. 20 of 2018 is hereby further amended as follows:",
            "pre_block_list": [
              "Amendment of the First Schedule to the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "in PART I of that Schedule",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "in item (XLIX) thereof, by the substitution for the words cigarettes identified, of the words and figures for any period commencing prior to November 1, 2019, cigarettes identified;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "by the substitution for item (LIV) thereof, of the following item:",
                    "pre_block_list": [
                      "(LIV) importation of gem stones by a person registered with the National Gem and Jewellery Authority, for the purpose of",
                      "re-exporting such gems upon being cut and polished and if the payment for such service of cut and polish is made in foreign currency and remitted to Sri Lanka through a bank;;"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "in item (LV) thereof, by the substitution for the words the subject of Agriculture., of the words the subject of Agriculture;;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "by the insertion immediately after item (LV) thereof, of the following new items:-",
                    "pre_block_list": [
                      "(LVI) palm oil manufactured locally out of imported crude palm oil or imported palm olein subjected to the Special Commodity Levy charged under the Special Commodity Levy Act, No. 48 of 2007;",
                      "(LVII) importation of Lucerne (alfalfa) meal and pellets;",
                      "(LVIII) importation of yachts and other vessels for pleasure or sports, rowing boats and canvas as classified under the Harmonized Commodity Description and Coding Numbers 8903.91.00; and",
                      "(LIX) importation of any project related article by an enterprise which has entered into an agreement with the Board of Investment of Sri Lanka under section 17 of the Board of",
                      "Investment of Sri Lanka Law, No. 4 of 1978, for the use in any project of such enterprise having a capital investment of not less than fifty million United States Dollars during the project implementation period and prior to the commencement of commercial operations",
                      ""
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "in PART II of that Schedule",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "in item (vii) thereof",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "in paragraph ( c ), by the substitution for the words a construction contractor or a sub-contractor, of the following:",
                        "pre_block_list": [
                          "a construction contractor or a sub-contractor; or;"
                        ],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "by the insertion immediately after paragraph ( c ) thereof, of the following:",
                        "pre_block_list": [
                          "( d ) on or after November 1, 2019, of a construction contractor or a sub- contractor; and"
                        ],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "by the  substitution for item (xii) thereof, of the following item:",
                    "pre_block_list": [
                      "(xii) services provided by a hotel, guest house, restaurant or other similar business",
                      "( a ) prior to January 1, 2011; or",
                      "( b ) on or after November 1, 2019, where the payment for such service is received in  foreign  currency through  a  bank  in Sri Lanka,",
                      "where such hotel, guest house, restaurant or other similar business is registered with the Ceylon Tourist Board;."
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency.",
              "English Acts of the Parliament can be purchased at the P RAKASHANA  P IYASA , D EPARTMENT   OF G OVERNMENT  P RINTING , N O . 118, D R . D ANISTER  D E  S ILVA  M AWATHA , C OLOMBO  8."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}