{
  "n_pages": 21,
  "title_page": {
    "title": "Act",
    "num": "44",
    "year": "2011",
    "date_certified": "2011-11-21",
    "date_published": "2011-11-25",
    "price": 13.0,
    "price_postage": 15.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 21St November, 2011]",
      "L.D.O. 39/2010.",
      "A N  A Ct   To   Provide   For   The   Establishment   Of   A  N Ational  P Olice A Cademy ;  To   Identify   The   Objective   And   Functions   Of ,  And   To",
      "Provide   For   The   Management   And   Administration   Of   The N Ational  P Olice  A Cademy ;  And   To   Provide   For   Matters",
      "Connected   Therewith   Or   Incidental   Thereto .",
      "Be It Therefore Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the National Police Academy Act, No. 44 of 2011.",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "I",
        "text": "",
        "pre_block_list": [
          "E STABLISHMENT   OF   THE  N ATIONAL  P OLICE  A CADEMY"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be established an academy, which shall be called the National Police Academy (hereinafter referred to as the Academy).",
                "pre_block_list": [
                  "Establishment of the National Police Academy."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Academy shall, by the name assigned to it by subsection (1) be a body corporate and shall have perpetual succession and a common seal and may sue and be sued in such name.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "The Secretary to the Ministry of the Minister assigned the administration of the Police Department, shall be charged with the responsibility of ensuring the efficient management and administration of the Academy in order to achieve the objective for which the Academy is established.",
            "pre_block_list": [
              "The Academy to be the responsibility of the Secretary to the Ministry of the Minister assigned the administration of the Police Department."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "The objective of the Academy shall be to develop the professional knowledge and skills of police officers and other law-enforcement officers selected for training at the",
            "pre_block_list": [
              "Objective of the Academy.",
              "2PL 0062604,090 (09/2011)",
              "National Police Academy Act, No. 44 of 2011 2",
              "Academy in order to prepare and equip them for appointment to appropriate positions in their respective professions."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "The functions of the Academy shall be to",
            "pre_block_list": [
              "Functions of the Academy."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "provide advanced training and education on policing, law-enforcement and related subjects to student officers;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "conduct research and studies on issues directly related to policing and law-enforcement; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "disseminate and share professional knowledge on policing and law-enforcement for the benefit of those concerned through relevant programmes and publications.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Academy shall have the power to do all such acts as may be necessary for the discharge of any or all  of its functions specified in section 5 of this Act.",
                "pre_block_list": [
                  "Powers of the Academy."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Without prejudice to the generality of the powers conferred on it by subsection (1), the Academy may",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "admit student officers to follow the courses of study at the Academy;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "levy such fees, where necessary, from student officers as are prescribed;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "conduct examinations for the purpose of evaluating the proficiency of student officers admitted for selected courses of study;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "issue certificates and grant and confer the post- nominal title npa (national police academy) on student officers on the successful completion of the courses of study;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "award, subject to the approval of the relevant educational authorities, diplomas, certificates and other academic distinctions on subjects related to policing and law-enforcement;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "affiliate to any University, subject to the approval of the University Grants Commission and the relevant local or foreign University;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "g",
                    "text": "publish and disseminate journals and similar documents to facilitate the functions of the Academy;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "h",
                    "text": "conduct research programmes on policing and law- enforcement to facilitate the functions of the Academy;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "i",
                    "text": "erect, equip and maintain for the purposes of the Academy, libraries, laboratories and other buildings;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "j",
                    "text": "create lectureship and other posts as may be required for the efficient functioning of the Academy;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "k",
                    "text": "appoint such employees and agents as are necessary for the administration of the affairs of the Academy;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "l",
                    "text": "receive grants, gifts or donations, whether from local or foreign sources;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "m",
                    "text": "borrow or raise money for the purpose of the Academy in such manner and upon such security as the Board may think fit;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "n",
                    "text": "take or hold any movable or immovable property which may become vested in it by this Act or by virtue of any purchase, grant, gift, testamentary",
                    "pre_block_list": [
                      "National Police Academy Act, No. 44 of 2011 4",
                      "disposition or otherwise, and to sell, mortgage, lease, grant, convey, devise, assign, exchange or otherwise dispose of any such movable or immovable property;"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "o",
                    "text": "enter into and perform or carry out, whether directly or through any officer or agent authorised in that behalf by the Academy, all such contracts or agreements as may be necessary for the attainment of the objectives of the Academy; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "p",
                    "text": "invest its funds in such a manner as the Board may think fit.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "II",
        "text": "",
        "pre_block_list": [
          "B OARD   OF  M ANAGEMENT   OF   THE  A CADEMY"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The management and the administration of the affairs of the Academy shall be vested in a Board of management (in this Act referred to as the Board) which shall consist of",
                "pre_block_list": [
                  "Constitution of the Board of Management of the Academy."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the following  ex-officio  members, namely",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "the Secretary to the Ministry of the Minister assigned the administration of the Police Department who shall be the Chairman;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "a senior official of the rank of Deputy Secretary to the Treasury nominated by the Secretary to the Ministry of the Minister to whom the subject of Finance is assigned;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "an Additional Secretary to the Ministry of the Minister assigned the administration of the Police Department, nominated by the Secretary;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iv",
                        "text": "the Inspector-General of Police; and",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "v",
                        "text": "the Executive Director of the Academy appointed under section 13;",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "two members appointed by the Minister in consultation with the Secretary; having proven ability in the fields of national security, public security, law, and public administration.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Chairman shall preside at all meetings of the Board and in the absence of the Chairman from any such meeting of the Board, a person from among members of the Board referred to in subparagraph (ii) of paragraph ( a ) of subsection (1) and subparagraph (iii) of paragraph (a) of subsection (1) and paragraph (b) of subsection (1), who has been duly nominated by the Chairman, shall preside at any such meeting.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Principal Administrative Officer of the Academy shall function as Secretary to the Board.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The seal of the Academy shall be in the custody of such person as the Board may decide from time to time.",
                "pre_block_list": [
                  "Seal of the Academy."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The seal of the Academy may be altered in such manner as may be determined by the Board.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The seal of the Academy shall not be affixed to any instrument or document except in the presence of the Chairman and one other member of the Board, both of whom shall sign the instrument or document in token of their presence:",
                "pre_block_list": [
                  "Provided that where the Chairman is unable to be present at the time when the seal of the Academy is affixed to any instrument or document, any other member of the Board authorised in writing by the Chairman in that behalf, shall be competent to sign such instrument or document in accordance with the preceding provisions of this subsection."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The Academy shall maintain a register of all instruments or documents to which the seal of the Academy is affixed.",
                "pre_block_list": [
                  "National Police Academy Act, No. 44 of 2011 6"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "The Academy shall consist of such Branches as are from time to time deemed necessary, by the Board.",
            "pre_block_list": [
              "Branches within the Academy."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "10",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Subject to the other provisions of this Act, the Board may regulate its procedure in regard to the meetings of the Board and the transaction of business at such meetings.",
                "pre_block_list": [
                  "Meetings and quorum at meetings of the Board."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Five members shall form a quorum at any meeting of the Board.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "11",
            "text": "No act, decision or proceeding of the Board shall be invalidated by reason only of the existence of a vacancy among its members or any defect in the appointment of its members.",
            "pre_block_list": [
              "Vacancy among members not to invalidate proceedings of the Board."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "12",
            "text": "The Board shall as soon as may be practicable, submit through the Secretary to the Ministry of the Minister to whom the administration of the Police Department is assigned the annual estimates or supplementary estimates, as the case may be, to the Treasury for the purpose of securing the necessary budgetary allocation for the Academy.",
            "pre_block_list": [
              "Annual estimates."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "III",
        "text": "",
        "pre_block_list": [
          "S TAFF   OF   THE  A CADEMY"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "13",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be appointed by the Minister a person to be the Executive Director of the Academy (hereinafter referred to as the Executive Director) who shall be a qualified senior officer holding the rank of Senior Deputy Inspector General of Police or Deputy Inspector General of Police.",
                "pre_block_list": [
                  "The Executive Director."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Executive Director shall hold office for a period of three years from the date of his appointment and shall be eligible for reappointment, unless he vacates his office earlier by retirement, death, resignation or removal.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Executive Director may resign his office as Executive Director by written communication in that behalf addressed to the Minister, forwarded through the Secretary to the Ministry of the Minister to whom the administration of the Police Department is assigned.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The Minister may, if he thinks it expedient to do so, by Order published in the  Gazette , remove the Executive Director from office for reasons assigned.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "The Executive Director, in respect of whom an Order under subsection (4) is made, shall vacate is office on the date of publication of such Order in the  Gazette , or on such other date as may be specified in such Order.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "In the event of the person appointed as Executive Director",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "vacating his office or ceasing to be a member of the Police Department of which he was a member prior to the expiry of his term of office as Executive Director, the Minister shall having regard to the provisions of subsection (1), appoint a qualified officer as Executive Director, and he shall, unless he earlier vacates office, hold office for a period of three years from the date of his appointment and shall be eligible for reappiontment; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "being temporarily unable to discharge the functions of his office by reason of ill health, absence from Sri Lanka or any other reason, the Minister shall having regard to the provisions of subsection (1), appoint the person holding the position of Principal Administrative Officer of the Academy, to act in his place as Executive Director during such period.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "14",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Executive Director shall, subject to the general direction and control of the Board, be charged with the direction of the affairs of the Academy and the discharge of the functions of the Academy. He shall also be charged with the overall administrative and disciplinary control of the employees and student officers of the Academy.",
                "pre_block_list": [
                  "Duties of the Executive Director."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Executive Director may in writing, with the approval of the Board, delegate to any employee of the Academy such of his duties as he may from time to time",
                "pre_block_list": [
                  "National Police Academy Act, No. 44 of 2011 8",
                  "consider necessary. Any employee to whom such functions are so delegated shall exercise them subject to the general or special direction of the Executive Director. Notwithstanding such delegation it shall be competent for the Executive Director, where necessary, to continue to discharge such functions."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Executive Director may in consultation with the Board decide on the medical, welfare and recreational facilities to be provided for student officers by the Academy.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The Executive Director may take necessary measures for the security and the protection of the Academy with the approval of the Board.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "15",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Board shall appoint  an officer holding the rank of Deputy Inspector General of Police or Senior Superintendent of Police to serve as the Principal Administrative Officer of the Academy for such period as may be determined by the Board.",
                "pre_block_list": [
                  "The Principal Administrative Officer of the Academy."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Principal Administrative Officer of the Academy shall be responsible to the Executive Director for supervising, coordinating and facilitating the affairs of the Academy in accordance with instructions issued by the Executive Director for that purpose.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "16",
            "text": "The Board may, subject to the provisions of this Act",
            "pre_block_list": [
              "Appointment and conditions of the staff of the Academy."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "appoint such officers and servants as it considers necessary for the discharge of the functions of the Academy and formulate policies to exercise disciplinary control over, or dismiss, such officers or servants;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "fix the rates at which such officers and servants shall be remunerated;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "determine the terms and conditions of service of such officers or servants; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "establish and regulate provident funds or schemes, where applicable, for the benefit of such officers or servants and make contributions to any such funds or schemes.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "17",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "At the request of the Board, any officer in the public service may, with the consent of that officer and of the Secretary to the relevant Ministry, be temporarily appointed to the staff of the Academy for such period as may be determined by the Board, or with like consent be permanently appointed to such staff.",
                "pre_block_list": [
                  "Appointment of public officers etc. to the staff of the Academy."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where any officer in the public service is temporarily appointed to the staff of the Academy the provisions of subsection (2) of section 14 of the National Transport Commission Act, No. 37 of 1991 shall,  mutatis mutandis, apply to and in relation to him.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where any officer in the public service is permanently appointed to the staff of the Academy the provisions of subsection (3) of section 14 of the National Transport Commission Act, No. 37 of 1991 shall,  mutatis mutandis, apply to and in relation to him.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where the Academy employs any person who has entered into a contract with the Government to serve the Government for a specified period, any period of service to the Academy by such person shall be regarded as service to the Government, for the purpose of discharging the obligations of such contract.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "At the request of the Board, any officer or servant of any Higher Educational Institution may, with the consent of such officer or servant and the principal executive officer of that Higher Educational Institution, be temporarily appointed  to the staff of the Academy for such period as may be determined by the Board or with like consent be permanently appointed to such staff, on such conditions, including those relating to pension and provident fund rights, as may be agreed upon by the Board and such principal executive officer.",
                "pre_block_list": [
                  "National Police Academy Act, No. 44 of 2011 10"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "Where any officer or servant of any Higher Educational Institution is temporarily appointed to the staff of the Academy, he shall be subject to the same disciplinary control as any other member of such staff.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "IV",
        "text": "",
        "pre_block_list": [
          "T HE  B OARD   OF  S TUDIES   AND   THE  B OARD   OF  D ISCIPLINE   OF   THE A CADEMY"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "18",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The affairs of the Academy relating to academic and professional studies shall be vested in the Board of Studies. The Board of Studies shall consist of",
                "pre_block_list": [
                  "The Board of Studies of the Academy."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the Executive Director;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the Principal Administrative Officer of the Academy;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "two persons nominated by the Board;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "a representative nominated by the Vice-Chancellor of the University to which the Academy may be affiliated; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "the heads of various Branches in the Academy.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Board of Studies shall discharge the functions assigned to, or conferred on it, subject to the general direction and control of the Board and any rules which may be made in that behalf by the Board.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Board of Studies shall have control and general direction over the instruction, training, research and examination of the Academy.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The Board of Studies shall be charged with the exercise, performance and discharge of the following powers, duties and functions:",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "to identify and recommend to the Board, the courses of  study and the curricula of such courses which are to be offered by the Academy;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "to decide on the degrees, diplomas, certificates and other academic distinctions which shall be awarded for the courses of study offered at the Academy;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "to identify the training to be followed, the examinations to be passed and the other conditions to be satisfied by students who wish to qualify for such degrees, diplomas, certificates and other academic distinctions;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "to consider and report on any matter referred to it by the Board;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "to present recommendations and reports to the Board on matters connected with the courses of study, teaching programmes, research programmes or examinations being conducted by the Academy;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "to appoint committees, which may include persons not being members of the Board of Studies for the purpose of considering and reporting on any special subject or subjects;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "g",
                    "text": "to recommend to the Board",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "the requirements for the admission of students to courses of study and examination;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "the persons who are suitable for recognition as teachers or examiners;",
                        "pre_block_list": [
                          "National Police Academy Act, No. 44 of 2011 12"
                        ],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "the persons who, having passed the prescribed examinations and having satisfied other prescribed conditions, are eligible for the award of diplomas, certificates and other academic distinctions;",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "h",
                    "text": "to identify the mode and conditions of competition for fellowships, scholarships, exhibitions, bursaries, medals and other prizes; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "i",
                    "text": "to name the persons suitable for the award of fellowships, scholarships, exhibitions, bursaries, medals and other prizes.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "19",
            "text": "The Board shall, in consultation with the Executive Director, appoint a Board of Discipline consisting of the following",
            "pre_block_list": [
              "Board of Discipline."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "the Principal Administrative Officer of the Academy; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "any other officers who in the opinion of the Executive Director is required for the effective settlement of the particular misconduct.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "20",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Every student officer shall be subject to the Code of Discipline of the Academy. The Code of Discipline shall be as prescribed by regulations.",
                "pre_block_list": [
                  "Code of Discipline and application of the code."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any student officer found to be in breach of such Code or who is found guilty of any breach by the Board of Discipline, may on recommendation being made by the Board of Discipline to the effect that the conduct of the student officer is not conducive to the best interest of the Academy, be liable to be withdrawn from the course of study, by the Executive Director.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every act of misconduct of student officers shall be reported to the respective Head of Institution of such officer",
                "pre_block_list": [
                  "by the Executive Director in order that disciplinary action as is deemed necessary in terms of the respective laws and regulations applicable to such institution, be initiated."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Any student officer who is found to be responsible for causing damage to government property, wilfully or negligently, shall be liable to indemnify the Academy for such damage.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "21",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The disciplinary control of the staff of the Academy shall be exercised by the Executive Director or any other officer of the Academy, authorised in that behalf by the Executive Director.",
                "pre_block_list": [
                  "Disciplinary control of the staff of the Academy."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The maintenance of disciplinary control of the staff of the Academy shall be in accordance with the procedure as specified by rules made by the Board.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "V",
        "text": "",
        "pre_block_list": [
          "F INANCE"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "22",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be established a Fund called the National Police Academy Fund (hereinafter referred to as the Fund).",
                "pre_block_list": [
                  "Fund of the Academy."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Board shall have the power to manage, control and operate the Fund.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "23",
            "text": "There shall be paid into the Fund",
            "pre_block_list": [
              "Payment into the Fund."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "all such sums of money as may be voted from time to time by Parliament for the management and administration of the Academy;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "all such sums of money as may be received by the Academy by way of donations, gifts or grants from any source whatsoever, whether within or outside Sri Lanka;",
                "pre_block_list": [
                  "National Police Academy Act, No. 44 of 2011 14"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "all moneys received by way of fees in respect of the courses of study being provided by the Academy; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "all such sums of money as may be received by the Academy in the exercise, performance and discharge of its powers, duties and functions.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "24",
            "text": "There shall be paid out of the Fund",
            "pre_block_list": [
              "Payment out of the Fund."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "expenses necessary for the establishment, working and maintenance of the Academy;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "the payment of fees to the visiting lecturers; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "all such other payments as are approved by the Board as being necessary for the purpose of carrying out the objective of the Academy.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "25",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Board shall direct the Accountant appointed in terms of section 26, to keep proper books of accounts and accounts of all income and expenditure, assets and liabilities and all other financial transactions of the Academy.",
                "pre_block_list": [
                  "Audit of Accounts."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The provisions of Article 154 of the Constitution relating to the audit of accounts of public corporations shall apply to the audit of accounts of the Academy.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The financial year of the Academy shall be the calendar year.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The annual accounts of the Academy shall be prepared by the Accountant who shall cause the same to be forwarded to the Board through the Executive Director.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "26",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Board shall appoint an Accountant for the Academy.",
                "pre_block_list": [
                  "Appointment of an Accountant."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Accountant shall be responsible to the Executive Director of the Academy for the administration and control of the Fund of the Academy established under section 22 of this Act and the other financial matters of the Fund.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "27",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "All student officers and the staff of the Academy shall be entitled to such emoluments and allowances as may be stipulated in the relevant institutional pay regulations applicable to them.",
                "pre_block_list": [
                  "Payment of emoluments."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "All personnel in the Academy referred to above shall be entitled to any additional allowances as may be paid to those appointed to training establishments presently under their respective institutions.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "All personnel of the Academy referred to above may in addition be entitled to such other additional allowances as may be determined by the Board from time to time with the concurrence of the Minister in charge of the subject of Finance.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The period of training of a student officer in the Academy shall be deemed to be reckonable service for the purpose of pension, gratuity and allowances.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "28",
            "text": "The Board may with the concurrence of the Minister and the Minister in charge of the subject of Finacne, borrow such sums of money as may be necessary to effectively discharge the functions assigned to it.",
            "pre_block_list": [
              "Borrowing powers of the Board."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "VI",
        "text": "",
        "pre_block_list": [
          "G ENERAL"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "29",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Board may make rules in respect of the courses of study to be provided for student officers by the Academy on the recommendation of the Executive Director.",
                "pre_block_list": [
                  "Board to make rules.",
                  "National Police Academy Act, No. 44 of 2011 16"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "30",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Minister may make regulations for the purpose of giving effect to the principles and provisions of this Act and in respect of matters required by this Act to be prescribed or in respect of which regulations are authorised or required to be made.",
                "pre_block_list": [
                  "Regulations."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Without prejudice to the generality of the powers conferred by subsection (1), the Minister may make regulations in respect of all or any of the following matters",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the management and administration of the affairs of the Academy;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "setting out the Code of Discipline;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "any other matter which is to be or may be prescribed or in respect of which this Act makes no provision or makes insufficient provision which in the opinion of the Minister, is necessary for the proper implementation of this Act.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every regulation made by the Minister shall be published in the  Gazette  and shall come into operation on the date of such publication or on such later date as may be specified in the regulations.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Every regulation made by the Minister shall, as soon as convenient after its publication in the  Gazette , be brought before Parliament for approval. Any regulation which is not so approved shall be deemed to be rescinded as from the date of such disapproval, but without prejudice to anything previously done thereunder.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Notification of the date on which any regulation is deemed to be rescinded shall be published in the  Gazette .",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "31",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "No suit or prosecution shall lie",
                "pre_block_list": [
                  "Protection for action taken under this Act or on the direction of the Academy."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "against the Academy for any act which in good faith is done or purported to be done by the Academy under this Act; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "against any member, officer, servant or agent of the Academy for any act which in good faith is done or purported to be done by him under this Act or on the direction of the Academy.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any expenses incurred by the Academy in any suit or prosecution brought by or against the Academy and any costs paid to, or recovered by the Academy in any such suit or prosecution shall be credited to the Fund.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Any expenses incurred by any such person as is referred to in subsection (1) of this section in any suit or prosecution brought against him before any court in respect of any act which is done or purported to be done by him under this Act or on the diretion of the Academy shall, if the court holds that such act was done in good faith, be paid out of the Fund, unless such expense is recovered by him in such suit or prosecution.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "32",
            "text": "The members of the Board and all officers and servants of the Academy shall be deemed to be public officers within the meaning and for the purpose of the Penal Code.",
            "pre_block_list": [
              "Members of the Board and officers and servants of the Academy deemed to be public officers."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "33",
            "text": "The Academy shall be deemed to be a Scheduled Institution within the meaning and for the purpose of the Bribery Act and the provisions of such Act shall be construed accordingly.",
            "pre_block_list": [
              "Academy deemed to be a Scheduled Institution within the meaning of the Bribery Act.",
              "National Police Academy Act, No. 44 of 2011 18",
              "Provisions of Act, No. 16 of 1978 not to apply."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "34",
            "text": "The provisions of the Universities Act, No. 16 of 1978, shall not apply to, or in relation to, the Academy established by this Act.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "35",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Interpretation."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "36",
            "text": "In this Act unless the context otherwise requires",
            "pre_block_list": [
              "Branch means a section of the Academy that is responsible for conducting specialised training pertaining to a particular subject or field;",
              "Higher Educational Institution means a University, Campus, Open University or University College established or deemed to be established under the Universities Act, No. 16 of 1978;",
              "law-enforcement officers mean an officer of any organisation that is statutorily vested with the responsibility of enforcing laws assigned to them;",
              "Police Department means the Sri Lanka Police Department established under the Police Ordinance, (Chapter II);",
              "principal executive officer in relation to"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "a University, means the Vice-Chancellor of  that University;",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "an Open University, means the Vice-Chancellor of that Open University; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iii",
                    "text": "a University College, means the Director of that University College; and",
                    "pre_block_list": [
                      "student officers mean and include officers from the Police Department, public officers, officers of other law-enforcement agencies of Sri Lanka and officers from police services and law-enforcement agencies outside Sri Lanka who are admitted to the Academy for training and education.",
                      "National Police Academy Act, No. 44 of 2011 20",
                      "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , D EPARTMENT   OF G OVERNMENT  I NFORMATION , N O . 163, K IRULAPONA  M AWATHA , P OLHENGODA , C OLOMBO  05 before 15th December each year in respect of the year following ."
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}