{
  "n_pages": 11,
  "title_page": {
    "title": "Budgetary Relief Allowance Of Workers Act",
    "num": "36",
    "year": "2005",
    "date_certified": "2005-10-18",
    "date_published": "2005-10-21",
    "price": 9.5,
    "price_postage": 5.0
  },
  "body_pages": {
    "preamble": [
      "Budgetary Relief Allowance Of Workers Act, No. 36 Of 2005 1",
      "[Certified On 18Th October, 2005]",
      "L.D.O. 17/2005.",
      "A N  A Ct   To   Provide   For   The   Payment   Of   A  B Udgetary  R Elief A Llowance   By   Employers   To   Workers   And   For   Matters",
      "Connected   Therewith   Or   Incidental   Thereto",
      "Be It Therefore Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "This Act may be cited as the Budgetary Relief Allowance of Workers Act, No. 36  of 2005.",
                "pre_block_list": [
                  "Short title."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The provisions of this Act shall be deemed for all purposes to have come into operation on August 1, 2005.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Commissioner shall be the Competent Authority for the purposes of this Act.",
                "pre_block_list": [
                  "Competent Authority."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Competent Authority may delegate to any officer of the Department of Labour any power, function or duty conferred or imposed on, or assigned to, such authority by this Act.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "With effect from August 1, 2005 every employer in any trade shall in respect of each month pay to every worker employed by him, a Budgetary Relief Allowance (hereinafter referred to as the allowance), calculated on the following basis :",
                "pre_block_list": [
                  "Payment of budgetary allowance."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "in the case of a worker whose monthly remuneration is rupees twenty thousand or below, the allowance payable shall be one thousand rupees :",
                    "pre_block_list": [
                      "Provided however, that in the case of a worker who for any reason other than the failure of the employer to provide work for such worker, does not work for the required number of days as prescribed by any written law or contract of employment, the",
                      "Budgetary Relief Allowance of Workers Act, No. 36 of 2005 2",
                      "allowance payable to such worker shall be in proportion to the number of days he has worked during such month but shall not exceed one thousand rupees ;"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "in the case of a worker who is paid a daily rate, the allowance payable shall be a sum of forty rupees per day for each day he has worked during the month :",
                    "pre_block_list": [
                      "Provided however, the total allowance payable for a month shall not exceed one thousand rupees ; and"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "in the case of a worker who is employed on a piece- rate basis, the allowance payable in respect of a month shall be not less than ten  per centum  of the wages or salary payable to such worker for that month :",
                    "pre_block_list": [
                      "Provided however, the total allowance payable for a month shall not exceed one thousand rupees."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "A worker whose wages or salary for a month exceeds twenty thousand rupees but does not exceed twenty one thousand rupees, shall in respect of each month be paid as allowance an amount equivalent to the difference between twenty one thousand rupees and the amount drawn by such worker as wages or salary for that month.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "A worker who has received a wage or salary increase during the month of October 2004 or thereafter, shall be entitled to an allowance under subsection (1) taking into consideration the amount equivalent to the difference between one thousand rupees and the amount of such wage or salary increase.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "A worker who is covered by",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "a Collective Agreement ; or",
                    "pre_block_list": [
                      "Budgetary Relief Allowance of Workers Act, No. 36 of 2005 3"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "an Order under subsection (2) of section 10 of the Industrial Disputes Act (Chapter 131), extending the application of a Collective Agreement in respect of such worker,",
                    "pre_block_list": [
                      "shall not be entitled to an allowance under subsection (1)."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "The Minister may, taking into consideration the relevant economic conditions prevailing in relation to any trade, defer by Order published in the  Gazette , the operation of the provisions of this section in relation to any trade specified in such Order, to such date as may be specified therein :",
                "pre_block_list": [
                  "Provided that, any deferment in terms of this subsection shall not extend beyond a period of six months from the date of the making of such Order."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "Every worker who has been employed by any employer subject to the provisions of section 3, for so long as he continues to be a worker of such employer, continue to be so employed on such terms and conditions relating to wages or salary, allowances or other payments in money by whatsoever name or designation as are not less favourable than those which such worker had enjoyed on the day immediately prior to the date of the coming into operation of this Act.",
            "pre_block_list": [
              "Special provisions regarding continuation of employment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The employer of a worker in any trade shall from and after the date of the coming into operation of this Act, maintain and keep in the premises in which that trade is carried on, a register setting out",
                "pre_block_list": [
                  "Duty of the employer to maintain register."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the name of each worker employed by him ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the class of work performed by each worker employed by him ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "the amount paid to each such worker as allowance in accordance with the provisions of this Act.",
                    "pre_block_list": [
                      "Budgetary Relief Allowance of Workers Act, No. 36 of 2005 4"
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every register maintained under subsection (1), shall be preserved for a period of six years by the employer. Every employer shall when required by the Commissioner, produce such register for inspection or furnish a true copy thereof or permit a copy of such to be made.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "The competent authority shall have power",
            "pre_block_list": [
              "Powers of competent authority."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "to enter and inspect at all reasonable hours of the day or night at any place in which workers in any trade are employed, for the purpose of examining any register or for ascertaining whether the provisions of this Act are being complied with ; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "where no such register is available for examination when he inspects such place, to require the production of such register on a specified later date for examination at such place or at the office of such authority ; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "to take copies of the whole or any part of any such register ; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "to question any person whom he finds in such place and whom he has reasonable cause to believe is an employer of workers employed in any trade carried on in such place ; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "to direct, in writing, any employer of workers employed in any trade to furnish him on or before a specified date, with",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "i",
                    "text": "a return, relating to all workers employed by any such employer in any specified class or description of such workers and containing such other particulars as he may require for the purposes of this Act ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "such information or explanation as he may require in respect of particulars stated in any return furnished by any such employer ; or",
                    "pre_block_list": [
                      "Budgetary Relief Allowance of Workers Act, No. 36 of 2005 5"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iii",
                    "text": "a true copy of the whole or any part of any register maintained by any such employer.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "Any person who",
            "pre_block_list": [
              "Offences and penalties."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "fails to furnish the competent authority with such assistance as is necessary for any entry or inspection or for the exercise of his powers under section 6 ; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "hinders or obstructs such authority in the exercise of the powers conferred by that section ; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "refuses to produce any register or furnish any information which such authority requires him to produce or furnish ; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "makes or causes to be made in any register, any false statement or makes or causes or knowingly permits to be produced, any register containing a false statement to such authority, knowing the same to be false ; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "furnishes any information to such authority acting under the powers conferred by that section, knowing the same to be false ; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "fails to comply with any directions given by such authority under section 6, or who, when called upon to furnish a return under that section, knowingly, makes or furnishes, or causes to be made or furnished, a return containing any false statement,",
                "pre_block_list": [
                  "shall be guilty of an offence and shall be liable on conviction before a Magistrate to a fine not exceeding ten thousand rupees or to imprisonment of either description for a term not exceeding six months or to both such fine and imprisonment."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "The allowance payable to a worker under this Act shall be deemed for all purposes to include",
            "pre_block_list": [
              "Payment due under this Act to constitute part of a workers wages or salary."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "contributions to Employees Provident Fund, Employees Trust Fund and pension ;",
                "pre_block_list": [
                  "Budgetary Relief Allowance of Workers Act, No. 36 of 2005 6"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "annual holiday remuneration ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "overtime remuneration ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "maternity benefit payments ; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "gratuity,",
                "pre_block_list": [
                  "and shall constitute part of the wages or salary of such worker. Every employer of any such worker shall pay such allowance within the period within which such employer is required by any written law to pay the wages or salary of such worker."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Any employer who fails to pay a sum required to be paid to a worker under this Act shall be guilty of an offence and shall be liable on conviction before a Magistrate to a fine not exceeding ten thousand rupees or to imprisonment of either description for a term not exceeding six months or to both such fine and imprisonment.",
                "pre_block_list": [
                  "Failure to pay sums due to workers."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Upon conviction by the Magistrate of an employer for failure to pay any sum required to be paid to a worker under this Act, the Court shall, in addition to the penalty imposed for such offence order such employer to pay such sum to such worker within a period specified in the Order, and if the sum is not so paid, such sum shall be recovered by Order of Court, as if it were a fine imposed by the Court and paid to such worker.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "10",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where an employer has been convicted for failure to pay any sum required to be paid to a worker of such employer under this Act, then, if a notice in the prescribed form of intention so to do has been served on the employer at any time before the date of commencement of the trial, evidence may be given of any failure on the part of the employer to pay any sum in accordance with the provisions of this Act to that worker or any other worker or workers at any time during the six years preceding the date on which",
                "pre_block_list": [
                  "Recovery of sums due to workers in certain cases.",
                  "Budgetary Relief Allowance of Workers Act, No. 36 of 2005 7",
                  "the complaint was made to Court of the offence of which the employer has been so convicted and, on proof of the failure, the Court may Order the employer to pay such sum as it may be found by the Court to be due from him to such worker or workers. Any sum ordered to be paid under this subsection may be recovered in the same manner as a fine imposed by Court."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "In this section prescribed means prescribed by regulation made under section 11.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "11",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Minister may make regulations in respect of matters for which regulations are authorized or required to be made under this Act.",
                "pre_block_list": [
                  "Regulations."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every regulation made by the Minister shall be published in the  Gazette  and shall come into operation on the date of such publication or on such later date as may be specified in the regulation.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every regulation made by the Minister shall, as soon as convenient after its publication in the  Gazette,  be brought before Parliament for approval. Any regulation which is not so approved shall be deemed to be rescinded as from the date of such disapproval but without prejudice to anything previously done thereunder.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "12",
            "text": "In this Act, unless the context otherwise requires",
            "pre_block_list": [
              "Interpretation.",
              "collective agreement shall have the same meaning as in the Industrial Disputes Act (Chapter 131) ;",
              "Commissioner means the person for the time being holding the office of Commissioner of Labour and includes any person for the time being holding office as a Deputy Commissioner of Labour or as an Assistant Commissioner of Labour or as a Labour Officer ;",
              "Budgetary Relief Allowance of Workers Act, No. 36 of 2005 8",
              "employer means any person who on his own behalf employs, or on whose behalf any other person employs, any worker in any trade and includes any person who on behalf of any other person employs any worker in any trade ;",
              "trade includes any industry,  business, undertaking, Government owned business undertaking, occupation, profession or calling, carried on, performed or exercised by an employer or worker, and any branch of, or any function or process in any trade, but does not include any industry, business or undertaking which is carried on by any corporation, board or other body which was or is established by or under any written law where the Government holds a majority of the share capital with funds or capital wholly or partly provided by the Government by way of grant, loan or otherwise ;",
              "wages or salary means any earnings including"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "the contractual wage or salary of the worker or the wage prescribed by the relevant Wages Board for the trade to which the worker belongs ; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "any amount payable to the worker under the Interim Devaluation Allowance of Employees Act, No. 40 of 1968.",
                "pre_block_list": [
                  "worker means an employee, a person earning a daily wage, or a person employed in any capacity by any employer under a contract, written, expressed or implied, to perform any work in any trade and includes a worker whose salary or wages are regulated by any written law or otherwise and a worker employed on a piece-rate basis but does not include a domestic servant or an employers personal chauffeur.",
                  "Budgetary Relief Allowance of Workers Act, No. 36 of 2005 9"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "13",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency.",
              "Budgetary Relief Allowance of Workers Act, No. 36 of 2005 10",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT   P UBLICATIONS  B UREAU , N O . 32, T RANSWORKS  H OUSE ,  L OTUS   R OAD ,  C OLOMBO  01  before  15th  December  each  year  in  respect of the year following."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}