{
  "n_pages": 9,
  "title_page": {
    "title": "Citizenship   (Amendment)  Act",
    "num": "16",
    "year": "2003",
    "date_certified": "2003-04-01",
    "date_published": "2003-04-04",
    "price": 8.25,
    "price_postage": 4.5
  },
  "body_pages": {
    "preamble": [
      "Citizenship (Amendment) Act, No. 16 Of 2003 1",
      "[Certified On 01St April, 2003]",
      "L. D.O. 11/2002.",
      "A N  A Ct   To   Amend   The  C Itizenship  A Ct",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Citizenship (Amendment) Act, No.  16   of 2003.",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "Section 2 of the Citizenship Act (hereinafter referred to as the principal enactment) is hereby amended by the repeal of subsection (3) and the substitution therefor of the following new subsection :",
            "pre_block_list": [
              "Amendment of section 2 of Chapter 349."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every person who has possessed of the aforesaid status is hereinafter referred to as a Citizen of Sri Lanka",
                "pre_block_list": [
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "Section 5 of the principal enactment is hereby amended as follows :",
            "pre_block_list": [
              "Amendment of section 5 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "in subsection (1) of that section by the substitution, for the words citizen of Ceylon by descent if at the time of his birth his father is a citizen of Ceylon of the words citizen of Sri Lanka if at the time of his birth either of his parents is or was a citizen of Sri Lanka.; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "in subsection (2) of that section by the substitution , for the words  citizen of Ceylon by descent if at the time of his birth his father is a citizen of Ceylon of the words citizen of Sri Lanka if at the time of his birth either of his parents is or was a citizen of Sri Lanka.;",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "The following new section is hereby inserted immediately after section 5 of the principal enactment and shall have effect as section 5 A  of that enactment :",
            "pre_block_list": [
              "Insertion of section 5 A  in the principal enactment.",
              "2H 0168205,650 (2002/09)",
              "Citizenship (Amendment) Act, No. 16 of 2003 2",
              "5 A . (1) Any person who was born within or outside Sri Lanka after the appointed date but prior to the date of commencement of this Act and",
              "Eligibility of persons born prior to the date of commencement of this Act.",
              "( a ) whose mother only was at the time of his birth a citizen of Sri Lanka and he is over twenty two years of age ; or",
              "( b ) neither of whose parents was at the time of his birth a citizen of Sri Lanka but at least one of his parents subsequently becomes a citizen of Sri Lanka ; and",
              "shall be eligible to obtain the status of a citizen of Sri Lanka in accordance with the succeeding provisions of this section."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "A person referred to in subsection (1) who is a citizen of any other country and who desires to acquire Sri Lankan citizenship and renounce citizenship of that other country, may make an application to the Mnister for a declaration that he has acquired the status of a citizen of Sri Lanka if he renounces citizenship of such other country, in accordance with the law in force in that behalf in that other country and he is, and intends to continue to be ordinarily resident in Sri Lanka, and the Minister may make the declaration for which the application is made.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "A person referred to in subsection (1) who is a citizen of any other country and who desires to acquire Sri Lankan citizenship and to also retain citizenship of that other country, may make an application to the Minister, for a declaration to the effect that he has acquired the status of a citizen of Sri Lanka, notwithstanding the fact that he is, and continues to be, a citizen of that other country, and the Minister may make",
                "pre_block_list": [
                  "Citizenship (Amendment) Act, No. 16 of 2003 3",
                  "the declaration for which the application is made, if he is satisfied that the making of such declaration would in all the circumstances of the case, be of benefit to Sri Lanka."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "When a declaration is made under this section, the Minister shall specify the date with effect from which such person shall have acquired the status of a citizen of Sri Lanka.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "The provisions of subsection (7) of section 19 shall,  mutatis mutandis,  apply to a person who has acquired the status of a citizen of Sri Lanka by virtue of the preceding provisions of this section.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "The provisions of section 26 of the principal enactment relating to the  payment of fees, shall,  mutatis mutandis,  apply to the application of a person under this section",
                "pre_block_list": [
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "The following new section is hereby inserted immediately after section 6 of the principal enactment and shall have effect as section 6 A  of that enactment :",
            "pre_block_list": [
              "Insertion of new section 6 A  in the principal enactment.",
              "Issue of Certificate of citizenship on application made.",
              "6 A . (1) Any person who is a citizen of Sri Lanka by virtue of the provisions of section 5, may if he so desires, apply to the Controller of Immigration and Emigration for a Certificate of citizenship. The application shall be substantially in the Form set out in Schedule A hereto."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Controller shall upon being satisfied of the status of the applicant, issue to the applicant, within sixty days of the receipt of the application, a Certificate, substantially in the Form set out in Schedule B hereto.",
                "pre_block_list": [
                  "Citizenship (Amendment) Act, No. 16 of 2003 4"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where such Certificate is to be issued in relation to a minor child, the application for the same may be made on behalf of such minor child, by either parent.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "No person shall require the production of a Certificate referred to in subsection (2) for any purpose and an affidavit shall be accepted as  prima facie  evidence of the facts stated therein.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "Section 9 of the principal enactment is hereby repealed.",
            "pre_block_list": [
              "Repeal of section 9 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "Section 10 of the principal enactment is hereby amended by the substitution for the words father or fathers wherever such words appear in that section, of the words father or mother or fathers or mothers respectively.",
            "pre_block_list": [
              "Amendment of section 10 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "Section 11 of the principal enactment is hereby amended as follows :",
            "pre_block_list": [
              "Amendment of section 11 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "in subsection (1) of that section",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "by the repeal of sub-paragraph (i) of paragraph ( b ) of that subsection ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "by the substitution, in sub-paragraph (ii) of paragraph ( b ) of that subsection, for the words whose father was a citizen of Ceylon by descent of the words, words either of whose parents was a citizen of Sri Lanka ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "by the substitution, in sub-paragraph (iii) of paragraph ( b ) of that subsection, for the words whose father, having been a citizen of Ceylon by descent of the words either of whose parents, having been a citizen of Sri Lanka ;",
                    "pre_block_list": [
                      "Citizenship (Amendment) Act, No. 16 of 2003 5"
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the repeal of paragraph ( a ) of subsection (2) of that section.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "Section 20 of the principal enactment is hereby amended by the repeal of subsection (3) of that section.",
            "pre_block_list": [
              "Amendment of section 20 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "10",
            "text": "Section 23 of the principal enactment is hereby repealed.",
            "pre_block_list": [
              "Repeal of section 23 of the principal enactrment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "11",
            "text": "Section 24 of the principal enactment is hereby repealed.",
            "pre_block_list": [
              "Repeal of section 24 of the principal enactrment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "12",
            "text": "Section 28 of the principal enactment is hereby amended as follows :",
            "pre_block_list": [
              "Amendment of section 28 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "in subsection (1) of that section, by the substitution in the definition of the expression minor child, for the words twenty one years of the words eighteen years ; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "in subsection (2) of that section, by the substitution for the words twenty one years of the words eighteen years.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "13",
            "text": "The following Schedule is hereby added immediately after section 28 of the principal enactment :",
            "pre_block_list": [
              "Addition of Schedules in the principal enactment.",
              "S CHEDULE  A [Section 6 A ]",
              "APPLICATION FOR A CERTIFICATE OF CITIZENSHIP  UNDER SECTION 6 A  OF THE CITIZENSHIP ACT [ CHAPTER  349]",
              "1. I  being the applicant*/a parent* of  a minor child hereby apply for a certificate of citizenship for myself*/my child aforementioned,* in terms of section 6 A  of the Act.",
              "2. I hereby declare that I am,*/my child aforementioned is* a citizen of Sri Lanka by virtue of the provisions of section 5 of the Act.",
              "3. I set out below particulars relating to mayself*/my child aforementioned*.",
              " delete whichever is inapplicable",
              "Citizenship (Amendment) Act, No. 16 of 2003 6"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "Full Name :",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "Address :",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "Sex : Male/Female",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "Date fo Birth :",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "Place of Birth :",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "If born outside Sri Lanka, place of registration of birth :",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "g",
                "text": "Particulars of parents",
                "pre_block_list": [
                  "Father Mother Name : Name : Whether citizen of Sri Lanka : Whether citizen of Sri Lanka : N.I.C. No. (if any) : N.I.C. No. (if any) : Residential Address : Residential Address :      ",
                  "DECLARATION",
                  "4. I declare that I am not/my child aforementioned is not, a citizen of any other Country.",
                  "I do solemnly, sincerely and truly declare and affirm/swear that the foregoing particulars are, to the best of my knowledge true.",
                  " Signature or thumb impression of Applicant.",
                  "Date : ",
                  "Affirmed*/sworn at  this day of  before me.",
                  " Signature of Justice of the Peace or Commissioner of Oaths.",
                  "Name and address of the Justice of the Peace or Commissioner of Oaths :   ",
                  "Citizenship (Amendment) Act, No. 16 of 2003 7",
                  "S CHEDULE  B (Section 6 A )",
                  "CERTIFICATE OF CITIZENSHIP OF SRI LANKA UNDER SECTION 6 A  OF THE CITIZENSHIP ACT [ CHAPTER  349]",
                  "By virtue of the powers conferred on me by the provisions of section 6 A of the Act, I , Controller of Immigration and Emigration, do hereby certify that  of  (state name) (state address) is a citizen of Sri Lanka by virtue of the provisions of section 5 of the Act."
                ],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "I",
        "text": "",
        "pre_block_list": [
          "Name :  Name of Parent(s) who is a citizen/who are citizens : (1)  (2)  Date and place of birth :  Sex :  Identity Card No. (if any) : ",
          "Date : Controller of Immigration and Emigration."
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "14",
            "text": "Where a person who was registered under paragraph ( a ) of subsection (2) of section 11, as a citizen of Sri Lanka prior to the date of commencement of this Act, acquires, by reason of the operation of the amendment made to section 5 of the principal enactment, by section 2 of this Act, the status of a citizen of Sri Lanka by descent, such person shall deemed to have become a citizen of Sri Lanka by descent, with effect from the date of the commencement of this Act.",
            "pre_block_list": [
              "Registered persons deemed to be citizens by descent."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "15",
            "text": "In the event of an inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency.",
              "Citizenship (Amendment) Act, No. 16 of 2003 8",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180(Foreign), payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , N O . 32, T RANSWORKS  H OUSE , L OTUS  R OAD , C OLOMBO  01 before 15th December each year in respect of the year following."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}