{
  "n_pages": 4,
  "title_page": {
    "title": "Inland  Trust  Receipts  (Amendment) Act",
    "num": "22",
    "year": "2024",
    "date_certified": "2024-04-01",
    "date_published": "2024-04-05",
    "price": 12.0,
    "price_postage": 150.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 01St Of April, 2024]",
      "L.D.- O. 67/2017",
      "A N  A Ct   To   Amend   The  I Nland  T Rust  R Eceipts A Ct , N O . 14   Of   1990",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:-"
    ],
    "pre_section_list": [
      {
        "class_name": "ActL1Section",
        "num": "1",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "This Act may be cited as the Inland Trust Receipts (Amendment) Act, No. 22 of 2024.",
            "pre_block_list": [
              "Short title and date of operation"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "The provisions of this Act, other than the provisions of this section, shall come into operation on such date as the Minister may appoint by Order published in the  Gazette (in this Act referred to as the appointed date).",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "The provisions of this section shall come into operation on the date on which the Bill becomes an Act of Parliament.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "2",
        "text": "Section 3 of the Inland Trust Receipts Act, No. 14 of 1990 is hereby amended in subsection (1) of that section, by the substitution for the words registered under the Registration of Documents Ordinance as a bill of sale, of the words and figures registered under the Secured Transactions Act, No. 17 of 2024 as a bill of sale.",
        "pre_block_list": [
          "Amendment of section 3 of Act, No. 14 of 1990"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "3",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "Where on the appointed date an inland trust receipt which has been registered under the Registration of Documents Ordinance (Chapter 117) as a bill of sale is in force, such inland trust receipt shall, for a period of two years from the appointed date, continue to be enforceable, but shall be required to be registered under the relevant provisions of the Secured Transactions Act, No. 17 of 2024 as a bill of sale, prior to the expiration of such period of  two years.",
            "pre_block_list": [
              "Provisions relating to inland trust receipts registered under the Registration of Documents Ordinance"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "A bill of sale referred to in subsection (1) shall, on being registered under the Secured Transactions Act, No. 17 of 2024, be deemed to have been perfected from the date on which such bill of sale initially became legally enforceable, and any priority which such bill of sale became entitled to at the time it initially became legally enforceable, shall continue to prevail.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "A bill of sale referred to in subsection (1) which is not registered under the Secured Transactions Act, No. 17 of 2024 prior to the expiration of two years from the appointed date, shall become legally unenforceable after the expiry of such period.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "4",
        "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
        "pre_block_list": [
          "Sinhala text to prevail in case of inconsistency",
          "English Acts of the Parliament can be purchased at the P RAKASHANA  P IYASA , D EPARTMENT   OF G OVERNMENT  P RINTING , N O . 118, D R . D ANISTER  D E  S ILVA  M AWATHA , C OLOMBO  8."
        ],
        "child_level_list": []
      }
    ],
    "part_list": []
  }
}