{
  "n_pages": 5,
  "title_page": {
    "title": "Special Commodity Levy Act",
    "num": "48",
    "year": "2007",
    "date_certified": "2007-10-15",
    "date_published": "2007-10-19",
    "price": 7.0,
    "price_postage": 5.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 15Th October 2007]",
      "L.D.O. 40/2007.",
      "A N  A Ct   To   Provide   For   The   Imposition   Of   A   Composite   Levy   On",
      "Certain   Specified   Commodity   Items   In   Lieu   Of   The   Amount",
      "Chargeable   On   Such   Commodity   Items   As   A   Tax ,  Duty ,  Levy ,  Cess",
      "Or   Any   Other   Charge   In   Order   To   Overcome   The   Complexities",
      "Associated   With   The   Application   And   Administration   Of   Multiple",
      "Taxes   On   Such   Specified   Commodity   Items ;  And   To   Provide   For",
      "Matters   Connected   Therewith   Or   Incidental   Thereto .",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Special Commodity Levy Act, No. 48 of 2007.",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "From and after the date of the coming into operation of this Act,  there shall be imposed a levy to be called the Special Commodity Levy on certain commodity items which shall from time to time be specified by the Minister by Order published in the  Gazette .",
                "pre_block_list": [
                  "Imposition of Special Commodity Levy."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The period of validity of every such Order and the rate of the Special Commodity Levy to be imposed in respect of each such specified item, either on  ad valorem  or specific basis, shall also be specified in the Order.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every Order made under subsection (1) which is valid for a period of over thirty days, may be amended or varied by adding thereto or removing therefrom any item or by revising the rates specified therein.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "No Order made under subsection (3) may be amended or varied until the expiration of thirty days from the date of the making thereof.",
                "pre_block_list": [
                  "2PL 0023804,350 (08/2007)"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "The Special Commodity Levy so imposed shall be a composite levy and during the period any Order published in terms of subsection (1) is in force, no other tax, duty, levy or cess or any other charge imposed in terms of any of the laws specified in the Schedule to this Act, shall be applicable in respect of the commodity items specified in any such Order.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "The Special Commodity Levy, imposed under section 2, in lieu of any tax, duty, levy or cess or any other charge imposed in terms of any of the laws specified in the Schedule to this Act, shall notwithstanding anything to the contrary in this Act, be collected, administered and recovered by the Director - Genaral of Customs, in accordance with the provisions of the Customs Ordinance (Chapter 235).",
            "pre_block_list": [
              "Collection, administration and recovery of the Special Commodity Levy."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "The Director - General of Customs shall remit all sums collected by him as Special Commodity Levy in terms of this Act, to the Consolidated Fund.",
            "pre_block_list": [
              "Special Commodity Levy to be remitted to the Consolidated Fund."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Notwithstanding the provisions of section 2, the Minister may, where he is of opinion that in view of the prevailing economic considerations that it is expedient so to do, by Order published in the  Gazette  waive for a period of time to be specified in such Order, the Special Commodity Levy chargeable under section 2 in respect of any specified item.",
                "pre_block_list": [
                  "Minister may waive the Special Commodity Levy on certain commodities."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "During the period any Order published in terms of subsection (1) is in force, no other tax, duty, levy or cess or any other charge imposed in terms of any of the laws specified in the Schedule to this Act, shall be applicable in respect of the commodity items specified in any such Order.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "Where any commodity item is made subject to an Order under section 2, the rate payable in respect of such commodity item shall be such rate as is applicable to such item at the time of submission of the Bill of Entry.",
            "pre_block_list": [
              "Determination of the applicable rate."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "Every Order made by the Minister in terms of section 2 and section 5, shall",
            "pre_block_list": [
              "Order to be placed before Parliament & c,."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "be in operation immediately upon the Minister affixing his signature thereto;",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "be published in the  Gazette  as soon as convenient;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iii",
                    "text": "be approved by Resolution of Parliament as soon as convenient thereafter; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iv",
                    "text": "if not approved by Parliament, be deemed to be rescinded with effect from the date of such resolution, without prejudice to anything previously done thereunder.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "Where an Order made under section 2 or section 5 is rescinded as provided for in paragraph (iv) of section 7, the commodity items to which the Orders relate shall become subject to the payment of any tax, duty, levy or cess or other charge imposed in terms of any of the laws specified in the Schedule to this Act.",
            "pre_block_list": [
              "Effect of an Order being deemed to be rescinded."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "In the case of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala Text to prevail in case of inconsistency.",
              "S CHEDULE (Sections 2 and 8)",
              "1. The Finance Act, No. 11 of 2002 (Part I). 2. The Value Added Tax Act, No. 14 of 2002. 3. The Finance Act, No. 5 of 2005 (Part I). 4. The Customs Ordinance (Chapter 235). 5. The Sri Lanka Export Development Act, No. 40 of 1979. 6. The Excise (Special Provisions) Act, No. 13 of 1989",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS   B UREAU , D EPARTMENT   OF G OVERNMENT   I NFORMATION ,  N O .  163,  K IRULAPONA   M AWATHA ,  P OLHENGODA , C OLOMBO  05  before   15th December each year in respect of the year following."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}