{
  "n_pages": 6,
  "title_page": {
    "title": "(Amendment)  Act",
    "num": "27",
    "year": "2022",
    "date_certified": "2022-10-21",
    "date_published": "2022-10-21",
    "price": 15.0,
    "price_postage": 15.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 21St Of October, 2022]",
      "L.D.O. 11/2022",
      "A N  A Ct   To   Amend   The  P Etroleum  P Roducts  (S Pecial  P Rovisions ) A Ct , N O . 33  Of  2002",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows: -"
    ],
    "pre_section_list": [
      {
        "class_name": "ActL1Section",
        "num": "1",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "This Act may be cited as the Petroleum Products (Special Provisions)  (Amendment) Act, No. 27 of 2022.",
            "pre_block_list": [
              "Short title and date of operation"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "The provisions of this Act other than this section shall come into operation on such date (hereinafter referred to as the appointed date) as the Minister may appoint by Order published in the  Gazette .",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "2",
        "text": "The long title of the Petroleum Products (Special Provisions) Act, No. 33 of 2002 (hereinafter referred to as the principal enactment) is hereby amended by the substitution for the words  IN THE ENERGY SUPPLY COMMITTEE ;, of the words  IN THE COMMITTEE APPOINTED BY THE CABINET OF MINISTERS ;.",
        "pre_block_list": [
          "Amendment of the long title to the Act, No. 33 of 2002"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "3",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "In the principal enactment and other written law, every reference to the Energy Supply Committee, in relation to the principal enactment, shall be read and construed as a reference to the Committee appointed under section 3.",
            "pre_block_list": [
              "Energy Supply Committee to be referred to as the Committee"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "In any notice, communication, form, or other document issued, made, required or authorized by or under the principal enactment, every reference to the Energy Supply Committee, shall be read and construed as a reference to the Committee appointed under section 3.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "4",
        "text": "Section 3 of the principal enactment is hereby repealed and the following section is substituted therefor: -",
        "pre_block_list": [
          "Replacement of section 3 of the principal enactment",
          "3. (1) There shall be a Committee appointed by the Cabinet of Ministers (hereinafter referred to as the Committee), subject to the succeeding provisions of this section to exercise, perform and discharge the powers, duties and functions hereinafter set out.",
          "Appointment of a Committee to exercise, perform and discharge the powers, duties and functions under this Act"
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "The Committee shall consist of the following:",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "ex-officio members",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "i",
                    "text": "the Secretary to the Ministry of the Minister assigned the subject of Petroleum, who shall be the Chairman of the Committee;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "the Secretary to the Treasury or his nominee not below the rank of Director-General of the Treasury;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iii",
                    "text": "the Secretary to the Ministry of the Minister assigned the subject of Economic Policy Development;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iv",
                    "text": "the Secretary to the Ministry of the Minister assigned the subject of Investment Promotion;",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "the Chairman or Managing-Director of  the  Ceylon  Petroleum Corporation, established under Ceylon Petroleum Corporation Act, No. 28 of 1961, nominated by the Minister;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "two members appointed from among persons who have achieved eminence in the field of petroleum industry or law.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "A member of the Committee appointed under paragraph ( c ) of subsection (2), shall hold office for the period of two years from the date of appointment unless such member resigns the office by letter addressed to the Cabinet of Ministers or, is removed from office by the Cabinet of Ministers, for reasons assigned.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "4",
            "text": "The quorum for any meeting of the Committee shall be five members and the Committee may regulate the procedure, in regard to the meetings of the Committee and the transaction of business at such meetings",
            "pre_block_list": [
              ""
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "5",
        "text": "The following new section is hereby inserted immediately after section 3 of the principal enactment, and shall have effect as section 3 A  of that enactment:-",
        "pre_block_list": [
          "Insertion of new section 3 A  in the principal enactment",
          "Committee deemed to be a scheduled institution within the meaning of the Bribery Act",
          "3 A . The Committee shall be deemed to be a scheduled institution within the meaning of the Bribery Act (Chapter 26) and the provisions of that Act shall be construed accordingly",
          ""
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "6",
        "text": "Section 6 of the principal enactment is hereby amended in subsection (1) of that section, by the substitution for the words the Minister in charge of the subject of Power and Energy of the words the Minister.",
        "pre_block_list": [
          "Amendment of section 6 of the principal enactment"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "7",
        "text": "Section 9 of the principal enactment is hereby amended as follows:",
        "pre_block_list": [
          "Amendment of section 9 of the principal enactment"
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "by the insertion immediately after the definition of the expression Ceylon Petroleum Corporation of the following new definition:",
            "pre_block_list": [
              "Minister means, the Minister assigned the subject and functions relating to this Act under Article 44 or 45 of the Constitution.; and"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "by the repeal of the definition of the expression Energy Supply Committee.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "8",
        "text": "Every licence validly issued under the provisions of the principal enactment and stated therein to continue in force for a period extending beyond the date of the coming into operation of this Act, shall continue in force for the period so stated and every such licensee shall be subject to the provisions of this Act and any other terms and conditions which may be lawfully imposed under this Act and any other regulation or rule made thereunder.",
        "pre_block_list": [
          "Transitional Provisions"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "9",
        "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
        "pre_block_list": [
          "Sinhala text to prevail in case of inconsistency",
          "English Acts of the Parliament can be purchased at the P RAKASHANA  P IYASA , D EPARTMENT   OF G OVERNMENT  P RINTING , N O . 118, D R . D ANISTER  D E  S ILVA  M AWATHA , C OLOMBO  8."
        ],
        "child_level_list": []
      }
    ],
    "part_list": []
  }
}