{
  "n_pages": 3,
  "title_page": {
    "title": "National Housing Development Authority (Amendment)  Act",
    "num": "23",
    "year": "2002",
    "date_certified": null,
    "date_published": "2002-10-11",
    "price": 4.25,
    "price_postage": 4.5
  },
  "body_pages": {
    "preamble": [
      "National Housing Development Authority  (Amendment) Act, No. 23 Of 2002 1",
      "[Certified On 11Th October, 2002]",
      "L.D.O. 39/99.",
      "A N  A Ct   To   Amend   The  N Ational  H Ousing  D Evelopment A Uthority  A Ct",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the National Housing Development Authority (Amendment)  Act, No. 23  of 2002.",
            "pre_block_list": [
              "Short title ."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "Section 63 of the National Housing Development Authority Act, No. 17 of 1979 (hereinafter referred to as the principal enactment) is hereby amended in subsection (1) of that section by the substitution for the words lawful termination of the occupation of such building by the occupier ; of  the words lawful termination of the occupation of such building by the landlord .",
            "pre_block_list": [
              "Amendment of section 63 of Act  No. 17 of 1979."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "Section 82 of the principal enactment is hereby amended by the substitution, for the words any property, business and any activity of the Authority, of the words any property, business and any activity of the Authority or to any legal proceeding relating to such property, business or activity. .",
            "pre_block_list": [
              "Amendment of section 82 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "The Schedule to the principal enactment is hereby amended by the addition immediately after the item Rent Act, No. 7 of 1972, of the following item Mediation Board Act, No. 72 of 1988,.",
            "pre_block_list": [
              "Amendment to the Schedule to the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala  text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency.",
              "2H 0164715,650  (2002/08)",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180(Foreign), payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , N O . 32, T RANSWORKS  H OUSE , L OTUS  R OAD , C OLOMBO  01 before 15th December each year in respect of the year following."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}