{
  "n_pages": 17,
  "title_page": {
    "title": "Act",
    "num": "19",
    "year": "2017",
    "date_certified": "2017-10-03",
    "date_published": "2017-10-06",
    "price": 13.0,
    "price_postage": 10.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 03Rd Of October, 2017]",
      "L.D.O. 1/2016.",
      "A N  A Ct   To   Provide   For   The   Development   And   Implementation   Of   A N Ational  P Olicy   And  S Trategy   On  S Ustainable  D Evelopment",
      "In  S Ri  L Anka ;  For   The   Establishment   Of   A  S Ustainable D Evelopment  C Ouncil   And   For   Matters   Connected   Therewith",
      "Or   Incidental   Thereto",
      "Whereas The Seventeen Sustainable Development Goals And One Hundred And Sixty Nine Associated Targets Were Adopted By United Nation Member States In Two Thousand Fifteen:",
      "Preamble.",
      "And Whereas   Sri Lanka Intends To Design, Develop And Implement A National Policy And Strategy On Sustainable Development And Facilitate All Agencies Responsible And To Follow Up And Monitor The Progress:",
      "And Whereas   Sri Lanka Would Set Its Own National Targets Guided By The Global Level Of Ambition But Taking Into Account National Interest And Circumstances And Also Incorporate Such Seventeen Sustainable Development Goals In National Planning Processes, Policies And Strategies In The Relevant Ongoing Processes In The Economic, Social And Environmental Fields:",
      "Now Therefore Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:-"
    ],
    "pre_section_list": [
      {
        "class_name": "ActL1Section",
        "num": "1",
        "text": "This Act may be cited as the Sri Lanka Sustainable Development Act, No. 19  of 2017.",
        "pre_block_list": [
          "Short title."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "2",
        "text": "The objects of this Act shall be to",
        "pre_block_list": [
          "Objects of this Act."
        ],
        "child_level_list": [
          {
            "class_name": "ActL3Paragraph",
            "num": "a",
            "text": "ensure that the National Policy and Strategy on Sustainable Development is prepared in accordance with section 11 of this Act and",
            "pre_block_list": [
              "2PL 0049752962 (01/2017)",
              "Sri Lanka Sustainable Development Act, No. 19 of 2017 2",
              "provide the legal framework for developing and implementing such National Policy and Strategy on Sustainable Development;"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "b",
            "text": "ensure an ecologically efficient use of natural, social and economic resources;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "c",
            "text": "to promote the integration and maintain the equipoise of  environmental, economic and social factors in the making of all decisions by government; and",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL3Paragraph",
            "num": "d",
            "text": "formulate strategies in accordance with paragraphs ( a ), ( b ) and ( c ) of this section.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      }
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "I",
        "text": "",
        "pre_block_list": [
          "E STABLISHMENT   OF  S USTAINABLE  D EVELOPMENT  C OUNCIL"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be established for the purpose of this Act, a Council called the Sustainable Development Council (hereinafter referred to as the Council).",
                "pre_block_list": [
                  "Establishment of the Sustainable Development Council."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Council shall, by the name assigned to it by this section be a body Corporate and shall have perpetual succession and a common seal and may sue and be sued in such name.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "( 1) The Council shall consist of the following members:",
            "pre_block_list": [
              "Constitution of the Council.",
              "( a ) the  ex-officio  members",
              "(i) the Secretary to the President;",
              "(ii) the Secretary to the Ministry of the Minister assigned  the subject of Sustainable Development;",
              "(iii) the Secretary to the Ministry of the Minister assigned  the subject of National Planning or his nominee;",
              "(iv) the Secretary to the Ministry of the Minister assigned  the subject of Environment or his nominee; and",
              "( b ) eight other members (hereinafter referred to as the appointed members), appointed by the President",
              "(i) two members  appointed by him on his own volition;",
              "(ii) one member nominated by the Prime Minister;",
              "(iii) two members nominated by the Minister assigned the subject of Sustainable Development; and",
              "(iv) three members out of the nine persons nominated by the Provincial Councils; at the expiration of the term of office of such members appointed under this sub-paragraph, the balance number of persons nominated by the Provincial Councils shall be considered for second and third appointment in rotation:",
              "Provided however, in the event a matter pertaining to any Provincial Council is taken up for discussion at any meeting of the Council, the member nominated by such Provincial Council shall have the power to participate at such meeting."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Chairman of the Council shall be appointed by the President from among its members.",
                "pre_block_list": [
                  "Sri Lanka Sustainable Development Act, No. 19 of 2017 4"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every appointed member shall possess academic or professional qualifications and wide experience in science, economics, environmental science or social science and possesses specific experience in relation to sustainable development.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Every appointed member other than the appointed members under sub-paragraph (iv) of paragraph ( b ) of subsection (1) shall unless he vacates office earlier by death, resignation or removal, hold office for a term of three years from the date of his appointment and shall unless he has been removed, be eligible for reappointment.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Every appointed member under sub-paragraph (iv) of paragraph ( b ) of subsection (1) shall unless he vacates office earlier by death, resignation or removal, hold office for a term of one year from the date of his appointment and shall unless he has been removed, be eligible for reappointment.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "The President may, if he considers it expedient to do so, remove from office any appointed member after assigning reasons therefor.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "Any appointed member may, at any time resign his office by a letter to that effect, addressed to the President and sent by registered post.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "8",
                "text": "In the event of vacation of office by death, resignation or removal of any appointed member, the President may having regard to the provisions of paragraph ( b ) of subsection (1) appoint any other person to succeed such member. Any member so appointed shall hold office for the unexpired term of office of the member whom he succeeds.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "9",
                "text": "Where an appointed member, by reason of illness, infirmity or absence from Sri Lanka for a period of not less than three months, is temporarily unable to perform his duties, it shall be the duty of such member to inform the President in writing of such inability. The President may, on receipt of such information, having regard to the provisions of paragraph ( b ) of subsection (1) appoint some other person to act in his place.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The quorum for a meeting of the Council shall be five members.",
                "pre_block_list": [
                  "Quorum and meetings of the Council."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Chairman shall preside at every meeting of the Council.  In the absence of the Chairman from any meeting of the Council, the Secretary to the Ministry of the Minister assigned the subject of Sustainable Development shall preside at such meeting.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Council shall hold its meetings once in every three months in every year.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "All questions for  decision at any meeting of the Council shall be decided by the vote of the majority of members present at such meeting. In the case of an equality of votes, the Chairman shall, in addition to his vote have a casting vote.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Subject to the preceding provisions of this section, the Council may regulate the procedure in relation to the meetings of the Council and the transaction of business at such meetings.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "No act or proceeding of the Council shall be invalid by reason only of the existence of any vacancy in the Council or any defect in the appointment of a member of the Council.",
            "pre_block_list": [
              "Acts or proceedings of the Council deemed not to be invalid by reason of any vacancy."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "The members of the Council shall be remunerated in such manner and at such rates as may be determined by the Minister with the concurrence of the Minister assigned the subject of Finance.",
            "pre_block_list": [
              "Remuneration of the members of the Council."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "A person referred to in paragraph ( b ) of subsection (1) of section 4 shall be disqualified from being appointed or continuing as a member of the Council",
            "pre_block_list": [
              "Disqualification from being a member of the Council."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "if he is or becomes a member of, Parliament, any Provincial Council or any local authority;",
                "pre_block_list": [
                  "Sri Lanka Sustainable Development Act, No. 19 of 2017 6"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "if he has been declared an insolvent or an un- discharged bankrupt under any law in Sri Lanka or any other country;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "if he is under any law in force in Sri Lanka or any other country found or declared to be of unsound mind;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "if he is convicted of an offence involving in moral turpitude and punishable with imprisonment for a term not less than six months;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "if he is serving or has served a sentence of imprisonment imposed by a Court of Sri Lanka or any other country; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "if he has any financial or other interest as is likely, to affect prejudicially the discharge by him of his functions as a member of the Council.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The seal of the Council shall be in the custody of such person as the Council may decide from time to time.",
                "pre_block_list": [
                  "Seal of the Council."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The seal of the Council may be altered in such manner as may be determined by the Council.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The seal of the Council shall not be affixed to any instrument or document except with the sanction of the Council and in the presence of two members of the Council who shall sign the instrument or document in token of their presence.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The Council shall maintain a register of the instruments and documents to which the seal of the Council has been affixed.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "10",
            "text": "The Powers, functions and duties of the Council shall be",
            "pre_block_list": [
              "Powers, functions and duties of the Council."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "to facilitate the achievement of national, regional and  international commitments relating to sustainable development;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "to formulate National Policy and Strategy on Sustainable Development in consultation and with the concurrence of all relevant parties and nine Provincial Councils and place before the Cabinet of Ministers for approval;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "to review and update the National Policy and Strategy on Sustainable Development periodically as and when the Cabinet of Ministers so decides;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "to issue guidelines relating to sustainable development to the ministries, provincial councils and project approving agencies in respect of new development projects;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "to facilitate and monitor the  mechanisms and progress review processes of the implementation of such  National Policy and Strategy on Sustainable Development;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "to appoint expert committees to study any specific matter;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "g",
                "text": "to identify sustainable development standards and ecological footprint indicators;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "h",
                "text": "to promote sustainable development including research and development, innovation, education awareness and eradication of poverty;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "to identify, introduce and follow up the mechanisms, audit mechanisms and all other matters relating to sustainable development;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "j",
                "text": "to acquire, hold, take or give on lease or hire, any immovable property;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "k",
                "text": "to open, maintain and close current and savings accounts in any State bank;",
                "pre_block_list": [
                  "Sri Lanka Sustainable Development Act, No. 19 of 2017 8"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "l",
                "text": "to accept grants, gifts or donations from persons or bodies of persons, in or out side Sri Lanka:",
                "pre_block_list": [
                  "Provided that, the Council shall obtain the prior written approval of the Department of External Resources of the Ministry of the Minister assigned the subject of National Policies and Economic Affairs, in respect of all foreign grants, gifts or donations made to the Council. Such written approval shall not impose any obligation or condition;"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "m",
                "text": "to co-ordinate with the project approving agencies to achieve the seventeen sustainable development goals;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "n",
                "text": "to enter into, or perform, all such contracts as may be necessary for the exercise of its powers or the discharge of its functions; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "o",
                "text": "to borrow such sums of money as may be necessary for discharging of its functions.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "II",
        "text": "",
        "pre_block_list": [
          "N ATIONAL  P OLICY   AND  S TRATEGY   ON  S USTAINABLE  D EVELOPMENT"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "11",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The National Policy and Strategy on Sustainable Development shall be in conformity with the Sustainable Development goals and associated targets.",
                "pre_block_list": [
                  "Approval for the National Policy and Strategy on Sustainable Development."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The National Policy and Strategy on Sustainable Development shall be in force until the end of year 2030.",
                "pre_block_list": [
                  "(4) The Minister shall lay such National Policy and Strategy on Sustainable Development before the Parliament for approval.",
                  "(5) The National Policy and Strategy on Sustainable Development which is not so approved shall be deemed to be rescinded as from the date of such disapproval.",
                  "(6) Upon the approval granted by the Parliament under subsection (4), such National Policy and Strategy on Sustainable Development shall be the National Policy and Strategy on Sustainable Development.",
                  "(7) It shall be the duty of every ministry, department, provincial council, provincial ministry and department and any local authority to comply with the National Policy and Strategy on Sustainable Development .",
                  "(8) The Minister shall co-ordinate with other project approving agencies for the purpose of implementing the National Policy and Strategy on Sustainable Development."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "12",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Every ministry, department, provincial council, provincial ministry and department and local authority shall prepare the Sustainable Development Strategy relevant to the scope of such ministry, department, provincial council, provincial ministry and department and local authority in accordance with the National Policy and Strategy on Sustainable Development within a period of one year from the date of approval under subsection (6) of section 11 by the Parliament.",
                "pre_block_list": [
                  "Sustainable Development Strategy of the ministries &c."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every ministry, department, provincial council, provincial ministry and department and local authority shall submit the progress report on the Sustainable Development Strategy prepared under subsection (1) within a period as may be required by the Minister.",
                "pre_block_list": [
                  "Sri Lanka Sustainable Development Act, No. 19 of 2017 10"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "13",
            "text": "Every ministry, department, provincial council, provincial ministry and department and local authority shall",
            "pre_block_list": [
              "Environment and social  audit."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "cause an environmental, and social audit to be done on the new development projects; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "ensure the environmental and social security on the new development projects.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "14",
            "text": "The annual report of every ministry, department, provincial council, provincial ministry and department and local authority shall include a statement as to the compliance with the National Policy and Strategy on Sustainable Development. PART III",
            "pre_block_list": [
              "Annual report of the ministry &c.",
              "S TAFF   OF   THE  C OUNCIL"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "15",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be appointed by the Cabinet of Ministers, a person to be the Director-General of the Council, who shall be its Chief Executive Officer.",
                "pre_block_list": [
                  "Director-General of the Council."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Director-General shall be entitled to be present at all meetings of the Council and to speak at such meetings, but shall not be entitled to vote at any such meetings.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Council shall assess the requirement of the minimum staff required for efficient operation and appoint such other officers and servants as are necessary for the purpose of carrying out the objects of the Act.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The Director-General shall, subject to the general direction and control of the Council, be responsible for the conduct of all affairs of the Council, including the administrative control of the officers and servants of the Council.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "The Director-General shall be paid such remuneration as may be determined by Cabinet of Ministers.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "The Cabinet of Ministers may, for reasons assigned therefor remove from office the Director-General appointed under subsection (1).",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "16",
            "text": "Whenever the Director-General is by reason of illness or absence from Sri Lanka or for any other cause unable to discharge or perform  any of his functions or duties, the Minister may with the concurrence of the Council, appoint any other senior officer of the Council to act in his place during such absence.",
            "pre_block_list": [
              "Temporary absence of the Director- General."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "17",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "At the request of the Council any officer in the public service may, with the consent of that officer and the Secretary to the Ministry of the Minister assigned the subject of Public Administration, be temporarily appointed to the staff of the Council for such period as may be determined by the Council or with like consent, be permanently appointed to such staff.",
                "pre_block_list": [
                  "Appointment of public officers to the staff of the Council."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where any officer in the public service is temporarily appointed to the staff of the Council, the provisions of subsection (2) of section 14 of the National Transport Commission Act, No. 37 of 1991, shall,  mutatis mutandis apply to and in relation to him.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where any officer in the public service is permanently appointed to the staff of the Council, the provisions of subsection (3) of section 14 of the National Transport Commission Act, No. 37 of 1991, shall,  mutatis mutandis apply to and in relation to him.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where the Council employs any person who has agreed to serve the Government for a specified period under any agreement, any  period of service to the Council by that person shall be regarded as service to the Government for the purpose of discharging the obligations of such agreement.",
                "pre_block_list": [
                  "Sri Lanka Sustainable Development Act, No. 19 of 2017 12",
                  "Appointment of officers in public corporations or higher educational institutions to the staff of the Council."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "18",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "At the request of the Council, any officer or servant of a public corporation may, with the consent of such officer or servant and the governing body of such public corporation, be temporarily appointed to the staff of the Council for such period as may be determined by the Council or  with like consent, be permanently appointed to such staff on such terms and conditions, including those relating to pension or provident fund rights, as may be agreed upon by the Council and the governing body of the public corporation concerned.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "At the request of the Council, any officer or servant of any higher educational institution may, with the consent of that officer or servant and the principal executive officer of that higher educational institution, be temporarily appointed to the staff of the Council for such period as may be determined by the Council or  with like consent be permanently appointed to such staff, on such terms and conditions, including those relating to pension or provident fund rights, as may be agreed upon by the Council and such principal executive officer.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where any person is temporarily appointed to the staff of the Council under subsection (1) or subsection (2), as the case may be, such person shall be subject to the same disciplinary control as any other member of the staff of the Council.",
                "pre_block_list": [
                  "PART IV",
                  "G ENERAL"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "19",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The financial year of the Council shall be the calendar year.",
                "pre_block_list": [
                  "Financial year and the audit of accounts."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The provisions of the Article 154 of the Constitution relating to the auditing of accounts shall apply in relation to the audit of accounts of the Council.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "20",
            "text": "The provisions of Part II of the Finance Act, No. 38 of 1971, shall  mutatis mutandis, apply to and in respect of the financial control and accounts of the Council.",
            "pre_block_list": [
              "Application of Part II of the Finance Act, No.38 of 1971."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "21",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Council may subject to such conditions as may be specified in writing, delegate to the Chairman or member of the Council or Director-General any of its powers, functions or duties under this Act, and the Chairman or such member or Director-General shall exercise, perform or discharge such power, function or duty subject to any special or general directions issued by the Council.",
                "pre_block_list": [
                  "Delegation of powers, functions and duties of the Council."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Notwithstanding any delegation made under subsection (1), the Council may exercise, perform or discharge any such power, function or duty so delegated.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "22",
            "text": "The Minister may, from time to time issue such general or special directions to the Council relating to the exercise, performance and discharge of the powers, functions and duties under this Act and it shall be the duty of the Council to comply with such directions.",
            "pre_block_list": [
              "Directions of the Minister."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "23",
            "text": "All members of the Council, officers, servants and agents of the Council shall be deemed to be public servants within the meaning and for the purpose of the Penal Code (Chapter 19).",
            "pre_block_list": [
              "All members of the Council etc. deemed to be public servants."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "24",
            "text": "The Council shall be deemed to be a Scheduled Institution within the meaning of the Bribery Act (Chapter 26) and the provisions of that Act shall be construed accordingly.",
            "pre_block_list": [
              "Council deemed to be a Scheduled Institution."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "25",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "All expenses incurred by the Council in any suit or prosecution brought by or against it before any court, shall be paid out of the Consolidated Fund and only costs paid to or recovered by the Council in any such suit or prosecution, shall be credited to the Consolidated Fund .",
                "pre_block_list": [
                  "Expenses to be paid out of the Consolidated Fund.",
                  "Sri Lanka Sustainable Development Act, No. 19 of 2017 14"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any expenses incurred by a member of the Council, Director-General or any officer or servant of the Council, in any suit or prosecution brought by or against such person before any court in respect of any act which is done or purported to be done by such person under this Act shall, if the court holds that such act was done in good faith, be paid out of the Consolidated Fund , unless such expenses are recovered by him in such suit or prosecution.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "26",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Minister may make regulations for the purpose of carrying out or giving effect to the principles and provisions of this Act, in particular in respect of all or any of the following matters:-",
                "pre_block_list": [
                  "Regulations."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the issuance of guidelines to the Project Approving Agencies;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the monitoring mechanisms and progress review processes on Sustainable Development Strategy implementation;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "the sustainability standards and ecological foot print indicators;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "the mechanisms for scoring or weighting projects;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "the criteria for carrying out appropriate social and environmental audits;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "the categories of development projects and complex projects; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "g",
                    "text": "the mechanisms for review of requests for approval of complex projects by Project Approving Agencies.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every regulation made by the Minister under subsection (1), shall after obtaining the approval of the Cabinet of Ministers be published in the  Gazette  and shall",
                "pre_block_list": [
                  "come into operation on the date of such publication or on such later date as may be specified in the regulation."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every regulation made by the Minister under subsection (1) shall, within a period of three months from the date of its publication in the  Gazette  be brought before Parliament for approval. Any regulation which is not so approved shall be deemed to be rescinded as from the date of such disapproval but without prejudice to anything previously done thereunder.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Notification of the date on which any regulation shall be deemed to be so rescinded, shall be published in the Gazette .",
                "pre_block_list": [
                  "Interpretation."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "27",
            "text": "In this Act, unless the context otherwise requires",
            "pre_block_list": [
              "Minister means the Minister assigned the subject of Sustainable Development;",
              "project approving agencies includes ministries, departments, provincial councils, provincial ministries and departments and local authorities and all other Government and Provincial Council Agencies;",
              "sustainability means the capacity of a thing, action, activity or process to be maintained indefinitely; and",
              "sustainable development means development that meets the needs of the present without compromising the ability of future generations to meet their own needs."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "28",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency.",
              "Sri Lanka Sustainable Development Act, No. 19 of 2017 16"
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}