{
  "n_pages": 19,
  "title_page": {
    "title": "Act",
    "num": "18",
    "year": "2018",
    "date_certified": "2018-07-04",
    "date_published": "2018-07-06",
    "price": 20.0,
    "price_postage": 45.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 04Th Of July, 2018]",
      "L.D.O. 54/2017",
      "A N   A Ct    To    Provide   For   The   Establishment   Of   The  1990 S Uwaseriya F Oundation ;  And   To   Provide   For   Matters   Connected   Therewith",
      "Or   Incidental   Thereto .",
      "Whereas The Government Having Identified Pre-Hospital Care Ambulance Services As An Essential Service In Enhancing The Standard Of Living Of Pepole In Sri Lanka By Delivering Comprehensive, Speedy, Reliable And Quality Pre-Hospital Care Services, Established With A Grant From The Government Of India A Pre-Hospital Care Ambulance Service Free Of Charge Initially In The Western And Southern Provinces:",
      "Preamble.",
      "And Whereas It Has Now Become Necessary To Expand The Pre-Hospital Care Ambulance Service To Cover The Whole Island And To Ensure The Smooth Operation Of Such Service In A Sustainable Manner:",
      "And Whereas It Has Become Necessary To Establish A Foundation For Effectively Carrying Out Pre-Hospital Care Ambulance Services Free Of Charge To Any Person And To Specify The Powers, Functions And Duties Of Such Foundation:",
      "Now Therefore Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the 1990 Suwaseriya Foundation Act, No. 18 of 2018, and shall come into operation on such date as the President may appoint by Order published in the  Gazette  (hereinafter referred to as the appointed date).",
            "pre_block_list": [
              "Short title and date of operation."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "I",
        "text": "",
        "pre_block_list": [
          "E STABLISHMENT   OF   THE  1990 S UWASERIYA  F OUNDATION"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be established a Foundation which shall be called the 1990 Suwaseriya Foundation (hereinafter referred to as the Foundation).",
                "pre_block_list": [
                  "Establishment of the 1990 Suwaseriya Foundation."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Foundation shall by the name assigned to it, by subsection (1) be a body corporate, with perpetual succession and a common seal and may sue and be sued in such name.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "The objects of the Foundation shall be to",
            "pre_block_list": [
              "Objects of the Foundation."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "provide pre-hospital care ambulance services and emergency response services free of charge to any person; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "provide immediate and effective pre-hospital care free of charge in a safe and clinical working environment until a person reaches the nearest healthcare provider.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "The powers, functions and duties of the Foundation shall be to",
            "pre_block_list": [
              "Powers, functions and duties of the Foundation."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "provide ambulance services, emergency response services and life-saving pre-hospital care in a safe and clinical working environment to any person free of any charge;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "provide such other services as may be determined by the Foundation to any person including training, equipment supply and managing other ambulance services provided by non-profit organizations free of charge upon a management fee as may be determined by the Foundation in consultation with the Minister;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "hold, take, give on lease, hire, sell, mortgage, grant, assign, exchange or otherwise dispose of the movable or immovable property belonging to the Foundation;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "receive grants, gifts or donation in cash or kind;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "enter into and execute, whether directly or through any officer or agent authorized in that behalf by the Board, all such contracts or agreements as may be necessary, for the discharge of the functions of the Foundation;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "open and maintain any account with any bank as it may think appropriate, and such account shall be operated in accordance with prevailing applicable written laws;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "g",
                "text": "manage, control, administer and operate the Fund of the Foundation; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "h",
                "text": "do all such other acts which may be incidental or conducive to, the attainment of the objects of this Act or the exercise or discharge of powers and duties assigned to the Foundation under this Act.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "The Foundation shall be capable in law to take and hold property movable or immovable which may become vested in it by virtue of any purchase, grant, gift, testamentary disposition, bequest, or otherwise and all such property shall be held by the Foundation for the purposes of this Act.",
            "pre_block_list": [
              "Powers of the Foundation to hold property."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "II",
        "text": "",
        "pre_block_list": [
          "A DMINISTRATION   AND   MANAGEMENT   OF   AFFAIRS"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The administration and management of the affairs of the Foundation shall be vested in a Board of Management (hereinafter reffered to as the Board).",
                "pre_block_list": [
                  "Administration of the Foundation vested in Board."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Board shall, for the purpose of administering the affairs of the Foundation, exercise, discharge and perform the powers, functions and duties conferred or assigned to or imposed on the Foundation by this Act.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "The Board shall consist of",
            "pre_block_list": [
              "Constitution of the Board."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "the following  ex-officio  members, namely",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "i",
                    "text": "the Secretary to the Ministry of the Minister assigned the subject of Finance or his representative;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "the Secretary to the Ministry of the Minister assigned the subject of Health or his representative;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iii",
                    "text": "the Inspector General of Police or his representative; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "four other members appointed by the President who shall possess academic or professional qualifications and have experience in the fields of medical science, pharmaceuticals medical technology,  finance,  management, administration, or law (hereinafter referred to as the appointed members).",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The President shall appoint one of the appointed members to act as Chairman of the Board.",
                "pre_block_list": [
                  "Chairman of the Board."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The  Chairman may resign from his office by letter addressed to the President and such resignation shall be effective from the date on which it is accepted by the President.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The President may for reasons assigned remove the Chairman from the office of Chairman.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Subject to the provisions of subsections (2) and (3), the term of office of the Chairman shall be the period of his membership of the Board.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Where the Chairman is temporarily unable to perform the duties of his office due to ill health, other infirmity, absence",
                "pre_block_list": [
                  "from Sri Lanka or any other cause, the President may appoint any other appointed member to act as Chairman in addition to his normal duties as an appointed member."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "A person shall be disqualified from being appointed or continuing as a member of the Board, if he",
            "pre_block_list": [
              "Disqualifications from being a member of the Board."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "is or becomes a member of Parliament or of any Provincial Council or of any local authority;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "is not or ceases to be a citizen of Sri Lanka;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "is under any law in force in Sri Lanka or any other country found or declared to be of unsound mind;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "is a person who having been declared insolvent or bankrupt under any law in force in Sri Lanka and is an undischarged insolvent or bankrupt;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "is serving or has served a sentence of imprisonment imposed by any court in Sri Lanka or in any other country;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "holds or enjoys any right or benefit under any contract made by or on behalf of the Foundation; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "g",
                "text": "has any financial or other interest as is likely to affect prejudicially the discharge by him of his functions as a member of the Board.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "10",
            "text": "Every appointed member shall, unless he earlier vacates office by resignation, death or removal, hold office for a period of three years from the date of his appointment and such member other than a member who is removed shall be eligible for re-appointment.",
            "pre_block_list": [
              "Term of office of members."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "11",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Every appointed member may at any time resign from his office by a letter to that effect, addressed to the President, and such resignation shall be effective from the date on which it is accepted by the President in writing.",
                "pre_block_list": [
                  "Removal and resignation of members."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where any appointed member by reason of illness, infirmity or absence from Sri Lanka is temporarily unable to discharge the functions of his office, the President may, having regard to the provisions of paragraph ( b ) of section 7, appoint some other person to act in his place.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The President may for the reasons assigned, remove an appointed member from office.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where an appointed member dies, resigns or is removed from office, the President may having regard to the provisions of paragraph ( b ) of section 7, appoint another person in his place and the person so appointed shall hold office for the unexpired period of the term of office of the member whom he succeeds.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "12",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The meetings of the Board shall be held at least once in every month and the quorum for a meeting of the Board shall be four members.",
                "pre_block_list": [
                  "Quorum and meetings of the Board."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Chairman shall preside at every meeting of the Board. In the absence of the Chairman from any meeting of the Board a member elected by the members present shall preside at such meeting.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "All questions for decision at any meeting of the Board shall be decided by the vote of the majority of members present at such meeting. In the case of an equality of votes the Chairman shall, in addition to his vote have a casting vote.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Subject to the preceding provisions of this section, the Board may regulate the procedure in relation to the meetings of the Board and the transaction of business at such meetings.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "13",
            "text": "The Board may act notwithstanding any vacancy among its members and any act or proceeding of the Board shall not be or deemed to be invalid by reason only of the existence of any vacancy among its members or any defect in the appointment of a member thereof.",
            "pre_block_list": [
              "Acts or proceedings of the Board deemed not to be invalid by reason of any vacancy."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "14",
            "text": "The members of the Board shall be paid remuneration in such manner and at such rates as may be determined by the President, with the concurrence of the Minister assigned the subject of Finance.",
            "pre_block_list": [
              "Remuneration of the members of the Board."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "15",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The seal of the Foundation shall be in the custody of such person as the Board may decide from time to time.",
                "pre_block_list": [
                  "Seal of the Foundation."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The seal of the Foundation may be altered in such manner as may be determined by the Board.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The seal of the Foundation shall not be affixed to any instrument or doucment except with the sanction of the Board and in the peresence of the Chairman and one other member of the Board who shall sign the instrument or document in token of their presence:",
                "pre_block_list": [
                  "Provided however, where the Chairman is unable to be present at the time when seal of the Foundation is affixed to any instrument or document, any other member of the Board authorized in writing by the Chairman on that behalf shall be competent to sign such instrument or document in accordance with the preceding provision of this subsection."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The Foundation shall maintain a register of the instruments and documents to which the seal of the Foundation has been affixed.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "III",
        "text": "",
        "pre_block_list": [
          "C HIEF   EXECUTIVE   OFFICER   AND   THE  S TAFF   OF   THE  F OUNDATION"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "16",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Board shall, in consultation with the Minister and having regard to the qualification and scheme of recruitment specified under subsection (2) appoint to the staff of the Foundation a Chief Executive Officer (in this Act referred to as the CEO).",
                "pre_block_list": [
                  "Appointment of the Chief Executive Officer of the Foundation."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Board shall, with the concurrence of the Minister specify qualification and the scheme of recruitment for the post of CEO.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The CEO shall subject to the general directions and supervision of the Board:",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "be charged with the administration of the affairs of the Foundation including the administration and control of the staff;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "be responsible for the execution of all decisions of the Board; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "carry out all such functions as may be assigned to him by the Board.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The CEO shall be entitled to be present and speak at any meeting of the Board, but shall not be entitled to vote at such meeting.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "The CEO may delegate in writing to any officer of the Foundation, any of his powers or functions and the officer to whom any such power or function is delegated shall exercise or perform them subject to the directions of the CEO.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "The Board may remove the CEO from office:",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "if he becomes permanently incapable of performing his duties;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "if he had done any act which, in the opinion of the Board, is of a fraudulent or illegal character or is prejudicial to the interests of the Foundation; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "has failed to comply with any directions issued by the Foundation.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "The CEO shall be paid such remuneration as may be determined by the Board.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "17",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Subject to the provisions of this Act, the Foundation may employ or appoint such employees as may be necessary for the efficient exercise, discharge and perform of its powers, functions and duties.",
                "pre_block_list": [
                  "Staff of the Foundation."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Board shall have the power subject to the provisions of the Act to",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "exercise disciplinary control over and dismiss the officers and employees of the Foundation;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "determine the terms and conditions of service of the officers and employees of the Foundation; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "fix the rates at which such officers and employees shall be remunerated with the concurrence of the Minister.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "All employees of the Foundation shall, within one month of employment, declare in writing to the Foundation of their personal direct or indirect interest to the affairs and transactions of the Foundation including those of their close relations or, concerns in which such employee has a substantial interest.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "IV",
        "text": "",
        "pre_block_list": [
          "F INANCE"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "18",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Foundation shall have its own Fund (hereinafter referred to as the Fund).",
                "pre_block_list": [
                  "Fund of the Foundation."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "All monyes lying to the credit of GVK EMRI Lanka (Private)  Limited (in this Act referred to as the GEL), on the day immediately preceding the appointed date shall be transferred to the Fund with effect from the appointed date.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "There shall be credited to the Fund:",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "all sums of money as may be voted from time to time by Parliament, for the use of the Foundation;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "all such sums as received by the Foundation in the exercise and discharge of its powers, functions and duties under this Act;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "all such sums of money as may be received by the Foundation by way of income, fees, charges, grants, gifts or donations from any source whatsoever whether within or outside Sri Lanka.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "There shall be paid out of the Fund:",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "all such sums of money as are required to defray any expenditure incurred by the Foundation in the exercise, performance and discharge of its powers, functions and duties under this Act; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "all such sums of money as are required to be paid out of the Fund, by or under, this Act.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "The Board shall make rules regarding payment of moneys out of the Fund.",
                "pre_block_list": [
                  "1990 Suwaseriya Foundation Act, No. 18 of 2018 11"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "19",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The financial year of the Foundation shall be the calendar year.",
                "pre_block_list": [
                  "Financial year and audit of accounts."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Board shall cause proper books of accounts to be kept of the income and expenditure, assets and liabilities and all other transactions of the Foundation.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The provisions of Article 154 of the Consititution relating to the audit of the accounts of public corporations shall apply to the audit of accounts of the Foundation.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The Board shall submit the audited statement of accounts together with the auditors report to the Minister within one hundred and fifty days of the end of the financial year to which such report relates. The Minister shall place such statement and the report before Parliament within two months of the receipt thereof.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "20",
            "text": "It shall be a defence in any criminal or civil proceeding for anything done or omitted to be done by",
            "pre_block_list": [
              "Defence in criminal or civil proceedings."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "a member of the Board;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "any employee or manager of the Foundation;",
                "pre_block_list": [
                  "if he proves that he exercised due diligence and reasonable care and acted in good faith in the course of or in connection with the discharge or purported discharge of his obligation under this Act or any regulation, rule, order or directive issued or made thereunder."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "21",
            "text": "Any expense incurred by a member of the Board or any other officer or employee or agent of the Foundation in any suit or prosecution brought against the Foundation or such person before any Court, in respect of any act which is done by the Foundation or such person under this Act or on the direction of the Foundation, shall, if the Court holds that",
            "pre_block_list": [
              "Expenses incurred to be paid out of the Fund.",
              "such act was done in good faith, be paid out of the Fund, and any cost paid or recovered by the Foundation or any such person referred to in this section, shall be credited to the Fund."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "V",
        "text": "",
        "pre_block_list": [
          "G ENERAL"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "22",
            "text": "The Foundation shall be deemed to be a Scheduled Institution within the meaning of the Bribery Act (Chapter 26) and the provision of the Act shall be construed accordingly.",
            "pre_block_list": [
              "Foundation deemed to be scheduled institution within the meaning of the Bribery Act."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "23",
            "text": "All members of the Board, the CEO, and all officers and employees of the Foundation shall be deemed to be public servants within the meaning and for the purposes of the Penal Code (Chapter 19).",
            "pre_block_list": [
              "Members, Officers and employees of the Foundation deemed to be public servants."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "24",
            "text": "The Minister may from time to time issue to the Board general or special directions as to the exercise, performance and discharge of the powers, duties and functions of the Board.",
            "pre_block_list": [
              "Directions of the Minister."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "25",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Subject to the provisions to of this Act, the Foundation may make rules in respect of all or any of the following matters:",
                "pre_block_list": [
                  "Rules."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "in respect of all matters for which rules are authorized or required to be made under this Act;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the meetings of the Board and the procedure to be followed at such meeting;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "in respect of the appoinment, promotion, remuneration and disciplinary control of an employee and the grant of leave and other emoluments to employees;",
                    "pre_block_list": [
                      "1990 Suwaseriya Foundation Act, No. 18 of 2018 13"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "in respect of the manner in which services, emergency response services and pre-hospital care shall be provided under this Act; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "any other matter connected with the affairs of the Foundation.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every rule made by the Foundation shall be approved by the Minister and be published in the  Gazette  and shall come into operation on the date of its publication or on such later date as may be specified therein.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "26",
            "text": "Notwithstanding anything to the contrary in any other written law:",
            "pre_block_list": [
              "Savings."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "all movable and immovable property of the GEL including the ambulances and medical equipment purchased under the grant from India maintained by the Ministry of Health for the purpose of GEL on the day immediately preceding the appointed date shall on and after the appointed date be deemed to be movable and immovable property of the Foundation;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "the employees, servants and agents of the GEL holding office on the day immediately preceding the appointed date shall on and after the appointed date be deemed to be the employees, servants and agents of the Foundation and such employees, servants and agents shall continue to hold office in the Foundation on the same terms and conditions enjoyed by them under the GEL immediately preceding the appointed date;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "all contracts, deeds, bonds, agreements, guarantees, powers of attorney, grants of legal representation and other instruments of whatever nature of the GEL",
                "pre_block_list": [
                  "subsisting and having effect on the day immediately preceding the appointed date and to which the GEL is a party or which are in favour of the GEL on and after the appointed date be deemed to be contracts, deeds, bonds, agreements, guarantees, powers of attorney, grants of legal representation and other instruments entered into by or granted in favour of the Foundation;"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "unless specifically revoked or substituted in the manner provided for in any other law, all approvals or licences granted to the GEL by any regulatory body or authority, Provincial Council, or local authority subsisting or having effect on the day immediately preceding the appointed date shall on and after the appointed date be deemed to be approvals or licences granted to the Foundation;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "any account maintained between the GEL and any other person in or outside Sri Lanka including the Government of Sri Lanka, its departments and statutory bodies on the day immediately preceding the appointed date, whether it be an asset or liability of the GEL shall on and after the appointed date be deemed  to be an account between the Foundation and such other person with the same rights and subject to the same obligations and incidents including rights of setoff as would have been applicable thereto if the account between the GEL and such other person had continued and so that any instruction, order, direction, mandate or authority given by such other person in relation to such account and subsisting on the day immediately preceding the appointed date shall, unless and until revoked or cancelled, apply to and have effect in relation to, the account between the Foundation and such other person;",
                "pre_block_list": [
                  "1990 Suwaseriya Foundation Act, No. 18 of 2018 15"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "all applications, actions, proceedings or appeals of whatever nature instituted under the provisions of any law by or against the GEL and pending on the day immediately preceding the appointed date shall on and after the appointed date be deemed to be applications, actions, proceedings or appeals instituted by or against the Foundation and may be continued accordingly;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "g",
                "text": "any pension fund, gratuity fund or unfunded liability in respect of a pension, gratuity or other liability relating to post employment benefit to any employee of the GEL and existing on the day immediately preceding the appointed date shall on and after the appointed date with the concurrence of the Minister assigned the subject of Finance be deemed, to be a pension fund, gratuity fund or such liability as the case may be, of the Foundation in respect of such employee;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "h",
                "text": "where the GEL on the day immediately preceding the appointed date was a contributor to any provident fund approved by the Commissioner of Labour for the benefit of its employees, then the Foundation shall on and after the appointed date be deemed, to be the contributor to such provident fund in respect of such employees;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "all tax credits, refunds, losses, concessions, reliefs, benefits and liabilities of the GEL subsisting on the day immediately precending the appointed date shall on and after the appointed date be deemed to be tax credits, refunds, losses, concessions, reliefs, benefits and liabilities of the Foundation;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "j",
                "text": "all judgments, decrees or orders entered in favour of, or against the GEL by any Court in any action or proceeding shall on and after the appointed date be deemed to be judgment, decrees or orders entered in favour of, or against the Foundation; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "k",
                "text": "all rights to intellectual property including trademarks, patents and software subsisting in favour of the GEL on the day immediately preceding the appointed date shall on and after the appointed date be deemed to be such rights in favour of the Foundation.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "27",
            "text": "In  this  Act,  unless  the  context  otherwise requires",
            "pre_block_list": [
              "Interpretation.",
              "close relation means spouse or dependent child;",
              "GVK  EMRI Lanka (Private) Limited means the company incorporated under the provisions of the Companies Act, No. 7 of  2007 bearing company incorporation No. PV 111132;",
              "healthcare provider includes any institution or establishment used or intended to be used for the reception of, and the providing of medical and nursing care and treatment for persons suffering from any sickness, injury or infirmity, a Hospital, Nursing Home, Maternity Home, Medical Laboratory, Blood Bank, Dental Surgery, Dispensary and Surgery, Consultation Room, and any establishment providing health screening or health promotion service, but does not include a house of observation, Mental hospital, any private dispensary or Pharmacy or drug stores exclusively used or intended to be used for dispensing and selling any drug, medical preparation or pharmaceutical product, or any Institution or premises registered for any purpose under the provisions of Ayurveda Act, No. 31 of 1961 and the Homeopathy Act, No. 7 of 1970;",
              "1990 Suwaseriya Foundation Act, No. 18 of 2018 17",
              "Minister means the Minister assigned the subject of the Suwaseriya Foundation;",
              "pre-hospital care includes first aid, emergency care or treatment given to a person suffering from any sickness, injury or infirmity until he reaches a health care provider;",
              "President means the President of the Democratic Socialist Republic of Sri Lanka;",
              "substantial interest means"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "in relation to a company, the holding of a beneficial interest by another company or an individual or his relative, whether singly or taken together, in the shares thereof, the paid up value of which exceeds ten  per centum  of the paid up capital of the company or the existence of a guarantee or indemnity for a sum not less than ten  per centum  of the paid up capital given by an individual or his relative or by another company on behalf of such company;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "in relation to a firm, the beneficial interest held therein by an individual or his relative, whether singly or taken together, which represents more than ten  per centum  of the total capital subscribed by all partners of the firm or the existence of a guarantee or indemnity for a sum not less than ten  per centum  of such capital given by an individual or the spouse, parent or child of the individual on behalf of such firm.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "28",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency.",
              "English Acts of the Parliament can be purchased at the P RAKASHANA  P IYASA , D EPARTMENT   OF G OVERNMENT  P RINTING , N O . 118, D R . D ANISTER  D E  S ILVA  M AWATHA , C OLOMBO  8."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}