{
  "n_pages": 5,
  "title_page": {
    "title": "Act",
    "num": "29",
    "year": "2022",
    "date_certified": "2022-10-25",
    "date_published": "2022-10-28",
    "price": 15.0,
    "price_postage": 15.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 25Th Of October, 2022]",
      "L. D.O. 49/2021",
      "A N  A Ct   To   Amend   The  W Ills  O Rdinance  (C Hapter  60)",
      "Be   It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows: -"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Wills (Amendment) Act, No. 29 of 2022.",
            "pre_block_list": [
              "Short title"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "Section 2 of the Wills Ordinance (Chapter 60) (hereinafter referred to as the principal enactment) is hereby repealed and the following section is substituted therefor:",
            "pre_block_list": [
              "Replacement of section 2 of Chapter 60",
              "Disposition of property by a will",
              "2. (1) It shall be lawful for any person who has reached the age of eighteen years and residing within or outside Sri Lanka to execute a will bequeathing and disposing any movable and immovable property and all and every estate, right, share or interest in any property which belong to him at the time of death and which, if not so devised, bequeathed or disposed would devolve upon his heirs of such person not legally incapacitated from taking the same as he shall seem fit."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every testator shall have full power to make such testamentary disposition as he shall feel disposed, and in the exercise of such right to exclude any child, parent, relative, or descendant, or to disinherit or omit to mention any such person, without assigning any reason for such exclusion, disinheritance, or omission, any law, usage, or custom now or herefore in force in Sri Lanka to the contrary notwithstanding",
                "pre_block_list": [
                  "",
                  "Wills (Amendment) Act, No. 29 of 2022 2",
                  "Repeal of section 3 of the principal enactment"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "Section 3 of the principal enactment is hereby repealed.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "Section 4 of the principal enactment is hereby repealed.",
            "pre_block_list": [
              "Repeal of section 4 of the principal enactment"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "Section 7 of the principal enactment is hereby amended as follows:",
            "pre_block_list": [
              "Amendment to section 7 of the principal enactment"
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the renumbering of that section as subsection (1) thereof; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the addition, immediately after the renumbered subsection (1) thereof, the following new subsection:",
                "pre_block_list": [
                  "(2) Upon the demise of a testator in a joint last will, testamentary proceedings shall be instituted under Chapter XXXVIII or Chapter XXXVIII B  of the Civil Procedure Code (Chapter 101), as the case may be, to obtain the probate or letters of administration with the will annexed proving the will",
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "Section 9 of the principal enactment is hereby amended by the substitution for the words buildings erected on the same, and, of the words, buildings erected on the same, condominium parcel or any land parcel, and.",
            "pre_block_list": [
              "Amendment to section 9 of the principal enactment",
              "Sinhala text to prevail in case of inconsistency"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "In the event of any inconsistency between the  Sinhala and the Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "English Acts of the Parliament can be purchased at the P RAKASHANA  P IYASA , D EPARTMENT   OF G OVERNMENT  P RINTING , N O . 118, D R . D ANISTER  D E  S ILVA  M AWATHA , C OLOMBO  8."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}