{
  "n_pages": 9,
  "title_page": {
    "title": "Regulation  Of  Insurance  Industry (Amendment)   Act",
    "num": "23",
    "year": "2017",
    "date_certified": "2017-10-19",
    "date_published": "2017-10-20",
    "price": 6.0,
    "price_postage": 10.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 19Th Of October, 2017]",
      "L. D.O. 45/2013.",
      "A N  A Ct   To   Amend   The  R Egulation   Of  I Nsurance  I Ndustry  A Ct , N O . 43  Of  2000",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:"
    ],
    "pre_section_list": [
      {
        "class_name": "ActL1Section",
        "num": "1",
        "text": "This Act may be cited as the Regulation of Insurance Industry (Amendment) Act, No. 23 of  2017.",
        "pre_block_list": [
          "Short title.",
          "Amendment of long title of Act, No. 43 of 2000."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "2",
        "text": "The long title of the Regulation of Insurance Industry Act, No. 43 of 2000 (hereinafter referred to as the principal enactment) is hereby amended by the substitution for the words ESTABLISHMENT OF AN INSURANCE BOARD, of the words ESTABLISHMENT OF AN INSURANCE REGULATORY COMMISSION OF SRI LANKA.",
        "pre_block_list": [],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "3",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "In the principal enactment and in any other written law, there shall be substituted for  the words Insurance Board of Sri Lanka and Board (denoting the Insurance Board of Sri Lanka), of the words Insurance Regulatory Commission of Sri Lanka and Commission respectively.",
            "pre_block_list": [
              "Insurance Board of Sri Lanka and Board to be referred to as the Insurance Regulatory Commission of Sri Lanka and Commission respectively."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "From and after the date of commencement of this Act, every reference to the Insurance Board of Sri Lanka in any notice, notification, contract, communication , form or other document shall be read and construed as a reference to the Insurance Regulatory Commission of Sri Lanka.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "4",
        "text": "Section 13 of the principal enactment is hereby amended in subsection (1) of that section, by the substitution for the words either one or both classes of insurance business, of the words general insurance business or long term insurance business.",
        "pre_block_list": [
          "Amendment of section 13 of the principal enactment.",
          "2PL 0053972,962 (08/2017)",
          "Regulation of Insurance Industry (Amendment) Act, No. 23 of 2017 2"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "5",
        "text": "The following new sections are hereby inserted immediately after section 15 A  of the principal enactment and shall have effect as sections 15 B , 15c and 15 D  of that enactment:",
        "pre_block_list": [
          "Insertion of new sections 15 B , 15c and 15 D  in the principal enactment.",
          "15 B . Notwithstanding the provisions of section 15 A , the Commission shall, upon being satisfied",
          "Local subsidiary insurance company of any foreign holding company.",
          "( a ) that at least eighty five  per centum of shares of the local subsidiary insurance company are held by a foreign holding company listed on a stock exchange outside Sri Lanka and which stock exchange is a member of the World Federation of Exchanges or such other organization recognized by the Commission;",
          "( b ) the accounts of such local subsidiary insurance company are included in the Group Consolidated Accounts of the foreign holidng company; and",
          "( c ) such foreign holding company is legally required by the foreign stock exchange on which it is listed to ensure group level compliance with all regulatory requirements of the foreign stock exchange including the requirement pertaining to the accounts of the local subsidiary insurance company,",
          "exempt such local subsidiary insurance company from being listed on a stock exchange licensed under the Securities and Exchange Commission of Sri Lanka Act, No. 36 of 1987.",
          "15 C . (1) The National Insurance Trust Fund established under the provisions of the National Insurance Trust Fund Act, No. 28 of 2006 shall be exempted from being listed on a stock exchange licensed under the provisions of the Securities and Exchange Commission of Sri Lanka Act, No. 36 of 1987.",
          "Exemption from being listed."
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "The Commission shall, upon being satisfied that a local subsidiary insurance company is held by a company that is listed on a stock exchange licensed under the Securities and Exchange Commission of  Sri Lanka Act, No. 36 of 1987 shall exempt such local subsidiary insurance company from being listed on a stock exchange licensed under the provisions of above-said Act.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "The Sri Lanka Insurance Corporation Limited or any insurance companies formed upon the segregation of the Sri Lanka Insurance Corporation Limited into two separate companies, whatever the names assigned to such companies on the date on which such segregation takes place shall be exempted from being listed on a stock exchanges, licensed under the Securities and Exchange Commission of Sri Lanka Act, No. 36 of 1987.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "No such exemption shall be valid, unless the Sri Lanka Insurance Corporation Limited or any insurance companies formed upon the segregation of the Sri Lanka Insurance Corporation Limited into two separate companies is or are owned by the Government of Sri Lanka.",
                "pre_block_list": [
                  "Regulation of Insurance Industry (Amendment) Act, No. 23 of 2017 4",
                  "15 D . It shall be the duty of ",
                  "Duty to comply with the terms and conditions.",
                  "( a ) any local subsidiary insurance company of any foreign holding company;",
                  "( b ) the National Insurance Trust Fund established under the provisions of National Insurance Trust Fund Act, No 28 of 2006; and"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "the entities referred to in subsections (2) and (3) of section 15c of this Act,",
                "pre_block_list": [
                  "to comply with any terms and conditions as may be determined by the Commission from time to time",
                  ""
                ],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "6",
        "text": "Section 78 of the principal enactment is hereby amended by the repeal of subsection (5) of that section and the substitution therefor, of the following:-",
        "pre_block_list": [
          "Amendment of section 78 of the principal enactment."
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "5",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "No person shall be eligible to be appointed as an insurance agent of a broker, if such person is already registered as an insurance agent of another broker or an insurer.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "No person shall be eligible to be appointed as an insurance agent of an insurer, if such person is already registered as an insurance agent of a broker.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "No person shall be eligible to be appointed as an insurance agent of an insurer for a particular class of insurance business, if such person is already registered as an insurance agent of another insurer for the same class of insurance business",
                "pre_block_list": [
                  ""
                ],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "7",
        "text": "Section 114 of the principal  enactment is hereby amended as follows:-",
        "pre_block_list": [
          "Amendment of section 114 of the principal enactment."
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "by the insertion, immediately after the definition of the expression classes of insurance business, of the following new definitions:",
            "pre_block_list": [
              " class of insurance business means general insurance business or long term insurance business;",
              "foreign holding company means any company or body corporate which is incorporated or established outside Sri Lanka and which is a holding company of local subsidiary insurance company;; and"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "by the insertion, immediately after the definition of the expression local authority security, of the following new definition:",
            "pre_block_list": [
              " local subsidiary insurance company means a person registered to carry on insurance business in Sri Lanka under the provisions of this Act, and includes a company deemed to be registered under section 113(2) of this Act;."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "8",
        "text": "(1 )  All contracts, agreements and other instruments of the insurance Board of Sri Lanka subsisting on the day immediately prior to the date of commencement of this Act, shall be deemed with effect from the date of commencement of this Act to be contracts, agreements or other instruments entered into by the Insurance Regulatory Commission of Sri Lanka.",
        "pre_block_list": [
          "Savings."
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "All suits, actions and other legal proceedings instituted by or against the Insurance Board of Sri Lanka and pending on the day, immediately prior to the date of commencement",
            "pre_block_list": [
              "Regulation of Insurance Industry (Amendment) Act, No. 23 of 2017 6",
              "of this Act, shall be deemed with effect from the date of commencement of this Act to be suits, actions and other legal proceedings instituted by or against the Insurance Regulatory Commission of Sri Lanka."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "3",
            "text": "All the rights, liabilities and obligations of the Insurance Board of Sri Lanka on the day immediately prior to the date of commencement of this Act, shall be deemed with effect from the date of commencement of this Act to be the rights, liabilities and obligations of the Insurance Regulatory Commission of Sri Lanka.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "4",
            "text": "All movable and immovable property vested in the Insurance Board of Sri Lanka on the date immediately prior to the date of commencement of this Act shall, with effect from the date of commencement of this Act, vest in the Insurance Regulatory Commission of Sri Lanka.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "5",
            "text": "Every decree, order or judgment entered in favour of or against the Insurance Board of Sri Lanka by any court in any action or proceeding, shall with effect from the date of commencement of this Act, be deemed to be a decree, order or judgment entered in favour of or against the Insurance Regulatory Commission of Sri Lanka and may be enforced accordingly.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "9",
        "text": "For the avoidance of doubt, it is hereby declared that theInsurance Regulatory Commission of Sri Lanka, shall for all purposes be deemed to be the successor to the Insurance Board of Sri Lanka established under section 2 of the principal enactment.",
        "pre_block_list": [
          "Insurance Regulatory Commission of Sri Lanka to be the successor to the Insurance Board of Sri Lanka."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "10",
        "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
        "pre_block_list": [
          "Sinhala text to prevail in case of inconsistency."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "11",
        "text": "The provisions of section 5 of this Act shall apply to any local subsidiary insurance company of any foreign holding company which holds a valid licence issued on or before February 7, 2011 under section 15 of the principal enactment after having fulfilled where so required the segregation requirements specified in section 53 of Regulation of Insurance Industry (Amendment) Act, No. 3 of 2011.",
        "pre_block_list": [
          "Extension of the application of section 5 to the existing insurers.",
          "Regulation of Insurance Industry (Amendment) Act, No. 23 of 2017 8"
        ],
        "child_level_list": []
      }
    ],
    "part_list": []
  }
}