{
  "n_pages": 17,
  "title_page": {
    "title": "Buddhasravaka Bhikku University (Amendment) Act",
    "num": "15",
    "year": "2012",
    "date_certified": "2012-07-11",
    "date_published": "2012-07-13",
    "price": 12.0,
    "price_postage": 10.0
  },
  "body_pages": {
    "preamble": [
      "[ Certified On 11Th July, 2012]",
      "L.D.O. 52/2006.",
      "A N  A Ct   To  A Mend   The  B Uddhasravaka  B Hikku  U Niversity  A Ct , N O . 26  Of  1996",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as  the Buddhasravaka Bhikku University (Amendement) Act, No. 15  of 2012.",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "In the Buddhasravaka Bhikku University Act, No. 26 of 1996 (hereinafter referred to as the \"principal enactment\") and in any other written law, there shall be substituted for the words \" Buddhasravaka Bhikku University\" the words \"Bhikku University of Sri Lanka\".",
                "pre_block_list": [
                  "General amendment to the Buddhasravaka Bhikku University Act, No. 26 of 1996."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every reference to the \"Buddhasravaka Bhikku University\" in any regulation, rule, notice, notification, contract, communication or other document shall be read and construed as a reference respctively, to the \"Bhikku University of Sri Lanka\".",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "Section 4 of the principal enactment is hereby amended as follows:",
            "pre_block_list": [
              "Amendment of section 4 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the deletion of the word \"and\" in paragraph ( q );",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the re-numbering of paragraph ( r ) as paragraph ( t ); and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "by the addition immediately after paragraph ( q ) thereof, of the following new paragraphs:",
                "pre_block_list": [
                  "\"( r ) to conduct  post-graduate courses for clergy students which are consistent with the objects of the University;",
                  "2PL 005804   4,090 (06/2012)"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "s",
                    "text": "to estabish local and foreign affiliated institutions as required by the University, and\".",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "Section 5 of the principal enactment is hereby amended by the repeal of subsection (2) of that section and the substitution therefor of the following:",
            "pre_block_list": [
              "Amendment of section 5 of the principal enactment.",
              "\"(2) In the event of any Maha Nayaka Thera or Chief Maha Nayaka Thera of any Nikaya referred to in subsection (1) declining to accept the appointment as Maha Mahopadyaya of the University the Minister in consultation with such Maha Nayaka Thera or Uththarithara Sabhawa, as the case may be, may make recommendation to the President to appoint another suitable Nayaka Thera of such Nikaya to be the Maha Mahopadyaya of the University.\"."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "Section 6 of the principal enactment is hereby amended by the insertion immediately after paraghaph (ii) thereof, of the following new paragraph:",
            "pre_block_list": [
              "Amendment of section 6 of the principal enactment.",
              "\"(iia) Dean of each Faculty;\""
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "Section 7 of the principal enactment is hereby amended as follows:",
            "pre_block_list": [
              "Amendment of section 7 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "in subsection (1) of that section",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "in paragraph ( a ) thereof, by the substitution for the word \"Minister\" of the word \"President\";",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "in paragraph ( b ) thereof, by the substitution for the words \"post-graduate degree in Buddhist Studies from a recognized University.\" of the words \"post-graduate degree in Buddhist Studies or in any other subject connected thereto from a recognized, University on a research done within a period of not less than two years and having ten years experience in the field of teaching.",
                    "pre_block_list": [
                      "In addition he shall be required to possess a good knowledge of oriental languages.\";"
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "in subsection (2) of that section",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "in paragraph (iii) thereof, by the substitution for the word \"Minister,\" of the words \"President through the Minister,\";",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "in paragraph (iv) thereof by the substitution for the word \"Minister\" of the word \"President\";",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "by the addition immediately after paragraph (v) thereof, of the following new paragraph:",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "vi",
                        "text": "Notwithstanding anything to the contrary in any other provision of this Act, the term of office of the Mahopadyaya of the University, who last held office on the day immediately preceding the date of coming into operation of this section, shall continue for  a further period of three years from the date of coming into operation of this section.;",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "by the repeal of subsections (3) of that section and the substitution therefor of the following:",
                "pre_block_list": [
                  "\"(3) ( a ) If there is sufficient proof that the Mahopadyaya has acted in a manner detrimental to the interests of the University, the President shall, on a resolution passed by not less than two-thirds of the total membership of the Uththaraithara Sabhawa at a special meeting convened for the purpose, require the Minister to take necessary steps to ensure the removal of the Mahopadyaya from office."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "The Mahopadyaya shall be the Accounting Officer of the University, who shall comply with",
                    "pre_block_list": [
                      "any determination or regulation or directive of the Council of the University relating to the control of finances and properties of the University. The Mahopadyaya shall exercise, perform and discharge such powers, duties and functions as may be conferred on him by this Act or by any regulation or rule made under this Act.\";"
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "by the deletion of the first paragraph of subsection (4) of that section;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "by the renumbering of the second paragraph of subsection (4) of that section as subsection (4) thereof.",
                    "pre_block_list": [
                      "Amendment of section 8 of the principal enactment."
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "Section 8 of the principal enactment is hereby amended as follows:",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the repeal of subsection (1) of that section, and the substitution therefor, of the following:",
                "pre_block_list": [
                  "\"(1) The first Registrar  of the University shall be appointed by the Minister for a period of three years. The Council shall on the recommendation of a selecting committee, appoint every subsequent Registrar for a period of five years, which may be renewed. Where an officer in the public service shall be appointed as the Registrar of the University the concurrence of the Secretary to the Ministry of the Minister in charge of the subject of Public Administration and the relevant officer shall be obtained.\";"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the repeal of subsection (3) of that section and the substitution therefor of the following:",
                "pre_block_list": [
                  "\"(3) The Registrar shall be the Assistant Accounting Officer of the University.\";"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "by the addition immediately  after subsection  (5)  of  that  section  of the following  new  subsection:",
                "pre_block_list": [
                  "\"(6) The Registrar shall be responsible to the Council for the safe custody of the records and properties of the University.\".:"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "Section 9 of the principal enactment is hereby amended in subsection (2) by the substitution for the words \"finances of the University and maintenance of its accounts\" of the words \"Finances of the University under the supervision of the Registrar and for the maintenance of its accounts \".",
            "pre_block_list": [
              "Amendment of section 9 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "Section 11  of the principal enactment is hereby amended as follows:",
            "pre_block_list": [
              "Amendment of section 11 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the substitution for the words \"the Senate.\" of the words \"the Senate;\";",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the addition immediately after paragraph (iii) thereof, of the following new paragraph:",
                "pre_block_list": [
                  "\"(iv) a Board of the Faculty or Boards of the Faculty.\"."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "10",
            "text": "Section 14 of the principal enactment is hereby amended as follows:",
            "pre_block_list": [
              "Amendment of section 14 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the repeal of subsection (1) of that section and the substitution therefor, of the following:",
                "pre_block_list": [
                  "\" (1) The Council of the University (hereinafter referred to as the \"Council\") shall be the executive and governing body of the University and shall consist of the following:"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "ex-officio  members",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "the Mahopadyaya;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "the Dean of each Faculty;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "two members of the academic staff",
                        "pre_block_list": [
                          "of the University elected from and",
                          "among the members of the Senate;"
                        ],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iv",
                        "text": "the Secretary to the Ministry of the Minister in charge of the subject of Buddha Sasana, or his nominee.",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "v",
                        "text": "the Secretary to the Ministry of the Minister in charge of the subject of Higher Education, or his nomine; and",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "vi",
                        "text": "the Secretary to the Ministry of the Minister in charge of the subject of Finance or his nominee.",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "appointed members appointed by the Minister",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "five learned Bhikkus who have rendered distinguished service to the Buddha Sasana; and",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "three lay Buddhists who have rendered distinguished service to the Buddha Sasana, and who have experience in the fields of Financ, Law and Administration.\"; and",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the addition immediately after subsection (9)  thereof, of the following new subsection:",
                "pre_block_list": [
                  "\"(10) Notwithstanding anything in this Act,",
                  "the appointed members of the Council who held office on the day immediately preceding the date of coming into operation of this section, shall continue to hold such office for the unexpired period from the date of coming into operation of this section.\"."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "11",
            "text": "Section 15 of the principal enactment is hereby amended in subsection (2) as follows:",
            "pre_block_list": [
              "Amendment of section 15 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "by the repeal of parapraph (xii) of that subsection and the substitution therefor of the following paragraph:",
                "pre_block_list": [
                  "\"(xii) to appoint a Bhikku Students Council which shall include representatives of the Bhikku Students for the promotion of the general well-being of the Bhikku Students of the University. The composition, powers, duties and function of such Council shall be prescribed by Ordinance;\";"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "by the addition immediately after paragraph (xiv) of that subsection, of the following new paragraphs:",
                "pre_block_list": [
                  "\"(xv) to formulate the scheme of recruitment  and  appointing procedure to be applied to the staff of the University to be on par with the schemes of recruitment and appointing procedures adopted in other Universities established under the Universities Act, No. 16 of 1978,",
                  "and to determine, from time to time, the various grades of the staff and the cadres of each grade;",
                  "(xvi) to determine, from time to time, the remuneration to be paid to various grades of the staff of the University and other benefits to be granted to such staff on the basis of the overall salaries and remuneration principles of other Universities established under the Universities Act, No. 16 of 1978 and in consultation with the Minister in charged of the subject of Finance;\";"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "by the re-numbering of paragraphs (xv) and   (xvi) as paragraphs (xvii) and (xviii).",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "12",
            "text": "Section 16 of the principal enactment is hereby amended as follows:",
            "pre_block_list": [
              "Amendment of section 16 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the repeal of subsection (2) of that section and the substitution therefor of the following subsection:",
                "pre_block_list": [
                  "\"(2) The Senate of the University shall consist of the following persons:"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "i",
                    "text": "Mahopadyaya;",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "the Dean of each Faculty of the University;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "the Head of each Department of Study;",
                        "pre_block_list": [
                          "(vi) the Librarian of the University;",
                          "(v) the every permanent Professor of the University;",
                          "(vi) one person from the teachers other than those referred to above elected by the permanent teachers of each Faculty from and among their number;",
                          "(vii) three teachers appointed by the Council of the University from among male Professors, Associate Professors and Senior Lecturers of the Departments of Buddhists Studies or Cultural Studies of other Universities in Sri Lanka;",
                          "(viii) three persons appointed by the Council of the University from among learned and distinguished laymen or members of the clergy who are not members of the staff of any University.\";"
                        ],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the insertion immediately after subsection (2) thereof of the following new subsections:",
                "pre_block_list": [
                  "\"(2A) Every elected or appointed member shall hold office for a period of three years from the date of his election or appointment, as the case may be:",
                  "Provided however, any member elected or appointed vacates office on grounds of retirement, resignation or being absent himself from three consecutive meetings of the Senate or otherwise, another member shall be elected or appointed, as the case may be, in place of such member in compliance with the provisions of paragraphs (vi), (vii) and (viii) of subsection (2). Further, such member shall hold office  for the unexpired term of office of his predecessor unless he vacates office earlier.",
                  "(2B) Notwithstanding anything in this Act, the appointed members, holding office on the day immediately preceding the date of coming into operation of this section, shall cease to hold such office on the date of coming into operation of this section:",
                  "Provided however, that the appointed members who cease to hold such office shall be eligible for reappointment.\".",
                  "Amendment of section 17 of the principal enactment."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "13",
            "text": "Section 17 of the principal enactment is hereby amended as follows:",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "in subsection (1) of that section",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "by the addition in paragraph (vi) thereof immediately after the word \"Council;\" of the words \"after considering the reports from the Faculty concerned;\".",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "in item ( c ) of paragraph (vii) thereof, by the substitution for the words \"Committee,\" of the word \"Committee;\".",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "by the addition immediately after sub paragraph (c) in paragraph (vii) thereof of the following:",
                    "pre_block_list": [
                      "\"( d ) to set up a Research and Publication Committee,\"."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the addition immediately after subsection (1) thereof of the following new subsection:",
                "pre_block_list": [
                  "\"(1A) The Senate may with the approval of the Minister, establish, from time to time, the Faculty or Department of Studies, as the Senate deems necessary, for the development of teaching, research and extension programmes of the University to realize the objects of the University.\".",
                  "Insertion of new sections 18A, 18B, 18C and 18D of the principal enactment."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "14",
            "text": "The following new sections are hereby inserted immediately after secftion 18 of the principal enactment and shall have effect as sections 18A, 18B, 18C and 18D of that enactment:",
            "pre_block_list": [
              "18A.  Every Faculty of the University shall have a Board of the Faculty",
              "\"The Board of each Faculty.",
              "(hereinafter referred to as the \"Board\") consisting of the following:",
              "( a ) the Dean of the Faculty concerned;",
              "( b ) all Permanent Professors, Associate Professors, Senior Lecturers and Permanent  Lecturers  of  the Departments of Studies which constitute the Faculty;",
              "( c ) two persons other than those referred to in paragraphs ( b ) of this section elected by the permanent academic staff of the Faculty from and among their numbers;",
              "( d ) two students elected by the students of the Faculty from and among their numbers; and",
              "( e )  three persons appointed by the Board who excel in the fields of study relevant to the Faculty and are not members of the staff of the University.",
              "18B.  (1) Subject to the provisions of this Act, the Board shall exercise, perform and discharge the powers, duties and functions:",
              "Powers, duties and functions of the Board.",
              "( a ) to consider and report back any matter referred to the Faculty by the Senate;",
              "( b ) to regulate subject to the control of the Senate, all matters pertaining to the teaching, examinations and research activities of the Departments of Study of the Faculty;",
              "( c ) to appoint committees which may include non-members of the Faculty",
              "to consider and report any special subject or subjects;",
              "( d ) to  submit  to  the    Senate recommendations and reports on study courses and examinations of the Faculty; and",
              "( e )  to recommend to the Senate the suitable persons to be appointed as invigilators."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Each Faculty shall have a Dean and he shall be a full time officer of the University and shall be the academic and administrative head of the Faculty. The Board of each Faculty shall elect the Dean from among the Heads of Departments of Studies, which constitute the Faculty and he shall cease to be the Head of the Depatrment of Studies concerned upon his election as the Dean:",
                "pre_block_list": [
                  "Provided that the first Dean to be appointed on the date of commencement of this Act shall be appointed by the Council on the recommendation of the Mahophadyaya."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "The Dean shall preside at every meeting of the Board of the Faculty ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "The members elected under paragraph ( d ) of section 18A shall be excluded from the business of any meeting of the Board convened for matters pertaining to the election of a Dean  and  to  decisions concerning examinations and",
                    "pre_block_list": [
                      "matters incidental thereto and such meeting shall be deemed to be a duly convened valid meeting irrespective of such exclusion."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The Dean, shall hold office for a period of three years from the date of his election and shall be eligible for re-election unless removed earlier from office.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Where the Dean is temporarily unable to perform the duties of his office on account of ill health, absent on leave or any other cause for a period of not more than three months, the Mahopadyaya shall appoint another to act in the place of the Dean, during such period as the Head of a Department of Study of that Faculty.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "Every member elected under paragraph ( d ) of section 18A shall hold office for a period of one academic year from the date of his election and all other elected members shall hold office for a period of three years from the date of election. Every such member shall be elegible for re-election.",
                "pre_block_list": [
                  "18C.  (1) The Head of a Department of Study  shall be a Professor, Senior Lecturer or a Permanent Lecturer appointed by the Council on the recommendation of the Mahopadyaya:",
                  "The Head of a Department of Study.",
                  "Provided however, that where a Head of any Department of Study is not appointed by the Council, the Mahopadyaya may appoint a Professor, an Associate Professor, Senior Lecturer or Permanent Lecturer to",
                  "act as the Head of a Department of Study of that Faculty for a period of one month from the date of such appointment.",
                  "(2) The Head of a Department of Study, subject to the provisions of any appropriate instrument, shall hold office for a period of three years from the date of his appointment and shall be eligible for re-appointment unless removed from office.",
                  "(3) Where the Head of a Department of Study is temporarily unable to perform the duties of his office on account of ill health, absent on leave or any other cause for a period not more than three months, the Mahopadyaya shall appoint another Professor, Associate Professor, Senior Lecturer or a Permanent Lecturer to the Department of Study concerned to act in that post during such period:",
                  "Provided however, that where a Head of any Department of Study is unable to perform the duties of his office on account of retirement, resignation or any other cause, for a period more than three months, the post of Head of the Department of Study concerned shall be deemed vacant and a new Head Department of Study shall be appointed to such post in terms of subsection (1).",
                  "18D.  The Governing Council may, with the apporval of the Minister, establish, from time to time, any Faculty or Department of Study as the Governing Council thinks necessary for the development of teaching, research and promotional programmes in order to fulfull the objects of the University.\".",
                  "Establishment of Faculties and Departments of Study."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "15",
            "text": "Section 23 of the principal enactment is hereby amended in subsection (1) by the addition immediately at the end of that subsection of the words \"If upon such appointment, the teacher so appointed disrobes, he shall cease to hold such office.\".",
            "pre_block_list": [
              "Amendment of section 23 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "16",
            "text": "Section 26 of the principal enactment is hereby amended by the  substitution  for the words \"fifty fifth year\" of the words \"fifty-seventh year.\".",
            "pre_block_list": [
              "Amendment of section 26 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "17",
            "text": "The following new section is hereby inserted immediately after section 57 of the principal enactment and shall have effect as section 57A of that enactment:",
            "pre_block_list": [
              "Insertion of new section 57A to the principal enactment.",
              "57A.  The Council, Senate and any other body established under this Act, in the exercise, performance and discharge of their respective powers, duties and functions under this Act, shall comply with such rules and regulations as may from time to time be made by the University Grants Commission.\".",
              "\"Council, Senate and any other body to comply with rules and regulations of the University Grants Commission."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "18",
            "text": "Section 68 of the principal enactment is hereby amended as follows:",
            "pre_block_list": [
              "Amendment of section 68 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the insertion immediately after the definition of the expression \"the Council\" of the following definition:",
                "pre_block_list": [
                  "\"University Grants Commission\" means the University Grants Commission established under the Universities Act, No. 16 of 1978;\";"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "in the definition of \"teacher\", by the substitution for the words \"a teacher; and\" of the words \"a teacher.\";\";",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "in the definition of \"the Council\", by the substitution for the words \"the University.\" of the words \"the University; and\".",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "19",
            "text": "In the event of any inconsistancy between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of any inconsistancy.",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , D EPARTMENT   OF G OVERNMENT  I NFORMATION , N O . 163, K IRULAPONA  M AWATHA , P OLHENGODA , C OLOMBO  05 before 15th December each year in respect of the year following ."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}