{
  "n_pages": 8,
  "title_page": {
    "title": "Youth  Corps  Act",
    "num": "21",
    "year": "2002",
    "date_certified": "2002-10-04",
    "date_published": "2002-10-04",
    "price": 6.75,
    "price_postage": 4.5
  },
  "body_pages": {
    "preamble": [
      "[Certified On 04Th October, 2002]",
      "L.D.O. 47/2002.",
      "A N  A Ct   To   Provide   For   The   Establishment   Of   A  Y Outh  C Orp  ;",
      "For   The   Setting   Up   Of   A  C Ouncil   For  Y Outh  A Ffairs  ;  And",
      "To   Provide   For   Matters   Connected   Therewith   Or   Incidental",
      "Thereto",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Youth Corps Act, No. 21 of 2002.",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "I",
        "text": "",
        "pre_block_list": [
          "C OUNCIL   OF   THE  Y OUTH  C ORPS"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be established a Council of the Youth corps (hereinafter referred to as the Council) which shall consist of five members one of whom shall be a female, as may be appointed by the Minister who shall nominate one of them as the Chairman of the Council. The members shall be chosen from among persons having knowledge and experience in the fields of youth development, employment and education.",
                "pre_block_list": [
                  "Establishment of the Council of the Youth Corps."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "All matters in respect of the administration of the Council shall be as prescribed.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The term of office of the members of the Council shall be three years.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "There shall be appointed three committees for the purpose of vocational training, youth development and placement  as are necessary for the administration of the affairs of the Council. The Council may delegate its powers to such Committees.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "The constitution of such Committees and the procedure to be adopted by such Committees shall be as prescribed.",
                "pre_block_list": [
                  "2H 016444  5,550 (07/2002)"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "The Youth Corps shall be a non-military organization for youth, having as its objectives",
            "pre_block_list": [
              "Objectives of the Youth Corps."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "youth development and employment training ; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "vocational education.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "The Council shall have the power",
            "pre_block_list": [
              "Powers of the Council."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "to prepare plans and programmes for the Youth Corps ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "to monitor and report on the implementation of such plans and programmes prepared under paragraph ( a ), as are approved by the Minister ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "to supervise the training of the members of the Youth Corps ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "to specify in consultation with the Director of the Youth Corps, the conditions relating to the training and efficiency of the members of the Corps and the degree of proficiency required to be attained by a ranger.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "II",
        "text": "",
        "pre_block_list": [
          "Y OUTH  C ORPS"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "There shall be raised and Maintained, in accordance with the provisions of this Act, a Corp to be known as the Youth Corps (hereinafter referred to as the Corps).",
            "pre_block_list": [
              "Youth Corps."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Corps shall be formed into such units and shall consist of such strength as the Minister may from time to time determine.",
                "pre_block_list": [
                  "Minister to determine units strengths of Corps."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The structure and ranks of the Corps and the appointments, promotions and demotions to and from, such ranks, shall be prescribed.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "The Minister shall appoint a fit and proper person as the Director of the Corps, who shall be responsible for the administration, training, discipline and efficiency of the Corps.",
            "pre_block_list": [
              "Director of Corps."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "The Director of the Corps shall",
            "pre_block_list": [
              "Duties of the Director of the Corps."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "give effect to the decisions of the Council and ensure that the decisions of the Council are given effect to ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "furnish to the Council such information as it may require for the exercise, performance and discharge of its powers, duties and functions.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "The officers of the Corps shall be appointed by the Secretary to the Ministry of the Minister.",
            "pre_block_list": [
              "Minister to appoint officers."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "10",
            "text": "Any member of the armed forces, the police force, the public service or a public corporation having special aptitude in the fields of youth development and employment training may be seconded  for service in the corps on full time or part time basis and shall be subject to such terms and conditions as may be prescribed.",
            "pre_block_list": [
              "Secondment of officers &c. for service in the Corps."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "11",
            "text": "The Director may with the approval of the Minister, by Notification published in the Gazette, invite persons who are not below eighteen years and not above twenty eight years of age to render voluntary  service in the Corps as a ranger. The manner of selection of such persons to whom the provisions of this section shall apply shall be prescribed.",
            "pre_block_list": [
              "Voluntary enlistment in the Corps."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "12",
            "text": "A ranger may, on the expiration of the period for which he was enrolled be discharged from the Corps, subject to the regulations made under this Act. Any ranger so discharged may, where necessary be enrolled in terms of an agreement entered into in that behalf.",
            "pre_block_list": [
              "Rangers to be discharged on expiration of period of enrollment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "13",
            "text": "Any ranger who",
            "pre_block_list": [
              "Discipline of rangers of the Corps."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "in such manner as to show willful defiance of authority, disobeys an lawful command given to him or conveyed to him personally by an officer ; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "contravenes or fails to comply with any order or regulation made under this Act,",
                "pre_block_list": [
                  "shall be disciplined in such manner as is prescribed."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "14",
            "text": "The Minister may with the concurrence of the Minister in charge of the subject of Finance determine the remuneration and other allowances of the officers and rangers of the Corps.",
            "pre_block_list": [
              "Minister to determine allowances of officers and rangers of the Corps."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "15",
            "text": "All property belonging to the Corps other than the property of individual members of the Corps and the exclusive right to sue, and recover, moneys and other property due to the Corps or any part of the Corps, shall vest in the Director of the Corps for the time being, with power for him to sue, to make contracts and conveyances, and to do all other lawful things relating to such property, and any civil or criminal proceedings taken by virtue of this section by the Director of the Corps shall not be discontinued and shall not abate by reason of his death, resignation, retirement, or removal from office but may be carried on by, and in the name of, his successor in office.",
            "pre_block_list": [
              "Property of the Corps to vest in the Director of the Corps."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "16",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Cabinet of Ministers may direct any Government department, public corporation, statutory body or any other Government institution to extend such services as forms part of the ordinary activities of such department, corporation, board or institution, to the Corps.",
                "pre_block_list": [
                  "Powers of the Cabinet of Ministers."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Cabinet of Ministers may appoint such number of Committees as it may consider necessary for the consideration of the manner in which such services are to be extended. The Cabinet of Ministers shall determine the functions of such Committees and the procedure to be followed by such Committees.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "III",
        "text": "",
        "pre_block_list": [
          "G ENERAL"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "17",
            "text": "Article 154 of the Constitution shall apply to the audit of the accounts of the Corp.",
            "pre_block_list": [
              "Accounts and Audit."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "18",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Minister may make regulations for the purpose of carrying out and giving effect to the principles and provisions of this Act.",
                "pre_block_list": [
                  "Regulations."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "In particular and without prejudice to the generality of the powers conferred by subsection (1), the Minister may make regulations for or in respect of all or any of the following matters :",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the appointment of members and the organization, control, administration and discipline of the Corps ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the uniforms to be worn by members of the Corps ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "the training of rangers ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "the disbandment of the whole or any part of any unit of the Corps ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "the age and other qualifications for ranger membership, promotion, advancement or reduction in rank of rangers and dispensation with the services of rangers ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "the termination of the service of any member of the Corps other than a ranger ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "g",
                    "text": "the procedure to be followed for the constitution of the Committees to be appointed by the Council and the composition of the same ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "h",
                    "text": "any matter in respect of which regulations are required to be made.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every regulation made by the Minister under subsection (1) shall be published in the Gazette and shall come into operation on the date of such publication or on such later date as may be specified in the regulation.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Every regulation made by the Minister under subsection (1) shall as soon as convenient after its publication in the Gazette be brought before Parliment for approval. Any",
                "pre_block_list": [
                  "regulation which is not so approved shall be deemed to be rescinded as from the date of such disapproval but without prejudice to anything previously done thereunder. Notification of the date of which a regulation is deemed to be rescinded shall be published in the Gazette."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "19",
            "text": "For the purposes of this Act",
            "pre_block_list": [
              "Interpretation.",
              "youth means a person not below the age of eighteen years and not above the age of twenty eight years."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "20",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency.",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , N O . 32, T RANSWORKS   H OUSE ,  L OTUS   R OAD ,  C OLOMBO  01  before  15th  December  each  year  in   respect  of the year following."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}