{
  "n_pages": 12,
  "title_page": {
    "title": "Chief Of Defence Staff Act",
    "num": "35",
    "year": "2009",
    "date_certified": "2009-07-09",
    "date_published": "2009-07-10",
    "price": 11.0,
    "price_postage": 5.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 09Th July, 2009]",
      "L.D.O. 25/2008.",
      "A N  A Ct   To   Provide   For   The   Appointment   Of   A   Person   To   Be   The",
      "C Hief   Of  D Efence  S Taff   Who   Shall   Be   Responsible   For",
      "The  C O - Ordination   Of   Activities   As   Between   The   Armed   Forces",
      "And   The  M Inistry   Of  D Efence ;  For   The   Establishment   Of   The C Ommittee   Of   The  C Hief   Of  D Efence  S Taff  ;  To   Provide   For   The",
      "Functions   Of   The  C Hief   Of  D Efence  S Taff  ;  And   To   Provide   For",
      "Matters   Connected   Therewith   Or   Incidental   Thereto .",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :-"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "This Act may be cited as the Chief of Defence Staff Act, No. 35 of 2009. The provisions of this Act, other than this section shall come into operation on such date or dates as the Minister may, by Order published in the  Gazette appoint (hereinafter referred to as the appointed date).",
                "pre_block_list": [
                  "Short title and date of operation."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The provisions of this section shall, in terms of paragraph (1) of Article 80 of the Constitution, come into operation on the date on which the Certificate of the Speaker is endorsed on the Bill.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Different dates may be appointed for bringing into operation different provisions or Parts of this Act.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "I",
        "text": "",
        "pre_block_list": [
          "A PPOINTMENT   OF  C HIEF   OF  D EFENCE  S TAFF"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The President shall appoint from among the persons presently serving as Commander of the Army, the Commander of the Navy or the Commander of the Air Force as the case may be, an officer to be the Chief of Defence Staff.",
                "pre_block_list": [
                  "Appointment of the Chief of Defence Staff.",
                  "Chief of Defence Staff Act, No. 35 of 2009 2"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Chief of Defence Staff shall function under the direction, supervision and control of the Secretary to the Ministry of the Minister in charge of the subject of Defence (hereinafter referred to as the Secretary).",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where an officer serving as the Commander of the Army, the Commander of the Navy or the Commander of the Air Force as the case may be, is appointed as the Chief of Defence Staff, he shall, upon being so appointed, relinquish his position as the Commander of the Army, the Commander of the Navy or the Commander of the Air Force, as the case may be :",
                "pre_block_list": [
                  "Provided that notwithstanding anything to the contrary contained in the Army Act (Chapter 357), the Navy Act (Chapter 358) and the Air Force Act (Chapter 359), the person so appointed as Chief of Defence Staff shall, for so long as he holds such position, continue to be a member of the regular force of the service to which he belonged at the time of his appointment under subsection (1) :",
                  "Provided further, when such officer relinquishes his position as the Commander of the Army, the Commander of the Navy  or the Commander of the Air Force, as the case may be, the officer so appointed shall, from the date of such appointment, be deemed to continue as a member of the regular force of the respective service to which he belonged prior to such appointment, notwithstanding anything to the contrary in the Army Act (Chapter 357), the Navy Act (Chapter 358) or theAir Force Act (Chapter 359) as the case may be."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The Chief of Defence Staff shall, while so serving in the office of the Chief of Defence Staff, hold the rank of General in the case of an officer  of the Army, Admiral in the case of an officer of the Navy, and Air Chief Marshal in the case of an officer of the  Air Force.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Chief of Defence Staff shall, subject to the pleasure of the President, hold office for a term of two years.",
                "pre_block_list": [
                  "Term of office &c., of the Chief of Defence Staff."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "An officer serving as the Chief of Defence Staff shall be eligible to be reappointed in like manner for two more years :",
                "pre_block_list": [
                  "Provided that such period of two years shall be granted by reappointments for one year at a time; provided, the total period of the term of office of the Chief of Defence Staff shall not in the aggregate exceed four years:",
                  "Provided further, that in a time of public emergency, the President may reappoint the officer serving as the Chief of Defence Stafffor any number of such terms of office."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Chief of Defence Staff may, by letter addressed to the President in that behalf tender his resignation from the office of Chief of Defence Staff, at any time before the expiry of his term of office.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Notwithstanding the provisions of subsection (3), a Chief of Defence Staff who tenders his resignation, shall not be relieved of the duties of his appointment, until the acceptance of such resignation by the President is notified to him in writing.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "In the event of death, retirement, resignation or disability or removal from office of the Chief of Defence Staff before the expiry of his term of office, the President shall, having regard to the provisions of this section, appoint another officer in his place.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "The officer so appointed under subsection (5) shall hold office for the unexpired period of the term of office of the particular Chief of Defence Staff whom he succeeds.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "Where a vacancy occurs in the office of Chief of Defence Staff, due to death, retirement, resignation, disability or removal, the President may nominate from among the",
                "pre_block_list": [
                  "Chief of Defence Staff Act, No. 35 of 2009 4",
                  "members of the Committee of the Chief of Defence Staff, a member to temporarily perform the duties and functions of the office of the Chief of Defence Staff in addition to his duties as Commander of the Army, Commander of the Navy or Commander of the Air Force as the case may be, until a successor is appointed or, in the case of absence or temporary disability of the Chief of Defence Staff, until he returns to office or the disability ceases."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "8",
                "text": "A member of the Chief of Defence Staff Committee who is so nominated under the provisions of subsection (7) shall perform the duties and functions of the office of Chief of Defence Staff until a successor is appointed or until the return to office of the Chief of Defence Staff as the case may be.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "The Chief of Defence Staff may be removed at any time by the President taking into consideration issues of national security, without assigning reasons therefor.",
            "pre_block_list": [
              "Removal of Chief of Defence Staff."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "Subject to the authority, direction, control and supervision of the Secretary, the functions of the Chief of Defence Staff shall be",
            "pre_block_list": [
              "Functions of the Chief of Defence Staff."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "to assist in providing for the strategic direction of the armed forces ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "to develop a doctrine for the joint employment of the armed forces ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "to facilitate the preparation of strategic plans for the armed forces ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "to co-ordinate matters in respect of the functions relating to intelligence as between the armed forces ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "to undertake assessments to determine the capabilities of the armed forces in comparison with those of their potential adversaries ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "to facilitate the preparation of operational plans for the armed forces and to co-ordinate the implementation of the same as between the armed forces ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "g",
                "text": "to prepare and review contingency plans relating to the armed forces ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "h",
                "text": "to tender advise on critical deficiencies and strengths and assess the effect of such deficiencies and strengths",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "in meeting national security objectives ; and",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "in ensuring conformity with policy ;",
                    "pre_block_list": [
                      "( i ) to tender advise on the extent to which the programmes, recommendations and budget proposals of the armed forces for a fiscal year conform to the priorities established in relation to strategic plans ;"
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "j",
                "text": "to tender advise on the extent to which the major programmes and policies of the armed forces relating to manpower and equipment conform to strategic plans ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "k",
                "text": "to assess military requirements as against the proposed defence procurement plans and to advise the Ministry accordingly ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "l",
                "text": "to facilitate the formulation of policies for the joint training of the armed forces ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "m",
                "text": "to facilitate the formulation of policies for peace-keeping operations by the armed forces ; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "n",
                "text": "to do all such other things as are required or are necessary for the implementation of the above.",
                "pre_block_list": [
                  "Chief of Defence Staff Act, No. 35 of 2009 6"
                ],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "II",
        "text": "",
        "pre_block_list": [
          "C OMMITTEE   OF   THE  C HIEF   OF  D EFENCE  S TAFF"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be established for the purposes of this Act, a Committee of the Chief of Defence Staff (hereinafter referred to as the Committee) within the Ministry of the Minister in charge of the subject of Defence.",
                "pre_block_list": [
                  "Committee of the Chief of Defence Staff."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Committee of the Chief of Defence Staff shall consist of",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the Chief of Defence Staff appointed by the President under section 2, who shall be the Chairman ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the Commander of the Army ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "the Commander of the Navy ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "the Commander of the Air Force.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Chairman shall facilitate the implementation of all matters as between the Ministry of the Minister in charge of the subject of Defence and the armed forces, in relation to military matters.",
                "pre_block_list": [
                  "The Chairman to facilitate implementation."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Chairman shall in consultation with the Commander of the Army, the Commander of the Navy and the Commander of the Air Force, discharge the functions arising out of subsection (1) under the direction and supervision of the Secretary.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Chairman shall, in carrying out his functions in respect of any matter, take into consideration the range of military advice and opinions with respect to such matter as he considers appropriate.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The Chairman shall establish procedures to ensure to the greatest extent possible, that the presentation of his own advice or opinion is not unduly delayed.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "III",
        "text": "",
        "pre_block_list": [
          "S TAFF"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be established an office of the Chief of Defence Staff which shall consist of such staff, comprising both armed forces personnel and civilian personnel. The civilian personnel may be deployed from among persons presently in the public service in keeping with the administrative regulations as are applicable thereto.",
                "pre_block_list": [
                  "Staff."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Secretary may also recruit staff if it be so necessary for the office of the Chief of Defence Staff, in accordance with the administrative regulations and the rules of the Public Service Commission as are in force.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where armed forces personnel are deployed for service in the office of the Chief of Defence Stafe, such deployment shall be done by the Secretary in consultation with the Commander of the Army, the Commander of the Navy or the Commander of the Air Force, as the case may be.",
                "pre_block_list": [
                  "Appointment of public officers to the office of the Chief of Defence Staff."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "At the request of the Secretary, an officer in the public service may, with the consent of that officer and the Public Service Commission, be temporarily appointed to the staff of the office of the Chief of Defence Staff, for such period as may be determined by the Secretary.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where an officer of the public service is temporarily appointed to the staff of the office of the Chief of Defence Staff, such appointment shall be subject to such terms and conditions as are not less favourable than those enjoyed by such officer on the day prior to the date of such appointment and such other government regulations as are applicable thereto.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where the office of the Chief of Defence Staff employs any person who has agreed to serve the government for a specified period the service to the office of the Chief of Defence Staff by that person, shall be regarded as service to the Government for the purpose of discharging that obligation for such agreement.",
                "pre_block_list": [
                  "Chief of Defence Staff Act, No. 35 of 2009 8"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "10",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "At the request of the Secretary, an officer or servant of any public corporation may, with consent of such officer or servant and the governing board of such public corporation, be temporarily appointed to the staff of the office of the Chief of Defence Staff for such period as may be determined by the Secretary, on such terms and conditions as may be agreed upon by the Secretary and the governing board of such corporation.",
                "pre_block_list": [
                  "Appointment of officers and servants of public corporations to the staff of the office of the Chief of Defence Staff."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where an officer or servant of a public corporation is temporarily appointed to the staff of the office of the Chief of Defence Staff, the provisions of subsection (2) of section 14 of the National Transport Commission Act, No. 37 of 1991 shall,  mutatis mutandis , apply to and in relation to such officer.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where any person is appointed under subsection (1) to the staff of the office of the Chief of Defence Staff such person shall be subject to the same disciplinary control as any other member of the staff.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "IV",
        "text": "",
        "pre_block_list": [
          "G ENERAL",
          "Regulations."
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "11",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Minister may make regulations under this Act for the purpose of carrying out or giving effect to the principles and provisions of this Act or in respect of any matter required by this Act to be prescribed or in respect of which regulations are authorized by this Act to be made.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Without prejudice to the generality of the foregoing, the Minister may make regulations in respect of the following :",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "joint doctrine, training and professional military education;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the programmes and courses that may be conducted in institutions established for the conduct of military education ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "the establishment of databases and systems for collection, collation and storage of information relating to operations of the armed forces ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "policies for peace-keeping operations ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "guidelines for determining the terms and conditions applicable to personnel recruited on contractual basis to the office of the Chief of Defence Staff ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "qualifications of experts whose services may be obtained for the office of the Chief of Defence Staff ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "g",
                    "text": "programmes and projects for human resources development within the office of the Chief of Defence Staff.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every regulation made by the Minister shall be published in the  Gazette  and shall come into operation on the date of such publication or on such later date as may be specified therein.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Every regulation shall, within three months of the publication of the same in the  Gazette , be brought before Parliament for approval. Any regulation that is not so approved by Parliament shall be deemed to be rescinded from the date of its disapproval but without prejudice to anything previously done thereunder.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Notification of the date on which any regulation made by the Minister is deemed to be rescinded shall be published in the  Gazette .",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "12",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Minister may, in consultation with the Secretary, make rules generally for the efficient functioning of the Ministry of the Minister in charge of the subject of Defence, and in particular in respect of the following matters :",
                "pre_block_list": [
                  "Rules."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "dress code including uniforms to be worn by persons serving in the Ministry ; and",
                    "pre_block_list": [
                      "Chief of Defence Staff Act, No. 35 of 2009 10"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the conduct and duties and functions of persons serving in the office of the Chief of Defence Staff.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every rule made by the Minister under subsection (1) shall be published in the  Gazette .",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "13",
            "text": "Any person who contravenes the provisions of any regulation or rule made under this Act shall be guilty of an offence and shall on conviction after summary trial before a Magistrate be liable to imprisonment for a term not exceeding one year or to a fine not exceeding rupees one hundred thousand.",
            "pre_block_list": [
              "Penalty for contravention of regulations or rules."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "14",
            "text": "The provisions of this Act shall have effect notwithstanding anything contained in any other written law and accordingly in the event of any conflict or inconsistency between the provisions of this Act and such other written law, the provisions of this Act shall prevail.",
            "pre_block_list": [
              "This Act to prevail over other written law."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "15",
            "text": "In the   event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of any inconsistency."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "16",
            "text": "In this Act, unless the context otherwise requires",
            "pre_block_list": [
              "Interpretation.",
              "armed forces means the Sri Lanka Army, the Sri",
              "Lanka Navy and the Sri Lanka Air Force, established respectively under the Army Act (Chapter 357), the Navy Act (Chapter 358) and the Air Force Act (Chapter 359).",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , D EPARTMENT   OF G OVERNMENT  I NFORMATION , N O . 163, K IRULAPONA  M AWATHA , P OLHENGODA , C OLOMBO  05 before 15th December each year in respect of the year following ."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}