{
  "n_pages": 8,
  "title_page": {
    "title": "Inland  Revenue  (Regulation Of Amnesty) Act",
    "num": "10",
    "year": "2004",
    "date_certified": "2004-10-20",
    "date_published": "2004-10-22",
    "price": 6.75,
    "price_postage": 4.5
  },
  "body_pages": {
    "preamble": [
      "Inland Revenue (Regulation Of Amnesty) Act, No. 10 Of 2004 1",
      "[Certified On 20Th October, 2004]",
      "L.D.O. 14/2004.",
      "A N   Act   To   Provide   For   The   Regulation   Of   The   Grant   Of   An   Amnesty",
      "In   Respect   Of   The   Non - Payment   Or   Non - Disclosure   Of   Liability   To   Pay",
      "Income   Tax   In   Respect   Of   Declarations   Made   On   Or   Before  A Ugust 31, 2003  In   Terms   Of   The   Repealed  I Nland  R Evenue  (S Pecial P Rovisions ) A Ct , N O . 7  Of  2002  And   The  I Nland  R Evenue  (S Pecial P Rovisions ) A Ct , N O . 10  Of  2003 ;  To   Provide   For   The   Repeal   Of   The I Nland  R Evenue  (S Pecial  P Rovisions ) A Ct , N O . 10  Of  2003 ;   And",
      "For   Matters   Connected   Therewith   Or   Incidental   Thereto .",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Inland Revenue (Regulation of Amnesty) Act, No. 10  of 2004.",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Subject to the provisions of section 3 of this Act, the Inland Revenue (Special Provisions) Act, No. 10 of 2003 is hereby repealed.",
                "pre_block_list": [
                  "Repeal of Act, No.10 of 2003."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Subject to the provisions of section 3 of this Act, any person who, on the day immediately prior to the enactment of the Inland Revenue (Special Provisions) Act, No. 10 of 2003, was liable, to pay any tax, levy, penalty (including any penalty in respect of any offence), or fine or to forfeiture in terms of any of the laws specified in the Schedule to the aforesaid Act, shall continue to be liable to the payment of such tax, levy, penalty (including any penalty in respect of any offence), forfeiture or fine, notwithstanding anything done or any right or liberty acquired in terms of the provisions of the aforesaid Act.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Any person whether in Sri Lanka or abroad, who, though required under the laws relating to the payment of income tax for the time being in force, had not in relation to any period prior to March 31, 2002 declared to the Commissioner-General his liability to such tax or the sources of his income and assets as at March 31, 2002, shall if such",
                "pre_block_list": [
                  "Declarations made prior to August 31, 2003, deemed to be declarations made in terms of this Act.",
                  "2H 022751-10,200 (08/2004)",
                  "Inland Revenue (Regulation of Amnesty) Act, No. 10 of 2004 2",
                  "person had on or before August 31, 2003 made a declaration to the Commissioner-General disclosing his liability or additional liability to the payment of income tax and all the sources of his income and assets as at April 1, 2002, be deemed to be a declaration made under this Act, and be entitled to an amnesty in terms of this Act:",
                  "Provided that in granting the amnesty as set out above, the Commissioner-General shall verify the correctness of the declarations received by him and grant the amnesty only in respect of such part of the declaration which discloses information in relation to undeclared income, undeclared assets and undeclared sources of income or additional income, assets and sources of income."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "For the avoidance of doubt it is hereby declared",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "that any declaration made under the provisions",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "of the Inland Revenue (Special Provisions) Act, No. 7 of 2002 shall in accordance with the provisions of subsection (2) of section 11 of the Inland Revenue (Special Provisions) Act, No. 10 of 2003 ; and",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "of the Inland Revenue (Special Provisions) Act, No. 10 of 2003, shall in accordance with the provisions of subsection (1) of section 3 of this Act,",
                        "pre_block_list": [
                          "be deemed to be a declaration to which the provisions of this section shall be applicable to ; and"
                        ],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "that any reference to the Inland Revenue (Special Provisions) Act, No. 10 of 2003 shall mean and include the Inland Revenue (Special Provisions) Act, No. 10 of 2003 as amended by the Inland Revenue (Special Provisions) (Amendment) Act, No. 31 of 2003.",
                    "pre_block_list": [
                      "Inland Revenue (Regulation of Amnesty) Act, No. 10 of 2004 3"
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Commissioner-General or any officer not below the rank of Deputy Commissioner authorised by him in that behalf may, where necessary require the persons whose declarations have been acknowledged to furnish him with the necessary particulars or with additional particulars as may be necessary for the purpose of assisting him in determining whether or not the amnesty should be granted. The particulars shall be furnished in the prescribed form within two weeks of the date on which such information was requested from him.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "Subject to the provisions of this Act, no prosecution shall be instituted for any offence committed by a declarant referred to in section 3 of this Act and no investigation shall be carried out against any declarant for the imposition of income tax, wealth tax or surcharge on income tax and wealth tax as the case may be, in accordance with the provisions of any written law relating to the same for the time being in force in so far as it relates to the amnesty granted by the Commissioner-General in terms of section 3.",
                    "pre_block_list": [
                      "No investigation or prosecution to be carried out."
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "Any person who has made a  declaration as is referred to in section 3 of this Act, shall be entitled to immunity from the payment of any income tax, wealth tax, or surcharge on income tax and wealth tax as the case may be, together with any penalty payable in respect of any disclosure of previously undeclared income, assets or sources of income, for the period ending on or  before March 31, 2002 :",
                    "pre_block_list": [
                      "Provided that no employer shall be exempt from the payment of the tax and the penalty referred to in paragraphs (1) ( a ) and (1) ( b ) above, in terms of the provisions of Chapter XIV of the Inland Revenue Act, No. 38 of 2000 applicable to the deduction of income tax from the remuneration of the employees, or any other previous law applicable to the same."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "It shall be lawful for the Commissioner-General or any other Authority administering the collection and recovery of any tax, levy or penalty, (including any penalty in respect of",
                "pre_block_list": [
                  "Inland Revenue (Regulation of Amnesty) Act, No. 10 of 2004 4",
                  "any offence) forfeiture or fine in terms of any law referred to in the Schedule of the Inland Revenue (Special Provisions) Act, No. 10 of 2003,"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "to collect and recover any such tax, levy or penalty, (including any penalty in respect of any offence) forfeiture or fine, subsequently waived, discharged or otherwise not recovered in accordance with the provisions of the aforesaid Act, in the manner provided for in terms of any law referred to in the Schedule to the aforesaid Act under which any such tax, levy or penalty, (including any penalty in respect of any offence) forfeiture or fine was imposed; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "to issue assessments or any other orders as the case may be, for any year of assessment or taxable period ending on or before March 31, 2002, where any tax, levy or penalty, (including any penalty in respect of any offence) forfeiture or fine has been discharged or refunded in terms of any law referred to in the Schedule to the aforesaid Act notwithstanding the fact that the period for the making of the same has elapsed.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "No person shall in terms of this Act, be entitled to any refund in respect of any money paid by him or recovered or deducted in terms of any law referred to in the Schedule of the Inland Revenue (Special Provisions) Act,  No. 10 of 2003, or to carry forward any loss in respect of any period ending on or before March 31, 2002 to any subsequent year, by reason of the fact  that he is entitled to the amnesty or immunity so granted in respect of his income or part thereof. The amount of undeclared income or the value of the undeclared assets of such person shall be deemed to be the  income tax for the purpose of ascertaining the amount of any such refund or for the purpose of setting off against any refund claimed by such person or for the purpose of setting off against such loss.",
                "pre_block_list": [
                  "Inland Revenue (Regulation of Amnesty) Act, No. 10 of 2004 5"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Any proceedings, investigation or inquiry which was being conducted by the Commissioner-General or any Authority administering the collection and recovery of any tax, levy or penalty, (including any penalty in respect of any offence) forfeiture or fine in terms of any law referred to in the Schedule of the Inland Revenue (Special Provisions) Act, No. 10 of 2003, and which has been, stopped, suspended or withdrawn in terms of the aforesaid Act, shall from the date of the coming into operation of this Act, be revived or restored and continued with, as if such proceedings, investigation or inquiry had not been so stopped, suspended or withdrawn.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "The Commissioner-General or any officer of the Department of Inland Revenue shall preserve and aid in preserving absolute secrecy in respect of the identity of the person making the declaration and any matter or thing contained in any declaration referred to in section 3 of this Act, as from the date of receipt of such declaration. All provisions of the Inland Revenue Act, No. 38 of 2000 applicable to the maintenance of official secrecy including punishment for the breach of such secrecy under section 172 of such Act, shall  mutatis mutandis  be applicable to a declaration made under this Act.",
            "pre_block_list": [
              "Secrecy."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Minister may make regulations for the purposes of carrying out or giving effect to the principles and provisions of this Act, and in respect of matters that are by this Act required to be prescribed.",
                "pre_block_list": [
                  "Regulations."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every such regulation shall be published in the  Gazette and shall come into operation on the date of such publication or on such later date as may be specified in the regulation.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every such regulation shall, as soon as convenient after its publication in the  Gazette , be brought before Parliament for approval. Any such regulation that is not so approved shall be deemed to be rescinded as from the date of disapproval, but without prejudice to anything previously done thereunder.",
                "pre_block_list": [
                  "Inland Revenue (Regulation of Amnesty) Act, No. 10 of 2004 6"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Notification of the date on which a regulation is deemed to be rescinded shall be published in the  Gazette .",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "In this Act unless the context otherwise requires",
            "pre_block_list": [
              "Interpretation.",
              "assets shall include immovable property, movable property, bank balances, treasury bills, fixed deposits, time deposits or any other form of deposit and money given by way of security or loans and cash in hand ;",
              "Commissioner-General shall have the same meaning as in the Inland Revenue Act, No. 38 of 2000 ;",
              "person shall include a body of persons, a company and a partnership ;",
              "sources of income shall include any income received by way of cash or in any other form.",
              "Inland Revenue (Regulation of Amnesty) Act, No. 10 of 2004 7",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT   P UBLICATIONS  B UREAU , N O . 32, T RANSWORKS  H OUSE ,  L OTUS   R OAD ,  C OLOMBO  01  before  15th  December  each  year  in  respect of the year following."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}