{
  "n_pages": 26,
  "title_page": {
    "title": "Monetary Law (Amendment)  Act",
    "num": "32",
    "year": "2002",
    "date_certified": "2002-12-17",
    "date_published": "2002-12-20",
    "price": 15.75,
    "price_postage": 6.75
  },
  "body_pages": {
    "preamble": [
      "Monetary Law (Amendment) Act, No. 32 Of 2002 1",
      "[Certified On 17Th December, 2002]",
      "L.D.O. 51/2002.",
      "A N  A Ct   To   Amend   The  M Onetary  L Aw  A Ct",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Monetary Law (Amendment) Act, No. 32  of 2002.",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "Section 5 of the Monetary Law Act (hereinafter referred to as the principal enactment) is hereby repealed and the following section substituted therefor :",
            "pre_block_list": [
              "Replacement of section 5 of Chapter 422.",
              "5. An institution, which shall be called and known as the Central Bank of Sri Lanka (hereinafter referred to as the Central Bank) is hereby established as the authority responsible for the administration, supervision and regulation of the monetary, financial and payments system of Sri Lanka, and without prejudice to the other provisions of this Act, the Central Bank is hereby charged with the duty of securing, so far as possible by action authorised by this Act, the following objectives, namely",
              "Establishment and objectives of the Central Bank"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "economic and price stability ; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "financial system stability,",
                "pre_block_list": [
                  "with a view to encouraging and promoting the development of the productive resources of Sri Lanka",
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "Section 8 of the principal enactment is hereby amended as follows :",
            "pre_block_list": [
              "Amendment of section 8 of the principal enactment.",
              "( a ) by the repeal of subsection (1) thereof, and substitution therefor, of the following subsection :",
              "2H 0171045,650 (10/2002)",
              "Monetary Law (Amendment) Act, No. 32 of 2002 2"
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Monetary Board of the Central Bank shall, in addition to determining the policies or measures authorized to be adopted or taken under this Act, be vested with the powers, duties and functions of the Central Bank under this Act, and be generally responsible for the management, operations and administration of the Bank :",
                "pre_block_list": [
                  "Provided, however, where the Monetary Board considers it appropriate, it may delegate to the Governor, or to any officer of the Central Bank or to a Committee of such officers, any power, duty or function conferred or imposed on, or assigned to, the Board by section10 ( a ), ( b ), ( bb ), ( d ) and section 27.;"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "by the insertion, immediately after subsection (1) of that section of the following new subsection :",
                    "pre_block_list": [
                      "(1A) Where any power, duty or function is delegated by the Monetary Board under subsection (1), the person or the group of persons to whom such power, duty or function is delegated shall exercise, perform or discharge such power, duty or function, in accordance with such general or special directions or guidelines as may be issued by the Monetary Board.; and"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "by the repeal of paragraph ( c ) of subsection (2) of that section and substitution therefor of the following paragraph :",
                    "pre_block_list": [
                      "( c ) three members appointed by the President on the recommendation of the Minister of Finance, with the concurrence of the Constitutional Council",
                      ""
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "Section 11 of the principal enactment is hereby amended as follows :",
            "pre_block_list": [
              "Amendment of section 11 of the principal enactment.",
              "Monetary Law (Amendment) Act, No. 32 of 2002 3"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "in paragraph ( a ) of subsection (1) of that section, by the substitution for the words any local authority of the words any Provincial Council or any local authority;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "in paragraph ( a ) of subsection (2) of that section, by the substitution for the words any local authority of the words any Provincial Council or any local authority;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "by the repeal of paragraph ( c ) of subsection (2) of that section and substitution therefor, of the following paragraphs :",
                "pre_block_list": [
                  "( c ) he is a director, officer, employee or shareholder of any banking institution (other than the Central Bank) or any other institution supervised or regulated by the Central Bank",
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "Section 13 of the principal enactment is hereby amended as follows :",
            "pre_block_list": [
              "Amendment of section 13 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "in subsection (1) of that section by the substitution for all the words from The term of office to  shall, of the following :",
                "pre_block_list": [
                  "The term of office of the Governor, and of any person appointed under paragraph ( c ) of subsection (2) of section 8 (hereinafter referred to as an appointed member) shall,; and"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "in subsection (2) of that section by the substitution for the words by the appointed member of the words by an appointed member.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "Section 14 of the principal enactment is hereby amended in subsection (1) of that section by the substitution for the words The appointed member, of the words An appointed member.",
            "pre_block_list": [
              "Amendment of section 14 of the principal enactment.",
              "Monetary Law (Amendment) Act, No. 32 of 2002 4"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "Section 15 of the principal enactment is hereby amended as follows :",
            "pre_block_list": [
              "Amendment of section 15 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "in subsection (1) of that section by the substitution for the words Where the appointed member, of the words Where an appointed member;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "in subsection (3) of that section by the substitution for the words to be the appointed member, of the words to be an appointed member",
                "pre_block_list": [
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "Section 16 of the principal enactment is hereby amended by the substitution for the words or the appointed member of the words or an appointed member.",
            "pre_block_list": [
              "Amendment of section 16 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "Section 17 of the principal enactment is hereby amended as follows :",
            "pre_block_list": [
              "Amendment of section 17 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "in subsection (3) of that section by the substitution for the words two members of the words three members;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "in subsection (4) of that section",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "i",
                    "text": "by the substitution for the words at least two members, of the words at least three members,; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "by the substitution for the words three members of the words five members",
                    "pre_block_list": [
                      "",
                      "Amendment of section 30 of the principal enactment."
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "10",
            "text": "Section 30 of the  principal enactment is hereby amended by the insertion immediately after subsection (9) of that section, the following subsection :",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "10",
                "text": "",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "Where an order has been made by the Monetary Board under subsection (1) of section 76 M  of the Banking Act, No. 30 of 1988 (hereinafter referred to as the Banking Act) in respect of a licensed specialised bank, the  provisions of subsections (3), (4), (5), (6), (7), (8) and (9) of this section shall, notwithstanding subsections (3) and (4), of section 76 M",
                    "pre_block_list": [
                      "Monetary Law (Amendment) Act, No. 32 of 2002 5",
                      "of the Banking Act and subject to paragraph (ii) of this subsection, apply,  mutatis mutandis,  to such bank as if it were a banking institution."
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "Where under paragraph (i) of this subsection, the application of the provisions of subsection (3) of this section requires",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "the winding up of a licensed specialised bank, the Monetary Board shall cancel the licence issued to such bank under Part IXA of the Banking Act and, the provisions of Part VIII of that Act shall apply to such winding up as if it were a compulsory winding up of the bank, in the case of a bank incorporated or established within Sri Lanka or a compulsory winding up of the affairs or closure of the business of the bank, in the case of a bank incorporated outside Sri Lanka ;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "the resumption of business of a licensed specialised bank, the Monetary Board may exercise the powers conferred on it under section 76 N  of the Banking Act ;",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "In this subsection licensed specialised bank shall have the same meaning as in the Banking Act",
                    "pre_block_list": [
                      ""
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "11",
            "text": "Section 31 of the principal enactment is hereby repealed and the following section  substituted therefor :",
            "pre_block_list": [
              "Replacement of section 31 of the principal enactment.",
              "31. Where an order is made by the Monetary Board under section 30 requiring the winding up of a banking institution",
              "Winding up of a banking institution."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "in the case of a commercial bank, the Monetary Board shall cancel the licence issued to it under the Banking Act and the provisions of Part VIII of",
                "pre_block_list": [
                  "Monetary Law (Amendment) Act, No. 32 of 2002 6",
                  "that Act shall apply as if it were a compulsory winding up of the bank, in the case of a bank incorporated or established within Sri Lanka or a compulsory winding up of the affairs or closure of the business of the bank, in the case of a bank incorporated outside Sri Lanka ;"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "in the case of any other banking institution, not being a licensed specialised bank to which subsection (10) of section 30 is applicable, the Director of Bank Supervision shall nominate a person to be the liquidator for the purpose of winding up and subject to such nomination, such institution shall be wound up in accordance with the law applicable to such institution",
                "pre_block_list": [
                  "",
                  "Amendment of section 34 of the principal enactment."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "12",
            "text": "Section 34 of the principal enactment is hereby repealed and the following section substituted therefor :",
            "pre_block_list": [
              "34.  The Central Bank shall publish a general balance sheet showing the volume and composition of its assets and liabilities as at the last day of each month before the last day of the succeeding month",
              "",
              "Monthly statement.",
              "Replacement of section 62 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "13",
            "text": "Section 62 of the principal enactment is hereby repealed and the following section substituted therefor :",
            "pre_block_list": [
              "62. For the purposes of this Act, the expression the money supply means all currency, demand deposits, time and savings deposits and such other financial assets as may be prescribed by the Monetary Board from time",
              "Expression of the definition of the money supply.",
              "Monetary Law (Amendment) Act, No. 32 of 2002 7",
              "to time and are owned by persons other than the Government, commercial banks and such financial institutions or categories of financial institutions as may be prescribed by the Monetary Board and for the purposes of this section financial institutions shall have the same meaning assigned to it in subsection (5) of section 93",
              ""
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "14",
            "text": "The principal enactment is hereby amended by the insertion immediately after section 62, of the following :",
            "pre_block_list": [
              "Insertion of new Part III in Chapter III of the principal enactment."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "III",
        "text": "",
        "pre_block_list": [
          "P AYMENT   AND  S ETTLEMENT  S YSTEMS",
          "62 A . (1) The Central Bank may establish and operate one or more systems",
          "Establishment of systems for transfer of funds and transfer and settlement of scripless securities.",
          "( a ) for the transfer of funds by and between the Central Bank, commercial banks and such other institutions or persons that maintain a settlement account with the Central Bank and who are admitted as participants to such system by the Central Bank ;",
          "( b ) for the transfer and settlement of scripless securities by and between the Central Bank and direct participants ;",
          "( c ) for the settlement of payment obligations in respect of transfer and settlement of scripless securities under paragraph ( b ).",
          "(2)  A system established under subsection (1) may be linked to another system in Sri Lanka or elsewhere for the clearing or settlement of payment obligations or securities.",
          "Monetary Law (Amendment) Act, No. 32 of 2002 8",
          "(3) The Central Bank may enter into agreements with the participants of a system established under subsection (1) and issue in writing to the participants of the system  rules for the operation of the system.",
          "(4)  Without prejudice to the generality of subsection (3), such rules may provide",
          "( a ) for the provision of intra-day credit against the collateral of securities to the participants and the conditions attaching to the provision of such credit ;",
          "( b ) for the appointment of the Central Bank as a certification authority for the purpose of issuing certificates to participants under any law applicable to the appointment of certification authorities in respect of electronic signatures ;",
          "( c ) for the formulation and adoption of a code of conduct for participants ;",
          "( d ) for the authentication of transactions carried out electronically ;",
          "( e ) for the Central Bank, if it considers necessary in the interest of the system, to cease or suspend the operation of the system, or to withdraw or suspend the privileges or rights of any participant or category of participants or to suspend or revoke the membership in the system of a participant ;",
          "( f ) for the appointment of auditors or inspectors for the auditing or inspection of the operating systems of participants in respect of the settlement system ; and",
          "Monetary Law (Amendment) Act, No. 32 of 2002 9",
          "( g ) for the payment of charges and fees to the Central Bank by the participants.",
          "(5) A payment or transfer made through a system established under subsection (1), is final and irrevocable",
          "( a ) in the case of a transaction involving a funds transfer only, upon the settlement account of the participant requesting the funds transfer being debited ;",
          "( b ) in the case of a transaction involving a securities transfer only, upon the securities account of the participant requesting the securities transfer being debited ;",
          "( c ) in the case of a transaction involving both, a funds transfer and a securities transfer, upon debiting the settlement account or the securities account of a participant requesting the funds transfer or the securities transfer as the case may be, whichever occurs earlier,",
          "and notwithstanding anything to the contrary in any other law, such payment or transfer shall not be required to be reversed, repaid or set aside nor shall any court, order such payment or transfer to be rectified or stayed.",
          "(6)  Scripless securities issued under this Act or the Local Treasury Bills Ordinance or the Registered Stock and Securities Ordinance shall be transferred, pledged, encumbered, lent, borrowed or transacted in only as provided by or under the regulations made under this Act or the Local Treasury Bills Ordinance or the",
          "Monetary Law (Amendment) Act, No. 32 of 2002 10",
          "Registered Stock and Securities Ordinance, as the case may be. A transfer, pledge, encumbrance, loan, borrowing or transaction effected accordingly shall be valid and effectual notwithstanding any other written law, and the claim of a participant of  the system on any scripless securities posted as collateral in accordance with those regulations as may be applicable shall have priority over the claims on such scripless securities of a person who is not a participant of the system.",
          "(7)   Nothing in subsections (5) and (6) shall affect any other legal right or remedy available to a person who has suffered any loss or damage by a payment, transfer or settlement effected through a system established under subsection (1).",
          "(8) Notwithstanding the provisions of any written law relating to the winding up of companies, if proceedings for the winding up of a participant of a system have commenced",
          "( a ) the Central Bank may do anything permitted or required by the rules of the system in order to net obligations incurred before or on the day on which the proceedings commenced ;",
          "( b ) the obligations that are netted under the rules of the system shall be disregarded in the proceedings ; and",
          "( c ) the netting made by the Central Bank and any payment made by the participant under the rules of the system shall not be voidable in the proceedings.",
          "Monetary Law (Amendment) Act, No. 32 of 2002 11",
          "(9) If proceedings for the winding up of a participant is commenced and a payment or settlement owed by such participant has been made as referred to in subsection (5) or (8), and if a payment or settlement of such funds or securities would have been void or voidable under any other written law if made outside the system, the liquidator of such participant may recover from the person to whose benefit such payment or settlement was made such amount as would have been recoverable if such payment or settlement had been made outside the system.",
          "(10) Without prejudice  to the generality of the provisions of section 47, the Monetary Board, any member of the Monetary Board, any officer or employee of the Central Bank or any person acting under the direction of the Monetary Board shall not be liable for any loss or damage suffered by any person or participant, arising directly or indirectly, from the use of the system by any participant, unless such loss or damage results from gross negligence or willful misconduct of the Monetary Board or any member of the Monetary Board or any officer or employee of the Central Bank or any person acting under the direction of the Monetary Board.",
          "(11) Where any transaction effected through a system established under subsection (1) is carried out electronically, such transaction shall not be denied legal effect, validity or enforceability solely on the ground that such transaction is carried out electronically or that the information relating to such transaction is maintained in the form of an electronic record, and such record may be tendered in evidence in proceedings before any court or tribunal in",
          "Monetary Law (Amendment) Act, No. 32 of 2002 12",
          "accordance with the provisions of Parts II and III of the Evidence (Special Provisions) Act, No. 14 of 1995 or any other law for the time being in force relating to the tendering of computer evidence, before any court or tribunal.",
          "(12) Any or all of the functions referred to in subsection (1) may, be carried out by a body corporate authorised for the purpose by the Monetary Board, subject to such terms and conditions as may be imposed by the Monetary Board.",
          "(13) For the purposes of this section",
          "direct participant and scripless securities shall have the same meaning as in section 112 A  ;",
          "rules means any rule issued by the Central Bank under subsection (3) of this section ;",
          "securities shall have the same meaning as in section 112 A  except that for the purposes of paragraph ( a ) of subsection (4), securities shall not include securities of the Central Bank issued in scripless form or otherwise ;",
          "settlement account means an account maintained by a participant with the Central Bank under this Act and used for the purposes of the system with the approval of the Central Bank ;",
          "securities account means an account maintained by a participant with the Central Bank in terms of paragraph ( b ) of section 112 A",
          "",
          "Monetary Law (Amendment) Act, No. 32 of 2002 13"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "15",
            "text": "Section 72 of the principal enactment is hereby amended as follows :",
            "pre_block_list": [
              "Amendment  of section 72 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "by the deletion of subsection (2) thereof and by renumbering subsection (1) as section 72 ; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "in the renumbered section 72, by the substitution for the words the Central Bank shall buy of the words the Central Bank may buy.",
                "pre_block_list": [
                  "Amendment of section 74 of the principal enactment."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "16",
            "text": "Section 74 of the principal enactment is hereby amended by the repeal of subsection (5) of that section.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "17",
            "text": "Section 76 of the principal enactment is hereby amended by the repeal of subsection (4) of that section.",
            "pre_block_list": [
              "Amendment of section 76 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "18",
            "text": "Section 76 A  of the principal enactment is hereby repealed and the following section substituted therefor :",
            "pre_block_list": [
              "Replacement of section 76 A  of the principal enactment.",
              "76 A .  (1) Where the Governor is of opinion that it is inexpedient to determine and certify, in accordance with the provisions of section 73, the parities with respect to the Sri Lanka Rupee of foreign currencies ordinarily required for the international transactions of Sri Lanka, the Governor",
              "Governors powers in relation to exchange rates.",
              "( a ) may desist from determining and certifying the parities of such foreign currencies under that section ; and",
              "( b ) may or may not determine the rates at which the Central Bank may buy and sell foreign exchange in spot or other transactions.",
              "Monetary Law (Amendment) Act, No. 32 of 2002 14"
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where the Governor acts in terms of subsection (1), the provisions of sections 73, 74 and 76 shall cease to have any force or effect in law.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where the Governor determines, under paragraph ( b ) of subsection (1) the rates at which the Central Bank may buy and sell foreign exchange in spot or other transactions, the following  provisions  shall  apply determination",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "such determination may be limited to such foreign currencies as the Governor may deem appropriate ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the rates determined under paragraph ( b ) of subsection (1)  shall not apply in the case of the purchases and sales of foreign notes and coins, in which case the Central Bank may have regard to the additional costs of, or costs incidental to, such purchases or sales ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "the Central Bank shall not accept any commission or impose any charge of any description in respect of the purchase or sale of foreign exchange, except the telegraphic or other costs actually incurred in connection with such purchase or sale ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "it shall be competent for the Governor to authorise, in writing, any officer by name or by office, to vary from time to time within such limits as may be specified by the Governor, the rates determined by the Governor under paragraph ( b ) of subsection (1)  ;",
                    "pre_block_list": [
                      "Monetary Law (Amendment) Act, No. 32 of 2002 15"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "where the Governor makes a determination under paragraph ( b ) of subsection (1)  with respect to foreign currency but makes no determination under that subsection with respect to any particular foreign currency, the Central Bank may buy and sell such currency in respect of which no determination has been made at a rate calculated on the basis of the exchange rate for that currency in the international markets in relation to any foreign currency with respect to which the Governor has made a determination under paragraph ( b ) of subsection (1).",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where the Governor desists from determining and certifying parities under subsection (1) ( a ) and does not determine the rates at which the Central Bank may buy and sell foreign exchange in spot or other transactions under paragraph ( b ) of subsection (1) the Central Bank may buy and sell foreign exchange at such rates as the Governor or an officer authorised by the Governor for the purpose may deem appropriate.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "Where the Governor determines under subsection (1) ( b ) the rates at which the Central Bank may buy and sell foreign exchange, the Governor may determine the minimum rate at which any Commercial bank may buy spot foreign exchange and the maximum rate at which any commercial bank may sell spot foreign exchange.",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "Notwithstanding that the Governor has desisted from determining and certifying parities under subsection (1) ( a ) and has not determined the rates at which the Central Bank may buy or sell foreign exchange under paragraph ( b ) of",
                    "pre_block_list": [
                      "Monetary Law (Amendment) Act, No. 32 of 2002 16",
                      "subsection (1) the Governor may determine the minimum rate at which any commercial bank may buy spot foreign exchange and the maximum rate at which any commercial bank may sell spot foreign exchange."
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "The provisions of paragraph ( d ) of subsection (3) shall,  mutatis mutandis,  apply to and in relation to, the minimum and maximum rates determined under paragraph ( a ) or paragraph ( b ) of this subsection.",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "Where no determination is made under paragraph ( a ) or paragraph ( b ) of this subsection, a commercial bank may buy, sell or carry out any transaction in foreign currency at rates calculated on the basis of the exchange rates for that currency in the international markets.",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "Where a determination is made under paragraph ( a ) or paragraph ( b ) of this subsection as to the minimum and the maximum rates at which commercial banks may buy and sell spot foreign exchange",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "no commercial bank shall buy spot foreign exchange at any rate below the minimum rate determined under those paragraphs as may be applicable or sell spot foreign exchange at any rate exceeding the maximum rate so determined as may be applicable ; and no commercial bank shall in respect of the purchase or sale of such exchange accept any commission or impose any charge of any description except telegraphic or other costs actually incurred in connection with such purchase or sale ; and",
                        "pre_block_list": [
                          "Monetary Law (Amendment) Act, No. 32 of 2002 17"
                        ],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "no commercial bank shall carry out any transaction in foreign exchange, not being a spot transaction, at any rate which differs from the rates determined under paragraph ( a ) or paragraph ( b ) of this subsection as may be applicable by a margin greater than is reasonable having regard to the additional costs, expenses or risks of the transaction, or by such margin, if any, as may be prescribed in that behalf by the Governor",
                        "pre_block_list": [
                          ""
                        ],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "19",
            "text": "The heading appearing in Part VI immediately before section 93 of the principal enactment is hereby repealed and the following heading substituted therefor :",
            "pre_block_list": [
              "Replacement of heading in Part VI of the principal enactment.",
              "R EGULATION   OF   THE  R ESERVES   OF  C OMMERCIAL   B ANKS   AND P RESCRIBED  F INANCIAL  I NSTITUTIONS ."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "20",
            "text": "Section 93 of the principal enactment is hereby repealed and the following section substituted therefor:",
            "pre_block_list": [
              "Replacement of section 93 of the principal enactment.",
              "Reserve requirements.",
              "93. (1) The Monetary Board shall, in order to limit the volume of money created by the credit operations of the financial system, require commercial banks and such other financial institutions operating in Sri Lanka as may be prescribed by the Monetary Board (in this Part referred to as the prescribed financial institutions) to maintain reserves against their deposit liabilities and such of their other financial liabilities as the Monetary Board may consider necessary and shall, for that purpose, prescribe the classes of deposit liabilities and the categories of other financial liabilities against which reserves are required to be maintained.",
              "Monetary Law (Amendment) Act, No. 32 of 2002 18"
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The reserves required to be maintained by a commercial bank or a prescribed financial institution under subsection (1), shall be proportionate to the volumes respectively, of each class of its deposit liabilities and each category of its other financial liabilities and shall, subject to subsection (4), take the form of rupee deposits in the Central Bank.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The accounts maintained at the Central Bank by prescribed financial institutions under subsection (2), shall be maintained only for the purpose of keeping the rupee deposits required to be maintained as reserves by such financial institutions.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The Monetary Board may in the interest of the national economy and the banking and financial systems of the country, permit the maintenance of any part of the reserves required to be maintained under subsection (1), in the form of assets other than rupee deposits in the Central Bank.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "In this Part",
                "pre_block_list": [
                  "financial business in relation to a financial institution means the accepting of money in any form from the public, in the ordinary course of business, by way of deposit or by the issue of bills of exchange, promissory notes, bonds, certificates, notes, commercial paper or other similar instruments by means of which money is raised from the public, and the use of that money, in whole or in part, for the grant of loans or making that money available to third parties or for the benefit of third parties, as a business ;",
                  "Monetary Law (Amendment) Act, No. 32 of 2002 19",
                  "financial institution means a licensed specialised bank as defined in the Banking Act, No. 30 of 1988, or a finance company as defined in the Finance Companies Act, No. 78 of 1988, and includes any person or body of persons carrying on financial business ;",
                  "other financial liabilities in relation to a licensed commercial bank or a prescribed financial institution, means liabilities (other than deposit liabilities) incurred by any such bank or financial institution by the acceptance of money in any form from the public, in the course of its business, by the issue of bills of exchange, promissory notes, bonds, cretificates, notes, commercial paper or other similar instruments by means of which money is raised from the public",
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "21",
            "text": "Section 94 of the principal enactment is hereby repealed and the following section substituted therefor :",
            "pre_block_list": [
              "Replacement of section 94 of the principal enactment.",
              "94. (1)  The Monetary Board shall prescribe, and may, from time to time, vary, the reserve ratios applicable to each class of deposit liabilities and each category or other financial liabilities against which reserves are required to be maintained under section 93.",
              "Monetary Board to prescribe reserve ratios."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any increase in a reserve ratio which is to be applicable in respect of any liability that existed on the date of the increase shall be made by the Monetary Board in a gradual manner and shall not exceed four percentage points in any one period of thirty days.",
                "pre_block_list": [
                  "Monetary Law (Amendment) Act, No. 32 of 2002 20"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Monetary Board shall, other than in exceptional circumstances, endeavour to give commercial banks and other prescribed financial institutions not less than fourteen days notice of the date on which any increase in a reserve ratio is to become effective",
                "pre_block_list": [
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "22",
            "text": "Section 95 of the principal enactment is hereby repealed and the following section substitued therefor :",
            "pre_block_list": [
              "Replacement of section 95 of the principal enactment.",
              "95. Where any commercial bank or any prescribed financial institution is required to maintain a reserve against any class of deposit liabilities or any category of other financial liabilities, the Central Bank shall, if so determined by the Monetary Board, in the interest of the national economy and the banking and financial systems of the country, pay to that bank or to that financial institution, as the case may be, interest at such rate as may be determined by the Monetary Board, on the amount maintained as a reserve or a part thereof",
              "",
              "Interest on reserves when payable."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "23",
            "text": "Section 96 of the principal enactment is hereby repealed and the following section substituted therefor :",
            "pre_block_list": [
              "Replacement of section 96 of the principal enactment. Computation of required reserves.",
              "96. (1) The reserves required to be maintained by a commercial bank or a prescribed financial institution shall be calculated on such basis as may be prescribed by  the Monetary Board."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "For the purposes of subsection (1), the principal  office in Sri Lanka of a commercial bank or a prescribed financial institution and the respective branches and agencies of such bank or financial institution shall be deemed to be one unit. .",
                "pre_block_list": [
                  "Monetary Law (Amendment) Act, No. 32 of 2002 21"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "24",
            "text": "Section 97 of the principal enactment is hereby repealed and the following section substituted therefor :",
            "pre_block_list": [
              "Replacement of section 97 of the principal enactment.",
              "97.  (1) Where the reserves maintained by a commercial bank or a prescribed financial institution are below the reserves required to be maintained by such bank or financial institution calculated on the basis prescribed under section 96, the commercial bank or the prescribed financial institution, as the case may be, shall pay to the Central Bank, interest on the amount of the deficiency at such rate as may be determined by the Monetary Board.",
              "Consequences of reserve deficiencies."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where a commercial bank or a prescribed financial institution regularly fails to maintain the reserves required to be maintained by such bank or financial institution calculated on the basis prescribed under section 96, the Monetary Board may, in the interests of the national economy, make order",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "prohibiting or restricting the making of loans or investments by that bank or financial institution ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "prohibiting the application of the whole or any specified part of the net profits of that bank or financial institution for the purpose of payment of a dividend to its shareholders",
                    "pre_block_list": [
                      ""
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "25",
            "text": "Section 98 of the principal enactment is hereby amended in subsection (2) of that section, by the substitution for the words under the preceding provisions of this Part, of the words under this Part.",
            "pre_block_list": [
              "Amendement of section 98 of the principal enactment.",
              "Monetary Law (Amendment) Act, No. 32 of 2002 22"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "26",
            "text": "The following new section is inserted immediately after section 98, and shall  have effect as section 98 A  of the principal enactment :",
            "pre_block_list": [
              "Insertion of new section 98 A  of the principal enactment.",
              "98 A . (1) The Director of Bank Supervision may examine, or cause an examiner of his department to examine the books, accounts and records of a prescribed financial institution and may require any such financial institution or its directors or officers to furnish from time to time or within such periods as may be specified, such books, accounts, records or information as may be required for the purpose of ascertaining whether such institution is complying with the provisions of this Part.",
              "Powers of the Director of Bank Supervision."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any person who resists or obstructs the Director of Bank Supervision or an examiner of his department, in the exercise by such Director or examiner, of the powers conferred on him by subsection (1) shall be guilty of an offence",
                "pre_block_list": [
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "27",
            "text": "Section 112 A  of the principal enactment is hereby amended as follows :",
            "pre_block_list": [
              "Amendment of section 112 A  of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "by the repeal of the marginal note to that section and substitution therefor of the following new marginal note :",
                "pre_block_list": [
                  "Facilities for maintenance of accounts at the Central Bank and a depository for scripless secutities .  ;"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "in paragraph ( b ) of that section, by the substitution for the words among direct participants. of the wordsamong direct participants ; and ; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "by the addition immediately after paragraph ( b ) thereof  of the following new paragraph :",
                "pre_block_list": [
                  "Monetary Law (Amendment) Act, No. 32 of 2002 23",
                  "( c ) for the maintenance of a depository for recording of title to scripless securities of the Central Bank, of direct participants and, in the case of dealer direct participants, of their customers. The Central Bank may make such rules and regulations as it may consider necessary in relation to the depository ; ;"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "by the repeal of the definition of the expression direct participant and the substitution therefor of the following definition :",
                "pre_block_list": [
                  "dealer direct participant  and direct participant shall have the respective meanings assigned to them in the Local  Treasury Bills Ordinance and the Registered Stock and Securities Ordinance ;  ;"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "by the repeal of the definition of the expression primary dealer and substitution therefor of the following definition :",
                "pre_block_list": [
                  " primary dealer shall have the meaning assigned to it in the Local Treasury Bills Ordinance and the Registered Stock and Securities Ordinance."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "28",
            "text": "Section 112 B  of the principal enactment is hereby repealed and the following section substituted therefor :",
            "pre_block_list": [
              "Replacement of section 112 B  of the principal enactment.",
              "112 B . (1) Any or all of the functions referred to in subsection (1) of section 98 and section 112 A  may. notwithstanding the provisions of such section, be carried out by a body corporate authorised for the purpose by the Monetary Board subject to such terms and conditions as may be imposed by the Monetary Board.",
              "Any body corporate to provide facilities under sections 98 (1) and 112 A ."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "A body corporate referred to in subsection (1) may hold an account with the Central Bank for the purpose of carrying out such functions",
                "pre_block_list": [
                  "",
                  "Monetary Law (Amendment) Act, No. 32 of 2002 24"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "29",
            "text": "Section 122 of the principal enactment is hereby amended as follows :",
            "pre_block_list": [
              "Amendment of Section 122 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "in subsection (2) of that section, by the deletion of all the words from  Every person who is guilty of an offence  to shall be liable, and substitution of the following words therefor :",
                "pre_block_list": [
                  "Every person who is guilty of an offence by reason of the contravention of, or failure to comply with, section 30 or section 32 (2) or section 45 or section 46 or section 50 or section 98 A  (2) or any rule, regulation, order, direction or requirement made or given under section 30 or section 79 (2) ( c ) or section 98 A  (1) or section 101 or section 102 shall be liable;"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "in subsection (2) of that section",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "i",
                    "text": "in paragraph ( a ) thereof, by the substitution for the words two thousand five hundred rupes of the words five hundred thousand rupees. ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "in paragraph ( b ) thereof, by the substitution for the words ten thousend reupees of the words one million rupees,  ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "in subsection (2 A ) of that section by the substitution for the words three thousand reupees of the wrods five hundred thousand rupees ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "in subsection (3) of that section by the substitution for the words five hundred rupees of the words one hundred thousand rupees.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "30",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency.",
              "Monetary Law (Amendment) Act, No. 32 of 2002 25",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180(Foreign), payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , N O . 32, T RANSWORKS  H OUSE , L OTUS  R OAD , C OLOMBO  01 before 15th December each year in respect of the year following."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}