{
  "n_pages": 9,
  "title_page": {
    "title": "(Temporary Provisions) Act",
    "num": "17",
    "year": "2021",
    "date_certified": "2021-08-23",
    "date_published": "2021-08-27",
    "price": 14.0,
    "price_postage": 15.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 23Rd Of August 2021]",
      "L.D.-O 19/2020",
      "A N  A Ct   To   Make   Temporary   Provisions   In   Relation   To   Situations",
      "Where   Persons   Were   Unable   To   Perform   Certain   Actions",
      "Required   By   Law   To   Be   Performed   Within   The   Prescribed   Time",
      "Periods   Due   To   Covid  -  19   Circumstances ;  To   Assign   Alternative",
      "Courts   Where   A   Court   Cannot   Function   Due   To   Covid  -  19",
      "Circumstances ;  To   Conduct   Court   Proceedings   Using   Remote",
      "Communication   Technology   To   Facilitate   The   Control   Of",
      "Coronavirus   Disease   2019  ( Covid  -  19 );  And   For   Matters",
      "Connected   Therewith   Or   Incidental   Thereto .",
      "Be   It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:-",
      "Short Title, Duration And Extension Of Operation Of The Act"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "This Act may be cited as the Coronavirus Disease 2019 (COVID -19) (Temporary Provisions) Act, No. 17 of 2021. The provisions of this Act shall be in operation for a period of two years commencing from   March 1, 2020.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Minister may, at any time within one month prior to the expiration of the period of operation of this Act, by Order published in the  Gazette , extend for a further period the operation of the Act:",
                "pre_block_list": [
                  "Provided however, the aggregate period of any extension shall not exceed two years from the date of such   extension."
                ],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "I",
        "text": "",
        "pre_block_list": [
          "R ELIEF   FOR  I NABILITY   TO  C OMPLY   WITH  P RESCRIBED  T IME  P ERIODS"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where any court, tribunal or any other authority established by or under any law is satisfied that, a person was prevented from-",
                "pre_block_list": [
                  "Relief in respect of inability to comply with prescribed time periods"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "instituting or filing any action, application, appeal or other legal proceeding, as the case may be, within the period prescribed by law for such purpose; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "performing any act which is required by law to be done or performed within a prescribed time period,",
                    "pre_block_list": [
                      "due to any COVID - 19 circumstance, it shall be competent for such court, tribunal or any other authority established by or under any law to allow, admit or entertain an action, application, appeal, other proceeding or act, referred to in paragraph ( a ) or ( b ), notwithstanding the lapse of the time period prescribed by law for such purpose and subject to the provisions of section 9, the period within which such person was subject to such COVID - 19 circumstance shall be excluded in calculating the said prescribed time period."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any relief granted under subsection (1) shall not apply in relation to any application or appeal-",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "to which the following rules apply-",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "the Supreme Court (Temporary Provisions) Rules, 2020 published in the  Gazette Extraordinary No. 2174/4 of May 6, 2020;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "the Supreme Court (Temporary Provisions) Rules, 2021 published in the  Gazette Extraordinary No. 2211/56 of January 21, 2021;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "the Court of Appeal (Procedure for Appeals from High Courts established by Article 154P of the Constitution) (Temporary Provisions) Rules, 2020 published in the  Gazette Extraordinary No. 2175/2 of May 12, 2020; or",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iv",
                        "text": "the Court of Appeal (Procedure for Appeals from High Courts established by Article 154P of the Constitution) (Temporary Provisions) Rules, 2021 published in the  Gazette Extraordinary   No. 2211/56 of January 21, 2021;",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "to which any Supreme Court Rule or Court of Appeal Rule as may be made under Article 136 of the Constitution within the period of operation of this Act, granting any exclusion of time period as a relief in respect of any COVID   - 19 circumstance, apply.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "II",
        "text": "",
        "pre_block_list": [
          "D ESIGNATION   OF  A TLERNATIVE  C OURTS"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Subject to the provisions of sections 46 and 47 of the Judicature Act, No. 2 of 1978,   where the ordinary functioning of any court of first instance is disrupted due to any COVID - 19 circumstance, the Judicial Service Commission may designate the nearest court of concurrent jurisdiction as the alternative court in place of such court, for the period during which such COVID - 19 circumstance exists. Any action, prosecution, proceeding or matter filed in or considered by such court of first instance or any new action, prosecution, proceeding or matter filed, shall be considered or heard by the court so designated:",
                "pre_block_list": [
                  "Designation of alternative courts in place of courts affected by COVID - 19 circumstances",
                  "Provided however, no transfer of an action, prosecution, proceeding or matter referred to in this subsection shall be made where-"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "any such court of first instance has reserved such action, prosecution, proceeding or matter for judgment, order or other pronouncement; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "all hearings in such action, prosecution, proceeding or matter have been concluded before such court of first instance.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "An action, prosecution, proceeding or matter filed in or considered by an alternative court referred to in subsection (1) may, by the presiding Judge of the alternative court, subsequently be transferred to the court of first instance which previously exercised jurisdiction in relation to such action upon the resumption of ordinary functions of such original court:",
                "pre_block_list": [
                  "Provided however, no transfer of an action, prosecution, proceeding or matter referred to in this subsection shall be made where-"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the alternative court has reserved such action, prosecution, proceeding or matter for judgment, order or other pronouncement; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "all hearings in such action, prosecution, proceeding or matter have been concluded before such alternative court.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "III",
        "text": "",
        "pre_block_list": [
          "C ONDUCTING  C OURT  P ROCEEDINGS  U SING  R EMOTE  C OMMUNICATION T ECHNOLOGY"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Notwithstanding anything contained in any other written law, where, in any action, application, appeal or other proceeding before a court of first instance,",
                "pre_block_list": [
                  "Conducting court proceedings using remote communication technology"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "any person is unable to appear in court; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the proceedings of the court cannot be conducted under the ordinary procedure,",
                    "pre_block_list": [
                      "due to any COVID - 19 circumstance, such action, application, appeal or proceeding before such court may be conducted by means of a live video or live television link created using a remote communication technology."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The provisions of",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the Supreme Court (Electronic Filing and Urgent Digital Virtual Hearings) (Special Provisions) Rules, 2021  published  in  the   Gazette   Extraordinary No. 2212/54 of January 29, 2021;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the Court of Appeal (Electronic Filing and Urgent Digital Virtual Hearings) (Special Provisions) Rules, 2021  published  in  the   Gazette     Extraordinary No. 2216/8 of February 23, 2021; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "any other Supreme Court Rule or Court of  Appeal Rule as may be made under Article 136 of the Constitution within the period of operation of this Act, in relation to conducting of court proceedings using remote communication technology,",
                    "pre_block_list": [
                      "shall,  mutatis mutandis,  apply to the extent possible, in relation to any action, application, appeal or proceeding conducted before any court of first instance under subsection (1)."
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "IV",
        "text": "",
        "pre_block_list": [
          "G ENERAL"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "Any period excluded as a relief under section 2 of this Act shall not exceed a period of twelve months:",
            "pre_block_list": [
              "Limitations on relief under this Act",
              "Provided that, a period exceeding twelve months may be excluded as a relief where the court, tribunal or any other authority established by or under any law is satisfied that it is just and equitable to do so and the period so excluded shall not exceed a period of further six months:",
              "Provided further, that the period excluded as a relief shall not exceed eighteen months in the aggregate."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "The burden of proof  that the inability to comply with the prescribed time periods for the purpose of section 2 is due to any COVID - 19 circumstance, shall be on the party making the application for relief under such section.",
            "pre_block_list": [
              "Burden of proof"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Any guideline, direction, circular, notice or decision whether in the printed or electronic form, made by the Government in relation to any COVID - 19 circumstance shall be admissible as  prima facie  evidence in any action, application, appeal or other legal proceeding instituted or made under this Act, without further proof.",
                "pre_block_list": [
                  "Guidelines, &c on any COVID -19 circumstance to be considered prima facie evidence"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where a party to such action, application, appeal or other legal proceeding disputes the admissibility of such guideline, direction, circular, notice or decision as evidence, the burden of proof shall be on the party who disputes such admissibility.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "For the purpose of this section, Government means any proper authority as defined in any regulation made under the Quarantine and Prevention of Diseases Ordinance (Chapter 222) in relation to COVID-19.",
                "pre_block_list": [
                  "Interpretation"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "In this Act, unless the context otherwise requires",
            "pre_block_list": [
              "COVID - 19 means the Coronavirus Disease 2019 (COVID - 19) declared as a quarantinable disease by Notification published in the Gazette  Extraordinary No. 2167/18 of March 20, 2020 under the Quarantine and Prevention of Diseases Ordinance (Chapter 222);",
              "COVID - 19 circumstance includes-"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "COVID - 19; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "any other circumstance arising out of or consequential to the circumstances referred to in paragraph ( a ); and",
                "pre_block_list": [
                  "Minister means the Minister assigned this Act under Article 44 or 45 of the Constitution."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency",
              "English Acts of the Parliament can be purchased at the P RAKASHANA  P IYASA , D EPARTMENT   OF G OVERNMENT  P RINTING , N O . 118, D R . D ANISTER  D E  S ILVA  M AWATHA , C OLOMBO  8."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}