{
  "n_pages": 27,
  "title_page": {
    "title": "Inland  Revenue  (Amendment)  Act",
    "num": "19",
    "year": "2003",
    "date_certified": "2003-05-09",
    "date_published": "2003-05-09",
    "price": 20.25,
    "price_postage": 6.75
  },
  "body_pages": {
    "preamble": [
      "Inland Revenue (Amendment) Act, No. 19 Of 2003 1",
      "[Certified On 9Th May 2003]",
      "L. Do. 11/2003.",
      "A N  A Ct   To   Amend   The  I Nland  R Evenue  A Ct , N O . 38  Of  2000",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Inland Revenue (Amendment) Act. No. 19   of 2003.",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "Section 10 of the Inland Revenue Act, No. 38 of 2000 amended by Act, No. 10 of 2002 (hereinafter referred to as the principal enactment) is hereby further amended by the insertion, immediately after paragraph ( eee ) of that section of the following paragraph :",
            "pre_block_list": [
              "Amendment of section 10 of Act, No. 38 of 2000.",
              "( eeee ) the interest arising or accuring to any person, (other than a body corporate, or any other person or partnership to whom or to which such interest is arising or accuring as business income,) on any secondary market transaction in dealing with any Security or Treasury Bond issued under the Registered Stocks and Securities Ordinance (Chapter 420), or Treasury Bill issued under the Local Treasury Bills Ordinance (Chapter 417), or  Central Bank Security issued under the Monetary Law Act (Chapter 422) on or after April 1, 2002 :",
              "For the purposes of this paragraph secondary market transaction includes a sale of a security, repurchase or reverse repurchase of a security after the original issue of such security ; ."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "Section 15 of the principal enactment as amended by Act, No. 8 of 2001 is hereby further amended by the repeal of sub-paragraph ( t ) of that section and the substitution therefor of the following sub-paragraph",
            "pre_block_list": [
              "Amendment of section 15 of the principal enactment.",
              "2H 0180077,150 (03/2003)",
              "Inland Revenue (Amendment) Act, No. 19 of 2003 2"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "t",
                "text": "the profits and income within the meaning of paragraph ( a ) of section 3 arising or accruing to any person or partnership on any secondary market transaction in dealing with any Security or Treasury Bond  issued under the Registered Stocks and Securities Ordinance (Chapter 420), or Treasury Bill, issued under the Local Treasury    Bills    Ordinance    (Chapter    417), or Central Bank Security issued under the Monetary Law Act, (Chapter 422), on or after April 1, 2002. :",
                "pre_block_list": [
                  "For the purposes of this paragraph secondary market transaction includes a sale of a security, repurchase or reverse repurchase of a security, after the original issue of such security ; ."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "Section 21 A  of the principal enactment (inserted by Act, No. 10 of 2002) is hereby amended as follows :",
            "pre_block_list": [
              "Amendment of section 21 A  of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "in subsection (1) of that section by the substitution for all the words from for a period of three years reckoned from the commencement of the year to the end of that subsection, of the following :",
                "pre_block_list": [
                  "for a period of five years reckoned from the year of assessment in which the undertaking commences to make profits or any year of assessment not later than two years reckoned from the date on which the undertakings, commences to carry on commercial operation which ever is earlier.;"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "in paragraph ( b ) of subsection (2) of that section by the substitution for the words five hundred million of the words two hundred and fifty million ; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "by the repeal of sub-paragraph (ii) of subsection (2) of that section and the substitution therefor of the following :",
                "pre_block_list": [
                  "Inland Revenue (Amendment) Act, No. 19 of 2003 3"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "export of non-traditional products means the export of any goods, including deemed export of goods within the meaning of section 49, other than goods referred to in sub-paragraph (ii) of paragraph ( b ) of section 52, not less than eighty  percentum  of the total turnover of such undertaking for any year of assessment.  .",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "Section 21 B  of the principal enactment (inserted by Act, No. 10 of 2002) is hereby amended in subsection (1) of that section by the substitution for all the words not less than five years but not more than ten years, to the end of that subsection of the following :",
            "pre_block_list": [
              "Amendment of section 21 B  of the principal enactment.",
              "not less than six years but not more than twelve years as may be determined by the Minister, by Order published in the  Gazette,  if the amount of the investment made by such company in such undertaking is not less than one thousand million rupees. Such period shall be reckoned, from the year of assessment in which the undertaking commences to make profits or any year of assessment not later than two years reckoned from the date on which the undertaking commences to carry on of commercial operations, which ever is earlier.  ."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "The following new sections are hereby inserted immediately after section 21 B  of the principal enactment and shall have effect as sections 21 C , 21 D , 21 E , 21 F  and 21 G  of that enactment :",
            "pre_block_list": [
              "Insertion of new sections 21 C , 21 D . 21 E , 21 F  and 21 G of the principal enactment.",
              "21 C . (1) The profits and income within the meaning of paragraph ( a ) of section 3 (other than any profits and income from the sale of capital assets) of any company from any specified undertaking referred to in subsection (2), shall be exempt from income tax, for a period of five years, reckoned from the year of assessment in which the undertaking",
              "Exemption from income tax of small scale infrastructure undertakings.",
              "Inland Revenue (Amendment) Act, No. 19 of 2003 4",
              "commences to make profits or any year of assessment not later than two years reckoned from the date of commencement of commercial operations, whichever is earlier."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "For the purposes of subsection (1) specified undertaking in relation to a company means an undertaking carried on by such company on or after April 1, 2002, and which is engaged in infrastructure development for the generation of power, tourism, recreation, ware housing and cold storage, garbage collection or disposal, construction of houses or construction of hospitals, and the total amount invested within one year from the commencement of the undertaking is not less than rupees ten million but not exceeding rupees fifty million.",
                "pre_block_list": [
                  "21 D . The profits and income within the meaning of paragraph ( a ) of section 3 (other than any profits and income from the sale of capital assets) of any company which commences a new undertaking which is engaged in research and development with an investment of not less than rupees two million made within one year from the commencement of such undertaking, shall be exempt from income tax for a period of five years, reckoned from the year of assessment in which the undertaking commences to make profits or any year of assessment not later than two years, reckoned from the date on which the undertaking commences to carry on of commercial operations which ever is earlier.",
                  "Exemption from income tax of any company engaged in research and development.",
                  "For the purposes of this section research and development means any systematic or intensive study carried out in the field of science and technology with the object of using the results",
                  "Inland Revenue (Amendment) Act, No. 19 of 2003 5",
                  "thereof for the production or improvement of materials, devices, products, produce or process (other than quality control of products or routine testing materials, devices, products or produce research in social sciences or humanities, routine data collection, efficiency surveys or management studies and market research or sales promotion).",
                  "21 E . (1) The profits and income within the meaning of paragraph ( a ) of section 3 (other than any profits from the sale of capital assets) of a company which acquires a non- performing or under performing business enterprise engaged in a specific area of activity, to rehabilitate such enterprise subject to terms approved by the Minister  and subject to adequate provision being made to meet the statutory liabilities outstanding at the time of acquisition of such enterprise, shall be exempt from income tax, for a period of three years, where the acquisition has been completed and commercial operations have commenced on or before March 31, 2004.",
                  "Exemption from income tax of any company acquiring non- performing or under performing business enterprises.",
                  "(2) The period of three years referred to in subsection (1), shall be reckoned from the year of assessment in which the acquired enterprise commences to make profits or any year of assessment, not later than two years reckoned from the date on which each enterprise commences commercial operations  which ever is earlier.",
                  "For the purposes of this section",
                  "acquires means  acquiring  ownership of enterprise by becoming the owner, partner or a joint venturer ;",
                  "Inland Revenue (Amendment) Act, No. 19 of 2003 6",
                  "rehabilitation means the recommencement of commercial operations of the enterprise on a sustainable basis ;",
                  "specific area means the manufacture of textiles, poultry, farming, fish rearing or any other area as may be determined by the Minister by Order published in the Gazette ;",
                  "non-performing means the failure to carry out commercial operations ;",
                  "under performing means the incurring of operational losses for a period not less than two consecutive years of assessment.",
                  "21 F . (1) The profits and income within the meaning of paragraph ( a ) of section 3, (other than any profits from the sale of capital assets) of any company which has an undertaking which is engaged in the manufacture and export of non- traditional products and undertakes expansion of its manufacturing undertaking of such products with an investment of not less than rupees ten million but not exceeding rupees one hundred million, shall be exempt from income tax  for a period of two years where the full investment has been made on or before March 31, 2004, in respect of such expansion.",
                  "Exemption from income tax of any company engaged in non-traditional products for exports which undertakes expansion.",
                  "(2) The period of two years referred to in subsection (1), shall be reckoned where the undertaking, which engages in expansion"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "is qualified for an exemption from income tax on the export of non- traditional products, from the date on which such exemption period is due to expire ; or",
                    "pre_block_list": [
                      "Inland Revenue (Amendment) Act, No. 19 of 2003 7"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "other than an undertaking referred to in  paragraph ( a ) from the date on which each undertaking commences to carry on commercial operations.",
                    "pre_block_list": [
                      "For the purposes of this section export of non-traditional products means the export of any goods, including deemed export of any goods within the meaning of section 49, other than goods referred to in sub-paragraph (ii) of paragraph ( b ) of section 52, not less than eighty percentum  of the total turnover of such undertaking for any year of assessment.",
                      "21 G . (1) The profits and income attributable to the expansion of any undertaking, of any company, which is engaged in the manufacture or production of traditional exports or non- exportable goods and which undertakes the expansion of any undertaking for the production or manufacture of such traditional export or non- exportable goods with an investment of not less than rupees ten million, shall be exempt from income tax for a period of two years where the full investment in relation to such expansion has been made on or before March 31, 2004.",
                      "Exemption from income tax of profits and income from expansion of undertakings engaged in the manufacture or production of traditional exports or non- exportable goods.",
                      "(2) The period of two years referred to in subsection (1) shall be reckoned from the year of assessment in which the expansion of such undertaking commences to make profits or from April 1, 2006, whichever is earlier.",
                      "For the purposes of this section profits and income attributable to the expansion of any undertaking means the excess of profits and income within the meaning of paragraph ( a ) of section 3, (other than any profits and income from the sale of capital assets) from the",
                      "Inland Revenue (Amendment) Act, No. 19 of 2003 8",
                      "production and manufacture of traditional exports or non-exportable goods during any year of assessment which is qualified for tax exemption over the annual average of the profits of such undertaking, such average, being computed taking into consideration the total profits for the period of three years immediately preceding the year of assessment in which  such tax exemption    period commenced",
                      ""
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "Section 23 of the principal enactment as amended by Act, No. 10 of 2002 is hereby further amended in subsection (1) of that section as follows :",
            "pre_block_list": [
              "Amendment of section 23 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "in paragraph ( b ) of that subsection by the repeal of sub-paragraph (iii) thereof and the substitution therefor of the following sub-paragraph",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "iii",
                    "text": "any motor coach acquired by such person and used in any trade, business, profession or vocation, in transporting employees of such trade, business, profession or vocation to, or from their place of work, at the rate of one hundred  percentum  of its cost of acquisition ;  and",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "in paragraph ( c ) of that subsection by the repeal of sub-paragraph (ii) thereof and the substitution therefor of the following sub-paragraph",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "one-fourth of any payment made for any year of assessment on or after April 1, 2002 ; .",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "Section 24 of the principal enactment, as last amended by Act, No. 10 of 2002 is hereby further amended in subsection (1) of that section, by the substitution in paragraph ( j ) of that subsection for the  word and figure section 96 of the word and figure section 95.",
            "pre_block_list": [
              "Amendment of section 24 of the principal enactment.",
              "Inland Revenue (Amendment) Act, No. 19 of 2003 9"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "Section 29 of the principal enactment as amended by Act, No 10 of 2002 is hereby further amended as follows :",
            "pre_block_list": [
              "Amendment of section 29 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "in subsection (1A) of that section",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "substitution for the word and figure section 122 A , wherever that word and figure appears in that section, of the words and figures section 122 A  and section 122 B  ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "in the proviso to that subsection by the substitution for the words statutory income of such person., of the words statutory income of such person :  ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "by the insertion immediately after the proviso to that subsection of the following :",
                    "pre_block_list": [
                      "Provided further that the interest received or accruing to any primary dealer being a company or otherwise from which tax has been deducted under section 122 A   on any primary market transaction on any Security or Treasury Bond issued under the Registered Stocks and Securities Ordinance (Chapter 420), or Treasury Bill issued under the Local Treasury Bills Ordinance (Chapter 417), or Central Bank Security issued under the Monetary Law Act (Chapter 422), shall not be considered as receipts from any trade or business under section 3 for the purpose of computing the statutory income of such company. ;"
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the insertion immediately after subsection (1A) of that section of the following new subsection :",
                "pre_block_list": [
                  "(1B) The assessable income of any primary dealer, on or after April 1, 2002, shall not include any interest income received or accruing where ",
                  "Inland Revenue (Amendment) Act, No. 19 of 2003 10"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "tax, on the total amount of such interest has been deducted under section 122 A  or section 122 B , as the case may be ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "such interest income has been accrued or arisen to such primary dealer in respect of a primary market transaction on any Security or Treasury Bonds issued under the Registered stock and Security Ordinance (Chapter 420), or Treasury Bill issued under the Local Treasury Bills Ordinance (Chapter 417), or Central Bank Security issued under the Monetary Law Act (Chapter 422), referred to in section 122 A  or  any debt security issued by a company under section 122 B , as the case may be.; and ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "in the proviso to subsection (2) of that section",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "in sub-paragraph ( c ) of paragraph (iii) of that subsection by the substitution for the words moneys worth., of the words moneys   worth ;;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "by the insertion immediately after paragraph (iii) of that proviso of the following paragraph :",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iv",
                        "text": "no deduction shall be allowed in respect of any sum paid if the amount payable has already been allowed in any year of assessment commencing prior to April 1, 2002",
                        "pre_block_list": [
                          ""
                        ],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "10",
            "text": "Section 40 B   of the principal enactment (inserted by Act, No. 10 of 2002) is hereby amended as follows :",
            "pre_block_list": [
              "Amendment of section 40 B  of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "in subsection (1) of that section by the substitution for the word and figure  21 B  of the words and figures section 21 B  or section 21 D  ; and",
                "pre_block_list": [
                  "Inland Revenue (Amendment) Act, No. 19 of 2003 11"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "in subsection (2) of that section by the substitution for the word and figure section 21 A , of the words and figures section 21 A  or section 21 C .",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "11",
            "text": "Section 49 of the principal enactment is hereby amended in subsection (1) of that section, by the substitution for the words other than desiccated coconut of the words other than coconut oil and desiccated coconut.",
            "pre_block_list": [
              "Amendment of section 49 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "12",
            "text": "Section 52 of the principal enactment is hereby amended by the substitution for the words other than desiccated coconut, where ever such words appear in that section, of the words other than coconut oil or desiccated coconut.",
            "pre_block_list": [
              "Amendment of section 52 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "13",
            "text": "Section 122 of the principal enactment as amended by Act No. 10 of 2002 is hereby further amended by the repeal of subsection (2) of that section and the substitution therefore of the following subsection :",
            "pre_block_list": [
              "Amendment of section 122 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every bank or financial institution or any company which issues any debt security, which deducts income tax in accordance with the provisions of subsection (1), or subsection (1) of section 122 A , or subsection (1) of section 122 B respectively, from any interest paid or credited or deemed to be credited by it to any person or partnership, as the case may be, shall issue to such person or partnership a statement setting out the following particulars :",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the gross amount of the interest paid or credited or deemed to be credited ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the rate of tax and the amount of tax deducted ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "the net amount of interest actually paid",
                    "pre_block_list": [
                      ""
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "14",
            "text": "Section 122 A  of the principal enactment is hereby repealed and the following section substituted therefor :",
            "pre_block_list": [
              "Replacement of section 122 A of the  principal enactment.",
              "Inland Revenue (Amendment) Act, No. 19 of 2003 12",
              "122 A . (1) Every bank or financial institution shall, subject to the provisions of this Chapter, deduct at the time the interest is paid or credited, on any sum of money deposited with it ",
              "Bank or financial institution to deduct income tax on interest paid.",
              "( a ) by any person or partnership in his or its own name or in the name of any other person or without the name of any person or partnership, other than in any Security or Treasury Bond issued under the Registered Stocks and Securities Ordinance (Chapter 420), or Treasury Bill issued under the Local Treasury Bills Ordinance (Chapter 417), or Central Bank Security issued under the Monetary Law  Act (Chapter 422) ",
              "(i) Where the interest paid or credited on such deposit is not less than six thousand rupees per month or not less than seventy two thousand rupees for a period of twelve months on such deposit on or after April 1, 2002 but prior to January 1, 2003;",
              "(ii) Where the interest paid or credited on such deposit which is not less than nine thousand rupees per month or not less than one hundred and eight thousand rupees for a period of twelve months, on such deposit, on or after January 1, 2003,",
              "income tax at the rate of ten  percentum  on the total amount of interest paid or credited on such deposit :",
              "Provided however the provisions of this paragraph shall not apply in respect of an institution certified by the Commissioner-",
              "Inland Revenue (Amendment) Act, No. 19 of 2003 13",
              "General as a charitable institution, on any interest and discount which is not in excess of twelve thousand rupees a month or one hundred and forty four thousand rupees a year, paid or credited to such institution on all deposits or accounts held by such institution :",
              "Provided further, that where a person or a partnership requests,  to a bank or financial institution, in writing to deduct income tax at the rate of ten  percentum  from any interest paid or credited to such person or partnership on a sum of money deposited by such person or partnership  with such bank or financial institution, then such bank or financial institution shall comply with such request, not withstanding that the amount of    interest paid or credited does not    exceed the amounts specified in the preceeding provisions and such deduction of tax shall be a deduction under section 122 A  ;",
              "( b ) by any person or partnership in his or its own name or without the name of any person or partnership in any Security or Treasury Bond issued under the Registered Stocks and Securities Ordinance (Chapter 420), or Treasury Bill issued under the Local Treasury Bills Ordinance (Chapter 417), or Central Bank Security issued under the Monetary Law Act (Chapter 422), and any discount is allowed and any interest is paid or is payable over the tenor of the period of such Security  Bond or Bill,",
              "income tax at the rate of ten  percentum  on the total amount of interest calculated at the yield to maturity over the tenor of such Security,  Bond",
              "Inland Revenue (Amendment) Act, No. 19 of 2003 14",
              "or Bill, as the case may be, at the time of the issue of such Security, Bond or Bill other than any Security, bond  Bill issued prior to April 1, 2002.",
              "For the purpose of this paragraph the yield, to maturity of any security or treasury bond issued under the Registered stocks and Securities Ordinance (Chapter 420), or Treasury Bill issued under the Local Treasury Bonds Ordinance (Chapter 417), or Central Bank Security issued under the Monetary Law Act (Chapter 422), at the time of issue, shall mean the interest at the time of issue considering the issue price which may be at a premium or discount on the par value of such Security, Bond or Bill, the interest coupons, the frequency and timing of interest coupons, the maturity value and the term of maturity."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Notwithstanding the provisions in paragraph ( a ) of subsection (1), in case of any savings certificate, certificate of deposit, or similar instruments or Government Rupee Loans or any deposit not in the name of any individual or jointly with any other individual  to any charitable institution as certified by the Commissioner- General, income tax shall be deducted on the total amount of  the discount allowed and interest paid irrespective of such amount of discount or interest.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "For the purposes of a deduction of income tax under this section",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "a sum of money deposited means any interest bearing deposit, any form of savings certificate or certificate of deposit or any Security or Treasury Bond issued under the Registered Stocks and Securities Ordinance (Chapter 420),",
                    "pre_block_list": [
                      "Inland Revenue (Amendment) Act, No. 19 of 2003 15",
                      "Treasury Bill issued under the Local Treasury Bills Ordinance (Chapter 417), or the Central Bank Security issued under the Monetary Law Act (Chapter 422);"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "interest in relation to a deposit of a sum of money includes interest, discount, any guaranteed income or fee assured, or any other payment accruing to the benefit of the person or partnership in whose name or on whose behalf the sum of money is deposited or to any other person on his or its behalf but does not include any interest exempt under section 10 or any interest credited or paid to any Ministry of a Minister  of  the  Cabinet,  or Department of the Government of Sri Lanka, or any Local Government Institution, or any Institution under a Provincial Council, or any foreign Government or any person exempt on such interest income under  paragraph ( a )  of  section 8 of this Act ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "in the case of a discount allowed, interest which is equal to the amount of discount shall be deemed to have been paid at the time of such discount is allowed and in case of a bill or bond or security with interest payments over the tenor of such Bond or Bill, or security the interest shall be the yield to maturity which amounts shall be deemed to have been paid at the time of the issue of such, Bond or Bill or security.",
                    "pre_block_list": [
                      "Inland Revenue (Amendment) Act, No. 19 of 2003 16",
                      "For the avoidance of doubt it is hereby declared that deduct at the time the interest is paid or credited in subsection (1) shall include any amount of interest credited to any account of the depositor or any other person",
                      ""
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "15",
            "text": "The following new section is hereby inserted immediately after section 122 A  of the principal enactment and shall have effect as section 122 B  of that enactment :",
            "pre_block_list": [
              "Insertion of new section 122 B  in the principal enactment.",
              "122 B . (1) Any company which issues corporate debt security shall, subject to the provisions of this Chapter, deduct at the time of payment the interest payable by such company where such payment takes place on or after November 1, 2002 on any sum of money subscribed by any person or partnership towards such debt security, whether such subscription has been made before or on or after November 1, 2002, income tax at the rate of ten  percentum on the total amount of interest accrued and paid or credited on such debt security :",
              "A company which issues corporate debt security to deduct income tax on interest.",
              "Provided however any corporate debt security issued at a discount exceeding fifty percentum  of the par value of such security shall not be subject to the deduction of tax under this section. Any interest or other income arising out of or in relation to such security shall be chargeable with tax, at the rate of ten  percentum, including any secondary market transaction, involving such security notwithstanding any thing to the contrary in this Act."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where any discount is allowed or any other guaranteed income is paid on such debt security on or after November 1, 2002 such discount or income shall be deemed to be interest paid and be liable to the deduction of income tax accordingly.",
                "pre_block_list": [
                  "Inland Revenue (Amendment) Act, No. 19 of 2003 17",
                  "For the purposes of this section "
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "corporate debt security means any debt security issued by any company",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "which is a limited liability company listed on the Stock Exchange ; or",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "where the security is listed on the Stock Exchange; or",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "where the paying agent for such company is a",
                        "pre_block_list": [
                          "(A) licensed commercial bank or a financial services subsidiary thereof ; or",
                          "(B) licensed specialized bank or a financial services subsidiary thereof ; or",
                          "(C) a non-bank financial institution,",
                          "and such security shall be any interest bearing or discounted debt instrument which includes bonds, notes, mortgages and any other form of instrument or paper that obligates the company which issues such security to pay the holder of a specified sum of money on demand or during the tenor or maturity."
                        ],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "debt security shall not include any loans, advances, over-draft or other similar facility or financial instrument issued by a bank or financial institution in the course of carrying on a business.",
                    "pre_block_list": [
                      "Inland Revenue (Amendment) Act, No. 19 of 2003 18",
                      "For the avoidance of doubt it is hereby declared that deduct at the time of payment from interest payable, in subsection (1) shall include any amount of interest credited to any account of the subscriber or any other person",
                      ""
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "16",
            "text": "Section 123 of the principal enactment is hereby amended as follows :",
            "pre_block_list": [
              "Amendment of section 123 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the substitution for all the words a payment referred to in section 122, then, of the words a payment of interest referred to in section 122, section 122 A  or section 122 B , then ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "in paragraph ( a ) of that section by the substitution for the word and figure section 122, of the words and figures section 122, section 122 A  or section 122 B ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "in paragraph ( b ) of that section",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "by the substitution for the word and figure section 123, of the words and figures section 122, section 122 A  or section 122 B ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "by the substitution for the words amount set out in such statement, of the words amount set out in such statement :; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "by the addition immediately after paragraph ( b ) of that section of the following :",
                "pre_block_list": [
                  "Provided however, where the total income on which tax has been deducted under section 122 A  or section 122 B , accrues over more than one year of assessment and has not been included in full in computing the assessable income of such person for any year of assessment, then such deduction shall be restricted to the propotionate amount of tax so deducted which  is attributable to the income included in the assessable income of such person in that year or any subsequent year of assessment",
                  "",
                  "Inland Revenue (Amendment) Act, No. 19 of 2003 19"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "17",
            "text": "The following new sections are hereby inserted immediately after section 123 of the principal enactment and shall have effect as sections 123 A  and 123 B  of that enactment :",
            "pre_block_list": [
              "Insertion of new sections 123 A  and 123 B  of the principal enactment.",
              "123 A . Where any person is engaged in any secondary market transaction, involving any security or treasury bond issued under the Registered stock and Securities Ordinance (Chapter 420), or Treasury Bill issued under the Local Treasury Bills Ordinance (Chapter 417), or Central Bank Security issued under the Monetary Law Act (Chapter 422) ,referred to in section 122 A  on which the income tax has been deducted during any year of assessment at the rate of ten  percentum  at the time of issue of such Security, Bond or Bill or where such Security, Bond or Bill has been issued prior to April 1, 2002 such person is entitled to a notional tax credit at ten  percentum  of the grossed up amount of interest income from such secondary market transaction to an amount of one ninth of the same, if such interest income forms part of the  assessable income of such person for that year of assessment.",
              "A notional tax credit on secondary market transactions.",
              "For the purposes of this section interest income from secondary market transaction means interest income accrued or received on a outright or reverse purchase transaction on such Security, Bond or Bill from a date on or after the date of primary issue of such Security, Bond or Bill, less interest expenses on repurchase transaction with Securities, Treasury Bonds or Treasury Bills from which such interest income was earned which has been certified by an approved accountant referred to in section 99 of this Act.",
              "Inland Revenue (Amendment) Act, No. 19 of 2003 20",
              "123 B . Where any person has proved to the satisfaction of the Commissioner-General that such person has already paid income        tax on  any  interest  liable  to  income     tax  at ten percentum  under section 122 A  or 122 B  within twelve months from the date of commencement of this Act, such person shall be entitled to a refund of such income tax paid by him on such interest income other than income tax deducted under section 122 A  or 122 B",
              "",
              "Refund of income tax paid on interest liable to withholding tax.",
              "Insertion of new section 124 A  in the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "18",
            "text": "The following new section is hereby inserted immediately after section 124 of the principal enactment and shall have effect as section 124 A  of that enactment :",
            "pre_block_list": [
              "124 A . (1) Any person or partnership from whose interest income the income tax is deductible by a bank or financial institution, or a company which issues any corporate debt security in accordance with the provisions of section 122 A  or 122 B , as the case may be, and such interest income will form part of the assessble income of such person or divisible profit or income of the partnership, as the case may be, for any year of assessment, may, if the amount of income tax payable by him or the relevant partners for such year of assessment is less than the income tax deductible during that year of assessment under section 122 A  or 122 B , make an application to the Commissioner-General in such form and containing such particulars as may be specified by the Commissioner-General  requesting that a direction be issued to that bank or financial institution or any company which issues corporate debt security, to make the necessary adjustments in the deduction of income tax in that year of assessment.",
              "Issue of directions where deductions are made  under section 122 A or 122 B .",
              "Inland Revenue (Amendment) Act, No. 19 of 2003 21"
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The provisions of subsection  (2), subsection (3), and subsection (4) of section 124 shall  mutatis  mutandis   apply  to  and  in relation to any direction issued under subsection (1).",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Commissioner-General shall not issue a direction as provided for in subsection (1) of this section unless, such excess deduction of the income tax arises as a result of losses incurred by such person or partnership which are deductible under section 29 and such amount of losses at the commencement of the relevant year of assessment exceeds the estimated total statutory income  for that year on the basis of the preceding year excluding the relevant estimated interest income  which is subject to the deduction of income tax  under section 122 A or 122 B  or such interest income which is subject to the income tax deduction is exempt from income tax.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "19",
            "text": "The following new section is hereby inserted immdiately after section 125 of the principal enactment and shall have effect as section 125 A  of that enactment :",
            "pre_block_list": [
              "Insertion of new section 125 A  in the principal enactment. Penalty for tax avoidance.",
              "125 A . Where the Commissioner General is of the view, that any bank or financial institution which issues any debt security, or a company which issues corporate debt security not deducting tax in accordance with the provisions of section 5 122 A  or 122 B , as the case may be, he shall after affording  such bank, financial institution or any such company which issues corporate debt security an opportuity to show cause and where he is satisfied that there has been a contravention of the provisions of sections 122 A  or 122 B , as the case  may be,",
              "Inland Revenue (Amendment) Act, No. 19 of 2003 22",
              "impose on such bank or financial institution or the company which issues such debt security a penalty of a sum equivalent to five hundred percentum  of the tax avoided  by the contravention of the  provisions of any such sections. ."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "20",
            "text": "Section 129 of the principal enactment is hereby amended as follows :",
            "pre_block_list": [
              "Amendment of section 129 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the renumbering of that section as subsection (1) ; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the addition immediately after the renumbered subsection (1) of that section of the following subsection :",
                "pre_block_list": [
                  "(2) Notwithstanding anything contained in subsection (1), where any penalty is payable under subsection(1), is outstanding on November 6, 2002"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "such penalty shall be waived in full where the tax in default has been fully paid on or before November 6, 2002 ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "where a part of the tax in default has been paid on or before November 6, 2002, the penalty referable to the amount of the tax in default so paid, shall be waived",
                    "pre_block_list": [
                      ""
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "21",
            "text": "The following new sections are hereby inserted immediately after section 130 of the principal enactment and shall have effect as section 130 A  and 130 B  of that enactment :",
            "pre_block_list": [
              "130 A . Where any tax has been deducted from any person or partnership in accordance with the provisions of sections 122 A  or 122 B , such person or partnership, as the case may be, shall be a person or partnership chargeable with income tax.",
              "Person or Partnership chargeable with income tax.",
              "Inland Revenue (Amendment) Act, No. 19 of 2003 23",
              "130 B . For the purposes of this Chapter, any Co-operative society registered under the Co- operative Societies Law, No. 5 of 1972, shall be deemed to be a company",
              "",
              "Insertion of new sections 130 A  and 130 B  in the principal enactment.",
              "Registered co- operative societies deemed to be companies."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "22",
            "text": "Section 186 of the principal enactment as last amended by Act, No. 10 of 2002 is hereby further amended as follows :",
            "pre_block_list": [
              "Amendment of section 186 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "in the definition of the expression of authorized representative",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "in sub item (iii) in item 1 ( a ) of that definition by the substitution for the words Attorney- at-Law ; or the words Attorney-at-Law ;;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "in sub item (iv) in item 1 ( a ) of the definition by the substitution for the words employed by that person, of the words employed by that person ; or;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "by the insertion immediately after sub item ( iv ) in item 1 ( a ) of the following :",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "v",
                        "text": "a member of the Sri Lanka Institute of Taxation established under the Sri Lanka Institute of Taxation Act, No. 21 of 2000 ;  ;",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the insertion immediately after the definition of the expression prescribed of the following :",
                "pre_block_list": [
                  "primary dealer means any financier or bank, appointed, by the Monetary Board of Sri Lanka, under the Local Treasury  Bills Ordinance (Chapter 417) or the Registered Stocks and Securities Ordinance (Chapter 420), and functioning as a primary dealer in Treasury Bills, Treasury Bonds Registered Stock or other Security ; .",
                  "Inland Revenue (Amendment) Act, No. 19 of 2003 24"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "23",
            "text": "The Third Schedule to the principal enactment is hereby amended in item (12) of that Schedule by the substitution for the word,  figure and letter section (1) ( r ) of the word, figures and letter section 23(1) ( q ).",
            "pre_block_list": [
              "Amendment of the Third Schedule to the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "24",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The amendments made to sections 10, 15, 21 A , 21 B , 23, 29, 40 B , 122, 122 A  123 and 186  of the principal enactment  by sections 2, 3, 4, 5, 9(1)  ( b ), ( c ), 9(2), 9(3), 10, 13, 14, 16 and  22  of this Act, shall  for all purposes be deemed ;  to have come into force on April 1, 2002.",
                "pre_block_list": [
                  "Retrospective effect."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The inserted  new sections 21 D ,  21 E  and 21 G  inserted in the  principal enactment by section 6 of this Act, shall  for all purposes be deemed  to have come into force on April 1, 2003.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": ". The amendments made to sections 23, 24 and the Third Schedule to the principal enactment by sections 7(2), 8 and section 23 of this Act, shall for all purposes be deemed  to have come into force on April 1, 2000.",
                "pre_block_list": [
                  "4. ( a ) The amendment made to section 29 of the principal enactment by section 9(1) ( a ) of this Act, and"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "The  new section 122 B   inserted in the principal enactment by section 15 of this Act,",
                    "pre_block_list": [
                      "shall for all purposes be deemed  to have come into force on November 1, 2002.",
                      "5. The amendment made to section 49 and 50 of the principal enactment by sections 11 and 12  of this Act, shall for all purposes be deemed  to have come into force on January 1, 2003.",
                      "6. The amendment made to section 129 of the principal enactment by section 20 of this Act, shall  for all purposes be deemed  to have come into force on November 6, 2002.",
                      "Inland Revenue (Amendment) Act, No. 19 of 2003 25",
                      "(7) ( a ) seetion 21 F , inscrted in the principal enactment by section 6, of this Act shall be deemed for all purposes to have come into  force on October 1, 2002;",
                      "( b )  sections 21 C , 123 A , 123 B , 124 A , 125 A , 130 A and 130 B   inserted in the principal enactment by sections 6, 17, 18, 19 and 21 respectively of this Act",
                      "shall  for all purposes be  deemed   to have  come into force on April 1, 2002."
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "25",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail. Sinhala text to prevail in case of inconsistency.",
            "pre_block_list": [
              "Inland Revenue (Amendment) Act, No. 19 of 2003 26",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180(Foreign), payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , N O . 32, T RANSWORKS  H OUSE , L OTUS  R OAD , C OLOMBO  01 before 15th December each year in respect of the year following."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}