{
  "n_pages": 51,
  "title_page": {
    "title": "Construction Industry Development Act",
    "num": "33",
    "year": "2014",
    "date_certified": "2014-10-16",
    "date_published": "2014-10-17",
    "price": 47.0,
    "price_postage": 70.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 16Th October, 2014]",
      "L.D.O. 59/2005.",
      "A N  A Ct   To   Provide   For   The  D Evelopment   Of   The  C Onstruction I Ndustry   In  S Ri  L Anka ;  To   Regulate ,  Register ,  Formalize",
      "And   Standardize   The   Activities   Of   The   Construction   Industry ;",
      "To   Provide   For   The   Establishment   Of   The   National   Advisory",
      "Council   On   Construction ;  The   Establishment   Of   The",
      "Construction   Industry   Development   Authority ;  And   The",
      "Establishment   Of   The   Construction   Industry   Development   Fund",
      "And   The   Fund   Of   The   Construction   Industry   Development",
      "Authority ;  To   Provide   Measures   For   The   Improvement   And",
      "Wellbeing   Of   The   Industry   Related   Professionals ,",
      "Manufacturers ,  Suppliers ,  Contractors   And   Craftsmen ;",
      "And   For   The   Settlement   Of   Disputes   Related   To  C Onstruction",
      "Activities ;  To   Ensure   Public   Safety   In   The   Construction   Industry",
      "Of  S Ri  L Anka ;  And   For   Matters   Connected   Therewith   Or",
      "Incidental   Thereto .",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:"
    ],
    "pre_section_list": [
      {
        "class_name": "ActL1Section",
        "num": "1",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "This Act may be cited as the Construction Industry Development Act, No. 33 of 2014 and shall come into operation on such date (hereinafter referred to as the appointed date) as the Minister may appoint by Order published in the  Gazette .",
            "pre_block_list": [
              "Short title, date of operation and application."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "This Act shall apply to all activities relating to the construction industry within the Democratic Socialist Republic of Sri Lanka, except otherwise provided herein.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      }
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "I",
        "text": "",
        "pre_block_list": [
          "N ATIONAL  P OLICY   ON  C ONSTRUCTION   AND   ITS  I MPLEMENTATION"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The National Advisory Council on Construction established under Part II of this Act, shall formulate a National Policy on Construction and such policy shall comprise",
                "pre_block_list": [
                  "National policy on Construction.",
                  "2PL 0084383,000 (08/2014)",
                  "Construction Industry Development Act, No. 33 of 2014 2",
                  "matters relating to the construction industry and its goals. The National Advisory Council on Construction shall on completion of the National Policy forward it to the Cabinet of Ministers for approval. Such National Policy may, from time to time, be revised in keeping with the developments of the construction industry."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "In formulating the National Policy in terms of subsection (1), emphasis shall be given to the involvement of professionals within the construction industry, including resource personnel in the field of traditional knowledge.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "The Minister may, from time to time, for the purpose of implementing the National Policy on Construction prepared in terms of section 2, give such general or special directions as he may consider necessary to the Construction Industry Development Authority to provide for the promotion and implementation of the National Policy.",
            "pre_block_list": [
              "Implementation  of National Policy."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "II",
        "text": "",
        "pre_block_list": [
          "N ATIONAL  A DVISORY  C OUNCIL   ON  C ONSTRUCTION"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "There shall be established a council which shall be called the National Advisory Council on Construction (hereinafter referred to as the Council) and shall consist of the members as specified in section 5.",
            "pre_block_list": [
              "Establishment of the National Advisory Council on Construction."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Council shall consist of",
                "pre_block_list": [
                  "Constitution of the Council."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the following  ex-officio  members, namely",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "the Secretary to the Ministry of the Minister in charge of the subject of Construction who shall be the Chairman of the Council and in his absence, an officer not below the rank of an Additional Secretary of that Ministry, nominated by the Secretary;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "the Secretary to the Ministry of the Minister in charge of the subject of Urban Development or an officer not below the rank of a Senior Assistant Secretary in charge of development work of that Ministry nominated by the Secretary;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "the Secretary to the Ministry of the Minister in charge of the subject of Highways or an officer not below the rank of a Senior Assistant Secretary in charge of development work of that Ministry nominated by the Secretary;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iv",
                        "text": "the Secretary to the Ministry of the Minister in charge of the subject of Water Supply and Drainage or an officer not below the rank of a Senior Assistant Secretary in charge of development work, of that Ministry nominated by the Secretary;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "v",
                        "text": "the Secretary to the Ministry of the Minister in charge of the subject of Irrigation or an officer not below the rank of a Senior Assistant Secretary in charge of development work, of that Ministry nominated by the Secretary;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "vi",
                        "text": "the Secretary to the Ministry of the Minister in charge of the subject of Housing or an officer not below the rank of a Senior Assistant Secretary in charge of development work, of that Ministry nominated by the Secretary;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "vii",
                        "text": "the Secretary to the Ministry of the Minister in charge of the subject of Vocational and Technical Training or an officer not below the rank of a Senior Assistant Secretary in charge of development work, of that Ministry nominated by the Secretary; and",
                        "pre_block_list": [
                          "Construction Industry Development Act, No. 33 of 2014 4"
                        ],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the following fifteen members appointed by the Minister (hereinafter referred to as appointed members) as follows:",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "the Chairman of the Construction Industry Development Authority established under section 8 of this Act;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "the President of the Institution of Engineers, Sri Lanka established under the Institution of Engineers, Sri Lanka Act, No. 17 of 1968 or his representative;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "the President of the Sri Lanka Institute of Architects established under the Sri Lanka Institute of Architects Law, No. 1 of 1976 or his representative;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iv",
                        "text": "the President of the Institute of Quantity Surveyors, Sri Lanka established under the Institute of Quantity Surveyors, Sri Lanka (Incorporation) Act, No. 20 of 2007 or his representative;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "v",
                        "text": "the President of the Institute of Town Planners, Sri Lanka established under the Institute of Town Planners, Sri Lanka (Incorporation) Act, No. 23 of 1986 or his representative;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "vi",
                        "text": "the President of the Association of Consulting Engineers, Sri Lanka established under the Association of Consulting Engineers, Sri Lanka (Incorporation) Act, No. 42 of 2003 or his representative;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "vii",
                        "text": "the President of the Institution of Incorporated Engineers, Sri Lanka established under the Institution of Incorporated Engineers, Sri Lanka (Incorporation) Act, No. 64 of 1992 or his representative;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "viii",
                        "text": "two representatives from the National Construction Association of Sri Lanka representing the Major and Minor Contractors, respectively and who are nominated by the National Construction Association of Sri Lanka;",
                        "pre_block_list": [
                          "(ix) one representative from the Chamber of Construction Industry, Sri Lanka nominated by the Chamber of Construction Industry, Sri Lanka;",
                          "(x) one member nominated by the Institution of Engineers, Sri Lanka established by the Institution of Engineers, Sri Lanka Act, No. 17 of 1968; and",
                          "(xi) four members appointed by the Minister from among persons who have achieved eminence in the fields of construction, environmental science, labour relations and public health or occupational health."
                        ],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "A person shall be disqualified from being appointed or continuing as an appointed member of the Council",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "if he is, or becomes a member of Parliament or any Provincial Council or any local authority; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "if he is not, or ceases to be a citizen of Sri Lanka; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "if he is under any law in force in Sri Lanka or in any other country found or declared to suffer from unsoundness of mind; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "if he is serving or has served a sentence of imprisonment imposed by any Court in Sri Lanka or any other country; or",
                    "pre_block_list": [
                      "Construction Industry Development Act, No. 33 of 2014 6"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "if he holds or enjoys any right or benefit under any contract made by or on behalf of the Construction Industry Development Authority; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "if he has any financial or other interest as is likely to affect prejudicially the discharge by him of his functions as a member of the Council.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every appointed member shall unless he vacates office earlier by death, resignation or removal, hold office for a term of three years from the date of his appointment and shall unless he has been removed, be eligible for reappointment.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The Minister may, if he considers it expedient to do so, remove from office any appointed member after assigning reasons therefor.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Any appointed member may at any time resign his office by letter to that effect addressed to the Minister and sent by registered post.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "In the event of vacation of office by death, resignation or removal of any appointed member, the Minister may having regard to the provisions of paragraph ( b ) of subsection (1) appoint any other person to succeed such member. Any member so appointed shall hold office for the unexpired term of office of the member whom he succeeds.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "Where an appointed member, by reason of illness, infirmity or absence from Sri Lanka for a period of not less than three months, is temporarily unable to perform his duties, it shall be the duty of such member to inform the Minister in writing of such inability. The Minister may, on receipt of such information, having regard to the provisions of paragraph ( b ) of subsection (1) appoint some other person to act in his place.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "8",
                "text": "No act or proceeding of the Council shall be invalid by reason only of the existence of any vacancy in the Council or any defect in the appointment of a member of the Council.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "9",
                "text": "All decisions at any meeting of the Council shall be arrived at by the vote of a majority of the members present. In the case of an equality of votes, the member presiding shall have a casting vote.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "10",
                "text": "The members of the Council shall be remunerated in such manner and at such rates as may be determined by the Minister with the concurrence of the Minister in charge of the subject of Finance.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "The objects of the Council shall be to",
            "pre_block_list": [
              "Objectives of the Council."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "formulate and amend the national policy on construction and its implementation mechanism;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "make representations to the Minister on any need for the development of the construction industry;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "advise the Minister and make recommendations on any regulation to be made under this Act;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "advise and make recommendations to the Authority on strategic issues, policies and legislative proposals that may affect or which is incidental or connected with the construction industry; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "propose measures to the Authority which are necessary for the development and sustenance of the construction industry.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Council shall meet at least once in three months. The Minister may however call a special meeting if a need arises to discuss any matter of importance.",
                "pre_block_list": [
                  "Meetings of the Council."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The quorum for a meeting of the Council shall be eight members.",
                "pre_block_list": [
                  "Construction Industry Development Act, No. 33 of 2014 8"
                ],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "III",
        "text": "",
        "pre_block_list": [
          "C ONSTRUCTION  I NDUSTRY  D EVELOPMENT  A UTHORITY"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be established an authority called and known as the Construction Industry Development Authority (hereinafter referred to as the Authority).",
                "pre_block_list": [
                  "Establishment of the Construction Industry Development Authority."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Authority shall by the name assigned to it by subsection (1), be a body corporate and shall have perpetual succession and a common seal and may sue and be sued in such name.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The management and administration of the affairs of the Authority shall be vested in a Board of Management (hereinafter referred to as the Board) which shall consist of",
                "pre_block_list": [
                  "Management and administration of the affairs of the Authority."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the following  ex-officio  members",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "the Secretary to the Ministry of the Minister in charge of the subject of Construction or an officer not below the rank of a Senior Assistant Secretary nominated by the Secretary; and",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "the Secretary to the Ministry of the Minister in charge of the subject of Finance or an officer not below the rank of a Senior Assistant Secretary nominated by the Secretary; and",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the following twelve members appointed by the Minister (hereinafter referred to as appointed members)",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "a member of the Institution of Engineers, Sri Lanka nominated by the Institution of Engineers, Sri Lanka established under the Institution of Engineers, Sri Lanka Act, No. 17 of 1968;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "a member of the Sri Lanka Institute of Architects nominated by the Sri Lanka Institute of Architects established under the Sri Lanka Institute of Architects Law, No. 1 of 1976;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "a member of the Sri Lanka Institute of Quantity Surveyors, Sri Lanka nominated by the Institute of Quantity Surveyors, Sri Lanka established under the Institute of Quantity Surveyors, Sri Lanka (Incorporation) Act, No. 20 of 2007;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iv",
                        "text": "a member of the Association of Consulting Engineers, Sri Lanka nominated by the Association of Consulting Engineers, Sri Lanka established under the Association of Consulting Engineers Sri Lanka (Incorporation) Act, No. 42 of 2003;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "v",
                        "text": "a member of the National Construction Association of Sri Lanka nominated by the National Construction Association of Sri Lanka;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "vi",
                        "text": "a member of the Chamber of Construction Industry, Sri Lanka nominated by the Chamber of Construction Industry, Sri Lanka; and",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "vii",
                        "text": "six other persons who are not members of the Council, of whom",
                        "pre_block_list": [
                          "( a ) three persons who have significantly contributed to the development of the construction industry in Sri Lanka; one of whom shall be a person appointed upon the request of the President of the Institution of Incorporated Engineers, Sri Lanka established under the Institution of Incorporated Engineers, Sri Lanka (Incorporation) Act, No. 64 of 1992; and",
                          "Construction Industry Development Act, No. 33 of 2014 10",
                          "( b ) three other persons to represent the fields of",
                          "(A) Agriculture,  Water  Resources  or Environmental Science;",
                          "(B) Public Health or Vocational Health; and",
                          "(C) Social, Cultural Heritage or Traditional Knowledge."
                        ],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Minister shall appoint one of the appointed members, to be the Chairman of the Board.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Minister shall appoint one of the appointed members as the Working Director of the Authority who shall be a full time officer.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "A person shall be disqualified from being appointed or continuing as a member of the Board",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "if he is, or becomes a member of Parliament or any Provincial Council, or any local authority; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "if he is not, or ceases to be a citizen of Sri Lanka; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "if he is under any law in force in Sri Lanka or in any other country found or declared to suffer from unsoundness of mind; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "if he is serving or has served a sentence of imprisonment imposed by any Court in Sri Lanka or any other country; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "if he holds or enjoys any right or benefit under any contract made by or on behalf of the Authority; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "if he has any financial or other interest as is likely to affect prejudicially the discharge by him of his functions as a member of the Board.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Every appointed member shall, unless he vacates office earlier by death, resignation or removal, hold office for a term of three years from the date of his appointment and shall, unless he has been removed from office, be eligible for re-appointment.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "The Minister may by Order published in the  Gazette remove any appointed member from office for reasons assigned. A member in respect of whom an Order is so made under this section shall be deemed to have vacated office on the date of publication of that Order in the  Gazette .",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "Any appointed member may at any time resign from office by a letter to that effect, addressed to the Minister and sent by registered post.",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "In the event of a vacation of office by death, resignation or removal of any appointed member nominated by an organization set out in subsection (1) of section 9, the Minister may appoint any other person to succeed such member as nominated by such organization. If such member was not nominated by an organization, then the Minister may appoint a suitable person from such organization to succeed such member. Any member so appointed shall hold office for the unexpired term of office of the member whom he succeeds.",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "In the case of a member nominated by an organization, on the nomination of such a member being withdrawn by the relevant organization, such member shall cease to function as a member of the Board.",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "Where an appointed member, by reason of illness, infirmity or absence from Sri Lanka for a period of not less than three months, is temporarily unable to perform his duties, it shall be the duty of such member to inform the Minister in writing of such inability. Thereupon, the Minister may, appoint some other person nominated by the relevant organization or any suitable person if such member was not nominated by any organization, to act in his place.",
                    "pre_block_list": [
                      "Construction Industry Development Act, No. 33 of 2014 12"
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "The Minister may, for reasons assigned, remove the Chairman or the Working Director of the Board.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "8",
                "text": "If the Chairman or the Working Director, by reason of illness, infirmity or absence from Sri Lanka, is temporarily unable to perform the duties of his office, the Minister may nominate another member of the Board to act in his place.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "9",
                "text": "The Chairman or the Working Director may, at any time resign from office of the Chairman or the Working Director by a letter addressed to the Minister. Such resignation shall take effect upon it being accepted by the Minister in writing.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "10",
                "text": "Subject to the provisions of subsections (2) and (3), the term of office of the Chairman and the Working Director shall be three years. The Chairman and the Working Director shall be eligible for reappointment.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "11",
                "text": "The Chairman, Working Director and the appointed members of the Board may be paid such remuneration out of the fund of the Authority as the Minister may determine in consultation with the Minister in charge of the subject of Finance.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "12",
                "text": "The Chairman of the Board shall preside at every meeting of the Board. In the absence of the Chairman at any meeting, the members present shall elect one among their members to preside at such meeting.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "10",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The quorum for a meeting of the Board shall be five members and the Board may subject to other provisions of this Act, regulate the procedure in respect of meetings of the Board and the transaction of business at such meetings.",
                "pre_block_list": [
                  "Meetings of the Board."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Chairman or the member presiding at any meeting of the Board, shall, in addition to his own vote, have a casting vote where there is an equality of votes.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Board shall meet at least once in every month.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "No act, decision or proceeding of the Board shall be deemed to be invalid by reason only of the existence of any vacancy in the Board or any defect in the appointment of any member thereof.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "11",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The seal of the Authority",
                "pre_block_list": [
                  "Seal of the Authority."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "shall be in the custody of the Director-General of the Authority;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "may be altered in such manner as may be determined by the Authority; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "shall not be affixed to any instrument or document except with the sanction of the Authority and in the presence of the Chairman and another member of the Authority who shall sign the instrument or document in token of their presence and such signing shall be independent of the signing of any person as a witness.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Authority shall maintain a register of the instruments and documents to which the seal of the Authority is affixed.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "12",
            "text": "The objects of the Authority shall be",
            "pre_block_list": [
              "Objects of the Authority."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "to ensure the implementation of the National Policy on Construction in keeping with the directions issued by the Minister in that regard under section 3;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "to provide strategic leadership to the stakeholders of the construction industry to stimulate sustainable growth, reform, and improvement of the construction sector;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "to register and renew such registration of the stakeholders of the construction industry as may be prescribed from time to time;",
                "pre_block_list": [
                  "Construction Industry Development Act, No. 33 of 2014 14"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "to promote sustainable growth of the construction industry with special attention to the design and development of energy efficient buildings and structures;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "to promote appropriate research and dissemination and publication of research work on any matter relating to the construction industry and its development;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "to formulate, in consultation with other relevant authorities, the standards in construction industry and categorize such standards as compulsory and voluntary standards; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "g",
                "text": "to implement the codes of conduct, practices, procedures and processes and documentations relating to construction industry as being formulated by the Authority.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "13",
            "text": "The functions of the Authority shall be",
            "pre_block_list": [
              "Functions of the Authority."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "to implement the policy formulated under section 2 in keeping with the directions issued by the Minister in that regard under section 3;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "to formulate strategies for the development of the construction industry;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "to collate and publish materials and information pertaining to the construction industry;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "to promote best practices relating to the construction industry;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "to implement the standards in construction work including the standards relating to quality of materials used and workmanship in consultation with the other relevant bodies;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "to recommend to any relevant authority to formulate national procurement guidelines related to procurement of works, goods and services in relation to construction industry;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "g",
                "text": "to provide for and regulate the presentation of national awards for construction excellence, outstanding achievements in different fields of construction and design and development of energy efficient buildings, structures and construction techniques;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "h",
                "text": "to promote the standards of professionalism and employment in the construction industry;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "to foster and promote entrepreneurship in construction contractors of Sri Lanka;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "j",
                "text": "to provide for the registration and grading of construction contractors;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "k",
                "text": "to provide for the registration of property developers and to grade them under financial and marketing capabilities;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "l",
                "text": "to provide for the registration of persons competent to function as adjudicators on contractual disputes;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "m",
                "text": "to maintain a directory of importers, manufacturers and suppliers of construction materials and construction components used in the construction industry, as may be determined by the rules made under this Act;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "n",
                "text": "to maintain a Register of qualified persons as specified in section 26;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "o",
                "text": "to provide for the registration of contractors specialized in the areas of electromechanical installations, other building fixtures and any other area relating to construction;",
                "pre_block_list": [
                  "Construction Industry Development Act, No. 33 of 2014 16"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "p",
                "text": "to provide for the registration and issuing of Craft Identity Cards to skilled workers in construction trades as may be determined by the rules made under this Act;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "q",
                "text": "to maintain a directory of heavy construction plant, machinery and equipment available in the country;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "r",
                "text": "to undertake and facilitate the human resources development and training required for construction industry and to develop national standards for training and assessment in concurrence with relevant national agency;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "s",
                "text": "to assess the competence of skilled workers engaged in the construction industry and issue certificates to such persons who do not possess such certificates;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "t",
                "text": "to review and monitor the human resource requirements of the construction industry and to facilitate the development of curricula for newly emerging trades;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "u",
                "text": "to promote and facilitate local consultancy services pertaining to construction industry and the undertaking of consultancy services in other countries by local consulting firms;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "v",
                "text": "to promote and facilitate locally registered contractors undertaking construction works in other countries;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "w",
                "text": "to provide information, advisory on matters relating to the construction industry;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "x",
                "text": "to promote and encourage the adoption and propagation of new technologies related to environmentally friendly, appropriate, cost efficient and affordable innovations;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "y",
                "text": "to review and monitor any material, plant and machinery requirements of the construction industry and to encourage the development and use of local products in the construction works;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "z",
                "text": "to undertake, promote and co-ordinate research in various branches of the construction industry and to conduct training programmes for the improvement of quality and productivity of the construction industry;",
                "pre_block_list": [
                  "( aa ) to assist institutions concerned with the construction industry in the development of their activities;",
                  "( bb ) to promote the construction of any building where necessary in a manner that may facilitate the easy access and use of such buildings by any elderly or differently abled persons;",
                  "( cc ) to undertake or assist any other activity for the promotion of the construction industry;",
                  "( dd ) to maintain a national data base on construction industry;",
                  "( ee ) to recommend to the relevant authority to regulate the health and safety standards and the use of hazardous material in construction industry;",
                  "( ff ) to establish standards for technical auditing and monitoring of the construction and management processes and the outcome of construction works which include compliance with stipulated conditions and approved standards;",
                  "( gg ) to recommend to the Minster to declare any project or undertaking as an identified construction work for the purposes of this Act.",
                  "Construction Industry Development Act, No. 33 of 2014 18"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "14",
            "text": "The Authority shall have such powers, as are necessary or incidental to the discharge of its functions under this Act, and in particular",
            "pre_block_list": [
              "Powers of the Authority."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "to acquire in any manner and hold, take or give on lease or hire, mortgage, pledge, sell or otherwise dispose of, any movable or immovable property;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "to appoint, employ, remunerate officers, servants and agents for the purposes of this Act and to exercise disciplinary control over such officers, servants and agents;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "to enter into, and perform, directly or through any servant or agent authorized in that behalf, all such contracts as may be necessary for the discharge of the functions of the Authority;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "to open, maintain and close accounts in any state owned bank or any other financial institution with the prior approval of the Ministry of Finance;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "to borrow such sums of money as may be necessary for the purpose of discharging the functions of the Authority;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "to accept and receive grants, donations and bequests, both movable and immovable from sources in or outside Sri Lanka and utilize them for the discharge of the functions of the Authority:",
                "pre_block_list": [
                  "Provided that, the Authority shall obtain prior written approval of the Director-General of the External Resources of the Ministry of the Minister to whom the subject of Finance has been assigned, in respect of all foreign grants, donations and bequests;"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "g",
                "text": "to make rules for the administration of the affairs of the Authority;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "h",
                "text": "to levy fees or charges on registration of service providers of Construction Industry and renewal of such registration or charges as may be prescribed for any service rendered by the Authority; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "to do all other acts and things which, from time to time, in the opinion of the Authority are necessary or incidental to the proper discharge of the functions of the Authority.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "15",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be appointed a Director-General by the Authority who shall possess experience and qualifications in the field of construction and management. The Director-General shall be deemed to be a public officer.",
                "pre_block_list": [
                  "Director-General of the Authority."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Director-General shall, subject to the general direction and control of the Chairman of the Board, be responsible for the administration and control of the officers and servants of the Authority.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "16",
            "text": "The Authority may appoint such officers and servants as it may consider necessary for the efficient exercise, discharge and performance of its powers, duties and functions under this Act and shall determine the remuneration payable to, and the conditions of service and disciplinary control over such officers and servants.",
            "pre_block_list": [
              "Staff of the Authority."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "17",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "At the request of the Authority any officer in the public service may, with the consent of that officer and the Secretary to the Public Service Commission, be temporarily appointed to the staff of the Authority for such period as may be determined by the Authority or with like consent, be permanently appointed to such staff.",
                "pre_block_list": [
                  "Appointment of Public Officers."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where any officer in the public service is temporarily appointed to the staff of the Authority, the provisions of subsection (2) of section 14 of the National Transport Commission Act, No. 37 of 1991 shall,  mutatis mutandis, apply to and in relation to such officer.",
                "pre_block_list": [
                  "Construction Industry Development Act, No. 33 of 2014 20"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where any officer in the public service is permanently appointed to the staff of the Authority, the provisions of subsection (3) of section 14 of the National Transport Commission Act, No. 37 of 1991 shall,  mutatis mutandis , apply to and in relation to such officer.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where the Authority employs any person who has entered into a contract with the Government by which he has agreed to serve the Government for a specified period, any period of service with the Authority by that person shall be regarded as service to the Government for the purpose of discharging the obligations of such contract.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "At the request of the Authority any officer of a Provincial Public Service may with the consent of that officer and the relevant Provincial Public Service Commission, be temporarily appointed to the staff of the Authority for such period as may be determined by the Authority or with like consent be permanently appointed to such staff.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "18",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Authority shall appoint in consultation with relevant authorities, the following committees to formulate standards, rules and regulations in the Construction Industry:",
                "pre_block_list": [
                  "Appointment of committees for implementation of construction standards."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the Committee on Technical Standards, Rules and Regulations;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the Committee on Environmental and Public Health Standards;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "the Committee on Ethical and Social Responsibility Standards.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The members of such committees shall be selected by the Authority in consultation with relevant professional bodies and other social and environmental organizations.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "IV",
        "text": "",
        "pre_block_list": [
          "C ONSTRUCTION  I NDUSTRY  D EVELOPMENT  F UND   AND   FUND",
          "OF   THE  A UTHORITY  F UND   AND   THE  F UND   OF   THE  A UTHORITY"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "19",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be established a Fund known as the Construction Industry Development Fund (in this Act referred to as the Development Fund).",
                "pre_block_list": [
                  "Construction Industry Development Fund."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "There shall be paid into the Development Fund",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "all such sums of money as may be received by the Development Fund by way of loans, rent, donations, gifts or grants whether from foreign or local sources;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "all such sums collected as the Construction Industry Development Levy.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "There shall be paid out of the Development Fund all such sums of money as are required to defray any expenditure incurred by the Development Fund in the exercise of the powers and discharge of the functions under this Act, subject to following guidelines:",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "more than fifty percentum (50%) of the fund shall be reserved for the well-being of the small scale contractors and self-employed registered craftsmen;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "not less than five percentum (5%) of the fund shall be reserved for research and publications in the field related to construction industry;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "not less than five percentum (5%) of the fund shall be reserved for the purpose of rewarding and encouraging the inventions, applications and propagation of environmentally friendly and cost efficient construction technologies;",
                    "pre_block_list": [
                      "Construction Industry Development Act, No. 33 of 2014 22"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "such amount as determined by the Authority is required to arrange long term insurance with pension benefits, for craftsmen registered with the Authority who are not entitled to any other form of retirement benefits under any other law.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "For the purposes of this section, the Minister to whom the subject of Construction is assigned shall impose a levy of cess to be called the Construction Industry Development Levy. The rate of the cess to be so levied shall be as determined by the Minister to whom the subject of Consruction is assigned with the concurrence of the Minister incharge of the subject of Finance as a percentage of construction cost of projects. Every such rate as determined shall be tabled in the Parliament for its approval.",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "The Minister shall by Order published in the  Gazette specify, from time to time, the rate of cess as determined under paragraph ( a ) of this subsection. Any Order made under this paragraph shall come into operation on the day of such publication in the  Gazette .",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "The Levy imposed under this section shall be collected by the Director-General of Construction Industry Development Authority and shall be credited to the Construction Industry Development Fund.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "20",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The management and administration of the affairs of the Development Fund shall be vested with National Advisory Council on Construction.",
                "pre_block_list": [
                  "The management and administration of the Development Fund."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Minister may make regulations specifying the manner in which the Development Fund should be administrated subject to paragraphs ( a ), ( b ), ( c ) and ( d ) of subsection (3) of section 19.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "21",
            "text": "The provisions of Article 154 of the Constitution relating to audit of accounts of public corporations shall apply to the audit of the accounts of the Development Fund.",
            "pre_block_list": [
              "Audit of accounts."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "22",
            "text": "The provisions of Part II of the Finance Act, No. 38 of 1971 shall  mutatis mutandis  apply to the financial control of the Development Fund.",
            "pre_block_list": [
              "Application of Finance Act, No. 38 of 1971."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "23",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Authority shall have its own Fund (in this Act referred to as the Fund of the Authority).",
                "pre_block_list": [
                  "Fund of the Authority."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "There shall be paid into the Fund of the Authority",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "all such sums of money as may be voted, from time to time, by the Parliament for the use of the Authority including such sums  of money needed to defray the salaries and other emoluments of the staff of the Authority;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "all such sums of money as may be received by the Authority in the exercise, discharge and performance of its powers, functions and duties; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "all such sums of money as may be received by the Authority by way of loans, rents, donations, gifts, grants or levies and sale of assets.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "There shall be paid out of the Fund of the Authority all such sums of money as are required to defray any expenditure incurred by the Authority in the exercise, discharge and performance of its powers, functions and duties under this Act.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "24",
            "text": "The provisions of Article 154 of the Constitution relating to audit of accounts of public corporations shall apply to the audit of the accounts of the Fund of the Authority.",
            "pre_block_list": [
              "Audit of accounts."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "25",
            "text": "The provisions of Part II of the Finance Act, No. 38 of 1971 shall  mutatis mutandis  apply to the financial control of the Authority.",
            "pre_block_list": [
              "Application of provisions of the Finance Act, No. 38 of 1971.",
              "Construction Industry Development Act, No. 33 of 2014 24"
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "V",
        "text": "",
        "pre_block_list": [
          "Q UALIFIED  P ERSONS"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "26",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Authority shall maintain a Register of persons recommended by the Credential Committee as being qualified persons (hereinafter referred to as the Register of Qualified Persons) in the following disciplines:",
                "pre_block_list": [
                  "Register of Qualified Persons."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "Engineering, in consultation with the Institute of Engineers, Sri Lanka established under the Institution of Engineers, Ceylon Act, No. 17 of 1968;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "Architecture, in consultation with the Sri Lanka Institute of Architects and Architects Registration Board established under the Sri Lanka Institute of Architects Law, No. 1 of 1976;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "Quantity Surveying, in consultation with the Institute of Quantity Surveyors, Sri Lanka established under the Institute of Quantity Surveyors, Sri Lanka (Incorporation) Act, No. 20 of 2007;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "Environmental and Public Health Engineering, in consultation with relevant professional and academic bodies; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "any other discipline not specified under paragraphs ( a ), ( b ), ( c ) and ( d ) but relating to the disciplines specified in pargraphs ( a ), ( b ), ( c ) and ( d )  and which shall be as prescribed from time to time, on the recommendation of the relevant academic or professional bodies or any board of registration relating to construction industry established by an Act of Parliament.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "The Minister shall, in consultation with any relevant professional or academic body or any board of registration established by an Act of Parliament, as the case may be, prescribe the criteria for registration of persons who are not members of any professional body or persons who",
                    "pre_block_list": [
                      "are not registered with any board of registration relating to construction industry established by an Act of Parliament, as specified in paragraphs ( a ), ( b ) or ( c ) of subsection (1) and persons belonging to the disciplines specified in paragraphs ( d ) and ( e ) of subsection (1)."
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "Any person who is a member of a professional body or a person registered under any board of registration relating to construction industry established by an Act of Parliament as specified in paragraph ( a ), ( b ) or ( c ) of subsection (1) shall be a qualified person specified in paragraphs  ( a ), ( b ) or ( c ) of subsection (1) and shall be exempted from the criteria for registration under this section.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Any Person who wishes to register himself as a qualified person shall apply to the Authority in that behalf. The Authority on receipt of such application shall",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "in the case of an application received from any professional body or board of registration relating to construction industry established by an Act of Parliament, on behalf of a person who is a member of such professional body or a person of such board of registration as specified in paragraphs ( a ), ( b ) or ( c ) of subsection (1), register such person as a Qualified Person under this Act and cause the names of such persons to be included in the Register of Qualified Persons;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "in the case of an application received from a person who is not a member of any professional body or a person who in not registered under any board of registration relating to construction industry established by an Act of Parliament, as specified in paragraphs ( a ), ( b ) or ( c ) of subsection (1) and any person belonging to the disciplines specified in paragraphs ( d ) and ( e ) of subsection (1), refer such application to the Credential Committee for its recommendation.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The Authority shall on the basis of the recommendation made to it by the Credential Committee",
                "pre_block_list": [
                  "Construction Industry Development Act, No. 33 of 2014 26",
                  "under subsecion (3), appoint such persons so recommended as qualified persons and cause the names of such persons to be included in the Register of Qualified Persons."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "The procedure for registration of qualified persons and renewal of such registration shall be as prescribed and a registration number shall be issued to each such qualified person upon the name of such person being entered in the Register of Qualified Persons. Such Register shall be available for inspection by any person free of charge at the office of the Authority during office hours.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "27",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Authority shall appoint a Credential Committee which shall consist of not more than fifteen members out of whom, two members each shall be nominated by the relevant academic and professional bodies and any board of registration relating to construction industry established by an Act of Parliament, as specified in paragraphs ( a ), ( b ), ( c ) and ( d ) of subsection (1) of section 26 and Society of Structural Engineers  Sri Lanka established under the Society of  Structural Engineers  Sri Lanka (Incorporation) Act, No. 40 of 2009.",
                "pre_block_list": [
                  "Credential Committes and its functions."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The function of such Credential Committee shall be to identify and categorize professional and vocational disciplines, minimum qualifications and experience required for registration of construction manpower including qualified persons under this Act, mode of practice of such disciplines and to recommend to the Authority the persons who may be registered as Qualified Persons under this Act.",
                "pre_block_list": [
                  "Only qualified persons to engange in identified construction works."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "28",
            "text": "No person other than a qualified person shall be appointed for the purpose of, or engage in the carrying out of, designing, and preparation of required contract documentation and supervision of any identified construction work.",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "29",
            "text": "The Authority shall maintain records on the identified construction works.",
            "pre_block_list": [
              "Records to be maintained."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "30",
            "text": "Every qualified person shall adhere to the standards of design and documentation maintained by respective body or board of registration or organization and where such standards are not maintained by any body or board of registration or organization, the qualified persons who are members of such body or organization or persons registered under such board of registration shall adhere to the standards of the Authority as shall be prescribed, from time to time, in respect of identified construction works.",
            "pre_block_list": [
              "Qualified persons to adhere to standards."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "31",
            "text": "Notwithstanding anything contained in any other law, no local authority shall entertain any application for building approval for any identified  construction works unless the architectural, structural, electrical and water supply, sewerage and other designs and services relating to such construction are carried out by a qulified person.",
            "pre_block_list": [
              "Local authority approval for identified construction works."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "32",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Any complaint against a qualified person relating to",
                "pre_block_list": [
                  "Conduct of investigations against qualified persons."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "any professional negligence, lack of competency or violation of ethical and social standards;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "moral turpitude, malpractice, fraud or dishonesty;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "breach of any terms and conditions where his registration has been granted subject to any terms and conditions,",
                    "pre_block_list": [
                      "may be made to the Authority."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where the qualified person against whom any complaint has been made under subsection (1), is a member of any professional body or a person registered under any board of registration relating to construction industry established by an Act of Parliament, specified in paragraphs ( a ), ( b ) or ( c ) of subsection (1) of section 26, the Authority shall refer such complaint to the relevant professional body or any board of registration in the construction industry established by an Act of Parliament.",
                "pre_block_list": [
                  "Construction Industry Development Act, No. 33 of 2014 28"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "On receipt of a complaint by the relevant professional body or any board of registration relating to construction industry established by an Act of Parliament, it shall carry out an investigation in respect of the matters referred to it under subsection (2). The findings in respect thereof shall be forwarded to the Authority as expeditious as possible and effect necessary disciplinary proceedings and report back to the Authority.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where no recommendation is made by the relevant professional body or any board of registration relating to the construction industry established by an Act of Parliament, under subsection (3), the Authority shall investigate into such matter and take necessary action.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Any complaint against any qualified person who is not a member of any professional body or a person registered under any board of registration relating to the construction industry established by an Act of Parliament, shall be investigated by the Authority in keeping with the disciplinary procedure of the Authority as shall be prescribed.",
                "pre_block_list": [
                  "Engagement of foreign consultants."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "33",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Any person requiring to engage a foreign consultant as a qualified person in any identified construction work shall apply to the Authority for a provisional registration.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every foreign consultant shall, prior to being engaged in any identified construction work as a qualified person in Sri Lanka, apply to the Authority for a provisional registration as a qualified person which shall be subject to yearly renewal on the condition that the registration is linked to an approved project. The procedure for such registration shall be as prescribed.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Any person who performs as a qulified person to carry out any identified construction work without obtaining a certificate of registration issued by the Authority shall be guilty of an offence under this Act.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The provisions of this section shall not apply to any foreign consultant who engages in any identified construction work under any project of the Government of Sri Lanka. However the Authority may obtain from the institutions which employ foreign consultatns, any particulars that may be required for the purpose of section 55 of this Act and such institutions shall comply with any request made by the Authority under this section.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "VI",
        "text": "",
        "pre_block_list": [
          "R EGISTRATION   OF  C ONTRACTORS , P ROPERTY  D EVELOPERS  & C ."
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "34",
            "text": "The Authority shall maintain a Register of Contractors in the manner and form as may be determined by the Authority by rules made by the Authority in that behalf (hereinafter referred to as the Register of Contractors) which shall be available free of charge for inspection at the office of the Authority by any person during office hours.",
            "pre_block_list": [
              "Register of Contractors."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "35",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "An application for registration as a contractor shall be made to the Authority. The manner of registration and fees  shall be as prescribed.",
                "pre_block_list": [
                  "Procedure for registration of contractors and renewal of registration."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Authority shall, in consultation with the relevant professional bodies and contractors associations appoint a committee to consider the applications for registration of persons as contractors. Criteria for such registration shall be as prescribed and shall include specific provisions relating to cost effective innovative technologies in order to accommodate the potentials of the contractors registered with the National Engineering Research and Development Centre.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where any person is registered as a contractor, the Authority shall issue to such person a Registration Number and a Certificate of Registration.",
                "pre_block_list": [
                  "Construction Industry Development Act, No. 33 of 2014 30"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The Certificate of Registration issued under this section shall be valid for the period specified in such Certificate and may be renewed on application made in that behalf and upon payment of the prescribed renewal fee.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "36",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Authority shall, where it receives any complaint against a contractor, refer such complaint  to a disciplinary committee comprising eminent persons appointed by the Minister, which shall investigate and make recommendations in respect thereof to the Authority. The guidelines for disciplinary procedure shall be as prescribed.",
                "pre_block_list": [
                  "Suspension or cancellation of a Cerificate of Registration."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The disciplinary committee appointed under this section shall in making its recommendations to the Authority take the following matters into consideration",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "Whether the contractor against whom the complaint has been made is found guilty of any professional negligence, lack of competency, moral turpitude, malpractice, fraud or dishonesty;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "Whether the contractor against whom the complaint has been made is in breach of his contractual obligations as a contractor;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "Whether the contractor against whom the complaint has been made is in breach of any terms and conditions subject to which such Certificate of Registration has been issued;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "Whether the contractor against whom the complaint has been made has obtained registration as a contractor by fraud or misrepresentation; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "Whether the contractor against whom the complaint has been made has contravened or failed to comply with the provisions of this Act or any regulation made thereunder.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Authority may upon receipt of such recommendations made by the disciplinary committee under this section suspend or cancel a Certificate of Registration issued under this Act.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "37",
            "text": "A person who is aggrieved by",
            "pre_block_list": [
              "Appeals against refusal to register a contractor &c."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "the refusal to register any contractor under this Act; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "the refusal to renew any Certificate of Registration issued to any contractor; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "the suspension or cancellation of a Certificate of Registration issued under this Act,",
                "pre_block_list": [
                  "may within thirty days from the date of communication of such refusal, suspension or cancellation, as the case may be, appeal to the Appeals Board established by section 53 against such refusal, suspension or cancellation."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "38",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Every identified construcion work shall be carried out by a registered contractor according to the procedures and standards as may be prescribed for such purpose.",
                "pre_block_list": [
                  "Employment of registered contractors in identified construction works."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any person who undertakes to carry out or carries out any identified construction works without obtaining a Certificate of Registration issued by the Authority shall be guilty of an offence under this Act.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "39",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Every foreign contractor prior to engaging in any identified construction work in Sri Lanka shall obtain a temporary registration as a contractor. The procedure for registration and renewal of such registration shall be as prescribed.",
                "pre_block_list": [
                  "Registration and employment of foreign contractors."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "No person shall engage a foreign contractor in any identified construction works unless such contractor is registered with the Authority under this section.",
                "pre_block_list": [
                  "Construction Industry Development Act, No. 33 of 2014 32"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The preceding provisions of this section shall not apply to a foreign contrator who has entered into an agreement with the Government of Sri Lanka to engage in any identified construction work. However the Authority may obtain from the institutions which employ such foreign contractors, any particulars that may be required for the purpose of section 55 of this Act and such institutions shall comply with any request made by the Authority under this section.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "40",
            "text": "The Authority shall by rules made by the Authority in that behalf establish a monitoring system for the monitoring of contractors registered under this Act.",
            "pre_block_list": [
              "Monitoring of contractors."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "41",
            "text": "The Authority shall maintain a Register of Property Developers which shall be available free of charge for inspection at the office of the Authority by any person during office hours.",
            "pre_block_list": [
              "Register of Property Developers"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "42",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "An application for registration as a property developer shall be made to the Authority. The manner of registration and fees shall be as prescribed.",
                "pre_block_list": [
                  "Procedure for registration of property developers and renewal of registration."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Authority shall, in consultation with the relevant professional bodies and property developers associations appoint a committee to consider the applications for registration of persons as property developers. Criteria for such registration shall be as prescribed.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "43",
            "text": "The Authority shall maintain a Directory of importers, manufacturers and suppliers of construction materials and  construction components in the manner as may be determined by the rules made by the Authority. Such Directory shall be available free of charge for inspection at the office of the Authority by any person during office hours.",
            "pre_block_list": [
              "Directory of importers, manufactures, and suppliers of construction materials and components."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "44",
            "text": "The Authority shall maintain a Directory of specified heavy construction machinery and equipment available in the manner as may be determined by the rules made by the Authority. Such Directory shall be available free of charge for inspection at the office of the Authority by any person during office hours.",
            "pre_block_list": [
              "Directory of heavy construction machinery and equipment."
            ],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "VII",
        "text": "",
        "pre_block_list": [
          "T ECHNICAL  A UDITING"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "45",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Authority shall carry out technical auditing of any indentified construction work if requested to do so by the owner of such construction work or any Government organization.",
                "pre_block_list": [
                  "Technical Auditing."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The procedure and rates for the levying of fees in respect of such technical auditing shall be as prescribed.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "For the purposes of this Act, Technical Auditing means the inspection of identified construction works, which include construction process and management process as well as the final product and examination of contract documents and documents pertaining to payments requested to be made on contracts, in order to verify",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the compliance of the documentation relating to identified construction works which are prepared in compliance with the requirements of this Act;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the execution of identified construction works in conformity with the provisions of the contract and the provisions of this Act;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "the compliance by parties referred to in the contract, with their respective obligations under the contract; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "the compliance with the basic public health, occupational health and environmental standards and technical standards which include efficient resource and energy utilization standards.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The Authority shall register and maintain a register of quality management auditors for the purpose of carrying out technical auditing. The procedure for registration and the qualifications required of such auditors shall be as determined by the rules made by the Authority.",
                "pre_block_list": [
                  "Construction Industry Development Act, No. 33 of 2014 34"
                ],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "VIII",
        "text": "",
        "pre_block_list": [
          "S TANDARD  D OCUMENTS   AND  H UMAN  R ESOURCE  D EVELOPMENT"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "46",
            "text": "Any party that engages a qualified person as a consultant or a registered contractor in any identified construction work shall use the standard documents specified for the purpose by the Authority.",
            "pre_block_list": [
              "Standard documents specified by the Authority to be used.",
              "Human resource development."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "47",
            "text": "The Authority shall",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "develop strategies to meet the future demands for qualified construction personnel, through training;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "facilitate the conduct or conduct training programmes for quality and productivity improvement;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "facilitate the development of national standards on skills and national trade tests;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "d",
                "text": "facilitate the development of curricula for the newly emerging trades;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "e",
                "text": "establish a scheme for the exchange of information relating to construction training;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "f",
                "text": "conduct surveys related to training, manpower needs and related matters;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "g",
                "text": "facilitate the improvement of social recognition and standard of the construction personnel;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "h",
                "text": "facilitate the development of a career path for construction personnel to enhance the human resource requirements of the construction industry;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "i",
                "text": "develop contract documents and implementing strategies to support registered craftsmen and small scale contractors who enter into individual contracts with clients without the involvement of qualified persons; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "j",
                "text": "facilitate translations of contract documentation into Sinhala and Tamil languages.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "48",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Any person who possesses any skill in any craft as may be determined by the rules made by the Authority, from time to time, may apply to the Authority for the issuance of an Identity Card.",
                "pre_block_list": [
                  "Skilled persons."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Authority may, considering the competency and capacity of such applicant issue an Identity Card (hereinafter referred to as a Craft Identity Card) to such person in the form and manner determined by the rules made by the Authority with an identification number specifying the category and grade of such craft identity card holder.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "No person other than a craft identity card holder shall be engaged independently in any identified construction work unless under the supervision of a craft identity card holder on the relevant craft.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Any person producing a  forged or false craft identity card to any other person or having in possession such forged or false craft identity card or similar document shall be guilty of an offence under this Act.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Any craft identity card holder shall be entitled to display conspicuously  in his place of work a board bearing the description Registered Craftsman or Registered Master Craftsman, as the case may be.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "The conditions relating to the issue of craft identity cards and the Code of Conduct for such craft identity card holders shall be as prescribed.",
                "pre_block_list": [
                  "Construction Industry Development Act, No. 33 of 2014 36"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "The Authority shall not grant approval for the engagement of any foreign craftsman in any identified construction work if the required skills in any required area are locally available.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "8",
                "text": "The Authority may subject to the approval of the Cabinet of Ministers arrange any long term insurance policy or any pension scheme with the utilization of the Development Fund for the craftsmen who are registered under this Act.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "9",
                "text": "The Authority shall maintain a register of craft identity card holders in the form and manner as may be determined by the rules made by the Authority. Such register shall be available for inspection free of charge at the office of the Authority.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "49",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Authority shall maintain a Register of Skilled Construction Workers, Construction Site Supervisors, Middle Level Technical Officers and other professionals in the construction industry as shall be prescribed and which shall be available for inspection free of charge at the office of the Authority.",
                "pre_block_list": [
                  "Registration of Skilled Construction Workers, Construction Site Supervisors, Middle Level Technical Officers and other professionals in the construction industry."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The registration of Skilled Construction Workers, Construction Site Supervisors, Middle Level Technical Officers and other professionals in the construction industry shall be done according to different skills and qualifications, and the procedure for registration and renewal of such registration shall be determined by the Authority in accordance with the rules made by the Authority.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "IX",
        "text": "",
        "pre_block_list": [
          "S ETTLEMENT   OF  D ISPUTES"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "50",
            "text": "If the parties so desire any dispute relating to a contract for construction works, if it is not provided for in the contract, may be settled through conciliation or mediation by the Authority.",
            "pre_block_list": [
              "Settlement of disputes through conciliation or mediation by the Authority."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "51",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "A party to any contract relating to an identified construction work, if unable to settle any dispute by conciliation or mediation by the Authority, may refer such dispute for adjudication.",
                "pre_block_list": [
                  "Right to refer for adjudication."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The procedure for adjudication of any dispute under this section shall be as prescribed.",
                "pre_block_list": [
                  "For the purpose of this section, dispute includes any difference of opinion between the parties to an identified construction work."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "52",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Authority shall maintain a Register of Adjudicators who are competent to adjudicate disputes relating to any contract of construction works in the form and manner as may be determined by the rules made by the Authority. The Register of Adjudicators shall be available for inspection free of charge at the office of the Authority.",
                "pre_block_list": [
                  "Register of Adjudicators."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The procedure for registration of such adjudicators and renewal of such registration shall be done according to the procedure as may be prescribed.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "X",
        "text": "",
        "pre_block_list": [
          "A PPEALS  B OARD"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "53",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be established for the purpose of this Act, an Appeals Board consisting of not more than sevan members who shall be appointed by the Minister upon the recommendation of the Authority. All members of the Appeals Board shall be qualified persons as specified in this Act with not less than twenty years of experience in the field of construction.",
                "pre_block_list": [
                  "Establishment of Appeals Board."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any person who is aggrieved by a decision of the Authority made under this Act may appeal to the Appeals Board in the manner as shall be prescribed.",
                "pre_block_list": [
                  "Construction Industry Development Act, No. 33 of 2014 38"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Members of the Appeals Board may hold office for a term of three years and shall be eligible for re-appointment.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "The provisions of subsection (2) of section 5 shall mutatis mutandis  apply to appointment of members to the Appeals Board.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "There shall be a Secretary to the Appeals Board who shall be appointed by the members of the Appeals Board from amongst its members.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "The members of the Appeals Board shall be remunerated in such manner as may be determined by the Minister with the concurrence of the Minister in charge of the subject of Finance.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "Subject to the provisions of this Act, the Appeals Board may regulate its own procedure at its meetings and the transaction of business thereat.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "54",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Every appeal made to the Appeals Board shall",
                "pre_block_list": [
                  "Hearing and determination of appeals."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "be in the prescribed form and accompanied by a copy of the decision appealed against;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "set out precisely the grounds of appeal; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "be delivered to the Secretary of the Appeals Board within thirty days from the date of the decision of the Authority.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "An appeal shall be heard by not less than three members of the Appeals Board.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "On receipt of an appeal, the Secretary of the Appeals Board shall fix a date, time and place for the hearing of such appeal, and shall give fourteen days notice thereof to the appellant and to the Authority.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Every appellant may appear before the Appeals Board in person or with an authorized representative.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "After the hearing of an appeal the Appeals Board shall give its decision within two months from the date on which such appeal was received by the Appeals Board and may confirm, vary or reverse the decision appealed against.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "The decision of the Appeals Board and the reasons therefor shall be notified in writing to the appellant and the Authority.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "Any person aggrieved by the decision of the Appeals Board in respect of any appeal made under subsection (1) may appeal against such decision to the Court of Appeal within thirty days from the date on which the decision and the reasons therefor were notified to the appellant.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "XI",
        "text": "",
        "pre_block_list": [
          "C OLLECTION , P ROCESSING   AND  D ISTRIBUTION   OF  I NFORMATION",
          "IN   THE  C ONSTRUCTION  I NDUSTRY"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "55",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Authority shall be responsible for the maintenance of a National Data Base in the construction industry for which a dedicated information secretariat (hereinafter referred to as the information secretariat) shall be established within the Authority.",
                "pre_block_list": [
                  "Authority to maintain a National Data Base for the construction industry."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The functions, procedures and performance standards required of the information secretariat shall be as prescribed.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Authority shall have the power to instruct and request for information as follows :-",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "from all State and private banks, in respect of the total financial facilities granted annually to any project or persons for any construction as may be determined by the Authority. Provided that, the projects and persons involved in such construction works may not be disclosed;",
                    "pre_block_list": [
                      "Construction Industry Development Act, No. 33 of 2014 40"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "from the National Housing Development Authority established under the National Housing Development Authority Act, No. 17 of 1979 in respect of the number of loans and grants issued for construction purposes. Provided that, the projects and the names of the beneficiaries of such loans or grants may not be disclosed;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "from the Sri Lanka Customs, in respect of information relating to the amounts and values of all the imports and exports of construction material;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "from the Geological Survey and Mines Bureau established under the Mines and Mineral Act, No. 32 of 1992 in  respect of the statistics relating to river sand and sea sand supplied to the market by license holders for sand mining;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "from all government and semi-government agencies engaged in contracting or direct construction of construction works, any particulars in respect of any construction work as required by the Authority in a specified format;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "from all qualified persons, registered contractors and property developers, details in respect of any construction work completed;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "g",
                    "text": "from the Director-General of Vocational Training, details in respect of training programmes and outcome of such training programmes related to construction industry;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "h",
                    "text": "from all government and voluntary organizations which provide small and medium scale housing loans and grants in respect of the number and amount of such loans and grants. Provided that, the beneficiaries of such loans or grants may not be disclosed; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "i",
                    "text": "from all local government authorities and all the statutory bodies that grant permits and licenses for construction works, in respect of any details of construction works as may be determined by the Authority by the rules made by the Authority.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Any person who fails to comply with any request for information in terms of subsection (1) shall notwithstanding anything contained in any other law be guilty of an offence under this Act.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "The Authority shall be responsible for the publication of annual reports on the construction industry in the country and dissemination of information to government and private institutions and individuals on written requests made to the Authority. The Authority shall charge such fees as may be determined for the performance of this service.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "The Authority shall at all times maintain confidentiality as regard the information made available to it under this section, other than if disclosure is required in terms of any written law for the time being in force, and shall not make public, or provide to any other government or private institution, any information that would lead to identification of individual contractors, manufacturers or suppliers and information relating to their individual financial standings.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          }
        ]
      },
      {
        "class_name": "ActL0Part",
        "num": "XII",
        "text": "",
        "pre_block_list": [
          "G ENERAL"
        ],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "56",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Any person who",
                "pre_block_list": [
                  "Offences."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "contravenes, or fails to comply with, any provision of this Act or any regulation made thereunder; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "being a member, officer or servant of the Authority discloses any information obtained by him in the exercise of his powers or the performance of his",
                    "pre_block_list": [
                      "Construction Industry Development Act, No. 33 of 2014 42",
                      "duties under this Act to any person for any purpose other than the purposes for which he is authorized to disclose information by this Act,",
                      "shall be guilty of an offence under this Act."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any person who commits an offence under this Act, shall upon conviction after summary trial before a Magistrate, be liable to a fine not exceeding rupees one hundred thousand or to imprisonment for a period not exceeding two years or to both such fine and imprisonment.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where an offence under this Act is committed by a body of persons, then",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "if that body of persons is a body corporate, every director and officer of that body corporate; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "if that body of persons is a firm, every partner of that firm,",
                    "pre_block_list": [
                      "shall be guilty of an offence under this Act:",
                      "Provided however, that a director or officer of such body corporate or a partner of such firm shall not be deemed to be guilty of such offence if it is proved to the satisfaction of the court that he exercised all due diligence to prevent the commission of such offence."
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "57",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Authority may make rules in respect of all matters for which rules are required or authorized to be made under this Act.",
                "pre_block_list": [
                  "Rules."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "58",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Minister may make regulations in respect of any matter required by this Act to be prescribed or in respect of any matter which regulations are required or authorized by this Act to be made.",
                "pre_block_list": [
                  "Regulations."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every regulation made by the Minister shall be published in the Gazette and shall come into operation on the date of its publication or on a later date as may be specified in such regulation.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every regulation made by the Minister shall, within six months after it is published in the  Gazette , be brought before Parliament for approval. Any regulation which is not so approved by the Parliament shall be deemed to be rescinded as from the date of such disapproval, but without prejudice to anything previously done thereunder.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "59",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Authority may subject to such conditions as may be specified in writing, delegate to any officer of the Authority any of the powers conferred on it by this Act or by any regulation made thereunder.",
                "pre_block_list": [
                  "Delegation of powers."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Notwithstanding any such delegation, the Authority may continue to exercise any such power so delegated.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "60",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Authority or any officer authorized in writing in that behalf by the Authority shall, on receipt of any complaint by any person in respect of an identified construction work, have the power on reasonable grounds and production, if so required his credentials, to enter at all reasonable hours of the day any premises where identified construction work is being carried out or any completed identified construction work, for the purpose of conducting any survey, examination or investigation in respect of such identified construction work.",
                "pre_block_list": [
                  "Power to enter any land or premises."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where the owner or occupier of that identified construction work unfairly refuses the conducting of such survey, examination or investigation by the Authority under subsection (1), the Authority may obtain from a Magistrates Court a search warrant for the purpose of entering such land or premises and exercise all or any of the powers conferred upon the Authority by such search warrant.",
                "pre_block_list": [
                  "Construction Industry Development Act, No. 33 of 2014 44"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "61",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "No person in charge of any land or premises specified in section 60 shall knowingly or will fully, resist or obstruct any officer or servant of the Authority in the lawful performance and discharge of his duties or functions under section 60.",
                "pre_block_list": [
                  "Resisting or obstructing the Authority &c."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any person who acts in contravention of the provisions of subsection (1) of this section shall be guilty of an offence under this Act.",
                "pre_block_list": [
                  "Members, officers and servants of the Authority deemed to be public servants."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "62",
            "text": "All members, officers and servants of the Authority shall be deemed to be public servants within the meaning and for the purpose of the Penal Code (Chapter 19).",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "63",
            "text": "The Authority shall be deemed to be a scheduled institution within the meaning of the Bribery Act, and the provisions of that Act shall be construed accordingly.",
            "pre_block_list": [
              "Scheduled Institution within the meaning of the Bribery Act."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "64",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Any expense incurred by the Authority in any suit or prosecution brought by or against the Authority before any court shall be paid out of the Fund of the Authority, and any costs paid to, or recovered by the Authority in any such suit or prosecution shall be credited to the Fund of the Authority.",
                "pre_block_list": [
                  "Expenses incurred in any suit or prosecution."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any expenses incurred by any member, officer or any servant of the Authority in any suit or prosecution brought by or against such person before any court in respect of any act or omission which is done or purported to be done by such person in good faith for the purpose of carrying out the provisions of this Act shall, if the court holds that such act or omission was done in good faith, be paid out of the fund of the Authority unless such expenses are recovered by him in such suit or prosecution.",
                "pre_block_list": [
                  "Repeals and Savings.",
                  "(2) All employees of the Institute for Construction Training and Development established by  Gazette Extraordinary No. 718/15 of June 10, 1992 issued under the State Industrial Corporations Act, No. 49 of 1957, on the day immediately preceding the day specified in the Order under subsection (1), who have not reached their respective ages of retirement, shall on the appointed date, be offered employment in the Authority, on terms and conditions no less favorable to the terms and conditions of employment applicable to them on the day immediately preceding the day specified in the aforesaid Order."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Any employee referred to in subsection (2), who wishes to opt out of service in the Authority may do so within three months from the date on which he was notified of the available offer of serving in the Authority. If any such employee as referred to in subsection (2) exercises his option not to accept the offer, he shall be paid compensation under a voluntary retirement scheme to be implemented in that behalf, with the approval of the Cabinet of Ministers.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Notwithstanding the rescission of the aforementioned Order",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "all movable and immovable property of the Institute for Construction Training and Development shall, from the date specified in the Order made under subsection (1), vest in the Authority;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "all contracts and agreements entered into by or with the Institute for Construction Training and Development and subsisting on the day immediately preceding the date specified in the Order made under subsection (1), shall be deemed to be contracts and agreements entered into, by or with the Authority;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "all suits, actions and other legal proceedings instituted by or against the Institute for Construction Training and Development and pending on the day immediately preceding the date",
                    "pre_block_list": [
                      "Construction Industry Development Act, No. 33 of 2014 46",
                      "specified in the Order made under subsection (1), shall with effect from the date specified in the aforesaid Order be deemed to be suits, actions and other proceedings instituted by, or against the Authority;"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "all rights, liabilities and obligations of the Institute for Construction Training and Development subsisting on the day immediately preceding the date specified in the aforesaid Order, shall with effect from the date specified in the aforesaid Order be deemed to be the rights, liabilities and obligations of the Authority;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "every decree, Order or judgment entered in favour of or against the Institute for Construction Training and Development by any competent court and remaining unsatisfied on the day specified in the aforesaid Order, shall with effect from such date be deemed to be a decree, Order or judgement enacted in favour of  or against the Authority and may enforce accordingly.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "All books, accounts and documents relating to any property of the Institute for Construction Training and Development and publications and registers of the Institute for Construction Training and Development shall remain in force and effectual and be deemed to be publications and registers of the Authority.",
                "pre_block_list": [
                  "Sinhala text to prevail in case of inconsistency.",
                  "66. In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
                  "Interpretation.",
                  "67. In this Act unless the context otherwise requires",
                  "construction work means, operations of any of the following descriptions"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "construction, alteration, repair, maintenance, extension, demolition or dismantling of buildings, or structures forming, or to form part of the land (whether permanent or not);",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "construction, alteration, repair, maintenance, extension, demolition or dismantling of any works forming, or to form, part of the land, including (without prejudice to the foregoing) walls;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "installation in any building or structure of fittings forming part of the land, including (without prejudice to the foregoing) systems of heating, lighting, air-conditioning, ventilation, power supply, drainage, sanitation, water supply or fire protection or security or communication systems;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "external or internal cleaning of buildings and structures, so far as carried out in the course of the construction, alteration, repair, extension or restoration;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "operations which form an integral part of, or are preparatory to, or are for rendering complete, such operations as are previously described in this section, including site clearance, earthmoving, excavation, tunneling and boring, laying of foundations, erection, maintenance or dismantling of scaffolding, site restoration, landscaping and the  provision of roadways and other access works;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "painting or decorating the internal or external surfaces of any building or structure;",
                    "pre_block_list": [
                      "construction contract means an agreement with a person or entity for any of the following:",
                      "( a ) the carrying out of construction work;",
                      "( b ) arranging for the carrying out of construction work by others, whether under sub-contract or otherwise to such person or entity, as the case may be;",
                      "Construction Industry Development Act, No. 33 of 2014 48",
                      "( c ) providing his own labour or labour owned by the entity or the labour of others, for carrying out of construction work;",
                      "contractor means any person or entity executing construction works under a construction contract;",
                      "constructor means any person who undertakes, whether exclusively or in conjunction with any other business to carry out any construction work on his own  account or for or on behalf of another person;",
                      "consultant means any qualified person or entity providing consultancy services under an agreement for construction work;",
                      "documentation means preparation of tender and bidding documents including bills of quantities, contract documents, drawings and specifications and any document pertaining to tenders or contracts;",
                      "externally funded projects shall include any project funded by any donor agency or lending agency or any foreign government through the External Resources Department of the General Treasury;",
                      "identified construction works means",
                      "( a ) all buildings, structures, or any building or structure or landscape which consists of facilities and amenities for public use exceeding in value rupees ten million or such higher value as may be prescribed by the Minister, from time to time; and",
                      "( b ) all buildings, structures or landscapes which need approval of environmental, geological and cultural heritage regulatory bodies.",
                      "Any private residential building constructed for the personal use of any private owner shall be excluded from the definition of the expression identified construction works;",
                      "completed identified construction works means any identified construction work for which a certificate of completion or taking over certificate has been issued;",
                      "Minister means the Minister in charge of the subject of Construction:",
                      "property developer means an entrepreneur who promotes any project in the construction industry, specially in the housing sector which are either physically or conceptually developed by the gain of inputs of lands, land ownership, financing, marketing or any other required expertise;",
                      "qualified person is a person who is competent in carrying out designing, preparation of required contract documents and supervision of any identified construction works, whose name is included in the Register of Qualified Persons;",
                      "supervision means to ensure that the engineering and architectural concepts and judgments incorporated in the design are properly adhered to in any construction work.",
                      "Construction Industry Development Act, No. 33 of 2014 50",
                      "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , D EPARTMENT   OF G OVERNMENT  I NFORMATION , N O . 163, K IRULAPONA  M AWATHA , P OLHENGODA , C OLOMBO  05 before 15th December each year in respect of the year following ."
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}