{
  "n_pages": 7,
  "title_page": {
    "title": "Economic Service Charge (Amendment) Act",
    "num": "11",
    "year": "2008",
    "date_certified": "2008-02-29",
    "date_published": "2008-02-29",
    "price": 5.0,
    "price_postage": 5.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 29Th February, 2008]",
      "L.D.O. 7/2008.",
      "A N  A Ct   To   Amend   The  E Conomic  S Ervice  C Harge A Ct , N O . 13  Of  2006",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Economic Service Charge (Amendment) Act, No. 11 of 2008.",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "Section 2 of the Economic Service Charge Act, No. 13 of 2006 (hereinafter referred to as the principal enactment) is hereby amended in subsection (1) of that section, by the substitution for the words at the appropriate rate specified in the Schedule to this Act,  of the following :",
            "pre_block_list": [
              "Amendment of section 2 of Act, No. 13 of 2006.",
              "at the appropriate rate specified in the Schedule to this Act :",
              "Provided that notwithstanding anything to the contrary in this Act and the rates specified in the Schedule to this Act, the rate of the Economic Service Charge, chargeable in respect of the turnover arising on or after April 1, 2008 from the export of any articles or goods, shall not exceed  0.25   per centum. ."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "Section 3 of the principal enactment is hereby amended in subsection (3) of that section, by the substitution for the words tax payable by such person or partner of such partnership for that year of assessment of the words",
            "pre_block_list": [
              "Amendment of section 3 of the principal enactment.",
              "tax payable by such person or partner of such partnership for that year of assessment :",
              "Provided that, where there remains as at March 31, 2006, any amount of the economic service charge paid in accordance with the provisions of Part I of the Finance Act, No. 11  of 2004 after its deduction in",
              "Economic Service Charge (Amendment) Act, No. 11 of 2008 2",
              "accordance with the provisions of that Act from the relevant income tax payable for any relevant year of assessment commencing before April 1, 2006"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "if such amount includes any part of the economic service charge paid for the year of assessment ended on March 31, 2005 such part may be apportioned to each year of assessment falling within the three years of assessment immediately succeeding the year of assessment which ended on March 31, 2006 ; or",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "if such amount includes any part of the economic service charge paid for the year of assessment ended on March 31, 2006, such part may be apportioned to each year of assessment falling within the four years of assessment immediately succeeding the year of assessment which ended on March 31, 2006,",
                "pre_block_list": [
                  "and the parts of the economic service charge so apportioned, shall be deducted to the extent it can be so deducted from the income tax payable by such person or such partnership for each such year of assessment",
                  "",
                  "Amendment of the schedule of the principal enactment."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "The Schedule to the principal enactment is hereby amended as follows :",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the substitution for items 4 and 5 of the Schedule of the following items :",
                "pre_block_list": [
                  "4. Such part of the relevant turnover arising before April  1, 2008 as consists, of turnover from any trade, business, profession or vocation",
                  "4 A . Such part of the relevant turnover arising on or after April 1, 2008 as consists, of turnover from any trade, business, profession or vocation"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "i",
                    "text": "the profits and income from which are chargeable with income tax at any rate specified in the Fifth Schedule to the Inland Revenue Act, other than in item 24 and item 28 of that Schedule ;                                                         0.5 per centum .",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "Such part of the relevant turnover as consists of the turnover from any trade or business which deals in the wholesale or retail (other than as distributor) of motor vehicles or liquor not manufactured by the dealer :",
            "pre_block_list": [
              "Economic Service Charge (Amendment) Act, No. 11 of 2008 4"
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the substitution for item 11 of the Schedule of the following items :",
                "pre_block_list": [
                  "11. Such part of the relevant turnover arising prior to April 1, 2008 as consists of"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "i",
                    "text": "the turnover from the export of apparels or the supply of locally manufactured textiles to apparel exporters to be used in the manufacture of apparels for export by such exporter. 0.1 per centum (ii) the turnover of a trading house approved by the Board of Investment so far as such trading house engages in the business of the export of apparels.",
                    "pre_block_list": [
                      "11 A . Such part of the relevant turnover arising on of after April 1, 2008 as consists of"
                    ],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "the turnover from",
                        "pre_block_list": [
                          "( a ) the export of apparels ; or",
                          "( b ) supply of locally manufactured apparels to any exporter of apparels for export :",
                          "( c ) supply of locally manufactured textiles to any exporter of apparels to be used in the manufacture of apparels for export by such exporter."
                        ],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "the turnover of a trading house approved by the Board of Investment in so far as such trading house engages in the business of the export of apparels.",
                        "pre_block_list": [
                          "5. In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
                          "Sinhala text to prevail in case of inconsistency.",
                          "Economic Service Charge (Amendment) Act, No. 11 of 2008 6",
                          "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , D EPARTMENT   OF G OVERNMENT  I NFORMATION , N O . 163, K IRULAPONA  M AWATHA , P OLHENGODA , C OLOMBO  05 before 15th December each year in respect of the year following ."
                        ],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}