{
  "n_pages": 4,
  "title_page": {
    "title": "Act",
    "num": "38",
    "year": "2022",
    "date_certified": "2022-11-17",
    "date_published": "2022-11-18",
    "price": 15.0,
    "price_postage": 15.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 17Th Of November, 2022]",
      "L. D.O. 80/2021",
      "A N  A Ct   To   Amend   The  C Ode   Of  C Riminal  P Rocedure A Ct , N O . 15  Of  1979",
      "Be   It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows: -"
    ],
    "pre_section_list": [
      {
        "class_name": "ActL1Section",
        "num": "1",
        "text": "This Act may be cited as the Code of Criminal Procedure (Amendment) Act, No. 38 of 2022.",
        "pre_block_list": [
          "Short title",
          "Amendment of section 281 of Act, No. 15 of 1979"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "2",
        "text": "Section 281 of the Code of Criminal Procedure Act, No. 15 of 1979 (hereinafter referred to as the principal enactment) is hereby amended by the substitution for the words, appears to the court to be under the age of eighteen years, of the words is under the age of eighteen years, at the time of the commission of such offence by such person,.",
        "pre_block_list": [
          "Amendment of section 286 of the principal enactment"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "3",
        "text": "Section 286 of the principal enactment is hereby amended by the substitution for the words and figures, In this section and in section 288 the expression of the words In this section the expression.",
        "pre_block_list": [
          "Replacement of section 288 of the principal enactment"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "4",
        "text": "Section 288 of the principal enactment is hereby repealed and the following section is substituted therefor:",
        "pre_block_list": [
          "Execution of sentences under section 53 of the Penal Code (Chapter 19)",
          "288. When any person has been sentenced under section 53 of the Penal Code (Chapter 19), such person shall be detained in an institution established under any written law for the detention of persons under the age of eighteen years, for a period specified in the sentence and subject to the provisions of such written law",
          "",
          "Code of Criminal Procedure (Amendment) Act, No. 38 of 2022 2"
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "5",
        "text": "In the event of any inconsistency between the  Sinhala and the Tamil texts of this Act, the Sinhala text shall prevail.",
        "pre_block_list": [
          "Sinhala text to prevail in case of inconsistency",
          "English Acts of the Parliament can be purchased at the P RAKASHANA  P IYASA , D EPARTMENT   OF G OVERNMENT  P RINTING , N O . 118, D R . D ANISTER  D E  S ILVA  M AWATHA , C OLOMBO  8."
        ],
        "child_level_list": []
      }
    ],
    "part_list": []
  }
}