{
  "n_pages": 3,
  "title_page": {
    "title": "Defence Services Command And Staff College (Amendment) Act",
    "num": "29",
    "year": "2013",
    "date_certified": "2013-07-08",
    "date_published": "2013-07-12",
    "price": 2.5,
    "price_postage": 5.0
  },
  "body_pages": {
    "preamble": [
      "[Certified On 08Th July, 2013]",
      "L.D.O. 17/2012",
      "A N  A Ct   To   Amend   The  D Efence  S Ervices  C Ommand   And  S Taff C Ollege  A Ct , N O . 5  Of  2008",
      "Be It  Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:"
    ],
    "pre_section_list": [
      {
        "class_name": "ActL1Section",
        "num": "1",
        "text": "This Act may be cited as the Defence Services Command and Staff College (Amendment) Act, No. 29 of 2013.",
        "pre_block_list": [
          "Short title."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "2",
        "text": "Section 7 of the Defence Services Command and Staff College Act, No. 5 of 2008 (hereinafter referred to as the principal enactment) is hereby amended in subsection (1) of that section by the repeal of paragraph ( f ) of that subsection and the substitution therefor, of the following paragraph:",
        "pre_block_list": [
          "Amendment of section 7 of the Act,  No. 5 of 2008."
        ],
        "child_level_list": [
          {
            "class_name": "ActL3Paragraph",
            "num": "f",
            "text": "the Vice-Chancellor of the General Sir John Kotelawala Defence University;.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "3",
        "text": "Section 15 of the principal enactment is hereby amended in subsection (1) of that section by the repeal of paragraph ( b ) of that subsection and the substitution therefor, of the following paragraph:",
        "pre_block_list": [
          "Amendment of section 15 of the principal enactment."
        ],
        "child_level_list": [
          {
            "class_name": "ActL3Paragraph",
            "num": "b",
            "text": "a representative nominated by the Vice-Chancellor of the General Sir John Kotelawala Defence University;.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "4",
        "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
        "pre_block_list": [
          "Sinhala text to prevail in case of inconsistency.",
          "2PL 0071214090 (03/2013)",
          "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , D EPARTMENT   OF G OVERNMENT  I NFORMATION , N O . 163, K IRULAPONA  M AWATHA , P OLHENGODA , C OLOMBO  05 before 15th December each year in respect of the year following ."
        ],
        "child_level_list": []
      }
    ],
    "part_list": []
  }
}