{
  "n_pages": 6,
  "title_page": {
    "title": "Bank Of Ceylon (Amendment) Act",
    "num": "54",
    "year": "2000",
    "date_certified": "2000-08-18",
    "date_published": "2000-08-18",
    "price": 4.5,
    "price_postage": 3.5
  },
  "body_pages": {
    "preamble": [
      "[Certified On 18Th August, 2000]",
      "L.D.O. 9/99.",
      "A N  A Ct   To   Amend   The  B Ank   Of  C Eylon  O Rdinance",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Bank of Ceylon (Amendment) Act, No. 54  of 2000.",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "Section 7 of the Bank of Ceylon Ordinance (Chapter 397) (hereinafter referred to as the principal enactment) is hereby amended by the repeal of subsection (1) of that section, and the substitution, of the following subsection therefor :",
            "pre_block_list": [
              "Amendment of section 7 of Chapter 397."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The authorized capital of the bank shall be fifty billion rupees divided into fifty million shares of one thousand rupees each",
                "pre_block_list": [
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "Section 16 of the principal enactment is hereby amended as follows :",
            "pre_block_list": [
              "Amendment of section 16 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the substitution, for the words specified either in section 17 or in section 19, of the words specified in section 17 or in section 17 A  or in section 19 ; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the substitution, for the words in accordance with section 17, of the words in accordance with section 17 or section 17 A .",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "Section 17 of the principal enactment is hereby repealed and the following section substituted therefor :",
            "pre_block_list": [
              "Replacement of section 17 of the principal enactment.",
              "17. Subject to the provisions of section 20, the Board may by resolution to be recorded in writing authorize any person specified in the resolution to enter upon and take possession of any immovable property mortgaged to the bank",
              "Authoriza- tion of manager to take possession of immovable property.",
              "2H 0080305,550 (06/00)",
              "as security for any loan, overdraft, advance or other accommodation in  respect of which default has been made and to manage and maintain such property and to exercise the same powers in  the control and management of such property as might have been exercised by the mortgagor, if he had not made default",
              "",
              "Insertion of section 17 A  in the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "The following section is hereby inserted immediately after section 17 and shall have effect as section 17 A  of the principal enactment :",
            "pre_block_list": [
              "17 A . Subject to the provisions of section 20, the Board may by resolution to be recorded in writing authorize any person specified in the resolution to seize any movable property mortgaged to the bank as security for any loan, overdraft, advance or other accommodation in respect of which default has been made",
              "",
              "Authorization of  person to seize movable property.",
              "Amendment of section 19 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "Section 19 of the principal enactment is hereby amended by the substitution for the words section 26, of the words section 26, and thereafter it shall not be competent for the borrower or any person claiming through or under any disposition whatsoever of the right, title or interest of the borrower to and in the property made or registered subsequent to the date of the mortgage to the bank, in any court to move to invalidate the said resolution or the subsequent sale for any cause whatsoever, and no court shall entertain any such application .",
            "pre_block_list": [
              "Amendment of section 20 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "Section 20 of the  principal enactment is hereby amended as follows :",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "by the substitution in subsection (1) of that section for the words and figures the provisions of sections 17 and 19 shall apply, of the words and figures the provisions of sections 17, 17 A  and 19 shall apply ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "by the repeal of subsection (2) of that section and the substitution of the following subsection therefor :",
                "pre_block_list": [
                  "(2) ( a ) Where"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "i",
                    "text": "the borrower is dead ;",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "bank has been notified, in writing of his death within a period of three months of his death ; and",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "probate of his will or letters of administration to his estate have not been issued,",
                        "pre_block_list": [
                          "the District Court of Colombo or the District Court of the district in which that property is situate or kept may, upon application made in that behalf by the bank and after service of notice of the application on such persons,if any, as the court may order, and if satisfied that the grant of probate or the  issue of the letters of administration is likely to be unduly delayed, appoint a person to represent the estate of the borrower for the purposes of this section.",
                          "( b ) Where the borrower is dead and the bank has been notified in writing of his death within a period of three months of his death, the board shall not take action as specified in section 17 or section 17 A  or section 19 unless and until a representative of his estate has been appointed under this section",
                          ""
                        ],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "Section 21 of the principal enactment is hereby repealed and the following section substituted therefor :",
            "pre_block_list": [
              "Replacement of section 21 of the principal enactment. Notice of resolution of Board to sell mortgaged property.",
              "21. Notice of every resolution under section 19 authorizing the sale of any property shall be published, in addition to the Gazette, in three daily newspapers in Sinhala, Tamil and English respectively and copies of such notice shall be sent to the borrower by registered post to the address furnished by him to the bank",
              ""
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "Section 22 of the principal enactment is hereby amended by the repeal of paragraph ( a ) of that section and the substitution of the following paragraph therefor :",
            "pre_block_list": [
              "Amendment of section 22 of the principal enactment."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "be sent to the borrower by registered post to the address furnished by him to the bank ;.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "10",
            "text": "Section 27 of the principal enactment is hereby amended by the substitution for the words property is situate or kept, of the following :",
            "pre_block_list": [
              "Amendment of section 27 of the principal enactment.",
              "property is situate or kept :",
              "Provided however that where the borrower has made default in respect of any other loan, overdraft, advance or accommodation granted to him by the bank, the board shall, in lieu of paying of  such balance to the borrower or any person legally entitled to accept the payments due to the  borrower or depositing in court, as aforesaid, deposit such balance in the District Court of the  district in which the property mortgaged as  security for such other loan, overdraft, advance or accommodation is kept or situate",
              ""
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "11",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency.",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180(Foreign), payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , N O . 32, T RANSWORKS  H OUSE , L OTUS  R OAD , C OLOMBO  01 before 15th December each year in respect of the year following."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}