{
  "n_pages": 4,
  "title_page": {
    "title": "Explosives (Amendment) Act",
    "num": "18",
    "year": "2005",
    "date_certified": "2005-06-13",
    "date_published": "2005-06-17",
    "price": 4.25,
    "price_postage": 5.0
  },
  "body_pages": {
    "preamble": [
      "Explosives (Amendment) Act, No. 18 Of 2005 1",
      "[Certified On 13Th June, 2005]",
      "L.D.O. 34/2000.",
      "A N  A Ct   To   Amend   The  E Xplosives  A Ct",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Explosives (Amendment) Act, No. 18  of 2005.",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "Sections 2 and 3 of the Explosives Act, (hereinafter referred to as the principal enactment) are hereby repealed and the following sections are substituted therefor :",
            "pre_block_list": [
              "Replacement of sections 2 and 3 of Chapter 183.",
              "2. (1) The Secretary to the Ministry shall be the Controller of Explosives for the purposes of this Act.",
              "Controller, Deputy Controllers and Assistant Controllers of Explosives."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every Additional Secretary and Senior Assistant Secretary to the Ministry shall be a Deputy Controller of Explosives for the purposes of this Act.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every Assistant Secretary to the Ministry shall be an Assistant Controller of Explosives for the purposes of this Act.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "There may be appointed by name or by office, such number of persons to be or to act as Deputy Controllers of Explosives or Assistant Controllers of Explosives, for the purposes of this Act",
                "pre_block_list": [
                  ""
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Every police officer not below the rank of sergeant shall be an inspector of Explosives for the purposes of this Act.",
                "pre_block_list": [
                  "Inspectors and other Staff."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "There shall be appointed such number of other     officers and servants as may be necessary for the purpose of this Act",
                "pre_block_list": [
                  "",
                  "2P L 0001965,650  (2005/03)",
                  "Explosives (Amendment) Act, No. 18 of 2005 2",
                  "3.  Section 27 of the principal enactment is hereby amended by the substitution for the words be liable to a fine not exceeding two thousand five hundred rupees or to imprisonment of either description for a term not exceeding two years or of the words be liable to a fine not exceeding twenty five thousand rupees or to imprisonment of either description for a term not exceeding five years or.",
                  "Amendment of section 27 of the principal enactment."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "Section 30 of the principal enactment is hereby repealed and the following section substituted therefor :",
            "pre_block_list": [
              "Replacement of section 30 of the principal",
              "30. (1) The provisions of this Act shall not apply to explosives which are held by the Armed Forces, the Police Force, the Government Analysts Department and for and on behalf of the Controller of Explosives.",
              "Exemption from application of the provisions of the Act."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The Minister may by Order published in the Gazette make provision as to the loading and unloading, transport and storage of the explosives referred to in subsection (1).",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Any person who contravenes or fails to comply with any provision of an Order made under subsection (2) shall be guilty of an offence and shall on conviction after summary trial before a Magistrate be liable to a fine   not exceeding ten thousand rupees",
                "pre_block_list": [
                  "",
                  "Sinhala text to prevail in case of inconsistency."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Explosives (Amendment) Act, No. 18 of 2005 3",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS   B UREAU , N O . 32, T RANSWORKS  H OUSE ,  L OTUS   R OAD ,  C OLOMBO  01  before  15th  December  each  year  in  respect of the year following."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}