{
  "n_pages": 10,
  "title_page": {
    "title": "Code Of Criminal Procedure (Amendment) Act ",
    "num": "47",
    "year": "1999",
    "date_certified": "1999-12-10",
    "date_published": "1999-12-10",
    "price": 6.0,
    "price_postage": 3.5
  },
  "body_pages": {
    "preamble": [
      "[Certified On 10Th December , 1999]",
      "L. D.  - O. 33/99.",
      "A N  A Ct   To   Amend   The  C Ode   Of  C Riminal  P Rocedure A Ct , N O . 15  Of  1979",
      "Be It  Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :-"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Code of Criminal Procedure (Amendment) Act, No.47 of 1999 and shall come into operation on such date as the Minister may appoint by Order published in the Gazette.",
            "pre_block_list": [
              "Short title and date of operation."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "Section 303 and 304 of the Code of Criminal Procedure Act, No.15 of 1979 (hereinafter referred to as  the principal enactment) are hereby repealed and the following sections substituted therefor :-",
            "pre_block_list": [
              "Replacement of sections 303 and 304 of Act, No.15 of 1979.",
              "303. (1) Subject to the provisions of this section, on sentencing an offender to a term of imprisonment, a court may make an order suspending the whole or part of the sentence if it is satisfied, for reasons to be stated in writing, that it is appropriate to do so in the circumstances, haveing regard to ",
              "Suspended sentence of imprisonment",
              "(a)  the maximum penalty prescirbed for the offence in respect of which the sentence is imposed ;",
              "(b)  the nature and gravity of the offence ;",
              "(c)  the offenders culpability and degree of responsibility for the offence ;",
              "(d)  the offenders previous character ;",
              "(e)  any injury, loss or damage resulting directly from the commission of the offence ;",
              "H-022545",
              "(f)  the presence of any aggravating or mitigating factor concerning the offender ;",
              "(g)  the need to punish the offender to an extent, and in a manner, which is just in all of the circumstances ;",
              "(h)  the need to deter the poffender or other persons from committing offences of the same or of a similar character ;",
              "(i)  the need to manifest the denunciation by the court of the type of conduct in which the offender was engaged in ;",
              "(j) the need to protect the victim or the community from the offender ;",
              "(k)  the fact that the person accused of the offence pleaded guilty to the offence and such person is sincerely and truly repentant ; or",
              "(l)  a combination of two or more of the above."
            ],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "A court shall not make an order suspending a sentence of imprisonment if -",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "a mandatory minimum sentence of imprisonment has been prescribed by law for the offence in respect of which the sentence is imposed ; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the offender is serving, or is yet to serve, a term of imprisonment that has not been suspended ; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "the offence was committed when the offender was subject to a probation order or a conditional release or discharge ; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "the term of imprisonment imposed, or the aggregate terms of imprisonment where the offender is convicted for more than  one  offence  in  the  same proceedings, exceeds two years.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The period for which the whole or  a part of a sentence may be suspended (hereinafter referred to as the operational period) shall be",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "determined ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "specified,",
                    "pre_block_list": [
                      "by the court when making the order suspending the whole or part of the sentence :",
                      "Provided that such period shall not be less than five years from the date of the order suspending the whole or part of the sentence."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "An  offender  sentenced  to  suspended imprisonment shall not serve any part of the imprisonment that is suspended unless",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "during  the  operational  period  the offender commits another offence the statutory penalty for which is, or includes, imprisonment ; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "a court makes an order under subsection (13).",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "The  operational  period  shall  be calculated with effect from the date of the order suspending the whole or part of the sentence.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "6",
                "text": "If  during  the  operational  period  an offender  is  sentenced  to  imprisonment  for another  offence  committed  prior  to  the commencement of the operational period, the operational period continues to elapse while the offender is serving that sentence.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "7",
                "text": "An  offender  who  is  sentenced  to suspended  imprisonment shall be taken to be discharged from the sentence at the end of the operational period.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "8",
                "text": "A suspended sentence of imprisonment shall  be  taken  as  being  a  sentence  of imprisonment for the purpose of any law, except any law providing for disqualification for, or loss of, office or the forfeiture or suspension of pensions or other benefits.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "9",
                "text": "If under subsection (13) an offender is ordered to serve the whole or part of a wholly suspended sentence of imprisonment then, for the  purposes  of  any  law  providing  for disqualification for, or loss of, office or the forfeiture or suspension of pensions or other benefits, the offender shall be taken to have been sentenced to imprisonment on the day on which the order was made under that subsection.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "10",
                "text": "For the purposes of subsections (8) and (9), law includes enactments of Parliament, regulations, rules and by-laws made under any enactment  of  Parliament,  the  Minutes  on Pensions, and Codes or Rules made by or approved by the Cabinet of Ministers.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "11",
                "text": "If a court convicts a person of an offence the statutory penalty for which is, or includes, imprisonment and that offence was committed during the operational period in relation to another offence, any court shall deal with the person under subsection (13).",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "12",
                "text": "",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "If a person has been convicted and dealt with for an offence the statutory penalty for which is, or includes, imprisonment and that offence was committed during the operational period in relation to another offence, then a complaint  may  be  made  to  the  court  that imposed  the  suspended  sentence  under subsection (1) in relation to the other offence, alleging those matters.",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "A complaint under paragraph  (a)  may be made",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "by any person ;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "not later than two years from the end of the operational period.",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "A complaint under paragraph  (a)  shall be in writing and be supported by an affidavit from the complainant.",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "If a complaint in writing, supported by an affidavit is received by the court under paragraph  (a) ,  the  court  shall  summon  the person in respect of whom it had imposed a suspended sentence and the person making the complaint under paragraph  (a)  to appear before it at a specified place, date and time.",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "A summons issued on a person under paragraph  (d)  shall be served on that person personally or left at the place where that person was last known to be living.",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "If any person summoned to appear before court under paragraph  (d) , fails to appear in court in response to the summons, the court shall issue a warrant to have the person arrested and brought before it.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "13",
                "text": "",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "If on the hearing of a complaint under subsection (12) the court is satisfied that a person has been convicted of an offence the statutory penalty for which is, or includes, imprisonment and that the offence was committed during the operational period in relation to an offence in respect of which the court had imposed a suspended sentence, the court may, notwithstanding anything in subsection (7)",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "restore the sentence or part sentence held in suspense and order the offender to serve it ; or",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "restore part of the sentence of part sentence held in suspense and order the offender to serve it ; or",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "in the case of a wholly suspended sentence, extend the operational period to a date not later than twelve months from the date of the order ;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iv",
                        "text": "make no order with respect to the suspended sentence,",
                        "pre_block_list": [
                          "and may, in addition, impose a fine not exceeding twenty - five thousand rupees such person."
                        ],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "If a court  orders an offender under paragraph  (a)  to serve a term of imprisonment that had been held in suspense, the term shall, unless the court otherwise orders, be served  (i) forthwith ; and",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "concurrently with any other term of imprisonment the offender is serving or is yet to serve.",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "A court shall make an order under sub- paragraphs (i) or (ii) or (iii) of paragraph  (a)  of subsection (13) unless it is of the opinion that it would be unjust to do so in view of all the circumstances which have arisen, or have become known, since the suspended sentence was imposed, including the fact of any subsequent offence, and if it is of that opinion, the court shall state its reasons in writing.",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "If in respect of a complaint made under subsection (12) it is not possible for the court to deal with the offender immediately, it shall release him on bail upon such terms as it may impose.",
                    "pre_block_list": [
                      "304. A court proposing to make an order suspending a sentence of impirsonment shall, before making such order  (a)  explain, or cause to be explained, to the offender in a language readily understood by the offender :",
                      "Court to explain effect of order to offender."
                    ],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "the purpose and effect of the proposed order ; and",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "the consequences that may follow if the  offender commits another offence punishable with imprison- ment during the operational periods;",
                        "pre_block_list": [
                          "(b)  make an order for the identification and fingerprinting of the offender. "
                        ],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "Section 305 of the principal enactment is hereby repealed.",
            "pre_block_list": [
              "Repeal of section 305 of the principal enactment."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
            "pre_block_list": [
              "Sinhala text to prevail in case of inconsistency.",
              "Annual subscription of English Bills and Acts of the Parliament Rs.885 (Local). Rs.1,180 (Foreign). Payable to the S UPERINTENDENT . G OVERNMENT  P UBLICATIONS  B UREAU , No. 32, T RANSWORKS H OUSE , L OTUS  R OAD , C OLOMBO  01 before 15 th  December each year in respect of the year following."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}