{
  "n_pages": 20,
  "title_page": {
    "title": "Debits Tax Act",
    "num": "16",
    "year": "2002",
    "date_certified": "2002-08-19",
    "date_published": "2002-08-23",
    "price": 15.0,
    "price_postage": 6.75
  },
  "body_pages": {
    "preamble": [
      "Debits Tax Act, No. 16 Of 2002 1",
      "[Certified On 19Th August, 2002]",
      "L. D. O. 22/2002.",
      "A N  A Ct   To   Provide   For   The   Imposition   Of   A   Tax   On   Debits   From",
      "Certain   Accounts   In   Commercial   Banks   And   On   Sums   Realized",
      "By   The   Encashment   Of   Certificates   Of   Deposit   And   Travellers",
      "Cheques ;  And   To   Provide   For   Matters   Connected   Therewith",
      "And   Incidental   Thereto .",
      "Be It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows :"
    ],
    "part_list": [
      {
        "class_name": "ActL0Part",
        "num": "0",
        "text": "",
        "pre_block_list": [],
        "child_level_list": [
          {
            "class_name": "ActL1Section",
            "num": "1",
            "text": "This Act may be cited as the Debits Tax Act, No. 16  of 2002.",
            "pre_block_list": [
              "Short title."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "2",
            "text": "Subject to the provisions of section 13, there shall be charged and levied,",
            "pre_block_list": [
              "Imposition of debits tax."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "the total amount of the debits made during each calendar month against each current account maintained at a commercial bank ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "an amount ; realized by the encashment of a certificate of deposit or travellers cheque,",
                "pre_block_list": [
                  "a tax to be called a debits tax, at the rate of one tenth of one  per centum  of the amount of the total debit or the amount encashed, as the case may be."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "3",
            "text": "The debits tax imposed under section 2 shall  ;",
            "pre_block_list": [
              "Liability to tax"
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "in the case of a debit from a current account maintained at a commercial bank, be paid by the person or persons in whose name or names that account is maintained ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "in the case of an amount realized by the encashment of a certificate of deposit, be paid by the holder of the certificate ; and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "c",
                "text": "in the case of an amount realized by the encashment of a travellers cheque, be paid by the person presenting the travellers cheque for encashment.",
                "pre_block_list": [
                  "2H 0155228,600 (2002/06)",
                  "Debits Tax Act, No. 16 of 2002 2"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "4",
            "text": "The liability of a person to pay the debits tax shall",
            "pre_block_list": [
              "Commencement of liability to pay debits tax."
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "in the case of a debit from a current account maintained at a commercial bank, commence at the end of the month in which the debit was made ;",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "in the case of an amount realized by the encashment of a certificate of deposit or travellers cheque, commence immediately upon such encashment.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "5",
            "text": "Every commercial bank, specialised bank, finance company or authorised dealer shall be liable to collect the debits tax arising out of current account trasactions, enacashment of certificates of deposit and travellers cheques and remit the same in accordance with the provisions of this Act.",
            "pre_block_list": [
              "Libiltiy of financial institutions to collect and remit debits tax."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "6",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Every commercial bank shall, at the beginning of every month, withdraw from every current account maintained at that bank, a sum equal to the sum payable as debits tax from that account in the preceding month, and shall remit such sum to the Commissioner - General, on or before the last working day of each month.",
                "pre_block_list": [
                  "Collection and remittance of debit tax.",
                  "Provided that, if the beginning of any month falls on a non-working day, such withdrawal may be made on the first working day thereafter :",
                  "Provided further that, debits tax should not be withdrawn from a current account if the tax liability of a current account during a particular month is less than rupees ten."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every commercial bank, specialized bank, finance company, or authorized dealer shall, on the encashment of a certificate of deposit or travellers cheque, deduct from the amount realized by such encashment, a sum equal to the debits tax payable on such amount and shall remit such sum to the Commissioner - General, on or before the last working day of  each month following the month in which the certificate of deposit or travellers cheque was encashed.",
                "pre_block_list": [
                  "Debits Tax Act, No. 16 of 2002 3"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where any sum is withdrawn and remitted under subsection (1) or deducted and remitted under subsection (2), in payment of the debits tax, such payment shall be deemed to be made with the authority of the person or persons in whose name or names the current account is being maintained at the commercial bank, the person who is the holder of the certificate of deposit or the person presenting the travellers cheque for encashment, as the case may be, and shall, subject to  the provisions of subsection (2) of section 10, be a valid discharge of that persons liability to pay the debits tax.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Where owing to there being no funds in a current account or there being an insufficiency of funds in a current account, the commercial bank in which such account is being maintained is unable to collect the debits tax in full or part, payable on the debits made from that account in the immediately preceding month, the bank shall report to the Commissioner-General, on or before the last working day of each month in which the default occurs, the names and address or the names  and addresses of the person or persons in whose name or names the account is being maintained, the total amount of the debits made from that account in the immediately preceding month and the debits tax payable on that amount :",
                "pre_block_list": [
                  "Provided that the commercial bank may differ the making of such report as aforesaid for a period of two months, in the event that the debits tax so payable can be recovered within such period of two months."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "Nothing in the preceding provisions of this section shall be deemed to authorize a commercial bank to refuse to pay out of the funds in any current account maintained at that bank, the whole or part of any amount of which payment is demanded by cheque, draft, order or other instruction of the person or persons in whose name or names that account is being maintained, on the ground only that debits tax on the debits made from that account, has to be paid :",
                "pre_block_list": [
                  "Provided however, any amount of debits tax due to be remitted to the Commissioner-General shall be recovered before the payment of such cheque, draft, order or other instruction.",
                  "Debits Tax Act, No. 16 of 2002 4"
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "7",
            "text": "Where the holder of a current account fails to provide sufficient funds to meet the debits tax payable by him in terms of this Act, the banks liability for the collection of debits  tax ceases upon the bank reporting such fact to the Commissioner- General.",
            "pre_block_list": [
              "Cessation of bank liability."
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "8",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "A person who pays debits tax in terms of this Act, may on request obtain a Tax Deduction Certificate from the person deducting such tax.",
                "pre_block_list": [
                  "Tax deduction certificate."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "The tax deduction certificate issued under subsection (1) shall include  information relating to :",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the sum total of the debits made from a current account or the sum total of the encashed proceeds received on encashment of certificates of deposits or travellers cheques as the case may be ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the sum deducted as debits tax,",
                    "pre_block_list": [
                      "for the period in respect of which the Certificate is requested."
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "The Certificate shall include confirmation of the remittance of such amount to the Commission - General.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "9",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "A commercial bank shall, when remitting the sums referred to in subsection (1) of section 6, furnish a statement to the Commissioner-General in respect of any current account, other than a special current account setting out the following :",
                "pre_block_list": [
                  "Returns"
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the total amount of debits made from all current accounts maintained by that bank in the preceding month ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the total amount of debits from all special current accounts maintained by that bank in the preceding month ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "the sums withdrawn as debits tax from all current accounts in that month ;",
                    "pre_block_list": [
                      "Debits Tax Act, No. 16 of 2002 5"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "the sums refunded under paragraph (i) of subsection (1) of section 12  and subsection (2) of section 12 ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "The names and addresses of account holders who have claimed refunds in respect of exempt debits under paragraph ( d ) of section 13, where the total amount of exempt debits in each current account in a month exceeds fifty  per centum  of the total debits in the relevant current account or rupees fifty thousand, whichever is lower.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "A commercial bank, specialized bank, finance company or authorized dealer shall, when remitting the sums referred to in subsection (2) of section 6, furnish a statement along with such remittance, to the Commissioner - General, setting out the following :",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the amount realized by the enacashment of the certificate of deposit, or travellers cheque, as case may be ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the sum deducted from that amount as the debits tax payable on that amount.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "10",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where a commercial bank reports under subsection (4) of section 6 that it is unable to collect the debits tax due on the debits made during a calendar month, from a current account maintained at that bank by any person, an officer authorized in writing by the Commissioner-General shall in writing direct such person to pay, within fourteen days of the direction, the amount of such debits tax to the Commissioner - General to be credited to the Consolidated Fund. If such person fails to pay such amount to the Commissioner-General within such fourteen days, such amount shall be deemed to be in default and such person shall be deemed to be a defaulter.",
                "pre_block_list": [
                  "Default in payment of debits tax.",
                  "Debits Tax Act, No. 16 of 2002 6"
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Where the sum remitted by a commercial bank, specialized bank, finance company or authorized dealer, under section 6, as the debits tax payable, on",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "the total amount of the debits made from a current account maintained at that commercial bank, in any month; or",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "the amount realized on the encashment of a certificate of deposit or travellers cheque,",
                    "pre_block_list": [
                      "is less than the actual amount payable as debits tax on the total amount of such debits or the amount so realized, as the case may be, the Commissioner-General shall by notice in writing, require such bank, finance company, or dealer or the person liable to pay the debits tax, to pay, within fourteen days of the date of the notice, the difference between the actual amount payable as debits tax and the sum remitted as  debits tax, to the Commissioner-General to be credited to the Consolidated Fund. If such bank, company, dealer or person fails to pay the amount of such difference within such fourteen days, such amount shall be deemed to be in default and such bank, company, dealer or person, as the case may be, shall be deemed to be a defaulter."
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "11",
            "text": "Where the amount of any debits tax or part thereof is in default, the Commissioner-General may issue a certificate containing particulars of the amount in default and the name and last known place of residence or business of the defaulter to the Magistrate having jurisdiction in the division in which such place is situated. The Magistrate shall thereupon summon the defaulter to show cause why proceedings for the recovery of the amount of the debits tax in default should not be taken against him, and if sufficient cause is not shown, the amount of the debits tax in default shall by order of the Magistrate be recovered as if it were a fine imposed by the Magistrate on such defaulter, and shall, when recovered, be remitted to the Commissioner - General to be credited to the Consolidated Fund.",
            "pre_block_list": [
              "Recovery",
              "Debits Tax Act, No. 16 of 2002 7"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "12",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Refunds may be made in respect of debits tax payments made in excess of the liable amount or tax payments made on exempt accounts, to the person from whom such amount is so deducted, as follows :",
                "pre_block_list": [
                  "Refunds."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "i",
                    "text": "in the case of a refund being requested by the account holder prior to the remittance of the debits tax payment to the Commissioner - General, the commercial bank, specialised bank, finance company or authorised dealer may refund the excess debits tax so deducted ;",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "in the case of a refund being requested by the account holder after the remittance of the debits tax payment to the Commissioner-General, the Commissioner- General may refund the debits tax so paid to the person from whom such amount is so deducted on a claim made in writing to the Commissioner - Gebneral within twelve months from the date of such payment. The Commissioner-General shall satisfy himself of the authenticity of the claim, prior to making such refund.",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "In the case of a refund made under the provisions of paragraph (i) of subsection (1) on the basis of a declaration referred to in subsection (2) of section 13, the bank to which the declaration is addressed shall verifty the amount of debits identified as exempt by the account holder with the banks records and refund the debits tax on such exempt debits, provided such debits tax was withdrawn from the account holder previously.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "All sums payable as refunds under this section shall either be paid by the commercial bank, specialised bank, finance company or authorised dealer out of the funds of such banks, company or dealer, or by the Commissioner-General out of the Consolidated Fund, as the case may be.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "13",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "There shall be exempt from debits tax",
                "pre_block_list": [
                  "Exemptions."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "debits made from any current account maintained by the Government of Sri Lanka, the Central Bank of Sri Lanka any Provincial Council any  local authority, any Foreign Government, by the mission of any State or any organisation to which the",
                    "pre_block_list": [
                      "Debits Tax Act, No. 16 of 2002 8",
                      "provisions of the Diplomatic Privileges Act, No. 9 of 1996 applies, or any diplomatic personnel of such mission or organization, or any International or Foreign Organization, approved by the Minister by Order published in the Gazette;"
                    ],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "debits made from any current account, being a special account opened by any person in a commercial bank on the basis of a declaration and an undertaking by the account holder that such account is solely for the purpose of making",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "payment of any loan or interest thereon, to the Deputy Secretary to the treasury ;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "payment of any tax to the Commissioner- General of Inland Revenue ;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "payment of tax, duty, levy or cess to the Director-General of Customs ;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iv",
                        "text": "payment of any tax or duty to the Commissioner of Excise or the Director- General of Excise; or",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "v",
                        "text": "any other payment which may be approved by the Minister by Order published in the Gazette ;",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "c",
                    "text": "debits made from any current account, being a special account opened by any person specified hereunder, in a commercial bank on the baisis of a declaration and undertaking by the account holder that such account is solely for the purpose of making",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "payments that represent benefits to contributors from any fund or scheme such as the Employees Provident Fund, the Employees Trust Fund or any approved provident fund or",
                        "pre_block_list": [
                          "Debits Tax Act, No. 16 of 2002 9",
                          "contributory pension scheme, within the meaning of the Employees Provident Fund Act or non-contributory pension scheme within the meaning of the Payment of Gratuity Act or Contributory Survivor Pension Scheme ;"
                        ],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "payments for the purchase of commodities for and on behalf of customers and payments that represent remittance of the sale proceeds of such commodities, made by a licensed produce broker ;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "payments in relation to trading in government securities made by a primary dealer ;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iv",
                        "text": "payments in relation to outright (both sales and purchases) and repurchase and reverse repurchase transactions of all debt securities (government and corporate) in the secondary market, made by a primary dealer or a commercial bank, a finance company, a licensed fiance leasing company or a limited libility comany or a person or a body of persons ;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "v",
                        "text": "payments in relation to the settlement of transactions carried out in the Colombo Stock Exchange on behalf of a customer, made by a licensed stock broker, or by a limited liability company or a person or a body of persons ;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "vi",
                        "text": "payments to any resident individuals utilizing funds transferred to that account from a foreign banking institution abroad ;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "vii",
                        "text": "payments from any such account maintained at a Commercial Bank by another Commercial Bank, specialized bank, licensed finance",
                        "pre_block_list": [
                          "Debits Tax Act, No. 16 of 2002 10",
                          "leasing company or other financial intermediary approved by the Commissioner- General ",
                          "( a ) being debits made in connection with the activites and the settlement of financial obligations, both interest and principal, arising from such activities as is set out in schedule II of the Banking Act, other than items ( o), (p ), ( v ) and ( x ) of such Schedule in the case of commercial banks :",
                          "Provided however, that in the case of item ( u ) in Schedule II of the Bnaking Act, the exemption granted shall be applicable only in relation to factoring activities ;",
                          "( b ) being debits made in connection with the activities as are set out in Schedule IV of the Banking Act, other than items ( ii ),( jj ), ( ll ), ( mm ) and ( nn ) of such Schedule and settlement of financial obligaitons both principal and interest, arising from such activities in the case of specialized bank; or",
                          "( c ) being debits made in connection with the intermediation activities and settlement of financial obligations, both interest and principal, arsing from such activities in the case of licensed finance leasing companies or any other financial intermediaries approved by the Commissioner-Geneneral, provided the debits in relation to licensed activities of a commercial bank or a specialized bank that are excluded from the exemptions set out in paragraphs ( a ) and ( b ) above,",
                          "Debits Tax Act, No. 16 of 2002 11",
                          "would also apply to a licensed finance leasing company or a licensed financial intermediary  approved  by  the Commissioner-General. (The Deputy Secretary to the Treasury will be the final authority in detrmining whether an activity  amounts  to  financial intermediation for the purposes of this paragraph) ;"
                        ],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "viii",
                        "text": "debits made from any such account which is maintained by any person at any commercial bank as a collection account, solely for the purpose of receiving funds and facilitating the transfer of funds, to accounts mainatined by such person at other branches or at the head office of such bank ;",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "d",
                    "text": "debits made from any current account of an account holder, in relaiton to",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "debits made from such account kept in a commercial bank that represents transfer of funds from that account to another current account in the same or any other commercial bank, maintained in the name of the same account holder ;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "debits made from such account in respect of sums withdrawn from that account for the payment of debits tax ;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "debits made in respect of dishonoured cheques, error corrections or contra entries that do not represent withdrawal of funds by the account holder ;",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "e",
                    "text": "debits made from any current account in relation to the",
                    "pre_block_list": [],
                    "child_level_list": [
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "i",
                        "text": "account of the Head Office in Sri Lanka, of a Commercial Bank as is maintained in a branch in Sri Lanka, of that bank ;",
                        "pre_block_list": [
                          "Debits Tax Act, No. 16 of 2002 12"
                        ],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "ii",
                        "text": "account of a branch in Sri Lanka of a commerceal  bank as is maintained in the Head Office in Sri Lanka, of that bank ;",
                        "pre_block_list": [],
                        "child_level_list": []
                      },
                      {
                        "class_name": "ActL4SubParagraph",
                        "num": "iii",
                        "text": "account of a branch in Sri Lanka of a commercial bank as is maintained in another branch in Sri Lanka, of that bank ;",
                        "pre_block_list": [],
                        "child_level_list": []
                      }
                    ]
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "f",
                    "text": "such other accounts, debits or classes of debits made from current accounts as may from time to time be determined by the Minister, by Order published in the  Gazette, having regard to the interests of the national economy.",
                    "pre_block_list": [],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "To qualify for the exemptions specified in sub- paragraphs (i), (ii) and (iii) of paragraph ( d ), the account holder shall furnish a declaration to the commercial bank, in a format to be prescribed by the Commissioner-General on or before the fifteenth day of the month, in respect of exempt debits made to any current account of such account holder in the preceding calendar month :",
                "pre_block_list": [
                  "Provided however, that if the fifteenth day falls on a non- working day, such declaration shall be made on the first working day thereafter."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Where an account holder fails to furnish a declaration within the time specifed in subsection (2), such person may apply for the refund from the Commissioner-General within a period of twelve months from the date of the payment of the debits tax, provided such claim is in writing and evidence acceptable to the Commissioner-General is furnished, to establish the fact that the refund relates to debits tax on an exempt debit.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "A commercial bank shall upon the opening of a collection account or special account report to the Commissioner-General, on or before the last working day of the calendar month following that in which such account was",
                "pre_block_list": [
                  "Debits Tax Act, No. 16 of 2002 13",
                  "opened, the name and address of the person or persons in whose name or names the accounts are maintained. A copy of the declaration and undertaking given by such person shall also be sent."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "5",
                "text": "For the avoidance of doubts it is hereby declared that, other than in the case of a person whose debits in a current account are totally exempt as provided for in paragraph ( a ), the exemptions granted by paragraphs ( b ), ( c ), ( d ), ( e ) and ( f ) shall not be applicable to payments made by a commercial bank, specialised bank, authorised dealer, finance company, licensed finance leasing company, fiancial intermediary or any other person specified under paragraphs ( b ), ( c ), ( d ), ( e ) and ( f ) for defraying other expenses including expenses of a capital nature such as the cost of purchasing any movable or immovable property or for the construction of any building :",
                "pre_block_list": [
                  "Provided however, in  the case of commercial banks, specialized banks, licensed finance leasing company and other financial intermediaries approved by the Commissiioner - General in terms of paragraph ( c ) (vii), any interest payment for a liability related to financial intermediation activity, for which exemption is granted shall be excluded from debits tax."
                ],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "14",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "An officer authorized in that behalf by the Commissioner - General may, by notice in writing, require a commercial bank, specialized bank, finance company or authorized dealer to furnish such returns and information as may be necessary for the purpose of ascertaining whether the provisions of this Act are being or have been complied with, and may  inspect, and make copies of any entries in, any books, records or other documents maintained by such bank, finance company or dealer.",
                "pre_block_list": [
                  "Powers to ensure compliance with the provisions of this Act."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every commercial bank, specialized bank, finance company and authorized dealer shall, notwithstanding anything to the contrary in any law, comply with a requirement imposed under subsection (1) and shall provide the officer",
                "pre_block_list": [
                  "Debits Tax Act, No. 16 of 2002 14",
                  "referred to in that subsection with all such facilities as are necessary for the inspection of any books, records or other documents maintained by such bank, finance company or dealer."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Except in the performance of his duties under this Act, an officer referred to in subsection (1) shall preserve, and aid in preserving, secrecy with regard to all matters relating to the affairs of any commercial bank, specialized bank, finance company or authorized dealer that may come to his knowledge in the performance of his duties under this section and shall not communicate any such matter except to the Deputy Secretary to the Treasury, the Commissioner - General or to a Court of Law.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "15",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Where any commercial bank, specialized bank, finance company or authorized dealer -",
                "pre_block_list": [
                  "Officers."
                ],
                "child_level_list": [
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "a",
                    "text": "fails to comply with, or contravenes, any provision of this Act or any requirement imposed under this Act or any regulation made under this Act ;",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL3Paragraph",
                    "num": "b",
                    "text": "knowingly makes any false statement in, or knowingly omits any material particular from, any return or information furnished by such commercial bank, specialized bank, finance company or authorized dealer,",
                    "pre_block_list": [
                      "that bank or finance company or that authorized dealer, as the case may be, shall be guilty of an offence under this Act and shall on conviction after summary trial before a Magistrate, be liable to a fine not exceeding one million rupees :",
                      "Provided however the Commissioner-General may compound the offence by imposing a penalty not exceeding one million rupees, which shall be credited to the Consolidated Fund.",
                      "Debits Tax Act, No. 16 of 2002 15"
                    ],
                    "child_level_list": []
                  }
                ]
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any person who, holding an account in a commercial bank, opens a collection or special current account on the basis of a false declaration or acts in breach of an undertaking furnished at the time of opening the current account, shall be liable to pay to the Commissioner - General a sum not exceeding rupees one million plus twice the amount of the debits tax not recovered as a result of such action, as penalty, upon the issue of notice under section 10 of this Act.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every person who contravenes the provisions of subsection (3) of section 14 shall be guilty of an offence under this Act and shall on conviction after summary trial before a Magistrate, be liable to a fine not exceeding one hundred thousand rupees or to imprisonment for a term not exceeding six months.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "16",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "The Minister may make regulations for the purposes of giving effect to the principles and provisions of this Act and in respect of matters which are required by this Act to be prescribed.",
                "pre_block_list": [
                  "Regulations."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Every regulation made under this section shall be published in the Gazette and shall come into operation on the date of such publication or on such later date as may be specified therein.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "3",
                "text": "Every such regulation shall as soon as convenient after its publication in the Gazette, be brought before Parliament for approval. Every regulation which is not so approved shall be deemed to be rescinded as from the date of such disapproval, without prejudice to the validity of anything previously done thereunder.",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "4",
                "text": "Notification of the date on which any such regulation is deemed to be rescinded shall be published in the Gazette.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "17",
            "text": "The provisions of this Act shall be deemed for all purposes to have come into effect on June 1, 2002.",
            "pre_block_list": [
              "Retrospective effect.",
              "Debits Tax Act, No. 16 of 2002 16"
            ],
            "child_level_list": []
          },
          {
            "class_name": "ActL1Section",
            "num": "18",
            "text": "",
            "pre_block_list": [],
            "child_level_list": [
              {
                "class_name": "ActL2Subsection",
                "num": "1",
                "text": "Any commercial bank, specialized bank, finance company or authorized dealer who collects or remits the debits tax as provided for in section 6, during the period commencing on June 1, 2002 and the date on which this Act is passed as an Act of Parliament, shall be deemed to have acted with due authority and is hereby indemnified from any civil or criminal prosecution in respect of such collection.",
                "pre_block_list": [
                  "Indemnity."
                ],
                "child_level_list": []
              },
              {
                "class_name": "ActL2Subsection",
                "num": "2",
                "text": "Any commercial bank, specialized bank, finance company or authorised dealer who collects from any person debits tax in excess of the amount he was liable to pay in respect of debits from a current account maintained by him or in respect of any amount realized by him by the encashment of a certificate of deposit or travellers cheque, or a commercial bank collects from any person, debits tax on any such debits made from a current account maintained by him in a bank as are exempt from debits tax by or under section 13, is hereby indemnified from any civil or criminal prosecution in respect of such collection, from and after June 1, 2002 and the date on which a refund of such amount is made or the date on which such amount is remitted to the Commissioner - General, as the case may be.",
                "pre_block_list": [],
                "child_level_list": []
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "19",
            "text": "In this Act, unless the context otherwise requires",
            "pre_block_list": [
              "Interpretation.",
              "Banking Act means the Banking Act, No. 30 of    1988 ;",
              "collection account means an account maintained with a commercial bank which facilitates the transfer of funds, but on  which no cheques can be drawn ;",
              "commercial bank   means a licensed commercial bank within the meaning of the Banking Act, No. 30 of 1988 ;",
              "Commissioner-General means the Commissioner - General of Inland Revenue, appointed or deemed to be appointed under the provisions of the Inland Revenue Act, No. 38 of 2000 ;",
              "Debits Tax Act, No. 16 of 2002 17",
              "current account means "
            ],
            "child_level_list": [
              {
                "class_name": "ActL3Paragraph",
                "num": "a",
                "text": "an account (other than a savings account, a non resident currency account, a resident foreign currency account, an account in a foreign currency banking unit and a share investment external rupee account) whether in credit or otherwise, which is maintained at a commercial bank for any person or persons, including any such bank, and from which payments are made on demand by that person or persons by cheque, draft, order or other instruction ;and",
                "pre_block_list": [],
                "child_level_list": []
              },
              {
                "class_name": "ActL3Paragraph",
                "num": "b",
                "text": "an internal account of a commercial bank from which payments are made for defraying any expenses of such bank, including",
                "pre_block_list": [],
                "child_level_list": [
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "i",
                    "text": "expenses of a capital nature such as the cost of purchasing any movable or immovable property or constructing any building; and",
                    "pre_block_list": [],
                    "child_level_list": []
                  },
                  {
                    "class_name": "ActL4SubParagraph",
                    "num": "ii",
                    "text": "all business expenses, which involves a payment and in respect of which debits are made either internally or externally;",
                    "pre_block_list": [
                      "debit means an entry made against a current account of any person or persons in respect of a withdrawal of funds from that account by cheque, draft, order or any other instruction of that person or persons, and includes the charges made by a commercial bank, in the course of business, on a current account maintained at that bank ;",
                      "Employees Provident Fund means the Employees Provident Fund established by the Employees Provident Fund Act, No. 15 of 1958 ;",
                      "Employees Trust Fund means the Employees Trust Fund established by the Employees Trust Fund Act, No. 46 of 1980 ;",
                      "Finance Company means a company registered under the Finance Companies Act, No. 78 of 1988, to carry on finance business ;",
                      "Debits Tax Act, No. 16 of 2002 18",
                      "Foreign Currency Banking Account means an account maintained at a commercial bank and designated as such by the Central Bank ;",
                      "licensed finance leasing company means a company licensed under the Finance Leasing Act, No. 56 of 2000;",
                      "licensed stock broker means a stock broker licensed under the Securities and Exchange Commission Act, No. 36 of 1987 ; licensed produce broker means a produce broker licensed under the Licensing of Produce Brokers Act, No. 9 of 1979 ;",
                      "Non-Resident Foreign Currency Account means an account maintained at a commercial bank and designated as such by the Central Bank ;",
                      "Payment of Gratuity Act means the Payment Gratuity Act, No. 12 of 1983 ;",
                      "Resident Foreign Currency Account means an account maintained at a commercial bank and designated as such by the Central Bank ;",
                      "savings account means an account which is maintained at a commercial bank and funds deposited in which earn interest and the withdrawal of funds from which can be made only after such intervals as are specified, or subject to such rules as are specified, by that bank ;",
                      "specialized bank   means a licensed specialized bank within the meaning of the Banking Act, No. 30 of 1988."
                    ],
                    "child_level_list": []
                  }
                ]
              }
            ]
          },
          {
            "class_name": "ActL1Section",
            "num": "20",
            "text": "In the event of any inconsistency between the Sinhala and Tamil texts of the Act, the Sinhala text shall prevail. Sinhala text to prevail in case of inconsistency.",
            "pre_block_list": [
              "Debits Tax Act, No. 16 of 2002 19",
              "Annual subscription of English Bills and Acts of the Parliament Rs. 885 (Local), Rs. 1,180 (Foreign), Payable to the S UPERINTENDENT , G OVERNMENT  P UBLICATIONS  B UREAU , N O . 32, T RANSWORKS   H OUSE ,  L OTUS   R OAD ,  C OLOMBO  01  before  15th  December  each  year  in   respect  of the year following."
            ],
            "child_level_list": []
          }
        ]
      }
    ]
  }
}