{
  "n_pages": 4,
  "title_page": {
    "title": "Excise (Amendment) Act",
    "num": "26",
    "year": "2018",
    "date_certified": "2018-09-03",
    "date_published": "2018-09-07",
    "price": 8.0,
    "price_postage": 15.0
  },
  "body_pages": {
    "preamble": [
      "Excise  (Amendment) Act, No. 26 Of 2018 1",
      "[Certified On 03Rd Of September, 2018]",
      "L.D.O. 21/2018",
      "A N  A Ct   To   Amend   The  E Xcise  O Rdinance  (C Hapter  52)",
      "Be   It Enacted By The Parliament Of The Democratic Socialist Republic Of Sri Lanka As Follows:-"
    ],
    "pre_section_list": [
      {
        "class_name": "ActL1Section",
        "num": "1",
        "text": "This Act may be cited as the  Excise (Amendment) Act, No. 26 of 2018.",
        "pre_block_list": [
          "Short  title."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "2",
        "text": "Section 30 of the Excise Ordinance (Chapter 52) (hereinafter referred to as the principal enactment) is hereby amended as follows:",
        "pre_block_list": [
          "Amendment of section 30 of the Excise Ordinance (Chapter 52)."
        ],
        "child_level_list": [
          {
            "class_name": "ActL2Subsection",
            "num": "1",
            "text": "in subsection (1) by the substitution for the words Every person who manufactures or sells any excisable article under a licence of the words Every person who imports, exports, transports, manufactures, sells, possess or stores any excisable article under a licence, permit or pass;",
            "pre_block_list": [],
            "child_level_list": []
          },
          {
            "class_name": "ActL2Subsection",
            "num": "2",
            "text": "in the marginal note to that section for the words certain licensees of the words holder of a licence, permit or pass.",
            "pre_block_list": [],
            "child_level_list": []
          }
        ]
      },
      {
        "class_name": "ActL1Section",
        "num": "3",
        "text": "Section 32 of the principal enactment is hereby amended by the insertion immediately after paragraph ( j ) of the following new paragraphs:",
        "pre_block_list": [
          "Amendment of section 32 of the principal enactment.",
          "( ja ) prescribing the types of security features to be affixed on any excisable article when such excisable article is imported, exported, transported, manufactured, sold, possessed or stored;",
          "( jb ) levying charges for  issuing of the security features referred to in paragraph ( ja ) to be affixed on any excisable article when such excisable article is imported, exported, transported, manufactured, sold, possessed or stored;."
        ],
        "child_level_list": []
      },
      {
        "class_name": "ActL1Section",
        "num": "4",
        "text": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
        "pre_block_list": [
          "Sinhala text to prevail in case of any inconsistency.",
          "Excise  (Amendment) Act, No. 26 of 2018 3",
          "English Acts of the Parliament can be purchased at the P RAKASHANA  P IYASA , D EPARTMENT   OF G OVERNMENT  P RINTING , N O . 118, D R . D ANISTER  D E  S ILVA  M AWATHA , C OLOMBO  8."
        ],
        "child_level_list": []
      }
    ],
    "part_list": []
  }
}